[
    {
        "Ticker": "ADP",
        "Company": "Automatic Data Processing",
        "Source_URL": "http://www.adp.com/",
        "Content_Type": "Website Content",
        "Raw_Text": "Experience better HR and payroll\nAnswer a few questions, and we'll help you find the perfect HR and payroll solution.\n- What are you interested in?\n- Login & Support\n- HCM\n- Payroll\n- Payroll\n- Payroll\n- Payroll\n- Professional Employer Organization (PEO)\n- Professional Employer Organization (PEO)\n- Professional Employer Organization (PEO)\n- Time & Attendance\n- Time & Attendance\n- Time & Attendance\n- Workforce Management\n- Talent\n- Retirement\n- Benefits Administration\n- Benefits Administration\n- Insurance\n- Workers’ Compensation\n- Workers’ Compensation\n- Business Tax Credits\n- Business Tax Credits\n- Standalone Compliance Services\n- Talent Acquisition\n- Standalone Compliance Services\nTake a self-guided product tour\nYou need comprehensive payroll and HR solutions that empower your people and unlock your teams’ potential. We deliver.\nSelect your business size to try a demo today. Select your business size to\ntry a demo today.\nNo matter your business size, we've got you covered\nChoose your business size to find your fit :\nSee solutions for:\nSimpler, smarter small business payroll and HR\nGet payroll done faster and tax filing done for you with a modern platform and direct access to payroll experts, designed to make paying your people easier than ever before.\nAll the payroll and HR technology you need — all in one place\nFrom HR, time and payroll to benefits, our AI-powered solutions are built for what your workforce needs and what it will need next.\nHCM solutions for enterprises\nADP delivers the scale, security and insights enterprise need to manage complex workforces and stay ahead of global compliance.\nNo matter your business size, we've got you covered\nLatest news and events\nAwards and recognition\n* From Fortune. ©2025 Fortune Media IP Limited All rights reserved. Used under license. Fortune® is a registered trademark and Fortune World’s Most Admired Companies™ is a trademark of Fortune Media IP Limited and are used under license. Fortune and Fortune Media IP Limited are not affiliated with, and do not endorse products or services of, ADP, Inc.\nAny time you select a partner, you're looking for 2 things: great technology and a great team to work with. With ADP we have both. Our ADP team is knowledgeable and there to advise us and answer our questions. That, combined with ADP's robust and adaptable global technology gives us confidence that our employees are taken care of.\nGreg Harmer\nGlobal Head of Payroll, Amazon"
    },
    {
        "Ticker": "ADP",
        "Company": "Automatic Data Processing",
        "Source_URL": "http://www.adp.com/what-we-offer/payroll/payroll-for-1-49-employees/payroll-packages.aspx",
        "Content_Type": "Website Content",
        "Raw_Text": "RUN Powered by ADP®\npayroll packages\nGet the right online payroll services and small business payroll software\nfor your business.\n|\nINTERACTIVE DEMO See our self-led |\nMost Popular | |||\n|---|---|---|---|---|\n|\nINTERACTIVE DEMO See our self-led |\nMost Popular | |||\n| Payroll & Tax | ||||\n|\nPayroll: Computer, Mobile App, Phone Call Run payroll online, by phone or even on-the-go with our mobile payroll app. No matter which way you choose, you can be confident that your data is safe and secure. |\nIncluded | Included | Included | Included |\n|\nDirect Deposit The quickest way to pay your employees. On payday, pay is automatically deposited in each employee’s account. |\nIncluded | Included | Included | Included |\n|\nRobust Reporting View, access, customize and print payroll and HR reports online. |\nIncluded | Included | Included | Included |\n|\nGeneral Ledger Interface Export journal entries from ADP into QuickBooks®, Xero, Wave, Creative Solutions or a generic output file without re-keying data. |\nIncluded | Included | Included | Included |\n|\nNew-Hire Reporting We’ll report new hires to help you comply with federal and state reporting requirements. |\nIncluded | Included | Included | Included |\n|\nW-2 & 1099 Forms We’ll create and deliver W-2 and 1099 forms for you (additional fee), and even e-file these forms with the IRS on your behalf. |\nIncluded | Included | Included | Included |\n|\nTax Filing We will calculate, file, deposit and reconcile your payroll taxes. We’ll even respond to inquiries from taxing agencies regarding the deposits and the returns we file for you. Best of all, if we make a tax filing error, we pay the resulting fines or penalties imposed by the taxing authorities for you. |\nIncluded | Included | Included | Included |\n|\nPayroll Delivery Your payroll checks will be delivered to your business in time for you to hand them out. |\nIncluded | Included | Included | Included |\n|\nMulti-company Management Streamline payroll and HR with multi-company reports, tax forms, workforce analytics, and more. |\nIncluded | Included | Included | Included |\n|\nMulti-jurisdiction Payroll Easily pay employees who work in more than one state or local jurisdiction in the same pay period — and we’ll handle the tax filing for you. |\nIncluded | Included | Included | Included |\n|\nWisely® Direct Debit Card Wisely Direct is a prepaid account offered directly to consumers by ADP. It can be used to receive direct deposits and income from other sources.3 |\nIncluded | Included | Included | Included |\n|\nCheck Signing: Security Checks will be signed using your company officer's signature or that of an ADP officer (if using TotalPay®). Payroll checks and direct deposit receipts of deposit will be stuffed and sealed into envelopes. Plus, we offer the most secure paycheck in the industry, with 10 advanced fraud protection features. |\nIncluded | Included | Included | |\n|\nState Unemployment Insurance (SUI) Management Complete management of your state unemployment insurance, including reviewing your account for erroneous charges and auditing your SUI experience rate(s) to make sure it is appropriate. We’ll also handle correspondence from each state in which you pay unemployment insurance. |\nIncluded | Included | Included | |\n|\nJob Costing ADP can track, calculate, and report on your labor costs for jobs and projects. It’s now easier to assign costs for invoices, identify profitability, and more. |\nIncluded | Included | Included | |\n|\nLabor Law Poster Compliance Automatically receive updated labor law posters to maintain compliance with posting regulations. |\nIncluded | Included | Included | |\n| Human Resources | ||||\n|\nADP® Employee Access Employees can view pay history and up to three years of W-2s/1099s, manage ADP retirement accounts and enroll in paperless pay statements. |\nIncluded | Included | Included | Included |\n|\nNew Hire Onboarding Free up time by letting new employees fill out their own paperwork electronically before their first day on the job: personal info, direct deposit, Form W-4, and more. |\nIncluded | Included | Included | Included |\n|\nEmployee Discounts Get discounts on nationally-recognized, brand-name products and local retailers. |\nIncluded | Included | Included | Included |\n|\nBackground Checks Receive single-county background checks, including SSN validation, criminal history, and search for current county of residence. |\nIncluded | Included | Included | Included |\n|\nZipRecruiter® Post to over 100 of the web's leading job boards. 80% of employers who post on ZipRecruiter get a quality candidate within a day. |\nIncluded | Included | Included | |\n|\nElectronic Form I-9 Complete Form I-9 electronically during new-hire onboarding. |\nIncluded | Included | Included | |\n|\nHR HelpDesk Receive phone and email access to a dedicated support team of HR professionals to help you navigate even your most complicated HR issues. |\nIncluded | Included | ||\n|\nEmployee Handbook Wizard Create a comprehensive, professional-quality employee handbook based on federal employment law in a few simple steps. |\nIncluded | Included | ||\n|\nSalary Benchmarks Exclusive data-driven salary benchmarking insights to stay competitive in the hiring market. |\nIncluded | Included | ||\n|\nHR Tracking Get 24/7 access to HR pages that help you track employee information, such as assigned property, performance and advanced reporting. |\nIncluded | Included | ||\n|\nHR Forms and Documents Save time by obtaining your key HR forms from our central library of thousands of best-practice documents, checklists, forms and policies. |\nIncluded | Included | ||\n|\nHR Training and Toolkits Properly complete everyday HR tasks, such as hiring and termination, with step-by-step, best-practice guidelines, essential forms and documents, and related policies. |\nIncluded | Included | ||\n|\nApplicant Tracking System, powered by CareerPlug Make hiring easier with CareerPlug: Instantly post roles to all major job boards, automate screening, and onboard new hires with ease—perfect for busy owners and managers |\nIncluded | |||\n|\nLearning Management System Assign (and track completion of) online courses on sexual harassment and abusive conduct, HR compliance, skills development, and much more. |\nIncluded | |||\n|\nSexual Harassment Prevention Training Legislative changes require certain employees to have specific training and other policies in place to handle sexual harassment by employees. |\nIncluded | |||\n|\nLegal Assistance from Upnetic Legal Services, powered by Legal Club®2 Access prepaid legal services from our partner Upnetic Legal Services, including advice and consultation on items like contract review, debt collection, and employment matters. |\nIncluded | |||\n| Add-Ons | ||||\n|\nTime and Attendance Run payroll accurately and stay in compliance by managing schedules, hours worked and time off for employees. | Included | Included | Included | Included |\n|\nRetirement6 Attract and keep the best talent with competitive, easy-to-manage retirement plan options through ADP® Retirement Services. | Included | Included | Included | Included |\n|\nWorkers' Compensation4 Prepare for the unexpected with simplified insurance and pay-as-you-go solutions. | Included | Included | Included | Included |\n|\nHealth Insurance4 Choose from a wide range of group health coverage options to meet your employees' health and wellness needs. | Included | Included | Included | Included |\nEssential Payroll\nPerfect for small businesses that simply need payroll, taxes, and help with compliance they can trust.\nWhat's included\n- Payroll: Computer, Mobile App, Phone Call\n- Direct Deposit\n- Robust Reporting\n- General Ledger Interface\n- New-Hire Reporting\n- W-2s and 1099 forms\n- Tax Filing\n- Payroll Delivery\n- Multi-company Management\n- Multi-jurisdiction Payroll\n- Wisely® Direct Debit Card\n- ADP® Employee Access\n- New Hire Onboarding\n- Employee Discounts\n- Background Checks\n- Add-ons\n- Time and Attendance\n- Retirement6\n- Workers' Compensation4\n- Health Insurance4\nEnhanced Payroll\nFor basic payroll plus ZipRecruiter®, SUI management and background checks.\nWhat's included\n- Everything included in Essential Payroll, plus…\n- Check Signing; Security\n- SUI Management\n- Job Costing\n- Labor Law Poster Compliance\n- ZipRecruiter®\n- Background Checks\n- Add-ons\n- Time and Attendance\n- Retirement6\n- Workers' Compensation4\n- Health Insurance4\nComplete Payroll & HR Plus\nFor everything included in our Enhanced package, plus basic HR support.\nWhat's included\n- Everything included in Enhanced Payroll, plus…\n- HR HelpDesk\n- Employee Handbook Wizard\n- HR Tracking\n- HR Forms and Documents\n- HR Training and Toolkits\n- Add-ons\n- Time and Attendance\n- Retirement6\n- Workers' Compensation4\n- Health Insurance4\nHR Pro Payroll & HR\nFor everything included in our Complete package plus enhanced HR support and perks for you and your employees.\nWhat's included\n- Everything included in Complete Payroll & HR, plus…\n- Enhanced HR HelpDesk Support\n- Applicant Tracking System\n- Enhanced Employee Handbook Support\n- Learning Management System\n- Sexual Harrassment Prevention Training\n- Legal Assistance Upnetic Legal Services\n- Add-ons\n- Time and Attendance\n- Retirement6\n- Workers' Compensation4\n- Health Insurance4\nDon't complicate. Integrate.\nAutomate tasks, streamline processes and share data seamlessly — all while keeping your data secure.\nGet the integrations you need with ADP.\nMEET OUR CLIENTS\nRUN is user friendly. You can integrate it with other features such as HR, Timekeeping, Retirement Services and Workers’ Compensation policies. All of our payroll tax filings are completed timely and accurately. It saves me so much time.\nLinda Kitch Bookkeeper, Orthoworx Inc.\nMEET OUR CLIENTS\nWe needed a one-stop shop and a resource that could provide easy payroll, benefits and compliance capabilities surrounding ever-changing state laws to help prevent costly mistakes. We found that with RUN.\nTracey Levy Partner and Chief Compliance Officer, LevCo Technologies\nMEET OUR CLIENTS\nI like the HR section of RUN. I enjoy using it to stay up to date on the laws. It provides updates each month categorized by state and federal law changes. There is also a great HR compliance database that helps me to make decisions and create policies that keep our entities compliant.\nKennedy Humphrey Human Resource Manager, Gaia Flooring\nMEET OUR CLIENTS\nI’ve never experienced a payroll platform this robust before. RUN gives me a central location to efficiently handle payroll and HR-related matters.\nSushant Garg Chief Financial Officer, T3RA Logistics\nMEET OUR CLIENTS\nRUN is user friendly. You can integrate it with other features such as HR, Timekeeping, Retirement Services and Workers’ Compensation policies. All of our payroll tax filings are completed timely and accurately. It saves me so much time.\nLinda Kitch Bookkeeper, Orthoworx Inc.\nMEET OUR CLIENTS\nWe needed a one-stop shop and a resource that could provide easy payroll, benefits and compliance capabilities surrounding ever-changing state laws to help prevent costly mistakes. We found that with RUN.\nTracey Levy Partner and Chief Compliance Officer, LevCo Technologies\nMEET OUR CLIENTS\nI like the HR section of RUN. I enjoy using it to stay up to date on the laws. It provides updates each month categorized by state and federal law changes. There is also a great HR compliance database that helps me to make decisions and create policies that keep our entities compliant.\nKennedy Humphrey Human Resource Manager, Gaia Flooring\nMEET OUR CLIENTS\nI’ve never experienced a payroll platform this robust before. RUN gives me a central location to efficiently handle payroll and HR-related matters.\nSushant Garg Chief Financial Officer, T3RA Logistics\nMEET OUR CLIENTS\nRUN is user friendly. You can integrate it with other features such as HR, Timekeeping, Retirement Services and Workers’ Compensation policies. All of our payroll tax filings are completed timely and accurately. It saves me so much time.\nLinda Kitch Bookkeeper, Orthoworx Inc.\nGet pricing specific to your business\n* See the terms and conditions.\n- ZipRecruiter is a registered trademark of ZipRecruiter, Inc.\n- Legal services are provided by Upnetic Legal Services, a third-party provider.\n- Wisely Direct is not an employer-offered pay card program. There’s no cost to employers and nothing to implement or manage.\n- Automatic Data Processing Insurance Agency, Inc. (ADPIA) is an affiliate of ADP, Inc. All insurance products will be offered and sold only through Automatic Data Processing Insurance Agency, Inc., its licensed agents or its licensed insurance partners; 1 ADP Blvd., Roseland, NJ 07068. CA license #0D04044. Licensed in 50 states. Certain services may not be available in all states.\n- Small Business Marketing toolkit is provided by Upnetic, a third-party provider. Available for an additional charge to RUN Essential and RUN Enhanced customers with up to 4 employees only.\n- Only licensed representatives of ADP Broker-Dealer, Inc. (ADPBD), Member FINRA, an affiliate of ADP, Inc, One ADP Blvd, Roseland, NJ 07068 may offer and sell retirement products and services or speak to retirement plan features and/or investment options available in any ADP retirement product. Unless otherwise agreed in writing with a client, ADP, Inc. and its affiliates (ADP) do not endorse or recommend specific investment companies or products, financial advisors or service providers; engage or compensate any financial advisor or firm for the provision of advice; offer financial, investment, tax or legal advice or management services; or serve in a fiduciary capacity with respect to retirement plans."
    },
    {
        "Ticker": "ADP",
        "Company": "Automatic Data Processing",
        "Source_URL": "http://www.adp.com/spark.aspx",
        "Content_Type": "Website Content",
        "Raw_Text": "Latest Articles\nTopics\nExploring the future of HR\nDecember 11, 2025 | 2 p.m. ET\nAre you ready for the HR trends and challenges of 2026? In this complimentary webcast, experts will relay the latest developments that could affect your workforce and how you can prepare, respond and adapt.\nRegister NowSubscribe to SPARK updates\nStay in the know on the latest workforce trends and insights."
    },
    {
        "Ticker": "ADP",
        "Company": "Automatic Data Processing",
        "Source_URL": "http://www.adp.com/resources/what-others-say/reviews.aspx",
        "Content_Type": "Website Content",
        "Raw_Text": "Reviews\nTop rated payroll and HR solutions.\n4.2 / 5 Stars\n(617 Reviews)\n4.5 / 5 Stars\n(829 Reviews)\n4.5 / 5 Stars\n(829 Reviews)\n4.5 / 5 Stars\n(829 Reviews)\n4.5 / 5 Stars\n(1,912 Reviews)\nRatings include incentivized reviews and are accurate as of 9/15/25."
    },
    {
        "Ticker": "ADP",
        "Company": "Automatic Data Processing",
        "Source_URL": "http://www.adp.com/about-adp.aspx",
        "Content_Type": "Website Content",
        "Raw_Text": "ADP — providing solutions that simplify work\nSince our very beginnings, we’ve been at the forefront of payroll and HR innovation.\nToday, as always, we're proud to design better ways to work, with people at the heart of everything we do.\nWho we are\nAt ADP, what we do is about people. Although we have a strong history of providing solutions for human resource challenges, we strive to do more than that.\nWe challenge ourselves to anticipate, think forward and take action in a way that empowers us to shape the changing world of work.\nFor over 75 years, we’ve led the way in defining the future of business solutions. ADP is proud to be named the 2025 Fortune® World's Most Admired Companies™ list again for 19 consecutive years*.\nWhat we do\nWe are a comprehensive global provider of cloud-based human capital management (HCM) solutions that unite HR, payroll, talent, time, tax and benefits administration and a leader in business outsourcing services, analytics and compliance expertise.\nOur unmatched experience, deep insights and cutting-edge technology have transformed human resources from a back-office administrative function to a strategic business advantage.\nLearn more about our philosophy, success factors and why companies work with ADP.\nOur leadership\nMeet the people who are leading the charge in designing better ways of working for businesses across the globe.\nLearn MoreCorporate social responsibility\nWe are committed to unlocking potential – not only for our clients and their businesses, but in our people, our communities and society as a whole.\nOur Company\nOur Associates\nOur Clients\nOur Communities\nOur World\nWorking with ADP\nOur policies, procedures and procurement resources helped make us one of the 2025 Fortune® World’s Most Admired Companies™* 19 years in a row.\nLearn about Supplier Diversity, Corporate Governance, Code of Ethics policies, and more.\nData security & privacy\nWe maintain the highest levels of data security and privacy, and educate and empower our clients to take measures to reduce risk.\nLearn more about Data Security at ADP.\nLearn more about Privacy at ADP.\nMeet the team\nADP has partnered with the most exciting professional athletes. Our roster of accomplished competitors inspire us to perform at our best.\nWhether on the field or in business, data and insights connect people to the things they care about. In sports, players rely on data to inform smarter decisions as they move from one maneuver to the next. And with data driven insights from ADP, our clients have the precise information they need today to have a competitive edge tomorrow.\nFeatured Awards & Industry Recognition\nWe're proud to be recognized for our work and values by esteemed organizations.\n* From Fortune. ©2025 Fortune Media IP Limited All rights reserved. Used under license. Fortune® is a registered trademark and Fortune World’s Most Admired Companies™ is a trademark of Fortune Media IP Limited and are used under license. Fortune and Fortune Media IP Limited are not affiliated with, and do not endorse products or services of, ADP, Inc."
    },
    {
        "Ticker": "ADP",
        "Company": "Automatic Data Processing",
        "Source_URL": "http://www.adp.com/about-adp/leadership.aspx",
        "Content_Type": "Website Content",
        "Raw_Text": "ADP uses cookies and similar technology to customize our site and offer tailored advertising. You can withdraw your consent at any time by setting your preferences."
    },
    {
        "Ticker": "ADP",
        "Company": "Automatic Data Processing",
        "Source_URL": "http://www.adp.com/about-adp/corporate-social-responsibility.aspx",
        "Content_Type": "Website Content",
        "Raw_Text": "Unlocking potential in our people, clients and communities\nCorporate Social Responsibility at ADP\nIn a world of constant change, ADP drives purposeful innovation while staying true to the values built into our DNA—ethics, integrity, and a commitment to doing things right. We deliver human, simple and sustainable business processes on a global scale to fuel meaningful progress.\nOur data, advanced technology, and deep expertise help employers of all sizes make sound decisions, capture opportunities for innovation, and invest in their most important resource: their people.\nThis commitment to corporate social responsibility helps us attract, engage, and retain top talent. It bolsters business performance and conserves environmental resources for our company, our clients and our community.\nBuilding a better company — and world\nLearn how ADP is contributing to a more ethical, inclusive society.\nADP is dedicated to unlocking potential not only for our clients and their businesses, but for our people and our communities. As a global leader in HR and payroll solutions, we have clients, associates, partners, investors and neighbors across the globe, a commitment to each of them to be a conscientious corporate citizen.\nOur stakeholders trust us to act ethically and responsibly and meet the highest standards of business conduct. Our corporate culture puts a priority on honoring our commitments and always doing the right thing. Integrity is first among our core values.\nThe following principles are critical to our ongoing success."
    },
    {
        "Ticker": "ADP",
        "Company": "Automatic Data Processing",
        "Source_URL": "http://www.adp.com/about-adp/awards-and-recognition.aspx",
        "Content_Type": "Website Content",
        "Raw_Text": "Awards and recognition\nAt ADP, we have a great story to tell. We uphold our mission by working hard every day to bring value to our clients, our associates, and the global community. Working with the highest ethical standards, as well as providing excellent quality service and products, is just good business. When we are recognized for our work by esteemed organizations, it reconfirms the fact that we are doing the right things and continuing to be driven by our core values.\nFeatured awards and industry recognition\nTechnology and product leadership\nLeader in HCM Wave - ADP Workforce Now (2025)\nForrester\nLeader in the People Analytics Platforms PEAK 2025 assessment, ADP® DataCloud (2025)\nPEAK by Everest Group\nLeader in SMB HCM Value Index - ADP Workforce Now® (2025)\nNucleus Research\nTop Rated Award - RUN Powered by ADP® (2025)\nTrustRadius\nLeader in Enterprise HCM - ADP Lyric HCM (2025)\nNucleus Research\nTop ranking solutions in Workforce Management, ADP Workforce Suite, ADP Workforce Manager (2025)\nNucleus Research\nLeader in Small Business Payroll - RUN Powered by ADP® (2025)\nG2\nTop 50 Best HR Products - ADP Workforce Now®, RUN Powered by ADP® (2021-2025)\nG2\nBest Products for Small Business - RUN Powered by ADP® (2021-2025)\nG2\nBuyers Choice Award for Best Capabilities, Value, and Customer Relationships - RUN Powered by ADP® (2025)\nTrustRadius\nBIG Innovation Award for Business Services - RUN Powered by ADP® (2025)\nBusiness Intelligence Group\nLeader and Star Performer for Recruitment Process Outsourcing (RPO) (2024)\nPEAK Matrix by Everest Group\nMarket Leader for Workforce Management Suites (2024)\nVentana Research\nMarket Leader for Workforce Management Basics (2024)\nVentana Research\nLeader and Star Performer for Employee Experience Management Platforms (2023)\nPEAK Matrix by Everest Group\nGold Winner for Mobile Web & App of the Year - RUN Powered by ADP® (2023)\nAmerican Best in Business Awards\nPlatinum Winner for Small Business Information Technology - RUN Powered by ADP® Mobile App (2023)\nTitan Awards\nPlatinum Winner for Financial Services Information Technology - RUN Powered by ADP® (2023)\nTitan Awards\nGold Winner for Mobile Site Design - RUN Powered by ADP® Mobile App (2023)\ndotCOMM Awards\nGold Winner for Mobile/Apps Business-to-Business - RUN Powered by ADP® Mobile App (2023)\ndotCOMM Awards\nNelsonHall NEAT Leader 2023: Next Generation HCM Technology\nNEAT by NelsonHall\n1st Place for Ongoing Investment Education - ADP TotalSource (2023)\nEddy Awards\nBanking Innovation Award - Wisely by ADP (2023)\nFinTech Breakthrough Awards\nBusiness Intelligence Solution of the Year - Voice of the Employee (2023)\nData Breakthrough Awards\nTop 100 Insurance Agencies and Brokers - Automatic Data Processing Insurance Agency, Inc. (ADPIA), an affiliate of ADP, Inc (2023)\nBusiness Insurance Magazine\nGold Stevie Winner for MyLife Advisors for Contact Center of the Year (2023)\nAmerican Business Awards\nBusiness Excellence Awards: Product, Service, & Solution | Business Technology Solutions Awards - Data Analytics and Business Intelligence (2023)\nGlobee Awards\nCloud Computing - Software as a Service: Talent Acquisition (2023)\nStratus Award\nMost Innovative Feature of the Year - Enterprise - Talent Acquisition (2023)\nBest in Biz Awards\nMost Innovative Product Line of the Year - Talent Acquisition (2023)\nBest in Biz Awards\nProduct of the Year - Talent Acquisition (2023)\nBIG Awards for Business\nStandOut Powered by ADP Video Series (2023)\nAVA Digital Awards\nTop 100 Best Software Products – RUN Powered by ADP® (2022-2023)\nG2\nTop 100 Best Global Software Companies (2023)\nG2\nStandOut Powered by ADP Metrics Dashboard Video (2023)\nAVA Digital Awards\nTop Rated Tax Compliance - ADP SmartCompliance® (2023)\nTrustRadius\nTop Rated Compliance Consulting - ADP SmartCompliance® (2023)\nTrustRadius\nBest Software Products - ADP SmartCompliance® (2023)\nG2\nService\nLeader in Benefits Administration (2022-2025)\nNEAT by NelsonHall\nLeader Multi-Process Human Resources Outsourcing (2012-2025; 14 consecutive years)\nPEAK by Everest Group\nLeader Multi-Country Payroll (MCP) Solutions (11 years)\nPEAK by Everest Group\nLeader Payroll Services (11 years)\nNEAT by NelsonHall\nLeader Recruitment Process Outsourcing (RPO) (2020–2025)\nNEAT by NelsonHall\nLeader Cloud-Based HR Transformation Services (2020 - 2023)\nNEAT by NelsonHall\nTalent and development\nBest Company Outlook (2021-2025)\nComparably\nMilitary Friendly Spouse Employers (2022-2025)\nMilitary Friendly\nMilitary Friendly Employers (2023-2024 Silver, 2025 Gold)\nMilitary Friendly\nBest Places to Work (2023-2025)\nBuiltIn\nBest Large Companies to Work (2023-2025)\nBuiltIn\nAmerica's Most Innovative Companies (2024-2025)\nFORTUNE\nAccessAbility Award (2025)\nHelen Keller Services (HKS)\nHR100 (2025)\nHRO Today\nBest CEOs for Diversity (2025)\nComparably\nBest CEOs for Women (2025)\nComparably\nMilitary Friendly Gold Top 10 Supplier Diversity Program (2025)\nMilitary Friendly\nBest Companies for Multicultural Women (2016-2025; 10 consecutive years)\nSeramount\nGlobal Inclusion Index (2025)\nSeramount\nBest Company for Multicultural Women (2025)\nSeramount\nLeading Inclusion Index Company (2025)\nSeramount\nTop Ranked Company on Corporate Equality Index (2009-2024)\nHuman Rights Campaign Foundation\nBest CEO (2018-2024)\nComparably\nHappiest Employees (2018-2024)\nComparably\nBest Place to Work for Disability Inclusion (2021-2024)\nDisability:IN\nBest Global Culture (2021-2024)\nComparably\nBest Career Growth (2021-2024)\nComparably\nBest Leadership Teams (2022-2024)\nComparably\nBest HR Teams (2023-2024)\nComparably\nAmerica’s Greatest Workplaces (2023-2024)\nNewsweek and Plant-A Insights Group\nTop Women Employer (2024)\nDiversityComm Magazine\nHybrid Best Places to Work (2023)\nBuiltIn\n* From Fortune. ©2025 Fortune Media IP Limited All rights reserved. Used under license. Fortune® is a registered trademark and Fortune World’s Most Admired Companies™ is a trademark of Fortune Media IP Limited and are used under license. Fortune and Fortune Media IP Limited are not affiliated with, and do not endorse products or services of, ADP, Inc."
    },
    {
        "Ticker": "ADP",
        "Company": "Automatic Data Processing",
        "Source_URL": "http://www.adp.com/about-adp/ambassadors.aspx",
        "Content_Type": "Website Content",
        "Raw_Text": "Connecting people and possibilities\nADP empowers people to perform at their best, delivering the data and insights they need today to chase the next win ahead. That's why we're proud to partner with the most exciting professional athletes who inspire us all to reach our full potential.\nMeet Team ADP\nIn sports as in business, better data powers smarter decision-making. Today's biggest names in athletics use data to create innovations in performance and to drive new efficiencies that give them a competitive edge. How they prepare for each competition, how they approach each maneuver — that combination of tenacity, technology and trusted advisors all leads to their success.\nADP-sponsored players are moving the sport forward and giving back to communities around the world. Meet our roster.\nCéline Boutier is a French professional golfer on both the LPGA Tour and Ladies European Tour. She holds six LPGA Tour victories and six Ladies European Tour victories since turning professional in 2016, most recently winning the Aramco Team Series – Shenzhen in 2024. Her win at the 2023 Amundi Evian Championship was her first major championship victory and the first time a Frenchwoman has won the event. Boutier is also a four-time member of the European Solheim Cup team; helping them to victories in 2019 (where she was undefeated), 2021 and 2023; and represented France at the 2020 Tokyo Olympics and the 2024 Paris Olympics.\n- Six-time LPGA Tour winner\n- Three-time Solheim Cup Winner\n- 1 major championship\nSam Burns joined the PGA TOUR in 2019 after an impressive year on the Korn Ferry Tour, and is one of the fastest growing names in golf. Burns is a five-time PGA TOUR champion, with his first win at just 24 years old at the Valspar Championship. Burns defended his title at the 2022 Valspar Championship where he won for the second time. His most recent win occurred at the 2023 WGC-Dell Technologies Match Play. In 2023, Sam made his first appearance on the U.S. Ryder Cup Team, where he played in three matches. In 2024, Sam represented the United States in the President Cup for the second time in his career. Sam is from Shreveport, LA, where he, his wife Caroline and their son Bear currently reside.\n- Five-time winner on PGA TOUR\n- Eight top-10 finishes in 2024\nMarcus Byrd is a PGA Americas Tour professional from Washington, D.C. Marcus previously excelled while playing on the APGA Tour and has now advanced his career to the Korn Ferry Tour and PGA TOUR Americas. In 2024 he achieved two top-10 finishes on the Korn Ferry Tour and made his first cut on the PGA TOUR at the 2024 RSM Classic. He is a testament to perseverance, having overcome several serious injuries and the death of his father in 2020. Marcus was the first APGA professional to secure four wins in one season. Marcus is actively working towards gaining his TOUR card.\nMax Homa is a six-time PGA TOUR champion, and a DP World Tour winner with his most recent victory at the Nedbank Golf Challenge. Four of Max’s six PGA TOUR wins have come from in his home state of California. Since 2020, Max ranks first on the PGA TOUR in wins in the Golden State and is an impressive 60 under-par across his four California wins. In 2023, Max made his first appearance on the U.S. Ryder Cup Team where he earned the team 3.5 points. In 2024, Max achieved his first top-5 finish in a major by tying for third place at the 2024 Masters Tournament, finishing at 4-under par. Homa is well-known for his vibrant social media presence, where he frequently interacts with fans and offers amusing insights into the life of a professional golfer. His on-course success and approachable demeanor have made him a fan favorite and a respected figure in the golfing community.\n- Six-time PGA TOUR winner\n- 2023 Ryder Cup Team\n- Finished 3rd place in the 2024 Masters\nThriston Lawrence is a South African professional golfer on the DP World Tour and PGA TOUR. He holds four wins on the DP World Tour, reaching as high as 3rd on the tour rankings. In 2022 he won the Omega European Masters in a playoff, leading to him earning the Sir Henry Cotton Rookie of the Year award at the end of the season. Lawrence continued his dramatic rise through 2023 and 2024, finishing 4th at The Open Championship in 2024. He has been awarded his PGA TOUR card for 2025 and will look to continue his success on golf's biggest stage.\n- 2022 Sir Henry Cotton Rookie of the Year\n- Finished 4th place at the 2024 Open Championship\nMinjee Lee is an 11-time LPGA Tour Champion, including three Major Championships. From Perth, Australia, she represented her home country in the 2016, 2020 and 2024 Olympic Games. She has also made a place for herself in Australian golf history as the third player to have ten or more LPGA Tour wins. Minjee has established herself as the most consistent player in the world, spending more than 360 straight weeks inside the top 20 of the Women’s World Golf Rankings. Minjee’s interests off the course include cooking, tennis and spending time with family.\n- 11-time LPGA Tour winner\n- Three-time Major Champion\n- Two-time Olympian\nMin Woo Lee is an Australian golfer who turned professional in 2019 and has since won five events. Lee most recently won his first PGA TOUR title at the 2025 Texas Children’s Houston Open. In 2024, Min Woo Lee made his first appearance in both the Olympics and the Presidents Cup. Min Woo's inventive use of social media has made him one of golf's most intriguing players. His captivating videos and distinctive way of documenting his travels on tour have significantly contributed to his popularity. Lee holds a Guinness World Record title for the ‘Fastest hole of golf by a team of four’ achieved at Real Club Valderrama in 2021.\n- Winner of the 2025 Texas Children’s Houston Open\n- Three-time winner on DP World Tour\n- One victory on Asian Tour\nGregory Odom Jr turned pro in 2024, he is a member of the APGA Tour. Odom began his collegiate golf career at the University of Memphis and later transferred to Howard University where we became a standout player. Odom Jr won back-to-back PGA Works Collegiate Championships in 2021 and 2022, which earned him a sponsor exemption and his PGA TOUR debut into the 2022 Wells Fargo Championship. In 2023, he was named the Pathway Player into the Collegiate Showcase at the Genesis Invitational. Odom’s first professional victory came at the Mastercard APGA Tour Championship in August 2024.\n- Winner of the 2024 Mastercard APGA Tour Championship\n- Winner of the 2024 Cisco Invitational\nYana Wilson is one of golf’s youngest stars. By age 15, Yana had won over 100 amateur junior golf tournaments including the 2022 USGA US Girls Junior Championship. In 2023 she won the prestigious 2023 Mizuho Americas Open Junior Invitational and was awarded the Rolex AJGA Player of the Year. Yana turned pro in 2024, making her professional debut at the Kroger Queen City Championship presented by P&G.\n- 2023 Rolex AJGA Player of the Year\n- Winner of the 2023 Mizuho Americas Open Junior Invitational\nFollow Yana on Instagram.\nSmarter decisions start with insightful data\nThe ability of data to power performance is true no matter what your field. In golf, data is critical to our ADP ambassadors game. They rely on information, such as ball speed, ball flight, club distance benchmarking, strokes gained, wind direction, green reading and more to make better decisions on the course.\nADP’s payroll and HR solutions may not be able to enhance your golf game, but they can help you answer critical questions about your business and your people. Is your turnover rate higher than expected? Could your time and attendance be better optimized? Are your compensation packages competitive? With this data at your fingertips, you can improve business outcomes and be better prepared for new challenges that arise.\nBusiness needs have changed. Our solutions have too.\nNo matter what lies ahead, we’re here to support you with unmatched expertise, agile technology, and actionable data."
    },
    {
        "Ticker": "ADP",
        "Company": "Automatic Data Processing",
        "Source_URL": "http://www.adp.com/about-adp/data-security.aspx",
        "Content_Type": "Website Content",
        "Raw_Text": "A partner you can trust\nProtecting our clients' data and earning their trust since 1949.\nSee how ADP’s security is at the forefront of the industry.\nData security\nToday’s digital landscape means limitless possibilities, and also complex security risks and threats. At ADP, security is integral to our products, our business processes, and infrastructure. We deliver advanced services and technology for data security, privacy, fraud, and crisis management—all so you can stay focused on your business.\nSecurity updates\nADP security updates and alerts to help you protect your organization and employees\nSOC details\nADP issues SOC 1 Type 2 and SOC 2 Type 2 reports over select products and services. In general, the availability of SOC 1 and SOC 2 reports is restricted to customers who have signed nondisclosure agreements with ADP. Also, ADP currently produces four (4) bridge letters per year, each covering the calendar quarter, and covering a fiscal quarter at-a-time.\nPlease contact your appropriate sales or account team member for more details in obtaining a SOC report. For more information regarding SOC reporting and its standard, please go the AICPA’s (American Institute of Certified Public Accountants) website.\nISO certification details\nADP maintains ISO 9001, ISO/IEC 27001 and ISO/IEC 27701 certifications for select services and locations. In general, the availability of ISO certifications is restricted to customers who have signed nondisclosure agreements with ADP.\nPlease contact your appropriate sales or account team member for more details.\nConstant innovation\nToday’s threats move fast. Across all our HCM products and services, we help keep you protected with constantly evolving tools, technologies, expertise, and safeguards. Our proactive culture and operations include:\n- Research and testing on evolving threats\n- Continual training in new guidelines and practices\n- Advanced technology\nGlobal expertise\nWhen it comes to security for your ADP products and services, you need protection around the clock, and in every time zone. With over 65 years of experience and global reach, our security specialists and intelligence platforms have the bases covered. You’ll benefit from:\n- Enterprise information security architecture\n- 24/7 global protection\n- Advanced threat monitoring\n- Multiple, state-of-the-art Critical Incident Response Centers located around the globe\nBusiness protection\nTo be protected, you need to take an integrated approach. Partnering with ADP gives you advanced platform defense, intelligent detection, automated data protection, physical security, fraud defense, business resiliency, identity and access management—and much more. We embed multiple layers of protection into our products, processes, and infrastructure, to be sure that security remains at the forefront.\nADP engages in both internal and external assurance and audit activities across the enterprise multiple times a year that include reviews of our technology, security and related controls. External assurance includes various SOC 1 and 2 reports, ISO 9001 and 27001 certifications, Sarbanes-Oxley, and Payment Card Industry Data Security Standard (PCI DSS), as well as a combination of internal assessments and audits performed by groups such as Internal Audit, the Global Security Organization, Compliance, etc.\nIncident management\nADP products and services are designed and maintained with controls and procedures to prevent incidents. In addition, a dedicated global team monitors round-the-clock using additional comprehensive controls, including data analytics, to detect, investigate and respond to anomalies and incidents. This team addresses any reported or detected issues by following a defined incident lifecycle. This lifecycle is governed by policies and procedures, and uses an incident management system to record facts, impact and remedial actions taken. To complete the cycle further, reviews are undertaken to learn and improve.\nFraud prevention\nFraud attacks have become increasingly sophisticated. With a dedicated fraud prevention program, ever-evolving anti-fraud practices, and cutting-edge technology, we work hard to protect your funds and personal information. Our fraud prevention program includes:\n- A detailed, holistic view of transactional behaviors\n- Proactive and systematic response to fraudulent activities\n- Deep understanding of fraud indicators and concealment strategies\n- Organization-wide Anti-Money Laundering (AML) compliance\n- Support for audit activities\n- Defend yourself against fraud\nBusiness resilience\nWe’re committed to keeping our products and services running smoothly so you can serve your employees. Across technology, environmental, process, and health, our priority is to identify and mitigate our own risk. Our highly skilled, certified business resiliency professionals around the globe ensure internal issue response 24/7—365 days a year.\nPrivacy at ADP\nADP clients around the world trust ADP to handle their sensitive information. ADP’s Global Data Privacy and Governance team handles:\n- The protection and governance of personal information as outlined in ADP’s Global Privacy Policy and BCRs\n- Conducting privacy reviews to ensure appropriate privacy protections are in place\n- Evaluating privacy incidents in accordance with data privacy laws\n- Implementing enterprise wide privacy compliance programs\nADP Security Awareness & Training Program Overview\nAt ADP, our Security Training and Awareness Program is a continuous, dynamic and robust initiative that is designed to develop and maintain a security-focused culture, empower our associates and contingent workers to make responsible, secure decisions and to protect our most valuable assets. We employ a variety of tools, techniques and programs to embed security into our associates’ and contingent workers’ day-to-day professional and personal lives.\nAll associates are required to take and successfully complete an annual, interactive security training program that includes an overview of key security topics, policies and responsibilities. All contingent workers are required to complete this same training within one week of the start of their contract. Additionally, ADP's security policies are available to both associates and contingent workers on ADP's Information Security intranet (access to intranet may be role dependent). This intranet site provides additional security information to all associates and contingent workers, such as a security newsfeed with tips and best practices, external security resources, emergency response information, security alerts, awareness information, security procedures, and contact information for associates and contractors to ask security-related questions or raise concerns via email or telephone.\nTo reach and engage as many associates and contingent workers as possible, ADP’s Security Training and Awareness program consists of various methods of delivery. Examples of tools used to include: classroom-based training, webinars, infographics, posters and other visual aids, online training, videos, blogs and portal articles, newsletters, internal social media feeds, intranet sites, etc. Further, ADP has implemented a security ambassador program that is available to both associates and contingent workers to join at their will. This gamified program provides opportunities for our associates and contingent workers to get additional security training and be involved in other security initiatives.\nTopics that ADP includes as part of our Security Training and Awareness program include (*topics may rotate depending on timing and specific initiative)\n- Clean desk\n- Bring-Your-Own Device\n- Data Management\n- Removable Media\n- Safe Internet Habits\n- Physical Security\n- Social Media\n- Scams including phishing, vishing, smishing, spear phishing and whaling\n- Malware\n- Social Engineering\n- Incident Response\n- Security Responsibilities\n- Other ADP-specific topics that are relevant to our associates and contractors\nDon’t just take our word for it.\nOur awards include:\n#5 Security Program in\nInformation Technology\nSecurity Magazine\n#1 in Business\nServices Category\nSecurity Magazine\nCSO50 Award:\nGlobal Incident Governance\nCouncil program\nCSO50 Award:\nADP's S.A.F.E program\nCSO50 Award:\nGlobal Third-Party Risk\nManagement 2.0\nExcellence in\nInformation Security\nRSA Conference"
    },
    {
        "Ticker": "ADP",
        "Company": "Automatic Data Processing",
        "Source_URL": "http://www.adp.com/contact-us/customer-service.aspx",
        "Content_Type": "Website Content",
        "Raw_Text": "ADP uses cookies and similar technology to customize our site and offer tailored advertising. You can withdraw your consent at any time by setting your preferences."
    },
    {
        "Ticker": "ADP",
        "Company": "Automatic Data Processing",
        "Source_URL": "http://www.adp.com/spark/about-us.aspx",
        "Content_Type": "Website Content",
        "Raw_Text": "About SPARK\nThe SPARK blog is a trusted resource that provides stories, insights and tips that can help you ignite the power of your people written by a hand-selected group of ADP subject matter experts, entrepreneurs, business writers and consultants.\nTopics\nSubscribe to SPARK updates\nStay in the know on the latest workforce trends and insights."
    },
    {
        "Ticker": "ADP",
        "Company": "Automatic Data Processing",
        "Source_URL": "http://www.adp.com/spark/series/a/ai-insights.aspx",
        "Content_Type": "Website Content",
        "Raw_Text": "AI Insights\nArtificial intelligence (AI) is changing how we work and how work gets done.\nUnderstand AI and its evolution and use cases. Read the following articles for the latest insights from attorneys and experts in HR, information technology and data privacy and security. Also, launch this on-demand webcast anytime, How AI is reshaping the world of work: Insights and strategies to consider.\nRecommended for You\nSubscribe to SPARK updates\nStay in the know on the latest workforce trends and insights."
    },
    {
        "Ticker": "ADP",
        "Company": "Automatic Data Processing",
        "Source_URL": "http://www.adp.com/what-we-offer/payroll/payroll-software.aspx",
        "Content_Type": "Website Content",
        "Raw_Text": "Payroll software\nfor business\nEasily run payroll, save time and keep your business compliant.\nPayroll software that’s easy and affordable\nRunning payroll online is one of the most important aspects of any successful business, but that doesn’t mean it has to be stressful. With first-class payroll software, you’ll experience peace of mind knowing you have the resources to pay your employees and taxes correctly and on time.\nADP’s payroll software features:\n24/7 access from any device\nA user-friendly interface\nAutomated features\nFeatures and benefits\nIn the cloud – and beyond\nMore than half of small firms with five or more employees pay an outside firm to prepare their payroll, according to the National Small Business Association1. Discover how ADP’s payroll software can help you improve your business operations.\nPayroll software for any size business\nPayroll software FAQs\n- What does payroll software do?\n-\nPayroll software automates the most labor-intensive aspects of running payroll. Specific features vary from one provider to the next, but employers generally are be able to use software to:\n- Calculate wages earned\n- Integrate payroll with time and attendance\n- Withhold taxes and other deductions\n- Pay employees\n- Run payroll reports\n- Access important tax forms\nBusinesses that opt for full-service payroll may also receive professional assistance with regulatory compliance and have taxes filed on their behalf.\n- What are the best payroll solutions?\n-\nNo two payroll providers are the same, but most high-quality solutions generally can:\n- Automate labor-intensive payroll and tax calculations\n- Deposit tax payments on time\n- Assist with inquiries from the IRS or state agencies, should they occur\n- Help support compliance with constantly changing employment laws and regulations\n- Integrate seamlessly with timekeeping, workers’ compensation, insurance services and other HR applications\n- Provide support with unemployment claims\n- Protect sensitive client payroll data\n- What size organizations use payroll software?\n-\nOrganizations of all sizes use payroll software, but what works for one may not be suitable for another. A small business may only need basic features that save time and help them with tax compliance. Larger corporations, on the other hand, tend to look for more advanced solutions that can integrate payroll with other HR systems or have advanced reporting capabilities.\n- Can I do payroll without software?\n-\nYes, payroll can be processed without software, but this is often a risky option for employers who don’t have the time or the accounting skills to do it correctly. The tax penalties that ensue from mistakes can quickly negate any savings achieved through DIY methods. For this reason, many businesses prefer to partner with a payroll service provider or explore outsourcing solutions.\n- What do I need to run payroll at my company or organization?\n-\nRegardless of how employers choose to run payroll, whether through traditional bookkeeping or a software solution, the process requires a few basic elements to get started. These include:\n- Federal and state employer identification numbers (EINs) for tax purposes\n- Payroll schedules that meet state requirements, as well as the needs of the workforce\n- A means of tracking employee time and attendance, especially if workers are hourly\n- Payment methods and statements that comply with all state regulations\n- A payroll manager to oversee the entire process of calculating wages and deductions, paying employees and filing taxes with government agencies on time\n- What is the easiest payroll software to use?\n-\nOf the many types of payroll software on the market today, some are easier to use than others. Those that are user friendly will usually provide hands-on training, digital learning tools, dedicated account resources or in-product demos to ensure that their clients can run payroll as proficiently as possible. To make things even easier, payroll software may also be capable of integrating with timekeeping, insurance and retirement solutions, and other HR programs.\n- How much does payroll software cost?\n-\nPayroll software costs vary depending on the number of people employed by the business, its individual needs and the provider’s price structure. An annual base price usually applies and there may be an additional fee for each payroll transaction. When weighing payroll software costs, it’s important to assess the level of support provided with the product and how well it can integrate with other programs.\n- When can I begin using software for payroll?\n-\nWith ADP, you can start processing payroll at any time, not just a new quarter or new year. If you’re switching providers, you can ease the transition process by asking for all the necessary forms and information upfront.\n- Can I use this payroll software to run payroll internationally?\n-\nNot all types of payroll software can meet the complex needs of international businesses. Employers that pay employees in multiple countries generally require a payroll service provider that offers worldwide compliance expertise, on-demand analytics and reporting, and first-rate security measures. Some, like ADP, are also capable of unifying data into a single system of record, which helps make managing global payroll easier.\n- What is the time commitment when processing payroll online?\n-\nCompared to manual data entry, online payroll software can save you considerable time. The features available in the package you choose will ultimately determine your total work effort.\n- In the event of a catastrophe or local emergency, how will workers get paid?\n-\nYou can process payroll anywhere because ADP products are in the cloud. So, even if you’re relocated from your place of business, ADP’s payroll software lets you easily use a mobile device to pay your employees.\n- Can a payroll software service provider integrate with my accounting software?\n-\nADP automatically syncs with many popular accounting software products, including QuickBooks™, QuickBooks™ Online, Xero™ and Wave, to ensure a seamless transition of your data. Check with a payroll provider to make sure they pair up with your preferred program.\n- What if I’m already processing payroll with an accountant or bookkeeper?\n-\nYour accountant will probably appreciate that you’re using a trusted payroll service provider because it enables seamless data integration, reporting and payroll processing. This empowers accountants to do more work with greater efficiency, so they have more time to work on strategies that help you run a better business.\nPayroll software testimonial\nPayroll is so quick it saves me a ton of time. Setting up new employees is also obscenely simple. Everything from tax withholdings to direct deposits are done in 2 minutes, max. Such a time-saver that I don't need to hire an HR person or additional accounting person.\nDaniel Ledbetter, Managing Director, Palmetto School of Career Development\nResources and insights\nguidebook\nHow to choose a payroll provider for your business\nguidebook\nPayroll implementation guide\nFAQ"
    },
    {
        "Ticker": "ADP",
        "Company": "Automatic Data Processing",
        "Source_URL": "http://www.adp.com/about-adp/philosophy.aspx",
        "Content_Type": "Website Content",
        "Raw_Text": "‹ Back to Overview\nADP’s One-of-a-Kind Culture and Values\nWe’re changing the world of work, where staying a step ahead means creating a collaborative and agile environment within a company known for its stability, ethics and integrity. Our down-to-earth culture welcomes diverse perspectives and creates a place where our people can flourish. We are on a transformative journey to advance human potential in powerful ways for our clients and ourselves.\nIntegrity is everything:\n- We conduct our business with the highest level of integrity. We are straight forward and honor our commitments. Every time.\nInsightful expertise:\n- We thrive on turning knowledge into insight. Staying ahead of the curve is how we drive value for our clients.\nService excellence:\n- We are obsessed with the client experience. The strength of our client relationships is the key to our growth and success.\nInspiring innovation:\n- We pioneer new and better ways to serve our clients and grow their businesses. We created an entire industry and continue to look ahead to create tomorrow.\nEach person counts:\n- We believe that each person counts. Each client and each associate. Every deed and every contact between ourselves and our clients. We respect and embrace the diversity of our associates, clients and business partners.\nResults-driven:\n- We are driven by a strong, results-driven work ethic. We encourage accountability and prudent risk-taking without the fear of occasional failure.\nSocial responsibility:\n- We believe in giving back to the communities where we work and live. We encourage and support our people’s commitment to giving back and helping to improve their communities."
    },
    {
        "Ticker": "ADP",
        "Company": "Automatic Data Processing",
        "Source_URL": "http://www.adp.com/about-adp/success-factors.aspx",
        "Content_Type": "Website Content",
        "Raw_Text": "‹ Back to Overview\nSuccess Factors\nProduct Leadership\nADP is committed to PRODUCT LEADERSHIP - delivering the best solutions to all of our markets ahead of the competition on a consistent basis.\nOur Vision\nWe know that new products and services are essential to business growth. They help us to better meet the needs of those we serve, as we attract new clients and grow and strengthen our relationship with our existing clients. Our products and services provide tangible solutions that differentiate us from our competitors.\nADP's product offerings include Web-based solutions throughout all of our businesses, in addition to traditional service bureau offerings.\nWe are leveraging the Internet to deliver solutions to an ever-expanding range of prospects. ADP product leadership, like World Class Service, not only requires a sustained, enterprise-wide commitment from us, but also is one of the key elements for our future success.\nWorld Class Service\nADP is committed to WORLD CLASS SERVICE. It is at the core of our service culture and will always be the heart of our relationship with our clients.\nWe define World Class Service as an ongoing journey toward service excellence. World Class Service challenges us to consistently reset the high bar of our performance levels to meet or exceed the expectations of an ever-more-competitive marketplace.\nADP's commitment to World Class Service begins with the first impression we make on a sales call...how smoothly we install our systems...and how effectively our solutions work. It is a combination of everything we do to create a client relationship - and make it flourish.\nWe measure the success of our commitment to World Class Service through client satisfaction scores and client retention rates. Those two key metrics have historically reflected how well we serve our clients.\nWhat differentiates ADP from the competition?\nWe believe that service demands increasingly higher levels of excellence - and there is no level of service today that cannot be further improved tomorrow.\nOur Employment Experience\nOur people are the key to our success.\nTo be the best that we can be, we strive to attract, motivate, empower, and retain exceptionally talented individuals who reflect the diversity of our global client base. We offer them a one-of-a-kind culture to grow their careers for current and future success.\nWe have made a long-term commitment to invest in our culture and the employment experience we offer, focusing on attaining and maintaining top-ranked associate satisfaction levels.\nWe are proud of a culture that offers meaningful work, opportunities for advancement, competitive compensation and benefits, and training and development in a fast-paced business environment that is also sensitive to work-family and flexible schedule needs.\nIn 2018, ADP was recognized by LinkedIn as a Top 50 company where people want to work in the US."
    },
    {
        "Ticker": "ADP",
        "Company": "Automatic Data Processing",
        "Source_URL": "http://www.adp.com/about-adp/message-from-the-ceo.aspx",
        "Content_Type": "Website Content",
        "Raw_Text": "A Message from Maria Black\nADP President and CEO\nIn 1949, ADP started with a simple idea: to help neighborhood business owners pay their people consistently and on time. Driven by this vision, our founder Henry Taub became an early pioneer of the Human Capital Management industry, paving the way for the future of business outsourcing as we know it.\nMore than 75 years later, innovation is still the heart of our business, and the values that led us to become a global technology leader still guide our way. ADP is more focused than ever on making work easy, smart, and human for people around the world — and a simple idea has evolved into a powerful portfolio of global solutions designed to help businesses of all sizes unlock their full potential.\nAs we focus on designing a better world at work, we are keenly aware of our responsibility to contribute to progress in business and beyond and are in the fortunate position to support more than 1.1 million clients in over 140 countries. This reach gives ADP unparalleled scale and a view into the workforce like no other, helping our clients support their people by anticipating, understanding and solving for emerging challenges. These insights represent the meaningful stories and experiences of the workforce, along with the growth of businesses, the contributions of their workers and more.\nAs technology accelerates, it’s our commitment to keep people at the center of every design and decision — and to protect the human moments that make work meaningful. We are so grateful to our 64,000 ADP associates for the important role they play, as they continue to listen and respond to our clients with thoughtfulness and urgency. It’s the reason our clients trust ADP’s unique expertise and exceptional service to support their people and drive their businesses forward.\nBecause the future of work is about elevating human potential. It’s the place where humanity meets innovation.\nThat’s why we are always designing for people.\nThank you,\nMaria Black\nPresident and CEO"
    },
    {
        "Ticker": "ADP",
        "Company": "Automatic Data Processing",
        "Source_URL": "http://www.adp.com/about-adp/office-locations.aspx",
        "Content_Type": "Website Content",
        "Raw_Text": "ADP Office Locations\nFor inquiries about purchasing ADP human capital management solutions, please call 800-225-5237.\nADP offers human capital management solutions including: payroll services, human resource management, benefits administration, talent management, time and attendance, HR BPO, retirement services, and insurance services for small, mid-sized and large businesses.\nCall 800-225-5237 to add to your existing ADP services or to find out how ADP human capital management solutions scale to your business whether you have 1 employee or more than 10,000. Let ADP handle your human capital management so you can get back to running your business.\nAlabama\nVestavia Hills, AL 35243\nArizona\nTempe, AZ 85281\nTucson, AZ 85711\nArkansas\nBentonville, AR 72712\nCalifornia\nCulver City, CA 90230\nFolsom, CA 95630\nFresno, CA 93711\nIrvine, CA 92606\nLa Palma, CA 90623\nLong Beach, CA 90815-1264\nMilpitas, CA 95035\nPasadena, CA 91101\nPleasanton, CA 94588\nRancho Cucamonga, CA 91730\nSan Diego, CA 92108\nSan Dimas, CA 91773\nSan Francisco, CA 94105\nWoodland Hills, CA 91367\nColorado\nDenver, CO 80237\nFort Collins, CO 80524\nConnecticut\nMilford, CT 06461\nStamford, CT 06902\nWest Hartford, CT 06107\nFlorida\nFort Lauderdale, FL 33309\nFort Myers, FL 33913\nJacksonville, FL 32216\nMiami, FL 33173\nMaitland, FL 32751\nMaitland, FL 32751\nSarasota, FL 34240\nTampa, FL 33609\nWest Palm Beach, FL 33407\nGeorgia\nAlpharetta, GA 30005\nAlpharetta, GA 30005\nAugusta, GA 30909\nHawaii\nHonolulu, HI 96813\nIllinois\nSchaumburg, IL 60196\nIndiana\nIndianapolis, IN 46256\nKansas\nOverland Park, KS 66210\nKentucky\nLexington, KY 40504\nLouisville, KY 40299\nLouisville, KY 40245\nLouisiana\nMetairie, LA 70002\nMaryland\nMiddle River, MD 21220\nMassachusetts\nBoston, MA 02116\nMarlborough, MA 01752\nMichigan\nAnn Arbor, MI 48108\nGrand Rapids, MI 49546\nLivonia, MI 48152\nTroy, MI 48083\nMinnesota\nBloomington, MN 55431\nMissouri\nSt. Louis, MO 63131\nNebraska\nOmaha, NE 68154\nNew Hampshire\nSalem, NH 03079\nFlorham Park, NJ 07932\nCranbury, NJ 08512\nMount Laurel, NJ 08054\nParsippany, NJ 07054\nRoseland, NJ 07068\nWall, NJ 08736\nNew York\nAmherst, NY 14221\nBrooklyn, NY 11201\nFairport, NY 14450\nLatham, NY 12110\nMelville, NY 11747\nNew York, NY 10018\nNew York, NY 10011\nNew York, NY 10119\nPittsford, NY 14534\nPoughkeepsie, NY 12601\nRochester, NY 14618\nSyracuse, NY 13088\nNorth Carolina\nCharlotte, NC 28202\nCharlotte, NC 28277\nRaleigh, NC 27603\nWilmington, NC 28403\nOhio\nCincinnati, OH 45202\nFindlay, OH 45840\nIndependence, OH 44131\nWesterville, OH 43082\nOklahoma\nOklahoma City, OK 73142\nOregon\nClackamas, OR 97015\nPennsylvania\nAllentown, PA 18101\nCoraopolis, PA 15108\nFort Washington, PA 19034\nPuerto Rico\nSan Juan, PR 00926\nRhode Island\nWarwick, RI 02886\nSouth Carolina\nColumbia, SC 29201\nFlorence, SC 29501\nGreenville, SC 29615\nMount Pleasant, SC 29464\nTennessee\nMemphis, TN 38138\nNashville, TN 37214\nTexas\nAustin, TX 78728\nDallas, TX 75207\nEl Paso, TX 79912\nEl Paso, TX 79912\nHouston, TX 77041\nSan Antonio, TX 78258\nUtah\nSalt Lake City, UT 84119\nVirginia\nArlington, VA 22203\nNorfolk, VA 23510\nRichmond, VA 23294\nWashington\nSeattle, WA 98101\nWisconsin\nMilwaukee, WI 53214"
    },
    {
        "Ticker": "ADP",
        "Company": "Automatic Data Processing",
        "Source_URL": "http://www.adp.com/about-adp/corporate-social-responsibility/supplier-diversity.aspx",
        "Content_Type": "Website Content",
        "Raw_Text": "‹ Back to Corporate Social Responsibility\nSupplier Diversity\nJump to:\nMission Statement\nOur Objectives\nProgram Participant Qualifications\nCertification\nFrequently Asked Questions\nRegister as a Supplier\nOur Commitment\nWhat We Buy\nMission Statement\nAs a global leader in business outsourcing solutions, ADP recognizes that creating partnerships with diverse suppliers is a major competitive advantage and a powerful business tool. ADP’s supplier diversity mission is to build relationships with and purchase goods and services from certified diverse enterprises including Minority-owned Businesses, Women-owned Businesses, Veteran and Service-Disabled Veteran-owned Businesses, LGBT+-owned Businesses, Disability-owned Businesses, as well as Small Businesses that can help ADP achieve its growth objectives.\nOur Objectives Include:\n- Actively seeking certified diverse suppliers.\n- Ensuring the inclusion of diverse suppliers as a part of our strategic sourcing and\nprocurement process. - Communicating the value of supplier diversity both internally and externally to all stakeholders.\n- Leveraging our supplier diversity results to meet our client’s supplier diversity requirements.\n- Diverse supplier development and education through webinars and mentorship, as well as certification sponsorships.\n- – Please use the link to your right to register for our upcoming webinars.\nProgram Participant Qualifications\nTo participate in the ADP Supplier Diversity Process, a business must be at least 51% owned, operated and controlled by member(s) from one of the following targeted enterprises or other businesses recognized by the SBA:\n- Minority-owned Business Enterprise (MBE)\n– Hispanic\n– African American\n– Asian\n– Native American - Women-owned Business Enterprise (WBE)\n- Veteran-owned Business Enterprise (VBE)\n- Service-Disabled Veteran-owned Business Enterprise (SDVOBE)\n- LGBT+-owned Business Enterprise (LGBTBE)\n- Disability-owned Business Enterprise (DOBE)\n- Small Business Enterprise (SBE)\nCertification\nTo help ensure that our bidding opportunities reach all eligible diverse businesses, ADP works in conjunction with and accepts third-party certification from the following organizations and councils:\n- Affiliates of the National Minority Supplier Development Council (NMSDC)\n- Affiliates of the Women’s Business Enterprise National Council (WBENC)\n- Affiliates of the National Gay and Lesbian Chamber of Commerce (NGLCC)\n- National Veterans Business Development Council (NVBDC)\n- Disability: IN\n- Small Business Administration\n- Certification from city, state, or Federal agencies may also apply\nTo participate in the ADP Supplier Diversity Process, a company must have a current third-party certification from one of the above organizations.\nFrequently Asked Questions\nHow do I register as a supplier?\nWhat is ADP's commitment to the supplier diversity process?\nWhat does ADP buy?\nFor more information about our Supplier Diversity Process and how to participate,\nplease contact our Supplier Diversity Team:\nsupplier.diversity@adp.com\nRegister as a Supplier\nPlease be aware that this registration does not qualify you as an approved supplier. This step is the beginning of the process that allows your company information to be made available to ADP's procurement team for potential opportunities.\nTo learn more about the process or to begin online registration please click here.\nOur Commitment\nLeadership Commitment\nADP maintains strong and active relationships with a diverse and highly qualified group of suppliers.\nProgram Commitment\nADP is committed to building a strong Supplier Diversity Process. The foundation consists of internal and external deliverables to help ensure success for all ADP stakeholders.\nWhat We Buy\nADP’s Global Procurement Department is the primary provider of ADP’s purchasing needs globally. Here are some examples of the products and services purchased by ADP:\n| Commodities | Description |\n| Office Supplies | All supplies |\n| Hardware | Desktops, Laptops, Servers, Printers |\n| Software and Computer Peripherals | Desktop and Server Applications, Computer Accessories |\n| Promotional Items | ADP Logo Items (e.g., Shirts, Hats, Jackets) |\n| Staffing Services | IT, Administrative, Project Management |\n| Relocation Services | Moving, Transportation, Lodging |\n| Building Maintenance and Operational Supplies | Janitorial/Cleaning, Building Materials |\n| Furniture and Furnishings | Office Furniture, Carpet/Floor Covering |\n| Travel and Entertainment | Car Rental, Fleet Services, Lodging, Transportation, Air Travel |\n| Professional and Consulting Services | IT, Marketing, Communications, Training, Other |"
    },
    {
        "Ticker": "ADP",
        "Company": "Automatic Data Processing",
        "Source_URL": "http://www.adp.com/about-adp/corporate-social-responsibility/ethics.aspx",
        "Content_Type": "Website Content",
        "Raw_Text": "‹ Back to Corporate Social Responsibility\nCode of Business Conduct & Ethics\nSee also:\nADP Anti-Bribery Policy\nCode of Ethics for Principal Executive Officer and Senior Financial Officers\nInsider Trading Policy\nReporting an Ethical Concern\nPolitical Contributions Policy\nJump to:\n- Purpose\n- Scope\n- Compliance with Law\n- Human Rights\n- Harassment, Discrimination, Libel or Slander\n- Conflicts of Interest\n- Anti-Bribery, Anti-Corruption, and Gifts\n- Public Sector Clients\n- Loans\n- Improper Use or Theft of ADP Property\n- Covering Up Mistakes; Falsifying Records\n- Protection of ADP, Client and Vendor Information\n- Gathering Competitive Information\n- Sales: Defamation and Misrepresentation\n- Use of ADP and Third-Party Software\n- Developing Software\n- Fair Dealing\n- Fair Competition and Antitrust Laws\n- Securities Trading\n- Speaking on Behalf of ADP\n- Political Contributions and Lobbying\n- Record Keeping and Financial Reporting\n- Records Retention\n- Waivers\n- Reporting Ethical Violations and Seeking Guidance\n- Conclusion\nEffective Date: April 9, 2025\nSupersedes Date: April 3, 2024\nStatement by President and Chief Executive Officer\nDear Associates,\nADP has a long and proud tradition of conducting business in accordance with the highest ethical standards and in full compliance with both the letter and spirit of all applicable laws. This tradition is reflected in our core value that “Integrity is Everything.” The Code of Business Conduct & Ethics and the Anti-Bribery Policy were developed under the supervision of ADP’s Board of Directors to provide clear guidance to all ADP associates and to ensure a consistent approach to business practices throughout ADP’s expanding worldwide operations. The current versions of the Code and Anti-Bribery Policy and Frequently Asked Questions for both can be found on the Associate Portal at www.myadp.adpcorp.com by following the links for Our Company/Policies & Guidelines/Ethics, Legal Compliance, or the Quick Link to Compliance and Ethics.\nADP’s commitment to maintaining the highest ethical standards starts at the top and resides with every associate. ADP’s Board of Directors, and I personally, are fully committed to conducting ADP’s business with the highest level of integrity and we expect your strict adherence to the Code of Business Conduct & Ethics, the Anti-Bribery Policy and the law. There is zero tolerance of non-compliance and/or retaliation. Any violations will result in swift progressive discipline, including possible termination of employment from ADP.\nI’d like to take this opportunity to remind all leaders in ADP that they have the extra responsibility of setting a clear example by treating associates, clients, prospects, vendors and competitors with honesty and respect, and by always following our policies and the law.\nPlease read the Code and Anti-Bribery Policy carefully as they include many important provisions. They also provide you with information regarding when and how to report any suspected violations. Your calls and written communications will always be dealt with confidentially and there will never be retaliation when a matter is brought forth in good faith.\nThank you for your commitment to comply unequivocally with the highest standards of integrity and business ethics.\nSincerely,\nMaria Black\nPresident and CEO\n©2025 ADP, Inc.\nADP is responsible for the interpretation and administration of this Code of Business Conduct & Ethics, which is considered proprietary information. ADP reserves the right to change this Code at any time, consistent with local law or regulation. Note that links to internal ADP policies may not be available for external viewing.\nPlease contact the ADP Ethics Helpline to report a concern or to ask for guidance regarding an ethics-related question.\nSummary\nADP and each of its associates, wherever they may be located, must conduct their affairs with uncompromising honesty and integrity and in full compliance with all laws and regulations. Business ethics are no different than personal ethics. The same high standard applies to both. As an ADP associate you are required to adhere to the highest standard regardless of local custom.\nYour Responsibilities\n- Comply with the Code of Business Conduct & Ethics, the embedded principles and all applicable laws and regulations.\n- Speak up. If you are aware of or suspect misconduct, a violation of this Code of Business Conduct & Ethics, any ADP policy, or any applicable law, you must report it to the appropriate level of management, or through the ADP Ethics Helpline.\n- Ask questions. If you are uncertain about how to proceed in any situation, discuss it with your manager, HR or, if you need more support, contact the ADP Ethics Helpline.\n- Manager expectations. As leaders, you have a heightened responsibility to be a role model for your associates and promote a culture of integrity and honesty, create an environment of open and honest communication without fear of reprisal, and report any suspected unethical behavior.\nRetaliation Is Not Tolerated\nADP does not tolerate retaliation against any individual who brings forth a matter in good faith or who participates in the investigation of any matter in good faith. Any person who retaliates against or threatens to retaliate against another for raising a concern or allegation regarding actual or potential misconduct will be subject to disciplinary action, up to and including termination.\nII. Scope\nAssociates are expected to be honest and ethical in dealing with each other, clients, vendors and all other third parties. Doing the right thing means doing it right every time.\nMisconduct cannot be excused because it was directed or requested by another. You are expected to alert management whenever an illegal, dishonest or unethical act is discovered or suspected. You will never be retaliated against for reporting your discoveries or suspicions.\nADP conducts its affairs consistent with the applicable laws and regulations of the countries where it does business. Business practices, customs and laws differ from country to country. When conflicts arise between ADP’s ethical practices and the practices, customs, and the laws of a country, ADP seeks to resolve them consistent with its ethical beliefs. If the conflict cannot be resolved consistent with its ethical beliefs, ADP will not proceed with the proposed action giving rise to the conflict. These ethical standards reflect who we are and are the standards by which we choose to be judged.\nThe following statements relate to frequently raised ethical concerns. This Code of Business Conduct & Ethics, however, does not and cannot address every situation that you may encounter. In those circumstances where you are not sure what to do, a set of questions is included at the end of this Code that can help guide you to the right decision and ensure that you do the right thing. If after doing so you are still not sure how to proceed, you should seek guidance from Global Ethics. You can do this by contacting the ADP Ethics Helpline.\nA violation of the standards contained in this Code of Business Conduct & Ethics will result in progressive discipline, including possible dismissal, as well as potential civil and criminal penalties where warranted.\nYou are expected to comply with all applicable laws, rules and regulations. If you have questions, the ADP Legal Department can assist you.\nADP adopts an approach to human rights consistent with the United Nations Universal Declaration of Human Rights, supports and respects the protection of internationally proclaimed human rights, and ensures that we are not complicit in human rights abuses.\nWe will not (i) use any form of slave, forced, bonded, indentured or involuntary labor, and will fully comply with all laws that prohibit the use thereof, as and when applicable (e.g., the U.K. Modern Slavery Act 2015); (ii) engage in human trafficking or exploitation; (iii) import goods tainted by slavery or human trafficking; or (iv) retain employees’ government-issued identification, passports or work permits as a condition of employment.\nC. Harassment, Discrimination, Libel or Slander\nYou must respect the rights of your fellow associates and third parties. Your actions must be free from harassment, including sexual harassment, and discrimination. Harassment is a violation of this Code of Business Conduct & Ethics even if it does not violate the law. Examples of harassment include such acts as bullying, intimidation, threats, stalking, verbal or physical aggression, and offensive or degrading comments or conduct. Each person must be accorded equal opportunity, without regard to their race, color, creed, religion, national origin, age, sex, marital status, lawful alien status, non-job related physical or mental disability, veteran’s status, sexual orientation, gender identity or expression or any other basis prohibited by law. Your actions must also be free from libel or slander.\nYou must avoid any personal activity, investment or association which could appear to interfere with good judgment concerning ADP’s best interests. You may not exploit your position or relationship with ADP for personal gain. You should avoid even the appearance of such a conflict. For example, there is a likely conflict of interest if you:\n- cause ADP to engage in business transactions with you, your relatives or friends;\n- use nonpublic ADP, client or vendor information for personal gain by you, relatives or friends (including securities transactions based on such information);\n- have more than a modest financial interest in ADP’s vendors, clients or competitors;\n- have a second job (“moonlighting”) or serve as a director of or advisor to another company that competes with ADP or may otherwise adversely affect your work at ADP;\n- receive a loan, or guarantee of obligations, from ADP or a third party as a result of your position at ADP; or\n- compete, or prepare to compete, in any other way with ADP while still employed by ADP.\nThere are other situations in which a conflict of interest may arise. If you have questions about a potential conflict of interest or are aware of an actual conflict of interest involving you or another ADP associate, you should contact Global Ethics by contacting the ADP Ethics Helpline or by following any of the other steps outlined in the Section on “Reporting Ethical Violations and Seeking Guidance.”\nE. Anti-Bribery, Anti-Corruption, and Gifts\nADP maintains an Anti-Bribery Policy prohibiting any improper or unethical payment to government officials or a party to a private commercial transaction anywhere in the world by any ADP officer, associate or agent of ADP. The following statement contains general guidance on Bribes and Gifts. You should refer to ADP’s Anti-Bribery Policy for more detailed guidance in this area.\nBribes\nAssociates must not offer or accept bribes, or let others do so on their behalf. ADP prohibits associates from offering anything of value to obtain or retain business for ADP or to otherwise secure a business advantage or influence a decision in favor of ADP. ADP also prohibits facilitation payments, which are cash payments generally made directly to a government employee to help expedite routine government processes. These are different than permitted expediting fees, which are published, available to all, and paid directly to a governmental agency.\nGifts\nOther than for gifts with a value of no more than U.S. $50 given or received in the normal course of business, neither you nor your relatives may give gifts to, or receive gifts from, ADP’s current or prospective clients, vendors or any other commercial partners. Presenting or accepting any other gifts to or from private commercial parties requires prior written approval from your business unit CFO and from the Anti-Bribery Committee.\nTravel, Meals, and Entertainment Expenditures\nADP permits accepting or providing proportionate and reasonable expenditures for travel, meals and entertainment that are legitimately designed to show appreciation to existing business partners, present products and services, or establish cordial business relations, provided that such travel arrangements, meals and entertainment:\n- are not excessive and always appropriate to the nature of the business relationship with the recipient;\n- conform to the laws and customs (as recognized by the written local law or a published judicial decision) of the country in which the expenditures are incurred, as well as the policies, rules or codes of conduct of the recipient;\n- do not place the recipient under an obligation or expectation to confer any business advantage in return for such hospitality (quid pro quo), or create an impression that the recipient’s independence will be affected; and\n- occur only occasionally.\nBefore providing or accepting, directly or indirectly, any travel arrangements, meals or entertainment that are reasonably valued at more than U.S. $250 for each guest, you must first obtain written permission from your business unit CFO and from the Anti-Bribery Committee. Since the level of appropriate expenditures may vary significantly from country to country, CFOs of local business units are authorized to adopt lower hospitality limits for their respective jurisdictions.\nGovernment Employees\nDealing with government employees is often different than dealing with private persons. Many governmental bodies in the United States and abroad strictly prohibit the receipt of any gratuities by their employees, including meals and entertainment. ADP’s Anti-Bribery Policy contains detailed rules applicable to interactions with government officials. You must be aware of and strictly follow the prohibitions set out in ADP’s Anti-Bribery Policy. In all cases, you must never directly or indirectly (e.g., through the use of a third party) promise or give any type of gratuity, kickback, bribe, payoff or advantage (whether in cash or any other form) to officials of governmental units or any other governmental organization, whether in the country of your residence or not.\nThe “public sector” covers a broad range of entities and often places unique bidding, pricing, disclosure and certification requirements on companies with which they do business. You must be aware of when you are dealing with a public sector client, understand what rules apply, seek guidance whenever necessary, and comply with all applicable rules. This is critical to protect ADP, our reputation, our associates, and, equally important, our clients. You should refer to the U.S. Public Sector Policy and International Public Sector Policy for more detailed guidance in this area.\nYou may not provide, facilitate, approve, request or accept a loan or payroll advance from ADP, other than loans that may be permitted on a case-by-case basis in connection with an associate relocation pursuant to the policies of ADP’s Global Mobility Department or through a company-wide approved program. Federal securities laws prohibit ADP from extending or arranging credit in the form of a personal loan to any Automatic Data Processing, Inc. director or executive officer, and all such loans are prohibited by this Code whether in connection with a relocation or otherwise. If you have questions, the ADP Legal Department can assist you.\nH. Improper Use or Theft of ADP Property\nEvery associate must safeguard ADP property from loss or theft and may not use or take such property for personal use. ADP property includes confidential information, software, computers, smartphones, cell phones, office equipment, and supplies. You must appropriately secure all ADP property within your control to prevent its unauthorized use. Use of ADP’s electronic communications systems must conform with ADP’s policies, including the Secure Communications Standard, the Data Protection Policy and the Global Social Media Policy which, among other things, preclude using such systems to access or post material that: is pornographic, obscene, sexually related, profane or otherwise offensive; is intimidating or hostile; or violates any laws or regulations. Notwithstanding the foregoing, associates may make limited non-business use of ADP’s electronic communication systems (e.g., smartphones, cell phones, computers), provided that (a) such use: (i) is occasional; (ii) does not interfere with the associate’s professional responsibilities; (iii) does not diminish productivity; or (iv) does not violate this Code or any other policy; or (b) an exception is specifically authorized in writing by ADP Executive Management.\nI. Covering Up Mistakes; Falsifying Records\nMistakes should never be covered up but should be immediately fully disclosed and corrected. Falsification of any ADP, client or third-party record is prohibited. If you are uncertain about whether a mistake has been made, you should seek guidance from your immediate supervisor or manager.\nJ. Protection of ADP, Client and Vendor Information\nADP is committed to respecting the privacy and security of all personal information that is entrusted to us and to complying with all of the laws that govern the collection, use and processing of personal information of our clients, associates and others. You must comply at all times with ADP’s Global Privacy Policy and the related privacy and information security standards that ADP has adopted. You must also comply at all times with the Binding Corporate Rules as adopted by ADP and approved by the European Data Protection Authorities, which include the ADP Workplace Privacy Code, the ADP Privacy Code for Business Data, the ADP Privacy Code for Client Data Processing Services, and the ADP UK Privacy Code for Client Data Processing Services.\nYou may not disclose ADP, client or vendor confidential or proprietary information to others. Additionally, you must take appropriate steps – including securing documents, limiting access to computers and electronic media, and proper disposal methods – to prevent unauthorized access to such information. Proprietary and/or confidential information includes, among other things, personal information, business methods, pricing and marketing data, strategy, computer code, screens, forms, experimental research, and information about, or received from, ADP’s current, former and prospective clients, vendors and associates. You must at all times comply with ADP’s Global Intellectual Property Policy.\nIf you learn about any potential ADP acquisition, disposition, joint venture or similar event, you must at all times keep that knowledge confidential and may not discuss it with any other person, including ADP associates who are known to you to regularly work on such transactions. If you learn about it through a rumor or any unauthorized source, you must immediately contact ADP’s Chief Legal Officer.\nK. Gathering Competitive Information\nWhen gathering competitive information, you must not violate our competitors’ rights. You may not accept, use or disclose their confidential or proprietary information, which includes information that provides a competitor with a business advantage and is not known to the public. You may access publicly available information such as annual reports, company web sites and publications, public presentations and public marketing documents, journal and magazine articles, stockbroker analyses, advertisements and other public media filings and offerings.\nParticular care must be taken when dealing with a competitor’s present and former clients, vendors and employees. Never ask for, accept or use confidential or proprietary information of our competitors. Never ask any person to violate a non-compete or non-disclosure agreement or to reveal confidential or proprietary information.\nYou may never use any type of ruse, scheme, misrepresentation or omission to obtain any information - whether confidential or not.\nIf you use third-party consultants to assist in gathering competitive information you must be extremely diligent that they strictly adhere to both the letter and spirit of this Code of Business Conduct & Ethics and that both the receipt and use of the gathered information is fully lawful, including applicable antitrust laws. In no event may you use ap third party to undertake activities that would be unacceptable or improper if conducted by ADP.\nAs a general rule, you should never engage in any course of action that you feel would be inappropriate or unethical if conducted by or on behalf of a competitor to obtain ADP information. If you are uncertain what may be obtained or used, the ADP Legal Department can assist you.\nL. Sales: Defamation and Misrepresentation\nSales associates should always seek to provide high value products and services, best suited to a client’s or prospect’s request or needs. It is each associate’s obligation to ensure that clients and prospects are not offered products or services that have no beneficial value to the client or are not well suited to the client’s or prospect’s business needs. Selling must never include misstatements or lies about ADP products and services, or about client’s or prospect’s needs. Spreading rumors, even indirectly, about our competitors, their products or their financial condition is strictly prohibited.\nM. Use of ADP and Third-Party Software\nADP and third-party software may be distributed and disclosed only to associates authorized to use it, and to clients in accordance with the terms of an ADP agreement. ADP and third-party software may not be copied without specific authorization and may be used only to perform assigned responsibilities.\nAll third-party software must be properly licensed, or otherwise utilized in accordance with its terms of use. The license agreements for such third-party software may place various restrictions on the disclosure, use and copying of software.\nAssociates involved in the design, development, testing, modification or maintenance of ADP software must not tarnish or undermine the legitimacy and integrity of ADP’s products by copying or using unauthorized third-party software or confidential information. Associates using or developing products that incorporate new and emerging technologies, must comply with all relevant laws, regulations, and ADP policies. (See ADP’s Use of Generative Artificial Intelligence (AI) Policy for more information.) You may not possess, use or discuss proprietary computer code, output, documentation or trade secrets of a non-ADP party, unless authorized by such party.\nNo ADP associate should take unfair advantage of anyone through manipulation, concealment, abuse of privileged information, misrepresentation of material facts, or any other unfair-dealing practice.\nP. Fair Competition and Antitrust Laws\nADP must comply with all applicable antitrust laws (often known outside the U.S. as competition laws). These laws attempt to ensure that businesses compete fairly and honestly and prohibit conduct seeking to reduce or restrain competition. If you are uncertain whether a contemplated action raises unfair competition or antitrust issues, the ADP Legal Department can assist you. You must also be aware of and strictly follow ADP’s Global Antitrust Policy.\nNo ADP associate may buy or sell securities while aware of material information not available to the public. Persons who give such undisclosed “inside” information to others may be as liable as persons who trade securities while aware of such information. Securities laws may be violated if you, or any relatives or friends, trade in securities of ADP, or any of its clients or vendors, while aware of “inside” information. Guidelines with respect to trading in ADP securities, as well as the securities of publicly traded companies with whom ADP has business relationships, are more fully set out in ADP’s Insider Trading Policy. If you are uncertain, the ADP Legal Department can assist you.\nYou may not discuss ADP or its business with the media, investment community, or industry analysts or consultants unless authorized to do so. If you are contacted by a member of the media regarding a matter involving ADP, you must refer the inquiry to Corporate Communications. Contact information is at mediacenter.adp.com. If you are contacted by a member of the investment or analyst community, or you receive an investment inquiry related to ADP, you must refer the inquiry to Investor Relations. Contact information is at investors.adp.com. You may not disclose material, non-public information about ADP to anyone outside ADP, including securities professionals, security holders, potential investors, or industry analysts or consultants seeking industry information on behalf of third parties, without appropriate prior approval and involvement of the ADP Legal Department.\nSocial Media\nSocial media should not be used in a way that violates this Code of Business Condict & Ethics, ADP policies, or any law or regulation. Associates should identify themselves accurately and make clear that they are speaking for themselves. Posts should be free from discriminatory remarks, harassment, threats of violence, obscene or offensive material, or similar inappropriate or unlawful conduct, and must not disclose confidential information about ADP or ADP’s clients or disparage ADP’s competitors. (See ADP’s Global Social Media Policy for more information.)\nS. Political Contributions and Lobbying\nNo funds or other assets of ADP may be used to make contributions, loans or payments (collectively “Political Contributions”) to (i) any elected or appointed official, political party, candidate for office, political action committee (PAC), Super PAC, ballot measure committee, political committee, and/or political organizations exempt from taxation under section 527 of the U.S. Internal Revenue Code or similar country-specific laws, (ii) pay for a candidate’s or elected or appointed official’s transition, inaugural or legal defense expenses, including to any inaugural committees or any other individuals or organizations managing, funding or supporting transitional, inaugural or legal defense activities, or (iii) make any independent expenditures on behalf of any elected or appointed official, political party, candidate for office, or PAC, Super PAC, ballot measure committee, political committee, and/or political organizations exempt from taxation under section 527 of the U.S. Internal Revenue Code or similar country-specific laws, in any country or region, even where allowed by law. In addition to cash payments, political contributions include in-kind contributions such as the purchase of tickets to fund-raising events, political advertisements, donations of products or services, work performed by associates during paid working hours, and the free use of ADP facilities by any elected or appointed official, political party, candidate for office, or PAC, Super PAC, ballot measure committee, political committee, and/or political organizations exempt from taxation under section 527 of the U.S. Internal Revenue Code or similar country-specific laws.\nUnless otherwise specifically prohibited by ADP, or unless you have received prior written notice by ADP of an obligation to obtain pre-clearance, you may make personal contributions to the extent permissible under federal or state law. Some state and local governments impose unique restrictions and disclosure requirements on public sector contractors, known as “pay-to-play” requirements. These requirements may restrict the personal political contributions of ADP associates with substantive responsibilities for the negotiation and oversight of the contract, and their spouses and dependent children. ADP associates must comply with all such requirements and should not make any personal political contributions to the extent they are restricted by applicable law. In addition, ADP is required to annually collect and report information with various states about certain political contributions by ADP entities, officers and directors of those entities and their spouses and dependent children. As a result, officers and directors of ADP entities and various other ADP associates with substantive responsibilities for the negotiation and oversight of contracts with government clients should ensure that they comply with these requirements. Failure to comply with these requirements may result in ADP being barred from doing business with certain government clients. If you have questions, the ADP Legal Department can assist you.\nYou may not make any Political Contributions as a representative or on behalf of ADP, and you may not use ADP’s name in any way that may create the impression that you are speaking or acting for or on behalf of ADP. ADP will not recognize, reimburse, or compensate associates for their personal Political Contributions. You may not pressure or coerce any associate to make personal political expenditures or take any retaliatory action against associates who do not make such expenditures.\nADP pays dues to trade associations that provide information and assistance on issues of concern to ADP. On an annual basis, ADP will seek written confirmation from each U.S. trade association to which ADP paid dues or other payments in excess of $25,000 that such trade association has not used any portion of these payments to make contributions to political parties, candidates or PACs, or any independent expenditures on behalf of any political party, elected or appointed official, candidate, or PAC.\nPortions of ADP’s business are subject to various laws and government regulations. At times, ADP works with lawmakers and government agencies regarding policy and legislation that may affect the manner in which we conduct some aspects of our business, including the areas of payroll services, human capital management services, benefits administration services, and professional employer organization services. You may not contact any government personnel on behalf of ADP regarding legislation, existing laws and regulations, and governmental actions, or engage in any other lobbying activities on behalf of ADP, without the prior approval of the ADP Legal Department. ADP associates engaged in such activities must comply with all applicable laws and regulations. If you have questions, the ADP Legal Department can assist you.\nT. Record Keeping and Financial Reporting\nADP requires honest and accurate recording and reporting of information in order to make responsible business decisions.\nAll of ADP’s books, records, accounts and financial statements must be maintained in reasonable detail, accurately and appropriately reflect transactions and comply with applicable legal and accounting requirements as well as ADP’s internal controls and procedures. You must be aware of and strictly follow additional guidelines addressed in ADP’s Anti-Bribery Policy.\nAs a public company, it is critical that ADP’s filings with the U.S. Securities and Exchange Commission and other regulators are timely, accurate, complete, fair and understandable and prepared in accordance with U.S. Generally Accepted Accounting Principles and other financial statement requirements. Depending on your position with ADP, you may be called upon to provide information to assure that ADP’s public reports and other public communications are accurate, complete, fair and understandable. ADP expects you to take this responsibility seriously.\nYou have a responsibility to understand the specific retention rules and practices that apply within your organization. The definition of “record” is very broad and different records have different retention periods. You should refer to the Global Records Information Management Policy for more detailed guidance in this area and check with your manager for all applicable retention rules and practices.\nIn no case may records involved in a pending or threatened litigation, government inquiry or under subpoena or other information request, be discarded or destroyed, regardless of the periods specified in the Global Records Information Management Policy. In addition, you may never destroy, alter, or conceal, with an improper purpose, any record or otherwise impede any official proceeding, either personally, in conjunction with, or by attempting to influence, another person.\nThis Code of Business Conduct & Ethics applies to all ADP associates and its Board of Directors. There can be no waiver of any part of the Code, except by a vote of the Board of Directors, which will ascertain whether a waiver is appropriate and ensure that the waiver is accompanied by appropriate controls designed to protect ADP.\nIn the event that any waiver is granted, the waiver will be posted on the ADP website, thereby allowing the ADP shareholders to evaluate the merits of the particular waiver.\nW. Reporting Ethical Violations and Seeking Guidance\nYour conduct can reinforce an ethical atmosphere and positively influence the conduct of fellow associates. If you have an ethics-related question or encounter a situation and are not sure what to do, you should reach out to ADP Global Ethics for guidance. If you are aware of or suspect misconduct, including a violation of any applicable law, you must report it to the appropriate level of management or ADP Global Ethics.\nYou may also contact your local Human Resources team, the Legal Department or the Audit Committee of the Board of Directors. Note that reports may be made anonymously where permitted by local law. However, without the ability to speak with you to obtain additional information, the ability to conduct a thorough investigation may be limited.\n- Contact the ADP Ethics Helpline by:\n| Direct phone: | 1-973-974-7377 (Accessible from all locations) |\n| Third-Party Helpline Provider, EthicsPoint, a NAVEX company: | |\n| Website: | www.adp.ethicspoint.com (for web reports) |\n| Toll-Free: | A list of toll-free numbers by country with the applicable country code can be found on the Associate Portal at https://myadp.adpcorp.com/ by following the links for Our Company / Policies & Guidelines / Ethics, Legal Compliance / Reporting Ethical Violations or on ADP’s website at https://www.adp.com/about-adp/corporate-social-responsibility/ethics/reporting-an-ethical-concern.aspx |\n| Email: | send an email to adp.ethics.helpline@adp.com |\n| Mail: | send a detailed note, with relevant documents, to ADP, Mail Stop #325E, One ADP Boulevard, Roseland, New Jersey 07068; or |\n- Contact the ADP local Human Resources team where you are based; or\n- Contact the ADP Legal Department by phone at 1-973-974-5865 and ask to speak to an attorney designated to handle ethics matters; or\n- Contact the Audit Committee of ADP’s Board of Directors by phone at 1-973-974-5770; sending a detailed note, with relevant documents, to ADP Board of Directors, Audit Committee, Mail Stop #405E, One ADP Boulevard, Roseland, New Jersey 07068; or sending an email to adp.audit.committee@adp.com.\nAny reports that involve the Chief Executive Officer or those reporting directly to the Chief Executive Officer of Automatic Data Processing, Inc. will be immediately communicated to the Chair of the Board of Directors and the Chair of the Audit Committee.\nAll reports to Global Ethics, including those made through the Ethics Helpline, go directly to the Global Ethics team at Corporate Headquarters, except as otherwise required by law. Global Ethics will determine the appropriate means to investigate and address the concern. You may be contacted by an investigator to obtain additional information and, upon completion of the investigation, when possible, you will be notified that the matter is closed and appropriate action was taken. Note that due to privacy concerns, you may not be told of the specific outcome of the concern you reported.\nYour reports, calls, detailed notes, emails and/or other messages will be dealt with confidentially, unless it is necessary to share such information in order to address the matter appropriately. Regardless, you have the commitment of ADP and of the Audit Committee of ADP’s Board of Directors that if you made a report in good faith you will be protected from retaliation. You should also know that ADP has taken necessary steps to (i) ensure that the personal data transferred to the United States is protected appropriately and as required, and (ii) comply with the Directive (EU) 2019/1937 (the European Union “Whistleblower” Directive), including related laws and regulations adopted by European Union member states. Nothing in this Code or any ADP policy or agreement prohibits you from providing information to the U.S. Securities and Exchange Commission or any government agency in a manner contemplated by relevant law or regulation.\nYou are ultimately the guardian of ADP’s ethics. While there are no universal rules, when in doubt, ask yourself:\n- Will my actions be ethical in every respect and fully comply with the law and with ADP policies?\n- Will my actions appear improper to others?\n- Will my actions make me feel uncomfortable?\n- How would I feel if I did nothing at all?\n- Will my actions be questioned by my supervisors, associates, clients, family and the general public?\n- Will my actions potentially damage ADP’s reputation?\n- Am I trying to fool anyone, including myself, as to the propriety of my actions?\nIf you are uncomfortable with your answer to any of the above, you should not take the contemplated actions without first discussing them with your local management. If you are still uncomfortable, please follow the steps outlined above in the Section on “Reporting Ethical Violations and Seeking Guidance.” All associates, and managers in particular, are responsible for creating an environment that both facilitates open discussion of issues and makes it easy and comfortable to raise concerns without a fear of reprisal.\nAny associate who ignores or violates any of ADP’s ethical standards, or who penalizes a subordinate for trying to follow those standards, or willfully or knowingly omits to tell the entire truth during any ethics or other ADP investigation, or obstructs, defeats or attempts to stop an ethics or other ADP investigation, will be subject to progressive discipline, up to and including immediate dismissal. However, it is not the threat of discipline that should govern your actions. We hope you share our belief that a dedicated commitment to ethical behavior is the right thing to do and the surest way for ADP to remain one of the world’s most ethical and highly successful companies.\nAutomatic Data Processing, Inc.\nOne ADP Boulevard\nRoseland, New Jersey 07068-1728\n1-973-974-5000\nSee Also\nADP Anti-Bribery Policy\nCode of Ethics for Principal Executive Officer and Senior Financial Officers\nInsider Trading Policy\nReporting an Ethical Concern\nPolitical Contributions Policy"
    },
    {
        "Ticker": "ADP",
        "Company": "Automatic Data Processing",
        "Source_URL": "http://www.adp.com/about-adp/leadership/maria-black.aspx",
        "Content_Type": "Website Content",
        "Raw_Text": "Maria Black\nPresident and CEO\nMaria Black is President and CEO of ADP, a leading global technology company providing human capital management (HCM) solutions. Appointed in 2023, Maria serves as ADP’s seventh CEO since its 1949 founding. With ADP’s extensive, unique data and trusted expertise – relied on by over one million clients – Maria is committed to providing employers with an empowered view into the future of work and the holistic, insights-driven support they need to enable the workforce of tomorrow.\nMaria’s vision is rooted in innovation and seeks to ensure employers and employees who use ADP’s products remain at the heart of each step forward. Through ADP’s unparalleled data, Maria sees a unique opportunity to create a more human-centric world of work by designing products and solutions that deliver data-driven insights and inspire opportunities for connection. Embracing the opportunity to raise the standards of excellence in the way businesses operate and care for their people, Maria is deeply committed to harnessing the power of ADP’s data to enable progress where innovation and humanity meet.\nThroughout her tenure at ADP, Maria has strived to provide businesses of all sizes – from small business to global enterprise – with the solutions and expertise that will help them achieve success. From joining ADP in 1996 as a sales associate, to leading critical growth initiatives throughout many areas of the business, and most recently working to simplify and modernize service delivery to clients in a comprehensive way, Maria’s experience across the entirety of ADP’s global portfolio has given her a unique lens into the world of work and the deep knowledge to help ADP clients navigate change.\nMaria shares her passion for progress through programs supporting women in leadership and veterans. She serves as chair and trustee of the ADP Foundation. She is also a member of the Business Council, Business Roundtable, the Wall Street Journal CEO Council, and the American Heart Association’s CEO Roundtable. She serves on the Board of Directors of Delta Air Lines. She holds a Bachelor of Arts degree in political science and international affairs from the University of Colorado, Boulder."
    },
    {
        "Ticker": "ADP",
        "Company": "Automatic Data Processing",
        "Source_URL": "http://www.adp.com/about-adp/leadership/jimmy-adams.aspx",
        "Content_Type": "Website Content",
        "Raw_Text": "Jimmy Adams\nPresident, National Account Services\nJimmy Adams is President of National Account Services at ADP. In this role, Jimmy leads a global team responsible for products and services that support upmarket and enterprise organizations in managing their people with innovative, AI-driven solutions and powerful insights.\nJoining ADP in 2006, Jimmy’s robust combination of product, technical and operational expertise has been instrumental in advancing ADP’s products and solutions. He has worked to understand client needs, accelerate solution design, and bring quality, innovative products to market to address the evolving business landscape.\nPrior to his current role, Jimmy served as Chief Product Development Officer, leading ADP’s product development teams around the globe, focused on developing and executing strategies to enhance ADP’s technology offerings to create the best experience for clients. Jimmy oversaw the global rollout of GenAI developer tools, driving continued product innovation.\nPreviously, Jimmy served as Senior Vice President of HCM Services and later as Senior Vice President of Product Development for National Account Services at ADP, where he created a tight collaboration between service and technology to enhance the client focus of ADP’s product design. Holding numerous senior leadership roles in product and service, Jimmy has spearheaded technical initiatives including ADP’s award-winning Next Gen payroll platform. He additionally led product development for ADP TotalSource, where he guided the R&D team in delivering industry-leading benefits and ACA modules as well as enhanced analytics tools.\nJimmy holds a Bachelor of Computer Science from the Georgia Institute of Technology."
    },
    {
        "Ticker": "ADP",
        "Company": "Automatic Data Processing",
        "Source_URL": "http://www.adp.com/about-adp/leadership/gus-blanchard.aspx",
        "Content_Type": "Website Content",
        "Raw_Text": "Gus Blanchard\nChief Marketing Officer\nGus Blanchard is Chief Marketing Officer for ADP. In this role, Gus leads ADP’s global marketing and communications organization, including the Growth Marketing, Brand to Demand and External Communications groups. Leveraging a deep background in sales and an intuition for clients’ needs, Gus delivers on the critical task of ensuring a cohesive, collective approach to Sales and Marketing to successfully attract and retain clients, expand market share, and strengthen the ADP brand.\nPreviously, Gus served as Senior Vice President (SVP) for Global Enterprise Sales (GES). Gus implemented multiple programs and initiatives that produced a high vitality salesforce distributing domestic and global HCM solutions in the enterprise market space.\nPrior to his role as SVP for GES, he served as SVP for ADP TotalSource Sales, overseeing over 800 sales associates that delivered consistently strong double-digit growth over five consecutive years. Earlier to this role he held a number of leadership positions including Division Vice President (DVP) of Major Accounts Sales – Southeast Division.\nGus is a founding Executive Sponsor of ADP’s Hispanic/LatinX Business Resource Group, Adelante. He is also a proud advocate and volunteer for Habitat for Humanity and the Girls and Boys Clubs of South Florida.\nGus earned a Bachelor of Science in Business Administration-Management with Honors, with an emphasis on marketing, organizational communication/development, and quantitative methods from the University of Florida."
    }
]