[
    {
        "Ticker": "AEP",
        "Company": "American Electric Power",
        "Source_URL": "https://www.aep.com",
        "Content_Type": "Website Content",
        "Raw_Text": "News Highlights\nNov. 13, 2025\nFeature\nTeams across American Electric Power (AEP) came together to honor the brave men and women who have served our country during our Veterans Day celebrations. From heartfelt conversations to moments of reflection, the day was filled with gratitude and respect for those who have sacrificed for our freedom.\nOct. 28, 2025\nFeature\nWe expect to invest $72 billion over the next five years to continue building a reliable grid that supports customers' energy needs.\nSite Selection for Your Business\nOur economic development team attracts investment in our service territory and helps businesses achieve their goals through site selection and energy expertise."
    },
    {
        "Ticker": "AEP",
        "Company": "American Electric Power",
        "Source_URL": "https://www.aep.com/news/",
        "Content_Type": "Website Content",
        "Raw_Text": "Our Stories\nNov. 13, 2025\nFeature\nTeams across American Electric Power (AEP) came together to honor the brave men and women who have served our country during our Veterans Day celebrations. From heartfelt conversations to moments of reflection, the day was filled with gratitude and respect for those who have sacrificed for our freedom.\nOct. 9, 2025\nFeature\nDon Chesler, AEP Ohio’s director of distribution operations, is living proof of hope, strength and resilience. He’s currently celebrating two years of being cancer-free, and while life has returned to a sense of normalcy, he cherishes every moment with loved ones.\nOct. 29, 2025\nNews Release\nFive-year, $72 billion capital plan supported by 28 GW of new load backed by customer agreements\nRobust capital plan enables new 7-9% long-term operating earnings growth rate through 2030\nRate base expected to increase at a 10% compounded annual growth rate to $128 billion by 2030\nThird-quarter 2025 GAAP earnings of $1.82 per share; operating earnings of $1.80 per share\nAEP expects full-year 2025 operating earnings in the upper half of its guidance range: $5.75 to $5.95 per share\nNews Releases\nNov. 5, 2025\nNews Release\nCooperation and Commitment Agreement to bolster 765 kV infrastructure development supporting unprecedented load growth\nDevelopment Services Agreement secures supply of critical equipment and materials needed for transmission grid enhancements\nAmerican Electric Power (Nasdaq: AEP) announces long-term strategic agreements with Quanta Services, Inc. (NYSE: PWR) designed to position AEP to execute on its announced $72 billion capital plan including delivery of high-voltage transmission, while enhancing supply chain resilience and expanding development capabilities to serve customers, including the rapidly growing data center market.\nOct. 29, 2025\nNews Release\nFive-year, $72 billion capital plan supported by 28 GW of new load backed by customer agreements\nRobust capital plan enables new 7-9% long-term operating earnings growth rate through 2030\nRate base expected to increase at a 10% compounded annual growth rate to $128 billion by 2030\nThird-quarter 2025 GAAP earnings of $1.82 per share; operating earnings of $1.80 per share\nAEP expects full-year 2025 operating earnings in the upper half of its guidance range: $5.75 to $5.95 per share\nEconomic Development\nFeb. 26, 2025\nFeature\nAluminum beverage can plant creates hundreds of jobs in Indiana on site where AEP and local partners spent a decade laying groundwork for success.\nOther News Topics\nRegional News\nFor location specific news, visit the following operating company websites."
    },
    {
        "Ticker": "AEP",
        "Company": "American Electric Power",
        "Source_URL": "https://www.aep.com/news/stories/",
        "Content_Type": "Website Content",
        "Raw_Text": "Search News Stories\nTeams across American Electric Power (AEP) came together to honor the brave men and women who have served our country during our Veterans Day celebrations. From heartfelt conversations to moments of reflection, the day was filled with gratitude and respect for those who have sacrificed for our freedom.\n- Cooperation and Commitment Agreement to bolster 765 kV infrastructure development supporting unprecedented load growth\n- Development Services Agreement secures supply of critical equipment and materials needed for transmission grid enhancements\nAmerican Electric Power (Nasdaq: AEP) announces long-term strategic agreements with Quanta Services, Inc. (NYSE: PWR) designed to position AEP to execute on its announced $72 billion capital plan including delivery of high-voltage transmission, while enhancing supply chain resilience and expanding development capabilities to serve customers, including the rapidly growing data center market.\n- Five-year, $72 billion capital plan supported by 28 GW of new load backed by customer agreements\n- Robust capital plan enables new 7-9% long-term operating earnings growth rate through 2030\n- Rate base expected to increase at a 10% compounded annual growth rate to $128 billion by 2030\n- Third-quarter 2025 GAAP earnings of $1.82 per share; operating earnings of $1.80 per share\n- AEP expects full-year 2025 operating earnings in the upper half of its guidance range: $5.75 to $5.95 per share\nThe Board of Directors of American Electric Power has declared a regular quarterly cash dividend of 95 cents per share on the company’s common stock, an increase of 2 cents per share.\nAEP Transmission, a subsidiary of American Electric Power has closed on a $1.6 billion loan guarantee at a preferred interest rate from the U.S. Department of Energy’s Loan Programs Office (LPO) to upgrade nearly 5,000 miles of transmission lines in Indiana, Michigan, Ohio, Oklahoma, and West Virginia while saving customers an estimated $275 million in financing costs over the life of the loan, benefits that customers will realize through lower costs in their bills.\nDon Chesler, AEP Ohio’s director of distribution operations, is living proof of hope, strength and resilience. He’s currently celebrating two years of being cancer-free, and while life has returned to a sense of normalcy, he cherishes every moment with loved ones.\nAmerican Electric Power has been named one of Forbes magazine’s America’s Best Employers for Tech Workers 2025.\nSince 1961, AEP has been at the forefront of innovation in power transmission, pioneering the development of Extra High Voltage 765 kilovolt transmission lines, the highest voltage level in North America.\nAre you a college student looking to supercharge your career in the energy sector? We are excited to grow our internship program, and applications are now open for our 2026 internship positions.\nAmerican Electric Power, on behalf of its subsidiary Public Service Company of Oklahoma, is seeking proposals from bidders to construct, operate and maintain a natural gas pipeline lateral and associated natural gas facilities to the Northeastern U5-U6 Natural Gas Project located in Oologah, Oklahoma.\nOn Sept. 5, AEP celebrates Power Plant Employee Appreciation Day, recognizing our many power plant employees who work tirelessly, day in and day out, to support generating electricity.\nAEP Service Corporation (AEPSC) today issued a request for proposal on behalf of one or more of AEPSC’s affiliated or associated companies for the supply of coal to one or more power plants.\nAmerican Electric Power, on behalf of its subsidiary Kentucky Power, is seeking proposals from bidders to construct, operate and maintain a natural gas pipeline lateral and associated natural gas facilities to the Big Sandy Natural Gas Project located in Louisa, Kentucky.\nThe Asian American Employee Partnership (AAEP) employee resource group participated in the 2025 Dragon Boat Race as a part of the annual Asian Festival in Columbus, Ohio. This tradition began in 2010 when a non-profit arts and culture organization recruited two paddling teams and organized the event, leading to the city’s first Dragon Boat Race. This year, the AAEP team finished in 5th place out of 20 teams.\nAEP Texas Kenedy Service Crew Leader, Ben Rosales, felt the ache in his heart after the Texas Hill County floods. In the hours after television and social media showed the world horrific scenes of devastation and missing campers in the communities of Ingram and Hunt, Texas, Rosales knew he needed to do something.\nAEP Energy Partners, a wholly owned subsidiary of American Electric Power company, seeks proposals for off-take from new and existing solar and wind facilities located in the PJM service region to support the company’s growing retail and wholesale loads in PJM including the Columbus, Ohio Electric Service Aggregation Program.\n- Second-quarter 2025 GAAP earnings of $2.29 per share; operating earnings of $1.43 per share.\n- AEP guides to the upper half of its 2025 operating earnings guidance range of $5.75 to $5.95 per share and reaffirms long-term growth rate of 6% to 8%.\n- AEP expects to announce a new, five-year capital plan of approximately $70 billion.\n- Customer agreements are secured for 24 gigawatts of new load by end of decade, up from 21 gigawatts.\n- Key legislative actions and regulatory approvals drove exceptional results for customers and stakeholders and provide clarity for the future.\nMy cancer journey began on a cold October morning before Halloween in 2022. After weeks of not sleeping well from the pain in my abdomen, I decided to go for testing.\nIndiana Michigan Power works with the Benton Harbor Youth Sports Association to remove barriers to participation because youth sports foster lifelong skills.\nThe Board of Directors of American Electric Power has declared a regular quarterly cash dividend of 93 cents per share on the company’s common stock.\nShowing results 1-25 of 2058"
    },
    {
        "Ticker": "AEP",
        "Company": "American Electric Power",
        "Source_URL": "https://www.aep.com/contact/media/",
        "Content_Type": "Website Content",
        "Raw_Text": "By clicking “Accept all”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts."
    },
    {
        "Ticker": "AEP",
        "Company": "American Electric Power",
        "Source_URL": "https://www.aep.com/email-alerts/",
        "Content_Type": "Website Content",
        "Raw_Text": "Get the most recent updates on what is happening at AEP.\nBy clicking “Accept all”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts."
    },
    {
        "Ticker": "AEP",
        "Company": "American Electric Power",
        "Source_URL": "https://www.aep.com/about/",
        "Content_Type": "Website Content",
        "Raw_Text": "Dedicated to Service\nAt AEP, we understand and appreciate the vital role we play in delivering power to people across the country every day. Our vision and core principles are not just words; they serve as the guideposts for our company as we strive to meet our customers' expectations.\nOur Mission\nPut the customer first\nOur Vision\nImproving customers' lives with reliable, affordable power\nOur Core Principles\nBuilding A Brighter Future\nWe're one of the largest electric companies in the country, powering millions of homes and businesses daily. Our customers depend on us to provide reliable energy, and we're committed to going above and beyond their expectations to create an energy future we can all be proud of. We're passionate about our customers and communities, and to doing everything in our power to develop innovative and clean energy solutions for a changing world.\nWe're committed to supporting economic development and making smart infrastructure investments that power our communities and improve lives by attracting high-quality jobs, encouraging capital investment, and stimulating local economies.\nBuild with AEP"
    },
    {
        "Ticker": "AEP",
        "Company": "American Electric Power",
        "Source_URL": "https://www.aep.com/about/our-commitment/",
        "Content_Type": "Website Content",
        "Raw_Text": "A History of Innovation\nSince 1906, AEP has taken great pride in serving our customers and communities. We've developed new ways to produce and deliver the safe, reliable and affordable energy that powers millions of homes and businesses. While the past century has brought changes and challenges, our focus on customers and spirit of innovation continue to guide how we serve our communities.\nBuilding a Bright Future Together\nTogether with our customers, we're developing forward-thinking solutions that power our communities. Our strategic vision for long-term growth focuses on providing a reliable and affordable diverse energy mix, modernizing the grid, generating customer and community-centric growth, driving financial and operational excellence and transforming our workforce.\nAs one of the nation's largest energy companies, we understand our important role in building the energy system of the future to benefit our customers and communities.\nOur Plans\nAEP is at the forefront of the energy industry's transformation. Some highlights of our strategy to make the electricity we provide even more reliable and affordable include:\n- Five-year, $72 billion capital forecast including $30 billion in transmission, $20 billion in generation and $17 billion in distribution investments to continue building the energy grid of the future\n- Adding more than 20,000 megawatts of diverse generation resources through 2034\n- Continuing to invest in a smarter, more modern power grid\n- Educating customers on how to optimize their energy efficiency\nWho We Are\nAt American Electric Power, we are redefining the future of energy, empowering the communities we serve and developing the workforce of the future.\n- A talented, dynamic workforce of 16,000 employees\n- Serving 5.6 million customers across 11 states\n- Operating the nation's largest transmission network with 40,000 line miles\n- Maintaining 225,000 distribution miles – one of the largest systems in the United States\n- Powering our communities with 29,000 megawatts of diverse generation\nEmpowering Our Communities\nWe strive to do more than keep the lights on for our customers. We're passionate about being involved in the communities where we live and work, and our employees make it all happen. From disaster relief to working with non-profits, our talented workforce is transforming the energy business for the better.\nDisaster Recovery in Corpus Christi\nWhen Mother Nature strikes, AEP Texas and its line crews know it's time to get to work, restoring power, protecting families and keeping our communities safe.\nWe Are Proud of Who We Are Today\nLearn more about AEP, our legacy of innovation, and the honors we've received for our performance, culture and commitment."
    },
    {
        "Ticker": "AEP",
        "Company": "American Electric Power",
        "Source_URL": "https://www.aep.com/about/leadership/",
        "Content_Type": "Website Content",
        "Raw_Text": "AEP's Board of Directors works closely with our leadership team to ensure we continually meet or exceed the highest standards of performance, innovation, ethics and service.\nBy clicking “Accept all”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts."
    },
    {
        "Ticker": "AEP",
        "Company": "American Electric Power",
        "Source_URL": "https://www.aep.com/about/facts/",
        "Content_Type": "Website Content",
        "Raw_Text": "AEP Facts\nAEP Facts at a Glance | |\n|---|---|\nAddress | |\nChairman of the Board of Directors, CEO & President | |\nService Territory | Approximately 200,000 square miles |\nStates Served | Arkansas, Indiana, Kentucky, Louisiana, Michigan, Ohio, Oklahoma, Tennessee, Texas, Virginia, West Virginia |\nU.S. Customers | 5.6 million |\n2024 U.S. Electricity Sales | Approximately 200 million KWh |\nAssets | $103 billion |\nEmployees | Approximately 16,000 |\nGenerating Capacity | 29 GW |\nMiles of Transmission Lines | Approximately 40,000 |\nMiles of Distribution Lines | Approximately 225,000 |\n2024 Operating Earnings | $2.98 billion |\n2024 Operating Earnings per Share | $5.62 |\n2024 Revenues | $19.7 billion |"
    },
    {
        "Ticker": "AEP",
        "Company": "American Electric Power",
        "Source_URL": "https://www.aep.com/about/aepwebsites/",
        "Content_Type": "Website Content",
        "Raw_Text": "AEP Websites\nCustomer Service Sites\nDepending on your service area, you can view your usage history, pay your bills online, and perform other tasks at one of the websites below.\nAEP National Customers\nNational account customers can manage their accounts online 24 hours a day, 365 days a year.\nRetail Electric Supply\nAEP Energy is a wholly owned subsidiary that provides competitive retail electricity and natural gas to more than half a million residential customers and businesses.\nHydro Projects\nClaytor Hydro\nThe Claytor Hydro Project, built in 1939, is in southwestern Virginia on the New River in Pulaski County. Operated by Appalachian Power, the project generates electricity, which merges with power generated at Appalachian Power's other hydro, gas and coal-fired power plants in Virginia and West Virginia, to help meet the electricity needs of millions of people in seven states from Virginia to Michigan.\nSmith Mountain Project\nSmith Mountain Project, operated by Appalachian Power, is a two-reservoir hydroelectric generation project located near Roanoke, Virginia. Built on the Roanoke River and completed in the mid-1960s, the project's two dams and reservoirs—Smith Mountain and Leesville—have added about 600 miles of new shoreline and about 25,000 surface acres of water for multiple uses.\nJoint Transmission Projects\nElectric Transmission Texas\nElectric Transmission Texas is a joint venture between AEP and MidAmerican Energy Holdings Company to build transmission projects within the Electric Reliability Council of Texas (ERCOT).\nGrid Assurance\nGrid Assurance is a joint venture between AEP, Berkshire Hathaway, and First Energy that offers cost-effective solutions for enhancing transmission system grid resilience and faster access to critical transmission equipment following a catastrophic event.\nPioneer Transmission\nPioneer Transmission is a joint venture between Duke Energy and American Electric Power to build and operate 240 miles of extra-high-voltage transmission lines and related facilities in Indiana.\nRITE Line Transmission\nReliability Interregional Transmission Extension is a joint venture that includes the subsidiaries of American Electric Power to build and operate approximately 420 miles of high-voltage transmission lines and related facilities in Indiana and Illinois.\nOther AEP Sites\nAEP Dolan Technology Center\nAEP's Dolan Technology Center is staffed by experts in instrumentation and test-formulation development and technical support. They offer expertise gained from a long history of supporting AEP's distribution, transmission and generation companies, along with insights on cutting-edge electrotechnology developments."
    },
    {
        "Ticker": "AEP",
        "Company": "American Electric Power",
        "Source_URL": "https://www.aep.com/news/stories/view/10534/",
        "Content_Type": "Website Content",
        "Raw_Text": "- Five-year, $72 billion capital plan supported by 28 GW of new load backed by customer agreements\n- Robust capital plan enables new 7-9% long-term operating earnings growth rate through 2030\n- Rate base expected to increase at a 10% compounded annual growth rate to $128 billion by 2030\n- Third-quarter 2025 GAAP earnings of $1.82 per share; operating earnings of $1.80 per share\n- AEP expects full-year 2025 operating earnings in the upper half of its guidance range: $5.75 to $5.95 per share\nCOLUMBUS, Ohio, October 29, 2025 – American Electric Power (Nasdaq: AEP) today reported third-quarter 2025 GAAP earnings of $972 million or $1.82 per share, compared with GAAP earnings of $960 million or $1.80 per share in third-quarter 2024. Operating earnings for third-quarter 2025 were $963 million or $1.80 per share, compared with operating earnings of $985 million or $1.85 per share in third-quarter 2024. See the detailed GAAP to operating earnings reconciliation at the end of this press release. AEP reaffirms its 2025 operating earnings guidance range of $5.75 to $5.95 per share and expects results to be in the upper half of the range.\nAEP today announced a new, increased long-term operating earnings growth rate of 7-9% over the next five years, bolstered by a $72 billion capital plan and supported by an expected 10% annual growth in rate base. During the first two years of the company’s plan, annual operating earnings growth is anticipated to be in the lower half of the range and at or above the high end of the range in 2028-2030. As infrastructure projects are put into service to meet customer demand, AEP expects operating earnings per share to increase at a 9% compounded annual growth rate over the five-year period. The rapidly accelerating load growth also supports AEP’s 2026 operating earnings guidance of $6.15 to $6.45 per share.\nInfrastructure for the Future\nAEP’s revised capital plan is based on customer commitments and the infrastructure needed to meet unprecedented power requirements, driven by large load customers including data centers and industrials. The confidence in the 28 gigawatts (GW) of load additions by 2030, up 4 GW since July 2025, is backed by Electric Service Agreements or Letters of Agreement and is supported by an additional 190 GW of load requests at various stages of development. The capital plan is one of the largest in the industry and is enabled by the company’s attractive service territory and the nation’s largest transmission system.\nAEP’s peak system demand is expected to surge to 65 GW by 2030, up from a current peak of 37 GW, highlighting the robust long-term growth that the company is experiencing across its service territory. To meet this opportunity, the company is investing $30 billion in transmission assets in the new capital plan. AEP’s pioneering transmission work, including developing the nation’s largest 765-kilovolt transmission network, has played a significant role in securing customers who need reliable delivery of large load power.\nAEP also plans to invest more than $20 billion in generation resources across the service territory in the next five years to meet the demands of customers in fast-growing regions. Nearly a quarter of the capital plan – $17 billion – is dedicated to AEP’s distribution network as the company builds on system enhancement programs.\n“As one of the largest utilities in the nation, we are using our scale to ensure we can deliver the power our customers need. We are utilizing our position as a leading transmission owner, our experience building distribution and our success in securing critical infrastructure for generation and additional high voltage equipment to meet the needs of our customers over the next five years,” said Bill Fehrman, AEP chairman, president and chief executive officer.\nEffectively Managing Growth\nMaintaining affordability has been a key priority. AEP is leading the way to implement new tariff structures across the states it serves that require customers with large power demands to make financial commitments based on their load forecasts. Operating companies have taken significant steps to ensure that costs of serving large load customers are allocated fairly and the right investments are made to support the long-term interests of all customers. Additionally, AEP is utilizing mechanisms like securitization, focusing on cost management, and allocating capital efficiently in support of continued growth.\n“Listening to our regulators, policymakers and customers has been critical to improving regulatory and legislative outcomes. I am encouraged by the progress we have made this year and look forward to working together as we develop solutions to meet the needs of our customers and the generational opportunities ahead of us,” Fehrman concluded.\nAmerican Electric Power\nPreliminary, unaudited results\n| Third Quarter Ended Sept. 30 | |||\n| 2024 | 2025 | Change | |\n| Revenue ($ Millions): | 5,420.1 | 6,010.4 | 590.3 |\n| Earnings ($ Millions): | |||\n| GAAP | 959.6 | 972.0 | 12.4 |\n| Operating (non-GAAP) | 985.4 | 962.9 | (22.5) |\n| EPS ($): | |||\n| GAAP | 1.80 | 1.82 | 0.02 |\n| Operating (non-GAAP) | 1.85 | 1.80 | (0.05) |\n| EPS based on 535 million shares 3Q 2025, 532 million shares 3Q 2024. |\n| Year-to-Date Ended September 30 | |||\n| 2024 | 2025 | Change | |\n| Revenue ($ Millions): | 15,025.0 | 16,560.7 | 1,535.7 |\n| Earnings ($ Millions): | |||\n| GAAP | 2,303.0 | 2,998.0 | 695.0 |\n| Operating (non-GAAP) | 2,317.8 | 2,551.9 | 234.1 |\n| EPS ($): | |||\n| GAAP | 4.35 | 5.61 | 1.26 |\n| Operating (non-GAAP) | 4.38 | 4.78 | 0.40 |\n| EPS based on 535 million shares 3Q 2025, 532 million shares 3Q 2024. |\nSummary of Results by Segment\n$ in millions\n| Third Quarter Ended Sept. 30 | |||\n| GAAP Earnings | 3Q 24 | 3Q 25 | Change |\n| Vertically Integrated Utilities (a) | 571.5 | 578.2 | 6.7 |\n| Transmission & Distribution Utilities (b) | 245.2 | 267.6 | 22.4 |\n| AEP Transmission Holdco (c) | 214.7 | 199.9 | (14.8) |\n| Generation & Marketing (d) | 93.3 | 44.3 | (49.0) |\n| All Other | (165.1) | (118.0) | 47.1 |\n| Total GAAP Earnings | 959.6 | 972.0 | 12.4 |\n| Operating Earnings (non-GAAP) | 3Q 24 | 3Q 25 | Change |\n| Vertically Integrated Utilities (a) | 572.4 | 573.5 | 1.1 |\n| Transmission & Distribution Utilities (b) | 245.2 | 259.1 | 13.9 |\n| AEP Transmission Holdco (c) | 214.7 | 199.9 | (14.8) |\n| Generation & Marketing (d) | 99.2 | 48.4 | (50.8) |\n| All Other | (146.1) | (118.0) | 28.1 |\n| Total Operating Earnings (non-GAAP) | 985.4 | 962.9 | (22.5) |\n|\nA full reconciliation of GAAP earnings with operating earnings is included in tables at the end of this news release. a. Includes AEP Generating Co., Appalachian Power, Indiana Michigan Power, Kentucky Power, Kingsport Power, Public Service Co. of Oklahoma, Southwestern Electric Power and Wheeling Powerb. Includes Ohio Power and AEP Texas c. Includes transmission-only subsidiaries and transmission-only joint ventures d. Includes marketing, risk management and retail activities in ERCOT, MISO, PJM and SPP, and competitive generation in PJM. |\n| Year-to-Date Ended September 30 | |||\n| GAAP Earnings | YTD 24 | YTD 25 | Change |\n| Vertically Integrated Utilities (a) | 1,198.0 | 1,335.0 | 137.0 |\n| Transmission & Distribution Utilities (b) | 542.3 | 656.1 | 113.8 |\n| AEP Transmission Holdco (c) | 624.1 | 1,012.9 | 388.8 |\n| Generation & Marketing (d) | 226.1 | 208.8 | (17.3) |\n| All Other | (287.5) | (214.8) | 72.7 |\n| Total GAAP Earnings | 2,303.0 | 2,998.0 | 695.0 |\n| Operating Earnings (non-GAAP) | YTD 24 | YTD 25 | Change |\n| Vertically Integrated Utilities (a) | 1,117.5 | 1,220.1 | 102.6 |\n| Transmission & Distribution Utilities (b) | 610.8 | 675.5 | 64.7 |\n| AEP Transmission Holdco (c) | 632.3 | 659.0 | 26.7 |\n| Generation & Marketing (d) | 225.6 | 216.4 | (9.2) |\n| All Other | (268.4) | (219.1) | 49.3 |\n| Total Operating Earnings (non-GAAP) | 2,317.8 | 2,551.9 | 234.1 |\n|\nA full reconciliation of GAAP earnings with operating earnings is included in tables at the end of this news release. a. Includes AEP Generating Co., Appalachian Power, Indiana Michigan Power, Kentucky Power, Kingsport Power, Public Service Co. of Oklahoma, Southwestern Electric Power and Wheeling Powerb. Includes Ohio Power and AEP Texas c. Includes transmission-only subsidiaries and transmission-only joint ventures d. Includes marketing, risk management and retail activities in ERCOT, MISO, PJM and SPP, and competitive generation in PJM. |\nEarnings Guidance\nAEP confirmed its 2025 operating earnings guidance range of $5.75 to $5.95 per share, guiding to the upper half of the range. Operating earnings could differ from GAAP earnings for matters such as impairments, divestitures, mark-to-market impacts or changes in accounting principles. AEP management is not able to forecast if any of these items will occur or any amounts that may be reported for future periods. Therefore, AEP is not able to provide a corresponding GAAP equivalent for 2025 earnings guidance.\nReflecting certain items recorded through the third quarter, the estimated earnings per share on a GAAP basis would be $6.58 to $6.78 per share. See the table below for a full reconciliation of 2025 earnings guidance.\n2025 EPS Guidance Reconciliation\n| Estimated EPS on a GAAP basis | $6.58 | to | $6.78 |\n| Mark-To-Market Impact of Commodity Hedging Activities | 0.01 | ||\n| Sale of AEP OnSite Partners | 0.02 | ||\n| Impact of Ohio Legislation | 0.04 | ||\n| FERC NOLC Order | (0.90) | ||\n| Operating EPS Guidance | $5.75 | to | $5.95 |\nWebcast\nAEP’s quarterly discussion with financial analysts and investors will be broadcast live over the internet at 9 a.m. Eastern today. The webcast will include audio of the discussion and visuals of charts and graphics referred to by AEP management. The charts and graphics will be available for download.\nAEP’s earnings are prepared in accordance with accounting principles generally accepted in the United States and represent the company’s earnings as reported to the Securities and Exchange Commission. The company’s operating earnings, a non-GAAP measure representing GAAP earnings excluding certain items as described in the news release and charts, provide another representation for investors to evaluate the performance of the company’s ongoing business activities. AEP uses operating earnings as the primary performance measurement when communicating with analysts and investors regarding its earnings outlook and results. The company uses operating earnings data internally to measure performance against budget, to report to AEP’s Board of Directors and also as an input in determining performance-based compensation under the company’s employee incentive compensation plans. A full reconciliation of GAAP earnings to operating earnings for the quarter and year to date is included in the tables at the end of this news release.\nAbout AEP\nAmerican Electric Power (Nasdaq: AEP) is committed to improving our customers' lives with reliable, affordable power. We expect to invest $72 billion from 2026 through 2030 to enhance service for customers and support the growing energy needs of our communities. Our nearly 17,000 employees operate and maintain the nation's largest electric transmission system with 40,000 line miles, along with more than 252,000 miles of distribution lines to deliver energy to 5.6 million customers in 11 states. AEP also is one of the nation's largest electricity producers with approximately 30,000 megawatts of diverse owned and contracted generating capacity. We are focused on safety and operational excellence, creating value for our stakeholders and bringing opportunity to our service territory through economic development and community engagement. Our family of companies includes AEP Ohio, AEP Texas, Appalachian Power (in Virginia, West Virginia and Tennessee), Indiana Michigan Power, Kentucky Power, Public Service Company of Oklahoma, and Southwestern Electric Power Company (in Arkansas, Louisiana, east Texas and the Texas Panhandle). AEP also owns AEP Energy, which provides innovative competitive energy solutions nationwide. AEP is headquartered in Columbus, Ohio. For more information, visit aep.com.\nWebsite Disclosure\nAEP may use its website as a distribution channel for material company information. Financial and other important information regarding AEP is routinely posted on and accessible through AEP’s website. In addition, you may automatically receive email alerts and other information about AEP when you enroll your email address by visiting the “Email Alerts” section of our website.\nThis report made by the Registrants contains forward-looking statements, and for the Registrants other than Parent, this report contains forward looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934. Many forward-looking statements appear in “Part I – Item 2 Management’s Discussion and Analysis of Financial Condition and Results of Operations” of this quarterly report, but there are others throughout this document which may be identified by words such as “expect,” “anticipate,” “intend,” “plan,” “believe,” “will,” “should,” “could,” “would,” “project,” “continue” and similar expressions, and include statements reflecting future results or guidance and statements of outlook. These matters are subject to risks and uncertainties that could cause actual results to differ materially from those projected. Forward-looking statements in this document are presented as of the date of this document. Except to the extent required by applicable law, management undertakes no obligation to update or revise any forward-looking statement. Among the factors that could cause actual results to differ materially from those in the forward-looking statements are: changes in economic conditions, electric market demand and demographic patterns in AEP service territories; the economic impact of increased global conflicts and trade tensions, and the adoption or expansion of economic sanctions, tariffs, trade restrictions or changes in trade policy; inflationary or deflationary interest rate trends; new legislation adopted in the states in which we operate that alters the regulatory framework or that prevents the timely recovery of costs and investments; volatility and disruptions in financial markets precipitated by any cause, including fiscal and monetary policy or instability in the banking industry; particularly developments affecting the availability or cost of capital to finance new capital projects and refinance existing debt; the availability and cost of funds to finance working capital and capital needs, particularly (a) if expected sources of capital such as proceeds from the sale of tax credits and anticipated securitizations do not materialize or do not materialize at the level anticipated, and (b) during periods when the time lag between incurring costs and recovery is long and the costs are material; changing demand for electricity, including large load contractual commitments for interconnection; the risks and uncertainties associated with wildfires, including damages caused by wildfires, the extent of each Registrant’s liability in connection with wildfires, investigations and outcomes associated with legal proceedings, demands or similar actions, inability to recover wildfire costs through insurance or through rates and the impact on financial condition and the reputation of each Registrant; the impact of extreme weather conditions, natural disasters and catastrophic events such as storms, hurricanes, wildfires and drought conditions that pose significant risks including potential litigation and the inability to recover significant damages and restoration costs incurred; limitations or restrictions on the amounts and types of insurance available to cover losses that might arise in connection with natural disasters, wildfires or operations; the cost of fuel and its transportation, the creditworthiness and performance of parties who supply and transport fuel and the cost of storing and disposing of used fuel, including coal ash and spent nuclear fuel; the availability of fuel and necessary generation capacity and the performance of generation plants; the ability to recover fuel and other energy costs through regulated or competitive electric rates; the ability to build or acquire generation (including from renewable sources), transmission lines and facilities (including the ability to obtain any necessary regulatory approvals and permits) to meet the demand for electricity at acceptable prices and terms, including favorable tax treatment, cost caps imposed by regulators and other operational commitments to regulatory commissions and customers for generation projects, to recover all related costs and to earn a reasonable rate of return; the disruption of AEP’s business operations due to impacts of economic or market conditions, costs of compliance with potential government regulations, electricity usage, supply chain issues, customers, service providers, vendors and suppliers caused by pandemics, natural disasters or other events; construction and development risks associated with the completion of the 2026-2030 capital investment plan, including shortages or delays in labor, materials, equipment or parts; prolonged or recurring U.S. federal government shutdowns could adversely affect our operations, regulatory approvals, and financial performance and could cause volatility in the capital markets which may interrupt our access to capital; new legislation, litigation or government regulation, including changes to tax laws and regulations, oversight of nuclear generation, energy commodity trading and new or modified requirements related to emissions of sulfur, nitrogen, mercury, carbon, soot or PM and other substances that could impact the continued operation, cost recovery and/or profitability of generation plants and related assets; the impact of tax legislation or associated Department of Treasury guidance, including potential changes to existing tax incentives, on capital plans, results of operations, financial condition, cash flows or credit ratings; the risks before, during and after generation of electricity associated with the fuels used or the by-products and wastes of such fuels, including coal ash and spent nuclear fuel; timing and resolution of pending and future rate cases, negotiations and other regulatory decisions, including rate or other recovery of new investments in generation, distribution and transmission service and environmental compliance; resolution of litigation or regulatory proceedings or investigations; the ability to efficiently manage and recover operation, maintenance and development project costs; prices and demand for power generated and sold at wholesale; changes in technology, particularly with respect to energy storage and new, developing, alternative or distributed sources of generation; the ability to recover through rates any remaining unrecovered investment in generation units that may be retired before the end of their previously projected useful lives; volatility and changes in markets for coal and other energy-related commodities, particularly changes in the price of natural gas; the impact of changing expectations and demands of customers, regulators, investors and stakeholders, including development, adoption, and use of artificial intelligence by us, our customers and our third party vendors and evolving expectations related to environmental, social and governance concerns; changes in utility regulation and the allocation of costs within RTOs including ERCOT, PJM and SPP; changes in the creditworthiness of the counterparties with contractual arrangements, including participants in the energy trading market; actions of rating agencies, including changes in the ratings of debt; the impact of volatility in the capital markets on the value of the investments held by the pension, OPEB and nuclear decommissioning trust funds and a captive insurance entity and the impact of such volatility on future funding requirements; accounting standards periodically issued by accounting standard-setting bodies; other risks and unforeseen events, including wars and military conflicts, the effects of terrorism (including increased security costs), embargoes, cybersecurity threats, labor strikes impacting material supply chains, global information technology disruptions and other catastrophic events; or the ability to attract and retain the requisite work force and key personnel.\nMedia Contact:\nScott Blake\nDirector, Media Relations\n614/716-1938\nAnalysts Contact:\nDarcy Reese\nVice President, Investor Relations\n614/716-2614"
    },
    {
        "Ticker": "AEP",
        "Company": "American Electric Power",
        "Source_URL": "https://www.aep.com/news/stories/view/10569/",
        "Content_Type": "Website Content",
        "Raw_Text": "Teams across American Electric Power came together to honor the brave men and women who have served our country during our Veterans Day celebrations. From heartfelt conversations to moments of reflection, the day was filled with gratitude and respect for those who have sacrificed for our freedom.\nAs Jacob Pyle, Senior Project Manager, shared, \"Veterans Day serves as a powerful reminder of the sacrifices made by those who have served our country. Since leaving the Army in 2022, I have become passionate about advocating for veterans in the corporate workspace, ensuring that their unique experiences and skills are recognized and valued. I proud to work at AEP — a company that actively honors and supports veterans through these events\".\nTake a look at some of the highlights from this meaningful day."
    },
    {
        "Ticker": "AEP",
        "Company": "American Electric Power",
        "Source_URL": "https://www.aep.com/news/stories/view/10531/",
        "Content_Type": "Website Content",
        "Raw_Text": "COLUMBUS, Ohio, Oct. 28, 2025 – For the second consecutive year, American Electric Power (Nasdaq: AEP) has been named one of Forbes magazine’s Best Employers for Engineers. AEP is ranked as one of the top employers for engineers in the utilities sector.\n“We are committed to providing an innovative environment for our engineers, who design, construct, and maintain the systems that keep electricity flowing for millions of customers,” said Bill Fehrman, AEP chairman, president and chief executive officer. “The work our engineers do is both challenging and rewarding, ensuring our communities receive safe and affordable service. As we build the energy system of the future to meet historic energy demand, we are grateful for our engineers’ dedication and creativity.”\nForbes partnered with Statista to survey more than 28,000 members of America’s engineering workforce, each employed by companies with at least 1,000 employees across all industry sectors. Respondents were asked how likely they were to recommend their current employer, previous employers, and other companies known through peers. Workplace flexibility, professional development opportunities and benefits were among the criteria evaluated to determine the top 175 companies recognized on the list.\nAbout AEP\nOur team at American Electric Power (Nasdaq: AEP) is committed to improving our customers' lives with reliable, affordable power. We are investing $54 billion from 2025 through 2029 to enhance service for customers and support the growing energy needs of our communities. Our nearly 17,000 employees operate and maintain the nation's largest electric transmission system with 40,000 line miles, along with more than 225,000 miles of distribution lines to deliver energy to 5.6 million customers in 11 states. AEP also is one of the nation's largest electricity producers with approximately 30,000 megawatts of diverse generating capacity. We are focused on safety and operational excellence, creating value for our stakeholders and bringing opportunity to our service territory through economic development and community engagement. Our family of companies includes AEP Ohio, AEP Texas, Appalachian Power (in Virginia, West Virginia and Tennessee), Indiana Michigan Power, Kentucky Power, Public Service Company of Oklahoma, and Southwestern Electric Power Company (in Arkansas, Louisiana, east Texas and the Texas Panhandle). AEP also owns AEP Energy, a competitive retail energy supplier. AEP is headquartered in Columbus, Ohio. For more information, visit aep.com."
    },
    {
        "Ticker": "AEP",
        "Company": "American Electric Power",
        "Source_URL": "https://www.aep.com/news/stories/view/10501/",
        "Content_Type": "Website Content",
        "Raw_Text": "Columbus, OH, October 16, 2025 – AEP Transmission, a subsidiary of American Electric Power (Nasdaq: AEP) has closed on a $1.6 billion loan guarantee at a preferred interest rate from the U.S. Department of Energy’s Loan Programs Office (LPO) to upgrade nearly 5,000 miles of transmission lines in Indiana, Michigan, Ohio, Oklahoma, and West Virginia while saving customers an estimated $275 million in financing costs over the life of the loan, benefits that customers will realize through lower costs in their bills.\nThe upgrades supported by this financing will replace existing transmission lines in existing rights-of-way with new lines capable of carrying more energy. The upgrades will provide enhanced reliability for customers and facilitate new economic growth opportunities by bringing additional power capacity to the communities AEP serves. AEP estimates that 1,100 construction jobs will be created through these projects.\nEnergy demand is increasing across AEP’s footprint. Customers have committed to business expansions or additions that will require an additional 24 gigawatts of electricity demand by the end of the decade. The upgrades have primarily been identified to support data center, artificial intelligence and manufacturing development and represent generational load growth on the electric system. Seeking federal funding opportunities and implementing rate structures that ensure new large customers are supporting infrastructure investment are some of the ways AEP is working to reduce rate impacts for customers.\n“AEP is experiencing growth in energy demand that has not been seen in a generation. As the first company to close a new loan with the Trump Administration under this program, we are excited to get to work on these projects to improve the service we provide to our customers,” said Bill Fehrman, AEP chairman, president and chief executive officer. “This loan saves our customers money and improves reliability while supporting economic growth in our states. The funds we will save through this program enable us to make additional investments to enhance service for our customers.”\n|\nState Transmission |\nTotal Projects |\nLine Miles Replaced |\nCustomers Served |\n|\nOhio Transco |\n76 |\n2,122 |\n1.5M |\n|\nI&M Transco |\n29 |\n1,410 |\n600,000 |\n|\nOklahoma Transco |\n17 |\n1,434 |\n1.2M |\n|\nWest Virginia Transco |\n4 |\n26 |\n460,000 |\nAEP will work with local communities and landowners in siting these critical transmission lines that will power important technology advancements and facilitate economic development for the states and communities AEP serves.\nApproximately 100 miles of transmission lines across Ohio and Oklahoma are the first projects to be supported by the loan guarantee. Additional funding and projects will follow.\nAbout AEP\nOur team at American Electric Power (Nasdaq: AEP) is committed to improving our customers' lives with reliable, affordable power. We are investing $54 billion from 2025 through 2029 to enhance service for customers and support the growing energy needs of our communities. Our nearly 17,000 employees operate and maintain the nation's largest electric transmission system with 40,000 line miles, along with more than 225,000 miles of distribution lines to deliver energy to 5.6 million customers in 11 states. AEP also is one of the nation's largest electricity producers with approximately 30,000 megawatts of diverse generating capacity. We are focused on safety and operational excellence, creating value for our stakeholders and bringing opportunity to our service territory through economic development and community engagement. Our family of companies includes AEP Ohio, AEP Texas, Appalachian Power (in Virginia, West Virginia and Tennessee), Indiana Michigan Power, Kentucky Power, Public Service Company of Oklahoma, and Southwestern Electric Power Company (in Arkansas, Louisiana, east Texas and the Texas Panhandle). AEP also owns AEP Energy, a competitive retail energy supplier. AEP is headquartered in Columbus, Ohio. For more information, visit aep.com."
    },
    {
        "Ticker": "AEP",
        "Company": "American Electric Power",
        "Source_URL": "https://www.aep.com/news/stories/view/10491/",
        "Content_Type": "Website Content",
        "Raw_Text": "Don Chesler, AEP Ohio’s director of distribution operations, is living proof of hope, strength and resilience. He’s currently celebrating two years of being cancer-free, and while life has returned to a sense of normalcy, he cherishes every moment with loved ones.\nThe Beginning of Life or Death\nNearly three years ago, in October 2022, Chesler developed a cough that wouldn’t go away.\n“I thought I had a cold or the flu, but when a lymph node on my neck started to protrude, I went to urgent care,” Chesler said. “Some time passed, and just two weeks before Thanksgiving, I found myself at the OSU Wexner emergency room. Doctors treated me, pulling two liters of fluid from my left lung.”\nThat’s when he received the devastating diagnosis.\n“The doctors told me, ‘We’re running tests to rule out an infectious cause, but the probability is high you have cancer.’ Those words slammed into me like a rogue wave, drowning out hope for the future. It was 2 a.m., two Tuesdays before Thanksgiving and just after my 35th birthday,” continued the devoted husband and father to his beautiful daughter, Madelyn, who was just three years old at the time.\nFurther testing confirmed he had stage two cancer. “A biopsy proved conclusive: Primary Mediastinal Diffuse Large B Cell Lymphoma. Just two days later, I started treatment that would ultimately save my life,” Chesler said.\nOvercoming Cancer\nThroughout his battle, Chesler tried to keep life as normal as possible. He continued his work as a distribution management systems supervisor supporting smart grid projects for AEP Ohio and other operating companies while undergoing chemotherapy.\n“I would take two days off after each chemo treatment because the computer screens made me so nauseous, but I didn’t want to miss too many days at the office. Coming to work became my outlet. It helped me forget I was battling cancer,” Chesler recalled.\nChesler emphasized the importance of the encouragement he received from his colleagues.\n“Everyone at AEP and AEP Ohio was so incredibly helpful, and they became a crucial part of my support system. I leaned into what I could do for the team, and it allowed me focus on the future. I connected with other employees facing similar battles, and I tried to help them in any way I could.”\n“An organization called the Leukemia Lymphoma Society, or LLS, was there to help me and my family. They provided the support needed to navigate through those uncertain times,” Chesler said.\nEven though Chesler endured six rounds of chemotherapy, he said that one of the hardest things he had to do through all of it was being a dad.\nThrough it all, Chesler pushed through the chemo, striving to be the best father and husband he could be.\nToday, he’s cancer-free.\n“I’ve been cancer-free for two years now. I remain grateful for the perspective I gained from my fight, but the fight isn’t over. We must continue to fund research and support for those still battling and their loved ones,” Chesler said.\nLiving Life to the Fullest\nChesler is back to enjoying activities he loved doing before the diagnosis, like camping, golfing and cherishing every breath of life.\nIn August, Chesler joined hundreds of Pelotonia riders cycling across Central Ohio to raise money for cancer research at The James, with a mission to end cancer.\nChesler remains committed to making the most of his second chance at life. This year, he is participating in AEP’s Light the Night Walk to raise awareness about the Leukemia Lymphoma Society (LLS). He hopes his story inspires others to reach out for help and reminds them that they don’t have to fight cancer alone."
    },
    {
        "Ticker": "AEP",
        "Company": "American Electric Power",
        "Source_URL": "https://www.aep.com/about/businesses/opcos/",
        "Content_Type": "Website Content",
        "Raw_Text": "Operating Companies\nOur Regulated Companies\nWe serve nearly 5.6 million customers in our regulated service territory, spanning more than 200,000 square miles in 11 states. Maintaining the nation's largest electricity transmission system and more than 225,000 miles of distribution lines, we deliver safe, reliable power to customers in Arkansas, Indiana, Kentucky, Louisiana, Michigan, Ohio, Oklahoma, Tennessee, Texas, Virginia and West Virginia."
    },
    {
        "Ticker": "AEP",
        "Company": "American Electric Power",
        "Source_URL": "https://www.aep.com/about/businesses/aepenergypartners/",
        "Content_Type": "Website Content",
        "Raw_Text": "AEP Energy Partners\nWholesale Energy Suppliers\nAEP Energy Partners (AEPEP) understands that each municipality, cooperative and utility customer has different power supply needs and risk profiles. As one of the largest wholesale suppliers in the country, AEPEP specializes in offering customized wholesale power supply products to customers based on their specific needs. AEPEP's energy experts carefully balance the forces of price and risk to create the right power supply product at a competitive price.\nOur Services\n- Customized Solutions\nAs a supplier within ERCOT, MISO, PJM and SPP, AEPEP works closely with customers to create a power supply plan based on their unique energy needs. - Wholesale Options\nAEPEP offers a full suite of wholesale supply products including full requirements, partial requirements, fixed load shapes, blocks and virtual generation portfolios. - Renewables\nAEPEP offers energy solutions such as solar, wind and energy storage to help customers more efficiently and reliably meet both their renewable energy goals and obligations, as well as energy needs without upfront costs. - Reliability\nIn today's ever-changing market it is important to have a strong, creditworthy counterparty that will be there for the life of the partnership. AEPEP has a long history of service with clients and offers a very strong credit rating through its parent company, AEP."
    },
    {
        "Ticker": "AEP",
        "Company": "American Electric Power",
        "Source_URL": "https://www.aep.com/news/stories/view/10555/",
        "Content_Type": "Website Content",
        "Raw_Text": "Columbus, Ohio, November 5, 2025 — American Electric Power (Nasdaq: AEP) today announced long-term strategic agreements with Quanta Services, Inc. (NYSE: PWR) designed to position AEP to execute on its announced $72 billion capital plan including delivery of high-voltage transmission, while enhancing supply chain resilience and expanding development capabilities to serve customers, including the rapidly growing data center market.\nThe collaboration includes a Cooperation and Commitment Agreement for transmission projects, and a Development Services Agreement for large transformer and breaker manufacturing. Together, these efforts position AEP and Quanta to deliver greater efficiency, constructability and certainty in meeting the energy needs of customers today and in the future.\nUnder the Cooperation and Commitment Agreement, AEP and Quanta will collaborate on the design, engineering, procurement and construction of 765 kV and other high-voltage transmission facilities. The partnership agreement combines AEP’s deep operational and development expertise, gained by being the first and the largest 765 kV operator in the United States, with Quanta’s proven track record of large-scale project execution as the most experienced 765 kV constructor in the United States, improving cost predictability, enhancing delivery certainty and providing a proven operational structure. AEP and Quanta will leverage the strength of this partnership to bring the benefits of 765 kV transmission to AEP's traditional operating footprint as well as surrounding markets.\nIn addition, AEP and Quanta have executed a Development Services Agreement to expand domestic manufacturing capacity for extra-high-voltage transformers and circuit breakers. This initiative represents a significant investment in power equipment manufacturing in the United States and will strengthen the domestic supply chain and ensure reliable access to critical grid components.\n“These agreements represent a new level of collaboration between AEP and Quanta that positions the companies to deliver solutions to customers to meet their electric needs with greater speed, greater schedule certainty and at improved costs,” said Bill Fehrman, AEP chairman, president and chief executive officer. “By aligning with Quanta early on supply chain, constructability and operations we are creating a new model that strengthens execution, reduces risk and provides certainty around the development of projects for our customers and stakeholders.”\n“This is a partnership built on execution and innovation,” said Duke Austin, president and chief executive officer of Quanta Services. “Together, AEP and Quanta bring unmatched expertise in power delivery and large-scale infrastructure development, ensuring we can provide solutions to meet the growing demand for reliable, efficient and resilient power. By combining our strong track record of safe, skilled workforce execution with AEP’s commitment to system reliability, we’re delivering the labor certainty and capacity needed to serve existing electric customers and power the rapidly expanding digital economy.”\nThe long-term collaboration will support AEP’s regulated and competitive transmission companies, including Transource Energy, LLC, while positioning both AEP and Quanta to deliver integrated solutions for the evolving grid and hyperscale market.\n###\nABOUT AEP\nAmerican Electric Power (Nasdaq: AEP) is committed to improving our customers' lives with reliable, affordable power. We expect to invest $72 billion from 2026 through 2030 to enhance service for customers and support the growing energy needs of our communities. Our nearly 17,000 employees operate and maintain the nation's largest electric transmission system with 40,000 line miles, along with more than 252,000 miles of distribution lines to deliver energy to 5.6 million customers in 11 states. AEP also is one of the nation's largest electricity producers with approximately 30,000 megawatts of diverse owned and contracted generating capacity. We are focused on safety and operational excellence, creating value for our stakeholders and bringing opportunity to our service territory through economic development and community engagement. Our family of companies includes AEP Ohio, AEP Texas, Appalachian Power (in Virginia, West Virginia and Tennessee), Indiana Michigan Power, Kentucky Power, Public Service Company of Oklahoma, and Southwestern Electric Power Company (in Arkansas, Louisiana, east Texas and the Texas Panhandle). AEP also owns AEP Energy, which provides innovative competitive energy solutions nationwide. AEP is headquartered in Columbus, Ohio. For more information, visit aep.com.\nABOUT QUANTA SERVICES\nQuanta Services is an industry leader in providing specialized infrastructure solutions to the utility, renewable energy, technology, communications, pipeline and energy industries. Quanta's comprehensive services include designing, installing, repairing and maintaining energy and communications infrastructure. With operations throughout the United States, Canada, Australia and select other international markets, Quanta has the manpower, resources and expertise to safely complete projects that are local, regional, national or international in scope. For more information, visit www.quantaservices.com.\nANALYSTS CONTACT:\nDarcy Reese\nVice President, Investor Relations\n614/716-2614\nMEDIA CONTACT:\nScott Blake\nDirector, Media Relations\n614/716-1938"
    },
    {
        "Ticker": "AEP",
        "Company": "American Electric Power",
        "Source_URL": "https://www.aep.com/news/stories/view/10521/",
        "Content_Type": "Website Content",
        "Raw_Text": "COLUMBUS, Ohio, Oct. 22, 2025 – The Board of Directors of American Electric Power (Nasdaq: AEP) has declared a regular quarterly cash dividend of 95 cents per share on the company’s common stock, an increase of 2 cents per share.\nThe dividend is payable Dec. 10, 2025, to shareholders of record as of Nov. 10, 2025, and is the company’s 462nd consecutive quarterly common stock cash dividend. AEP has paid a cash dividend on its common stock every quarter since July 1910.\n“AEP is proud to have delivered a consistent quarterly dividend to our shareholders for 115 years,” said Bill Fehrman, AEP chairman, president and chief executive officer. “We remain focused on providing reliable and affordable service for our customers, investing to meet their growing energy needs and creating value for all of our stakeholders.”\nAbout AEP\nOur team at American Electric Power (Nasdaq: AEP) is committed to improving our customers' lives with reliable, affordable power. We are investing $54 billion from 2025 through 2029 to enhance service for customers and support the growing energy needs of our communities. Our nearly 17,000 employees operate and maintain the nation's largest electric transmission system with 40,000 line miles, along with more than 225,000 miles of distribution lines to deliver energy to 5.6 million customers in 11 states. AEP also is one of the nation's largest electricity producers with approximately 30,000 megawatts of diverse generating capacity. We are focused on safety and operational excellence, creating value for our stakeholders and bringing opportunity to our service territory through economic development and community engagement. Our family of companies includes AEP Ohio, AEP Texas, Appalachian Power (in Virginia, West Virginia and Tennessee), Indiana Michigan Power, Kentucky Power, Public Service Company of Oklahoma, and Southwestern Electric Power Company (in Arkansas, Louisiana, east Texas and the Texas Panhandle). AEP also owns AEP Energy, a competitive retail energy supplier. AEP is headquartered in Columbus, Ohio. For more information, visit aep.com.\nWebsite Disclosure\nAEP may use its website as a distribution channel for material company information. Financial and other important information regarding AEP is routinely posted on and accessible through AEP’s website at https://www.aep.com/investors/. In addition, you may automatically receive email alerts and other information about AEP when you enroll your email address by visiting the “Email Alerts” section at https://www.aep.com/investors/."
    },
    {
        "Ticker": "AEP",
        "Company": "American Electric Power",
        "Source_URL": "https://www.aep.com/news/stories/view/10465/",
        "Content_Type": "Website Content",
        "Raw_Text": "As a native of the area, Heather Vanater can do little to hide her joy at seeing Nucor’s massive investment in Mason County take shape.\nAnd knowing that her company played a leading role in bringing a monumental transformation to an area of West Virginia replete with economic challenges.\n“We have been part of something that has changed the lives of families,” said Vanater, Appalachian Power’s Economic & Business Development manager, with a level of emotion that conveys her ties to this community. “How much better does it get?!”\nThose in Apple Grove, West Virginia, and the surrounding communities are finding out every day just how much better it’s getting as Nucor draws closer to beginning operation at its massive sheet mill. This operation will employ 800 people directly and bring a secondary economic impact unlike any other in the region.\nNucor’s $4 billion sheet mill operation under construction in Apple Grove (adjacent to the Ohio River, 15 miles south of Point Pleasant) is the single largest capital investment in West Virginia history, and the flurry of construction activity reflects that. The mill just marked the halfway point of construction.\nFrom attracting the company to the site through developing solutions, AEP and Appalachian Power personnel have walked alongside Nucor, which will be Appalachian Power’s biggest customer.\nNucor acquired the roughly 2,000 acres from AEP thanks to site readiness programs. Nearby, AEP is building a new substation to provide 345-kV service.\n“Being able to land a project of this caliber is such a milestone and benchmark not only for us, but also for the state,” Vanater said.\nAppalachian Power President Aaron Walker added, “This is home. APCo is home. We understand the population. We understand the residents. We understand how to make things happen and get things done here.”\nIn the community, Nucor has set off a domino effect, benefitting countless families.\n“Nucor is transforming our state and our community,” said Morganne Tenney, executive director, Putnam County Development Authority. “It is a generational impact.”\n“We’re talking about a lifetime of jobs for generations, and with the investments in small businesses to come, the school districts, and more…it’s an incredible impact. I know 30-40 years from now, that facility will still be there, and we had a part in making that happen. We had a part in really turning around that community.”\nWhen operational in 2027, the Apple Grove operation will produce 3 million tons of steel products annually for auto manufacturing, construction and other industries. The Mason County site is strategically located to efficiently serve customers in the Midwest and Northeast, the two largest sheet-consuming regions in the U.S."
    },
    {
        "Ticker": "AEP",
        "Company": "American Electric Power",
        "Source_URL": "https://www.aep.com/news/stories/view/10045/",
        "Content_Type": "Website Content",
        "Raw_Text": "The collaborative effort that brought a state-of-the-art manufacturing plant and more than 300 new jobs to Muncie, Indiana, illustrates the power of patience.\n“The CANPACK plant showed us that the long game works,” said Traci Lutton, vice president of Muncie-Delaware County Economic Development Alliance. “This was a project more than 10 years in the making. What we have now would not be possible in Muncie without the long-term support of Indiana Michigan Power and the AEP family.”\nSituated on 139 acres, the 862,000-square-foot beverage can manufacturing facility is the result of a $380 million investment. The plant began producing beverage cans in 2023.\nIt’s CANPACK’s second U.S. operation. In 2020, it opened a similar plant in Olyphant, Pennsylvania. Both support major consumer brands in virtually all beverage categories.\n“This plant allows us to expand the company’s business more strategically in the Midwest, locating closer to our customers’ filler operations,” said CANPACK Muncie Plant Manager Josh Ballard, who noted his facility’s flexibility, product line breadth, and ability to accommodate a production line expansion form a significant advantage. “We think this operation gives us a strong competitive edge in the market.”\nFor years, AEP’s economic development team worked to ensure Industria Centre Park was ready for development.\nAs part of AEP’s Quality Site Program, risks had been assessed or mitigated, studies completed, and a laundry list of items addressed, all to alleviate potential investors’ concerns and instill confidence in the site.\n“AEP provided support and advisory services and worked closely with professional site selection firms throughout the years we showed companies this site, which had been proposed for dozens of projects. Having the Quality Site certification in place prepared us for the opportunity to compete for the CANPACK investment,” Lutton said. “Throughout the process, the team at Indiana Michigan Power has been responsive and willing to assist with questions about electric infrastructure, capacity, rate estimates and service plans.\n“At every turn, AEP had the right people at the table.”\nAnd the right people on the ground. AEP provided temporary power, while a dual high-voltage substation was built adjacent to the facility, which was a needed on-site addition due to CANPACK’s high power demands.\n“The relationship between a manufacturing facility and an energy supplier is critical, from the start of the build to running production,” Ballard said. “AEP was extremely instrumental in helping us get this plant started. They were there every step of the way.”\nWith CANPACK anchoring the Industria Centre Park, Lutton calls it a milestone moment in the city's ongoing transformation.\n“With CANPACK, we’ve been able to diversify what manufacturing is in Muncie,” Lutton said. “I think we’ve seen a turnaround here. CANPACK’s decision to locate in Muncie signals that we’re moving in the right direction.\n“I feel very proud that the team of people from the economic development office to AEP and our local elected officials were able to bring this project home.”"
    },
    {
        "Ticker": "AEP",
        "Company": "American Electric Power",
        "Source_URL": "https://www.aep.com/news/stories/view/9971/",
        "Content_Type": "Website Content",
        "Raw_Text": "American Electric Power received conditional commitment from the U.S. Department of Energy’s Loan Program Office (LPO) to support the company’s upgrade of nearly 5,000 miles of transmission lines in Indiana, Michigan, Ohio, Oklahoma and West Virginia.\nThese upgrades replace existing transmission lines in existing rights-of-way with new lines capable of carrying more energy. The upgrades will provide enhanced reliability for customers and facilitate new economic growth opportunities by bringing additional power capacity to these regions. The LPO is making up to $1.6 billion available to AEP at a preferred interest rate. This program will save AEP customers an estimated $278 million in financing costs over the life of the loan.\n“AEP is investing $54 billion in transmission, distribution and generation projects over the next 5 years. Funds from this program will support these investments and save our customers money while we work to improve reliability and bring economic growth to our states,” said Bill Fehrman, AEP president and chief executive officer. “The funds we are able to save through this program enable us to make additional investments to enhance service for our customers.”\nAEP submitted loan applications for 126 projects, representing almost 5,000 miles of transmission lines and $3.6 billion in investments, that would generate $278 million in financing savings. AEP estimates that 1,100 construction jobs will be created through these projects.\nThese projects will use existing easements and rights-of-way as much as possible. Some existing easements may need to be widened or updated to accommodate the higher capacity lines. Impacted landowners will be contacted before any work takes place.\nApproximately 100 miles of transmission lines across Ohio and Oklahoma are the first projects to be supported by the proposed loan guarantee. Additional funding and projects will follow.\nBefore the funds are available, AEP and the LPO must agree to certain conditions. It is anticipated that loan will close by the end of the first quarter in 2025 with initial funding to occur in 2026."
    },
    {
        "Ticker": "AEP",
        "Company": "American Electric Power",
        "Source_URL": "https://www.aep.com/news/stories/view/9824/",
        "Content_Type": "Website Content",
        "Raw_Text": "After catastrophic storms like Hurricanes Helene and Milton, heroes converge.\nAmong them, lineworkers, tree crews, assessors and other utility workers put in long hours, with boots on the ground in perilous conditions, working to restore normalcy in devastated areas.\nBut not everyone has to know how to install a new pole or restring a transmission line to be someone’s hero.\nWhitney Czelusniak is AEP’s economic and business development manager for Virginia. Usually based in Roanoke, she drove to her hometown of Chilhowie, Va., on Friday, Sept. 27, in a lull between the worst of the storm and the flash flooding that came later.\nShe found her family safe. Communications were down, but they still had power, and any property damage was insignificant.\nWith her family sorted, she returned to work as soon as cell service returned. With every text, email and call, she asked, “How can I help?” A friend and colleague, Karen Gilmer, a senior key account manager, answered.\nFood.\nGilmer found herself filling an unexpected role: helping source three square meals a day for crews\nscattered across the county. It’s something she’d never been asked to do before.\n“I just took an assignment and hit the ground running with it,” Gilmer said. “My main focus was to make sure that they were not focused on where their next meal was coming from, and they could get out and do the work they needed to do safely.”\nShe learned Czelusniak’s family lives only a few minutes from the Glade Spring service station, where about 50 personnel from near and far needed to be fed.\n“With the flood’s impacts, there weren’t a lot of places that were one, open, or two, able to support the volume of meals we needed,” Czelusniak said. “So, I pitched in the best I could.”\nFirst, Czelusniak secured a generous donation of smoked meat from a local restaurant, Poe's Pulled Pork. After a quick supply run, Czelusniak and her mother rolled up their sleeves and got to cooking sides: pork and beans and mac and cheese.\nThe next day, the family put three ovens to work, churning out spaghetti, bread and brownies.\n“I tried to leave them enough salad to keep eating for a couple of days, too,” she said, chuckling. “I wanted them to have some green veg. They were eating a lot of carbs.”\nWhen she wasn’t cooking, Czelusniak started her day by 6 a.m., helping Gilmer crisscross the county to pick up and deliver boxed lunches.\nIt made all the difference for at least one employee who traveled from Texas to provide technical support during the restoration effort.\nContinuous Improvement Lead Kevin Lozano sent a personal note to local leadership.\n“I just wanted to say the ladies cooking home-cooked meals each night for us here is probably the most ‘at home’ feeling I’ve ever had this far away from home on a storm in the 19 years I’ve been here,” Lozano wrote. “I really appreciate it and needed to say something about it. We had homemade dessert, too! I’m about to send this pic to my compadres to rub it in a little.”\nHis picture showed a spaghetti buffet, well worked over, laid out on folding tables.\nCzelusniak said she and her family never wanted any credit. They just wanted to help.\n“That one hit my heart,” she said. “That was home. These communities were places I spent a large part of my personal and past professional life. These were neighbors and friends, not just colleagues.”\n“This was just a little small thing.”"
    },
    {
        "Ticker": "AEP",
        "Company": "American Electric Power",
        "Source_URL": "https://www.aep.com/news/stories/view/10502/",
        "Content_Type": "Website Content",
        "Raw_Text": "October 13 – 17 marks Customer Service Week at AEP. A time to recognize employees who go above and beyond to improve the lives of our customers.\n“Our success as a company depends on delivering the reliable service and positive experiences our customers expect,” said Bill Fehrman, AEP chairman, president and chief executive officer. “Schools, businesses and communities count on us every day to keep the lights on and the power flowing.”\nCustomer Champion: Robin Watson\nLast June, an Appalachian Power customer noticed that a recently replaced streetlight was shining through their bedroom window, affecting their sleep.\nThe customer expressed their frustration in an email survey sent by AEP. This is when Robin Watson became aware of the issue and took immediate action. She kept in close contact with the customer while also engaging with local teams who could help.\nWithin a few days, a technician visited the property. They determined the best solution was a simple fix of spray painting the back of the light. This blocked excess light from reaching the customer’s home while still properly lighting the street.\nAfter the light was fixed, Watson received a heartfelt message from the grateful customer.\n“While there may be challenging days in customer service, going the extra mile can lead to remarkable outcomes,” said Watson. “I will cherish her message as a source of motivation on tougher days.”\nCustomer Champion: SWEPCO Perfect Power Strike Team Members\nThe temperature on Aug. 25 stretched toward 100 degrees as power in a Haughton, LA, neighborhood flickered with short lapses throughout the day. A customer reported the issue and said multiple momentary outages lasting several seconds had been happening in recent days.\nIt would take the swift, dedicated work of SWEPCO’s Perfect Power Strike Team collaborating across four work groups and the unique real-time data of the newly installed smart meters in the residential area to solve the mystery and restore power quality.\nAfter receiving the initial report, customer service account representative Miranda Nunnery promptly reached out to the customer and began her investigation. However, no outages were found that aligned with the customer’s experience.\nThat’s when she and customer services manager Todd Nottingham turned to the newly installed smart meters in the neighborhood to see if the real-time user interface data shed light on the power quality issue at the home.\nNunnery and Nottingham found that the smart meter data not only confirmed the customer’s report, but also revealed a larger issue in the area.\nIn all, 139 meters in the area were registering power blinks. Nunnery quickly escalated the findings to distribution system supervisor Tabetha Jackson, who deployed troubleman Daryl McDay to patrol the line and look for the cause of the issue. McDay traced the issue back to the Bellevue Oil Field substation, where he found an overheating connector on one of the phases.\nJackson worked with Justin Dupree from the Substation group to replace the faulty connector If the issue hadn’t been found early when it caused short lapses in power, it would have eventually resulted in an area outage.\nCustomer Champion: AEP Energy Team\nFrom June 16-July 11, an AEP Energy team made a concerted effort to improve customer relationships and better understand them. Led by Jaime Connor, quality supervisor, a 4-person team developed the AEP Energy Rapport, a month-long initiative to enhance customer interactions.\nAmillion Adras, customer advocate, spoke with a longtime AEP Energy customer who was going through major transitions in her life. Adras recognized the customer was going through a challenging time and made sure to comfort her throughout the interaction.\nThe effort to cultivate the relationship then went beyond the initial interaction. Days later, the customer received a floral bouquet, courtesy of AEP Energy.\n“A strange van pulled up in front of our house, and they had this huge vase of beautiful flowers,” said the customer. “It was an astonishing, beautiful bouquet. We were very excited and shared photos with friends and neighbors.”\n“This initiative taught us that building rapport is essential for delivering an exceptional customer experience. When customers feel at ease and connected with an advocate, they are more likely to share accurate information, follow directions, and express gratitude, which all aid the advocate in resolving issues during the first call,” said Connor."
    }
]