[
    {
        "Ticker": "AMGN",
        "Company": "Amgen",
        "Source_URL": "http://www.amgen.com/",
        "Content_Type": "Website Content",
        "Raw_Text": "sa-user-id [x2]Used to track visitors on multiple websites, in order to present relevant advertisement based on the visitor's preferences.\nsa-user-idUsed to track visitors on multiple websites, in order to present relevant advertisement based on the visitor's preferences.\nsa-user-id-v2Used to track visitors on multiple websites, in order to present relevant advertisement based on the visitor's preferences.\nsa-user-id-v2 [x2]Used to track visitors on multiple websites, in order to present relevant advertisement based on the visitor's preferences.\nsa-user-id-v3 [x2]Collects data on the user across websites - This data is used to make advertisement more relevant.\nsa-user-id-v3Collects data on the user across websites - This data is used to make advertisement more relevant."
    },
    {
        "Ticker": "AMGN",
        "Company": "Amgen",
        "Source_URL": "http://www.amgen.com/about",
        "Content_Type": "Website Content",
        "Raw_Text": "Amgen harnesses the best of biology and technology to fight the world’s toughest diseases, and make people’s lives easier, fuller and longer. We discover, develop, manufacture and deliver innovative medicines to help millions of patients. Amgen helped establish the biotechnology industry more than 40 years ago and remains on the cutting-edge of innovation, using technology and human genetic data to push beyond what’s known today.\nOur investment in research and development has yielded a robust pipeline that builds on our existing portfolio of medicines to treat cancer, heart disease, osteoporosis, inflammatory diseases and rare diseases.\nAmgen is one of the 30 companies that comprise the Dow Jones Industrial Average®, and we are also part of the Nasdaq-100 Index®, which includes the largest and most innovative non-financial companies listed on the Nasdaq Stock Market based on market capitalization.\nReaching Seriously Ill Patients Worldwide\nWe have a presence in approximately 100 countries and regions worldwide and our innovative medicines have reached millions of people in the fight against serious illnesses. We focus on four therapeutic areas, general medicine, rare disease, inflammation, and oncology, delivering innovative medicines to help people live longer, fuller, happier lives.\nInvesting in Science and Innovation\nWe pursue new ways to do science using tools like AI, generative biology and human data to discover what is not yet known and develop new precision medicines to fight the world’s toughest diseases.\nMaking Medicines Safely and Reliably\nMany of Amgen's medicines are made through a highly complex process involving living cells. Our commitment is to deliver for \"every patient, every time\", and we have a long-running reputation for the reliability of our supply chain.\nOperating Responsibly\nMaking a positive difference in the world is at the heart of what we do at Amgen — and it goes beyond making vital medicines. We also help build a better world by focusing on environmental, social and governance issues that matter most to our business and our stakeholders."
    },
    {
        "Ticker": "AMGN",
        "Company": "Amgen",
        "Source_URL": "http://www.amgen.com/about/amgen-history",
        "Content_Type": "Website Content",
        "Raw_Text": "AMGen incorporates.\nAMGen (Applied Molecular Genetics Inc.) is established in Thousand Oaks, California, on April 8, 1980, as the brainchild of venture capitalists William K. (Bill) Bowes and associates. With a staff of three, the Company occupies a shared building, now called “Building 1.”\nGeorge B. Rathmann is named first CEO.\nAMGen names its first CEO, scientist and businessman George B. Rathmann. Dubbed “Mr. Biotech” by Red Herring magazine, Rathmann has been called one of the great geniuses of high-tech entrepreneurialism. Working from a small trailer to free up space for scientists, Rathmann quickly establishes scientific goals and secures funding to conduct grand experiments in technology.\nEarly experiments.\nIn the first three years, AMGen scientists attempt many things: creating organisms to extract oil from shale, growing chickens faster, making specialty chemicals, cloning luciferase (the light source for fireflies) and creating a process for producing indigo dye in E. coli—an achievement that garners the prestigious cover of Science magazine. The final direction for the Company would be treating and curing disease.\nLed by CFO Gordon Binder, Amgen’s IPO on June 17, 1983, raises nearly $40 million.\nThe Company officially changes its name to Amgen.\nThe clone that launched a company.\nA team led by a young researcher from Taiwan named Fu-Kuen Lin is tasked with finding and cloning the erythropoietin gene. Their job is staggering: finding a gene on a single fragment of DNA among 1.5 million fragments of the human genome. After working tirelessly for two years, they do it. This groundbreaking achievement enables the creation of one of the most successful drugs in biotech history, EPOGEN® (epoetin alfa).\nKirin and Amgen form a joint venture, Kirin-Amgen, for the worldwide commercialization of erythropoietin.\nA second discovery.\nWhile Lin is working on erythropoietin, researcher Larry Souza and his team clone granulocyte colony-stimulating factor (G-CSF). This discovery leads to the development of Amgen’s second blockbuster drug NEUPOGEN® (filgrastim).\nGordon Binder is appointed CEO.\nAmgen had just received the first U.S. patent for recombinant erythropoietin, completed a 20,000 page filing to the FDA for approval of EPOGEN® (epoetin alfa) and completed building a new 24,000 square foot manufacturing facility. At this height, Rathmann announces that he is ready to retire, explaining, “I figured that would be a great thing if they got a running start by launching EPOGEN® as the new management team.” Gordon Binder is promoted from CFO to CEO and ushers in a new and promising era.\nOn June 1, 1989, the FDA approves EPOGEN® (epoetin alfa). EPOGEN® is named Product of the Year, by Fortune magazine.\nAmgen goes international.\nAmgen establishes its European headquarters in Lucerne, Switzerland. Later, the European headquarters will relocate to Zug, also in Switzerland. Over the next several years, Amgen would quickly establish offices across Europe, including a key manufacturing and distribution center in Breda, the Netherlands.\nGiving back: the Amgen Foundation is formed.\nAmgen establishes the Amgen Foundation as a way to coordinate the various groups and individuals who were already giving back to the community. Today, the Amgen Foundation focuses on excellence in science education to inspire the next generation of innovators, and invest in strengthening communities where Amgen staff members live and work. By the end of 2024, the Foundation had donated more than $475 million in grants to local, regional and international nonprofit organizations that reflect Amgen’s core values and impact lives in inspiring and innovative ways.\nOn February 21, 1991, NEUPOGEN® (filgrastim) is approved by the FDA.\nNEUPOGEN® is named Product of the Year by Fortune magazine.\nA billion-dollar company.\nAmgen hits $1 billion in product sales for EPOGEN® (epoetin alfa) and NEUPOGEN® (filgrastim) combined. On January 2, 1992, Amgen is added to the S&P 500 and months later, the Company debuts on the Fortune 500 list.\nAmgen opens its Puerto Rico facility, which would become Amgen’s flagship manufacturing site with over 1.7 million square feet of space.\nTwo important discoveries.\nAmgen researcher Steve Elliott and his team add two sugar chains to erythropoietin, causing the protein to remain in the body longer. From this discovery, Aranesp® (darbepoetin alfa) is created. Around the same time, Amgen researcher Olaf Kinstler and his team are experimenting with a longer-lasting form of NEUPOGEN® (filgrastim). Amgen attaches the waxy, water-soluble polymer polyethylene glycol (PEG) to G-CSF, which expands the molecule and greatly slows down excretion. From this discovery, Neulasta® (pegfilgrastim) is created.\nA time of scale and growth.\nStaff numbers reach 3,396 globally, up from only 344 when Binder was named CEO in 1988. The Thousand Oaks headquarters had grown, too–from half a building in 1980 to a sprawling campus with well over a million square feet of space by 1992. Local newspapers describe the area as “perpetually under construction.”\nAmgen wins the National Medal of Technology.\nAmgen becomes the first biotech company to receive the U.S. Department of Commerce National Medal of Technology. This award is considered by the U.S. government to be on par with the Nobel Prize. Given that year by Vice President Al Gore and Commerce Secretary Ron Brown, the award recognizes Amgen for “its leadership in developing innovative and important cost-effective therapeutics based on advances in the cellular and molecular biology for delivery to critically ill patients throughout the world.”\nThe Amgen Values launch.\nThe Amgen Values are first launched. Amgen could not have accomplished what it has if not for its commitment to building a culture and social architecture that embraces science and innovation—a culture that continues to shape what Amgen is today.\nOn November 2, 1998, the FDA approves Enbrel® (etanercept).\nKey discoveries.\nScientists at Amgen identify and clone osteoprotegerin (OPG). Subsequent research showed that OPG functioned as a decoy receptor for RANK ligand. These insights form the scientific basis for denosumab.\nA new CEO for a new century.\nKevin W. Sharer becomes Amgen’s third CEO, following the retirement of Gordon Binder. When Binder stepped down, Amgen had grown to become the fourteenth largest drug company in the world, having outstripped its early biotech rivals years before. As Amgen’s former President and COO, Sharer had split many responsibilities with Binder. Binder explained, “Like an athlete, there comes a time for the CEO to leave. We were about to launch preparations for several new products, and Kevin was ready to take command.”\nAmgen’s Cambridge, Mass., research center opens.\nAmgen becomes one of the early pioneers in what would become a biotechnology hotbed in Kendall Square, opening a 285,000-square-foot facility.\nOn September 17, 2001, Aranesp® (darbepoetin alfa) is approved by the FDA.\nAmgen in space.\nAmgen and NASA team up to study Amgen’s investigational treatment, osteoprotegerin (OPG), on the space shuttle Endeavour. The experiment mimics the effects of the rapid bone loss that astronauts experience due to microgravity.\nEvery patient, every time.\nAmgen acquires Immunex, the developer of ENBREL® (etanercept), along with a manufacturing plant in Rhode Island that had not been used since being built 10 years earlier. Within a matter of months, Amgen teams secure FDA approval, start production and are able to manufacture enough ENBREL® to meet demand.\nOn January 31, 2002, Neulasta® (pegfilgrastim) is approved by the FDA.\nOn March 8, 2004, Sensipar® (cinacalcet) is approved by the FDA.\nAmgen acquires Tularik, adding five candidates to Amgen’s pipeline and establishing a strong presence in South San Francisco.\nElucidating the biology of PCSK9.\nScientists in Amgen’s labs in South San Francisco play a critical role in elucidating the function of PCSK9, which lays the groundwork for evolocumab.\nBreakaway from Cancer®.\nAmgen founds Breakaway from Cancer, a national initiative to increase awareness of important resources available to people affected by cancer—from prevention through survivorship. Breakaway from Cancer represents a partnership between Amgen and four nonprofit organizations dedicated to empowering patients with education, resources and hope, wherever they may be in the cancer care continuum. Today, Breakaway from Cancer has reached hundreds of thousands of people touched by cancer with information about resources and services available to people affected by cancer, and more than $4 million has been donated to the Breakaway from Cancer nonprofit partners.\nOn September 27, 2006, Vectibix® (panitumumab) is approved by the FDA\nWomen’s Genome Health Study begins.\nAmgen collaborates with Brigham and Women’s Hospital and NIH’s National Heart, Lung, and Blood Institute on the Women’s Genome Health Study (WGHS). The purpose: to identify genetic variations that may underlie a range of serious illnesses including heart disease, stroke, diabetes, breast cancer and osteoporosis.\nProviding cutting-edge research experiences.\nThe Amgen Foundation, in collaboration with Massachusetts Institute of Technology (MIT), launches the Amgen Scholars program to provide undergraduates with access to research experiences and exposure to biotechnology and drug discovery at top institutions globally.\nOn August 22, 2008, Nplate® (romiplostim) is approved by the FDA.\nNplate® (romiplostim) is awarded “Best Biotechnology Product” by Prix Galien.\nPrix Galien is an international award that recognizes outstanding achievements in improving the human condition through the development of innovative therapies.\nProlia® (denosumab) and XGEVA® (denosumab) are approved by the FDA on June 1, 2010 and November 18, 2010, respectively.\nProlia® wins Best New Drug from Scrip, one of the industry’s highest global accolades.\nProlia® (denosumab) and XGEVA® (denosumab) are awarded “Best Biotechnology Product” by Prix Galien.\nPrix Galien is an international award that recognizes outstanding achievements in improving the human condition through the development of innovative therapies.\nAmgen, CDC and CDC Foundation partner to improve infection control for cancer patients.\nPreventing Infections in Cancer Patients is a comprehensive public health collaboration between the CDC, the CDC Foundation and Amgen to help reduce infections by raising awareness among patients, caregivers and healthcare providers about steps they can take to protect themselves during chemotherapy treatment. Program resources include a Basic Infection Control and Prevention Plan for outpatient oncology clinics and an online patient risk assessment tool, in addition to posters, fact sheets and postcards. As of 2015, nearly 650,000 pieces of initiative materials have been disseminated to the public.\nTapping Amgen’s biomanufacturing expertise to create biosimilars.\nAmgen and Actavis, Inc. announce that they will collaborate to develop and commercialize, on a worldwide basis, several oncology antibody biosimilar medicines. This collaboration reflects the shared belief that the development and commercialization of biosimilar products will not follow a pure brand or generic model, and will require significant expertise, infrastructure and investment to ensure safe, reliably supplied therapies for patients.\nAmgen acquires a manufacturing facility near Dublin, Ireland.\nAmgen acquires BioVex, developers of talimogene laherparepvec.\nAmgen expands in Brazil, including the acquisition of Bergamo, a privately held Brazilian pharmaceutical company.\nRobert A. Bradway is appointed as Amgen’s fourth CEO.\nAfter more than a decade of leading Amgen as the world’s largest biotechnology company, Sharer announces his retirement and that the reins will be handed over to Bradway, Amgen's president and COO. Vance Coffman, chairman of the board's governance and nominating committee at that time, explains, \"During [Kevin’s tenure], Amgen grew significantly in every dimension and is well positioned for the future.\"\nStrategic partners and acquisitions.\nAmgen acquires deCODE Genetics, a global leader in human genetics. The acquisition reflects a core tenet of Amgen’s current R&D strategy: finding and pursuing drug targets that are validated by human genetics. That same year, Amgen and AstraZeneca agree to jointly develop and commercialize five monoclonal antibodies from Amgen's inflammation portfolio. Amgen also acquires Micromet Inc., developers of what would later be approved by the FDA as BLINCYTO® (blinatumomab); KAI Pharmaceuticals, developers of AMG 416; and Mustafa Nevzat, a leading privately held Turkish pharmaceutical company.\nAmgen Teach launches in Europe.\nAmgen Teach launches in Europe to provide hundreds of science educators with free training sessions that emphasize hands-on, inquiry-based experiential learning for their students.\nAmgen Astellas BioPharma K.K. alliance forms in Japan and Amgen-Betta Pharmaceuticals joint venture is established in China.\nAmgen acquires Onyx Pharmaceuticals, developers of Kyprolis® (carfilzomib) for Injection.\nThrough a collaboration with Servier, Amgen obtains the U.S. commercial rights to ivabradine.\nOn December 3, 2014, BLINCYTO® (blinatumomab) is approved by the FDA.\nThe next generation of biomanufacturing.\nConstruction is completed on a state-of-the-art facility in Singapore. The plant has the same capacity as a conventional plant, but in a smaller space, using less water and less energy while producing fewer solid wastes and fewer emissions.\nAmgen’s Asia Research and Development Center opens at ShanghaiTech University in China.\nOn March 2, 2015, the Neulasta® (pegfilgrastim) Delivery Kit, including the On-body Injector, launches.\nOn April 15, 2015, Corlanor® (ivabradine) is approved by the FDA.\nOn August 27, 2015, Repatha® (evolocumab) is approved by the FDA.\nOn October 27, 2015, IMLYGIC™ (talimogene laherparepvec) is approved by the FDA.\nAmgen Singapore Manufacturing Facility\nAmgen's first commercial chemical synthesis manufacturing facility opens in Singapore. The facility is in line with Amgen’s global expansion strategy to strengthen its biomanufacturing capabilities.\nOn July 11, 2016, the Repatha® (evolocumab) Pusthronex™ system (on-body infusor with prefilled cartridge) is approved.\nOn September 23, 2016, AMJEVITA™ (Adalimumab-Atto) is approved by the FDA. It is Amgen's first biosimilar to receive regulatory approval.\nOn February 7, 2017, Parsabiv® (etelcalcetide) is approved by the FDA.\nOn September 14, 2017, MVASI™ (bevacizumab-awwb) is approved by the FDA.\nACC Opens in Tampa, FL\nIn October 2017, Amgen Capability Center (ACC) opens in Tampa, Florida.\nOn November 11, 2017, Amgen launches the ENBREL (etanercept) Mini™ single-dose prefilled cartridge with AutoTouch™ Reusable Autoinjector that is ergonomically designed for patients.\nOn May 17, 2018, Aimovig™ (erenumaab-aooe) is approved by the FDA.\nAmgen Rhode Island Breaks Ground on First U.S. Next-Gen Plant\nAmgen breaks ground on its new next-generation biomanufacturing plant at its West Greenwich, Rhode Island campus. The new plant will be the first of its kind in the U.S., designed for greater flexibility, speed and efficiency, and will manufacture products for the U.S. and global markets.\nOn April 9, 2019, EVENITY™ (romosozumab-aqqg) is approved by the FDA.\nOn June 13, 2019, KANJINTI™ (trastuzumab-anns) is approved by the FDA.\nOn November 21, 2019, Amgen completes the acquisition of Otezla® (apremilast).\nOn December 6, 2019, AVSOLA™ (infliximab-axxq) is approved by the FDA.\nAmgen Closes a Strategic Collaboration with BeiGene\nOn January 2, 2020, Amgen announces a strategic collaboration with BeiGene to expand its oncology presence in China.\nAmgen Foundation and Harvard Launch \"LabXchange\"\nAmgen Foundation and Harvard announce the global launch of LabXchange™, a free online science education platform.\nAmgen Establishes Wholly-Owned Affiliate In Japan\nAmgen Astellas BioPharma K.K. in Japan becomes wholly owned affiliate, and renamed Amgen K.K.\nAmgen Turns 40\nOver 40 years, Amgen grew from a small team in a California office park to a global biotech leader in approximately 100 countries. Hundreds of biotech companies have come and gone since our founding in 1980, but Amgen is still here, and we're stronger than ever.\nAmgen Joins the Dow Jones Industrial Average\nOn August 24, 2020, Amgen joins the Dow Jones Industrial Average.\nFDA Approval of RIABNI™ as biosimilar to Rituxan®\nOn Decmber 17, 2020, the FDA approved Amgen's RIABNI™ (rituximab-arrx) as a biosimilar to Rituxan® (rituximab).\nAcquisition of Five Prime Therapeutics\nOn April 16, 2021, Amgen successfully completed its acquisition of Five Prime Therapeutics.\nFDA Approval of LUMAKRAS™ for KRAS G12C-mutated Non-Small Cell Lung Cancer (NSCLC)\nOn May 28, 2021, the FDA approved Amgen's LUMAKRAS™ (sotorasib) as the first and only targeted treatment for patients with KRAS G12C-mutated locally advanced or metastatic non-small cell lung cancer (NSCLC).\nAcquisition of Teneobio, Inc\nOn October 19, 2021, Amgen successfully completed its acquisition of Teneobio, Inc.\nTezspire™ Approved by FDA for Severe Asthma\nOn December 17, 2021, the FDA approved Amgen and AstraZeneca's Tezspire™ (tezepelumab-ekko) in the U.S. for severe asthma.\nAcquisition of Chemocentryx\nOn October 20, 2022, Amgen successfully completed its acquisition of Chemocentryx.\nAMJEVITA™ Becomes Available in U.S.\nOn January 31, 2023, Amgen's AMJEVITA™ (adalimumab-atto), the first biosimilar to Humira® (adalimumab), became available in the U.S. It had been approved by the FDA in 2016.\nAmgen Expands into Rare Disease with Acquisition of Horizon Therapeutics plc\nOn October 6, 2023, Amgen completed its acquisition of Horizon Therapeutics plc, marking the creation of Amgen's Rare Disease business.\nAmgen Ohio Opens\nOn February 26, 2024, Amgen opened a new, state-of-the-art biomanufacturing site in Central Ohio.\nIMDELLTRA™ (tarlatamab-dlle) Approved by FDA for ES-SCLC\nOn May 16, 2024, the FDA approved Amgen's IMDELLTRA™ (tarlatamab-dlle) for the treatment of adult patients with extensive-stage small cell lung cancer (ES-SCLC)."
    },
    {
        "Ticker": "AMGN",
        "Company": "Amgen",
        "Source_URL": "http://www.amgen.com/about/mission-and-values",
        "Content_Type": "Website Content",
        "Raw_Text": "Amgen strives to serve patients by transforming the promise of science and biotechnology into therapies that have the power to restore health or save lives. In everything we do, we aim to fulfill our mission to serve patients. And every step of the way, we are guided by the values that define us.\nOur Mission\nTo Serve Patients\nOur Values\nBe Science-Based\nOur success depends on superior scientific innovation, integrity and continuous improvement in all aspects of our business through the application of the scientific method. We see the scientific method as a multi-step process that includes designing the right experiment, collecting and analyzing data and rational decision making. It is not subjective or emotional, but rather a logical, open and rational process. Applying the scientific method in all parts of the organization is expected and highly valued.\nCompete Intensely and Win\nWe compete against time, past performance and industry rivals to rapidly achieve high quality results. Winning requires taking risks. We cannot be lulled into complacency by previous achievements. Though we compete intensely, we maintain high ethical standards and demand integrity in our dealings with competitors, customers, partners and each other.\nCreate Value for Patients, Staff and Stockholders\nWe provide value by focusing on the needs of patients. Amgen creates a work environment that provides opportunities for staff members to reach their full potential. We strive to provide stockholders with superior long-term returns while balancing the needs of patients, staff and stockholders.\nBe Ethical\nWe are relentless in applying the highest ethical standards to our products, services and communications.\nTrust and Respect Each Other\nEvery job at Amgen is important and every Amgen staff member is important. We attract diverse, capable and committed people and provide an environment that fosters inclusion, respect, individual responsibility and values diversity. Trust is strengthened through personal initiative and by obtaining quality results rapidly.\nEnsure Quality\nQuality is a cornerstone of all of our activities. We seek the highest quality information, decisions and people. We produce high quality products and services. Quality is woven into the fabric of everything we do.\nWork in Teams\nOur teams work quickly to move scientific breakthroughs from the lab through the clinic to the marketplace and to support other aspects of our business. Diverse teams working together generate the best decisions for patients, staff and stockholders. Our team structure provides opportunities for Amgen staff to impact the direction of the organization, to gain broader perspective about other functions within Amgen and to reach their full potential.\nCollaborate, Communicate and Be Accountable\nLeaders at Amgen seek input and involve key stakeholders in important decisions. In gathering input, strong leaders will welcome diverse opinions, conflicting views and open dialogue for serious consideration. They will clearly communicate decisions and rationale openly and in a timely manner. Once a decision is made, the leader and members of the team will all be accountable for the results and for implementing the decision rapidly."
    },
    {
        "Ticker": "AMGN",
        "Company": "Amgen",
        "Source_URL": "http://www.amgen.com/about/leadership",
        "Content_Type": "Website Content",
        "Raw_Text": "At Amgen, we recognize that innovation comes from many sources. The formation of the Amgen Scientific Advisory Boards formalizes our belief in engaging outside experts to help us theorize, test and spur our discovery and development processes forward. The Scientific Advisory Boards provide external scientific review of our research and development activities and assist management in making significant scientific judgments."
    },
    {
        "Ticker": "AMGN",
        "Company": "Amgen",
        "Source_URL": "http://www.amgen.com/about/awards-and-accolades",
        "Content_Type": "Website Content",
        "Raw_Text": "Amgen Sets Official Guinness World Records™ For Most Osteoporosis Screenings in 24 Hours\nAmgen—together with local healthcare partners in 10 countries around the world—set a Guinness World Records title for the most osteoporosis screenings for an osteoporosis campaign in 24 hours—with 6,056 tracked screenings on\nMay 5, 2019. To break the existing world record, Amgen set out to screen at least a total of 3,000 people in 10 countries around the world—to help them understand their risk of having osteoporosis, a medical condition that weakens bones\nand makes them more likely to fracture. The campaign took place in Brazil, Canada, Colombia, Egypt, Kuwait, Lebanon, Mexico, Saudi Arabia, South Africa and Turkey."
    },
    {
        "Ticker": "AMGN",
        "Company": "Amgen",
        "Source_URL": "http://www.amgen.com/about/therapy-areas",
        "Content_Type": "Website Content",
        "Raw_Text": "We address important scientific questions to help large patient populations with high unmet medical needs across disease areas such as Cardiovascular, Obesity and Bone Health.\nRare Disease\nWith long journeys to diagnosis, lack of awareness and limited treatment options, we are committed to advancing therapeutic options while providing holistic support to the community.\nInflammation\nAmgen creates transformative medicines for autoimmune and chronic inflammatory diseases that target the root causes of inflammation.\nOncology\nEvery patient's cancer journey is unique, with challenges from many directions. At Amgen, we believe we can do more to make innovative, life-changing therapies available for patients living with cancer."
    },
    {
        "Ticker": "AMGN",
        "Company": "Amgen",
        "Source_URL": "http://www.amgen.com/about/therapy-areas/cardiovascular",
        "Content_Type": "Website Content",
        "Raw_Text": "Cardiovascular disease is a leading public health threat that affects nearly 240 million people worldwide.1 And the number of patients keeps growing. There are many potential causes of cardiovascular disease, yet 80% of cardiovascular events, like heart attacks and strokes, are preventable.2 All patients deserve focused approaches to treat their unique conditions.\nAmgen is a pioneer in cardiovascular research, with a legacy of addressing unmanaged LDL cholesterol (LDL-C), one of the most modifiable risk factors for heart attack and stroke. Building on this expertise, Amgen continues to push the boundaries of lipid science by expanding research into other critical areas like lipoprotein(a) - also known as Lp(a) - an emerging cardiovascular risk marker.\nWe are also committed to working with the cardiovascular disease community to achieve the bold ambition of cutting in half the number of heart attacks and strokes in the U.S. by 2030."
    },
    {
        "Ticker": "AMGN",
        "Company": "Amgen",
        "Source_URL": "http://www.amgen.com/about/therapy-areas/bone-health",
        "Content_Type": "Website Content",
        "Raw_Text": "At Amgen, we’re dedicated to fighting the misconception that osteoporosis is a normal part of aging. Osteoporosis affects more than 500 million people globally and causes more than 8.9 million fractures every year.1 One in three women over the age of 50 will experience an osteoporosis-related fracture in her lifetime,1 which can lead to pain, loss of mobility, and changes in lifestyle, including fear of falling and social isolation.2\nBut it doesn’t have to be that way. Amgen has developed innovative therapies to help patients improve their bone health and prevent fractures with medicines that work by both strengthening patients' existing bone, and simultaneously building new bone and slowing bone loss. We also work to increase the use of bone density testing (DXA scans) so people at risk for fractures can take preventative measures before fractures occur."
    },
    {
        "Ticker": "AMGN",
        "Company": "Amgen",
        "Source_URL": "http://www.amgen.com/about/therapy-areas/inflammation",
        "Content_Type": "Website Content",
        "Raw_Text": "A child hospitalized with complications of severe eczema... a parent unable to leave home due to severe asthma... a young adult with joints damaged by arthritis. In our mission to serve patients, we focus on inflammatory diseases that have debilitating effects on people’s lives.\nAmgen makes medicines that treat over a dozen inflammatory diseases. Our early-stage research seeks newer, faster and more personalized ways to help patients living with inflammatory disease, focusing on the areas where we see the greatest opportunities for breakthroughs – and where breakthroughs are most needed by patients."
    },
    {
        "Ticker": "AMGN",
        "Company": "Amgen",
        "Source_URL": "http://www.amgen.com/about/therapy-areas/oncology",
        "Content_Type": "Website Content",
        "Raw_Text": "The words “you have cancer” strike fear into the heart of people around the world. Recent scientific and medical advances in cancer care have dramatically improved survival rates and quality of life for patients. However, there is still much work to do.\nAmgen advances all angles of care by delivering innovative treatments and support for fighting some of the world’s hardest to treat cancers. Our oncology work includes propelling the next generation of targeted small molecules, innovative immunotherapies like T-cell engagers to help a patient’s immune system target cancer cells, and new ways to use monoclonal antibodies to target specific biomarkers."
    },
    {
        "Ticker": "AMGN",
        "Company": "Amgen",
        "Source_URL": "http://www.amgen.com/about/how-we-operate",
        "Content_Type": "Website Content",
        "Raw_Text": "Doing the right thing is central to our mission to serve patients. At Amgen, doing the right thing means more than just following our compliance policies. It also means truly living the Amgen values.\nIt’s a privilege to work at a company focused on helping patients with serious diseases and this is a privilege we do not take lightly. Our business is built on an unwavering commitment to integrity and compliance, which is demonstrated by our staff members every day through their words, decisions and actions."
    },
    {
        "Ticker": "AMGN",
        "Company": "Amgen",
        "Source_URL": "http://www.amgen.com/science/clinical-trials/about-clinical-trials",
        "Content_Type": "Website Content",
        "Raw_Text": "About Clinical Trials\nThe process that brings a new drug from the research laboratory to the marketplace is a long and careful one. Long, because it takes years to complete all the laboratory, animal and human tests; careful, because all those involved in bringing it to market must ensure patient safety and follow strict government regulations in evaluating the drug's safety and efficacy.\nOne of the most important steps in the development process is the clinical trial, which is a study with people who volunteer to receive the drug and be observed for its effects. It is through these trials that investigational drugs are tested to determine whether they can benefit human beings. But before this can happen, people must volunteer and participate - a choice that may benefit not only the individual but many, many others as well.\nWhether or not you qualify for a clinical trial depends on a number of factors, including your medical condition. Your physician will discuss these factors with you and provide comprehensive information on the investigational drug and the trial itself.\nStill, you may have questions. Participation in a clinical trial can be a great undertaking, and there are no guarantees that the investigational drug will work. This page, however, will help you understand some of the potential benefits and risks of participation, and give you some idea of what to expect if you decide to participate.\nWhat is a Clinical Trial?\nA clinical trial is carefully supervised research that is done in humans prior to the availability of an investigational drug to the general public.\nThe term clinical refers to research performed in a hospital or clinic setting in which a physician and other healthcare professionals observe a participant. A trial is a study, whereby the drug is analyzed for its effects on a group of participants.\nHowever, before a drug enters the clinical trial phase, it is extensively tested through basic or preclinical research in the laboratory, both in lab experiments and in animals. The type of experiments depends on the disease being studied, and if animals also can have the same disease. This type of research is extremely important in gathering information on the drug's possible benefits and risks before it is tested in humans.\nIt is important to understand that both basic research and research done through clinical trials are carefully supervised, monitored and documented. Investigational drugs must demonstrate their safety and efficacy to government regulators (such as the Food and Drug Administration in the United States) before they are approved. Clinical trial volunteers play a very big role in this process.\nWhy Do People Become Involved in Clinical Trials?\nThe reasons why people become involved in clinical trials are as varied as the individuals themselves.\nSome people have an illness that currently has no treatment. A clinical trial may offer the opportunity to try an investigational medication, which may help.\nOthers may become involved because their current medication has too many side effects and they want to see if they can tolerate the investigational drug being tested.\nAnd others volunteer because they want to help find answers to scientific or medical questions that will help others benefit in the future.\nOnly you can decide whether or not to participate in a clinical trial. That's why you should take plenty of time to think about the trial and ask all the questions you want. You may even consider asking a close friend or family member to help you in your decision—they may have questions or concerns that you may not have considered.\nAbove all, remember that there are risks associated with clinical trials. And yes, it's a tough decision. Have all the facts before you make up your mind.\n\"I decided to enter a clinical trial because I hoped that the research would be of help to future\npatients.\"\n—Clinical\ntrial participant\nWhat are the Risks Involved in Clinical Trials?\nInvestigational drugs are tested in clinical trials because not everything is yet known about them. So there may be risks to receiving the drug, which will not be uncovered until after a clinical trial begins. Your physician will discuss these potential risks with you. You should carefully weigh them against the possible benefits, and ask as many questions as you need to. Keep the following in mind when evaluating risks:\n- Sometimes the risks, or side effects, may seem no worse than those of your current treatment options. Other times, the side effects may seem greater.\n- You may react differently from another individual when given the same drug. Preclinical testing in the laboratory can often give scientists and physicians an idea of what individuals may experience in the clinical setting. But every person is different. Your physician will ask you a lot of questions ahead of time to learn as much as possible about your medical history in order to reduce the potential risks.\n- In addition, the risks associated with clinical trials can vary depending upon the disease being treated. These risks are carefully weighed and balanced by your physician, the study physician, the national regulatory agency (such as the Food and Drug Administration [FDA] in the US), and an Institutional Review Board (IRB)/Independent Ethics Committee (IEC). An IRB/IEC is an independent body that includes medical, scientific and non-medical representatives. The IRB/IEC reviews and approves a clinical study for safety issues and protects the rights and well-being of study participants.\n- If something shows up that is a risk to participants in the clinical trial, the participants will be notified by the investigator and, under some circumstances, the trial may be stopped or placed on hold until more information is known.\nWhat is a Placebo?\nA placebo is an inactive product used to compare results of the active drug being studied and to learn more about its actions. It is used in clinical trials as one of many possible treatment assignments. Because the participant and healthcare professionals usually do not know which individual has received the placebo and which has not, observations in the clinical trial can be conducted more fairly, since undue concentration on the people who received the investigational drug is reduced.\nWhat are the Potential Benefits of Participating in a Clinical Trial?\nThere are a number of potential benefits from participating in a clinical trial. In general, they include:\n- Becoming involved in the testing of an investigational drug that would not otherwise be available.\n- The possibility of free study medication and study-related medical care during the clinical trial.\n- Contributing to medical science, which may help other patients now and in the future.\n\"I was always willing to try anything that was available to potentially help in finding new treatment\noptions for\nthe disease.\"\n—Matt, Clinical Trial Volunteer\nWhere are Clinical Trials Performed?\nClinical trials can occur in a variety of places. Some are performed in a hospital and others right in the doctor's office. Still others are done in special research centers.\nIf you decide to participate in a clinical trial, you will receive information regarding the study location.\nAre Volunteers Required to Pay for Participation in Clinical Trials?\nYou should not be asked to pay to be in a clinical trial. In most cases, study medication is provided free of charge.\nIn addition, the costs of many tests and procedures associated with the trial will not be charged to you. And in most instances, the cost of routine tests and procedures that are part of your normal healthcare might be paid under your current insurance plan or covered by your healthcare provider.\nIf you are considering participation in a clinical trial, discuss the potential financial implications with your physician or other healthcare professional. They can tell you exactly what will be covered as part of the clinical trial and what will be considered part of your normal healthcare routine, including that which may be your responsibility. Remember to ask everything that's on your mind. It's your right.\nHow Do People Become Involved in a Clinical Trial?\nPeople interested in clinical trial participation should discuss this with their physician. It's the best way to learn whether or not an appropriate trial is available, and where it is being conducted. Potential participants are screened to determine if they are eligible for a given trial. Sometimes screening involves nothing more than a series of questions and answers. Other times it may require laboratory tests. In any case, these tests are performed only with the participant’s consent.\nNot every disease will have a clinical trial currently underway. But this situation is constantly changing. Consult your physician or patient support group to learn if research is being planned which may be appropriate for you.\n\"I found an article on the bulletin board at the hospital...and they were eager to talk to people who\nwere\ninterested in potentially getting involved with a study.\"\n—Alfred, Clinical Trial Volunteer\nWhat are the Participant's Responsibilities?\nYour responsibilities will be explained to you by your healthcare team. In general, however, you must see your study physician as scheduled and take the study medication as directed.\nYou may also be asked to keep a diary of your experience with the study medication; this may help give your study physician information on its safety and effectiveness. You should also contact your study physician as soon as possible if you are hospitalized for any reason.\nIn addition, it is important to let all of your non-study physicians know that you are participating in a clinical trial. They will need the name and phone number of the study physician in order to let him or her know about any pertinent medical information that may affect your participation in the trial. It is advisable to keep the study physician's name and number with you at all times in case of emergency.\nCan People be Enrolled in a Clinical Trial Without Their Knowledge?\nNo. Clinical research is regulated by federal/national government and by the medical profession. You are protected from unauthorized research without your consent through a process known as informed consent.\nInformed consent means that your physician and/or study nurse will thoroughly explain the clinical trial to you and may provide a package of information on the trial along with an informed consent form. The informed consent form provides information on the length of the study, potential side effects (if known) from the drug being tested, your rights to withdraw from the study, and how the study is considered completed.\nThe consent form will also explain how the study protocol is designed, whether or not a placebo is to be used, and what kind of tests will be required. If you don't understand any of the terms of an informed consent form, it is important that you ask your physician or nurse.\nOnce you are satisfied that you have a full understanding of the nature and scope of the trial and decide to proceed, and if you qualify to participate, you may decide to sign the informed consent form. However, remember that you always have the right to say no. If you are uncomfortable with what you are being asked to do in the study, or if you don't fully understand it, or if you simply no longer want to participate, do not feel like you have to participate."
    },
    {
        "Ticker": "AMGN",
        "Company": "Amgen",
        "Source_URL": "http://www.amgen.com/about/therapy-areas/rare-disease",
        "Content_Type": "Website Content",
        "Raw_Text": "While rare diseases are defined as conditions that affect less than 200,000 people,—collectively there are more than 10,000 different rare diseases that impact around 400 million people globally. These illnesses demand urgent attention, and rare diseases are a core and growing part of Amgen’s mission to serve patients.\nPatients living with rare diseases often face unique challenges, which is why Amgen also works to support patients through #RAREis, which elevates the faces, voices and diverse perspectives of people living with rare diseases, while also providing education, awareness and resources – including scholarships and grants – for the entire rare disease community."
    },
    {
        "Ticker": "AMGN",
        "Company": "Amgen",
        "Source_URL": "http://www.amgen.com/stories/2025/11/delivering-excellence-celebrating-quality-safety-compliance-month-at-amgen",
        "Content_Type": "Website Content",
        "Raw_Text": "Quality, Safety & Compliance (QSC) Month recognizes the power of every role and the collective impact of Amgen staff in achieving their mission to serve patients worldwide.\nAt Amgen, quality, safety and compliance represent more than just organizational functions. These elements are deeply embedded in the company culture and serve as the foundation for future breakthroughs. In November, Amgen’s annual Quality Month evolved into Quality, Safety & Compliance (QSC) Month, reflecting a broader commitment to the highest standards across all areas of work.\nThe Power of Every Role: How Employees Across Amgen Are Driving Excellence\nEvery function and role at Amgen plays a vital part in ensuring patients receive the highest quality therapies. Across research, development, manufacturing and the field, Amgen staff are the heart of the organization—bringing integrity, innovation and actively caring to every moment that moves science forward and serves patients. By asking questions, raising concerns and sharing ideas, Amgen employees help manage risk and strengthen our commitment to integrity, quality, safety and innovation.\nHere’s what some Amgen colleagues have to say about how these values show up in their day-to-day work:\n“In Operations, every decision we make, whether on the floor or in a meeting, has a direct impact on patient safety and product quality. That’s why speaking up isn’t optional; it’s essential. ‘Be Ethical’ isn’t just a value, it’s a mindset we carry into every shift. At Amgen, our voice is our first line of defense, and using it is how we protect each other, our patients and our purpose.”\n— Sofie Levecque, Director, Manufacturing\n“A strong focus on health and safety creates an environment where everyone feels valued and empowered to do their best. When we know our well-being is a priority, we can concentrate fully on our work and maintain the highest quality standards. By fostering a culture of safety where we actively care for one another, we ensure every patient receives the highest quality medicine.”\n— Aine Heffernan, Senior Associate, Manufacturing\n“In Research and Development, safety and quality are the foundation of discovery. Every experiment, every data point and every decision must meet the highest standards because they directly influence the medicines we bring to patients. By prioritizing rigorous science and uncompromising safety, we ensure innovation translates into therapies that are not only effective but also trusted. It’s how we honor our responsibility to patients and shape the future of medicine.”\n— Judy Fenyk-Melody, Executive Director, Research\n“Continuous improvement is a productivity engine for Amgen’s global supply quality. We always seek better ways to improve the work we do and the processes we run. The productivity gains we made have created bandwidth for our staff, allowing them more time to focus on the essential work we do to serve patients. Our team’s ongoing commitment to continuous improvement, combined with strong leadership sponsorship, keeps the productivity engine going.”\n— Allen Harmon, VP Global Supplier Quality\n“In Commercial, quality, safety and compliance are not separate from how we achieve our mission. They are the foundation that enables us to serve patients with confidence and represent our license to operate and our commitment to doing what’s right, every time. Because our teams are at the forefront of engaging with customers, we continuously remind ourselves that every interaction is an opportunity to uphold Amgen’s standards and strengthen trust. By doing so, we ensure that every innovation we bring forward truly delivers value and reliability to the patients who rely on us.”\n— Suhee Shin, General Manager\nSetting the Standard: Your Role Matters\nWhether in the lab, at a distribution center, with customers in the field or working remotely, the daily commitment of Amgen staff to quality, safety and compliance advances the organization’s mission to serve patients worldwide.\nTogether, Amgen and its employees shape a future defined by innovation, safety, integrity and high-quality outcomes for patients everywhere."
    },
    {
        "Ticker": "AMGN",
        "Company": "Amgen",
        "Source_URL": "http://www.amgen.com/stories/2025/11/amgen-foundation-doubles-down-on-giving-tuesday",
        "Content_Type": "Website Content",
        "Raw_Text": "To Mohit Chhaya, a principal IS business systems analyst at Amgen, his father was everything.\nHis father was a bank manager who always had a kind, calm and measured tone. As a boy, he remembered his father coming home from his job smiling and in good spirits. He admired the man who taught him the merit of hard work, the importance of integrity and the value of learning to forgive and let go. He remembered how he valued family and was a rock for them. He wanted to be just like him.\nAnd when Chhaya went to school to study engineering and management, his father encouraged him and told him he believed in him, no matter the path he chose. His father was an optimist who saw possibilities, not limits.\n“Even though I wasn’t very vocal with my feelings, he inspired me,” Chhaya said. “I always wished I had the same level of calm, patience and dedication as he did.”\nChhaya began work at Amgen’s Headquarters in Thousand Oaks, California in 2013. He recalled how his father came to visit him on the sprawling, tree-lined campus to see his son working there—filled with pride.\nBut several years ago, tragedy struck. His father had a stroke that left him paralyzed. The man Chhaya used to see standing strong, who was slow to anger and quick to find the positives began a descent into darkness. The smile he always seemed to have was gone. He had never seen his father like this before. It scared him. Saddened him. The man he knew was disappearing into himself and there wasn’t anything he could do to stop it.\nHis father died in 2021. Chhaya was heartbroken. He wanted to do something to honor him and help others who might have suffered a brain injury. To give them a silver lining. Hope.\nThat’s when he heard about the Amgen Foundation’s Nonprofit Board Leadership program at the Thousand Oaks campus. Through that program, he discovered The Brain Injury Center of Ventura County, a non-profit in Southern California that worked with those who suffered from brain traumas.\nAfter understanding their mission, he started serving them as a vice-chair on their board of directors, helping them with defining strategy and leadership. He also learned about the Amgen Foundation’s Dollars for Doers' program and Giving Tuesday double-match program. Donating—and knowing the Amgen Foundation was going to double match that—made him feel like he was making a difference.\n“It might not be able to help my dad, but it can help someone,” Mohit said. “That’s why I gave.”\nAnd why he continues to do so.\nDouble Match on Giving Tuesday\nGiving Tuesday as a global movement began in 2012 with a few simple goals in mind: Inspire people to give. To do something good. To make the world a better place. It was established in New York and began spreading across the country and around the world as people leveraged it and found ways to give both time and money to support charities, nonprofits and humanitarian efforts.\nThe Amgen Foundation began its Giving Tuesday double-match program in 2021. The way it works is fairly straightforward: For every dollar donated by eligible staff in the United States and Puerto Rico, the foundation will kick in $2. Each eligible Amgen staff member may give up to $2,500 on this one day, which will be double matched by the Foundation, up to $5,000.\nJennifer Egglin, associate director of corporate philanthropy, said the first year the double-match program was offered, staff donations plus the Foundation’s double-match resulted in over $2.5 million going to charity on Giving Tuesday. Last year, that total had grown to over $4 million on this single day, with the number of employees participating increasing every year. Egglin said growth is continuing for Giving Tuesday, which for the Amgen Foundation runs for 24 hours beginning at 8 a.m. Eastern Time Dec. 2.\nShe notes how the Amgen Foundation is committed to boosting participation to continue to engage employees in making a difference.\nScott Heimlich, executive director of corporate philanthropy and president of the Amgen Foundation, is also keen to continue to engage more employees in giving year-after-year. “By matching donations 2:1 on this one day, we can make an even greater impact in our communities and reinforce our culture of giving,” he said.\nBroad Range of Beneficiaries\nThere are large organizations that remain popular with givers, including St. Jude Children’s Research Hospital, United Way and the American Red Cross. But local groups can also be the beneficiaries of Giving Tuesday, and some employees at Amgen have targeted those in hopes that the matches will make a bigger impact.\nMary Clouser, associate director for observational research, found a chance to give close to home when her children attended a small nonprofit preschool and knew that the double-match would have a deeper impact because of their small budget. And she loved the school so much, she continues to donate on Giving Tuesday so it can continue to provide a play-based preschool to future generations.\n“It was such a special place and I was so impressed with how it was run,” she said. “They always needed money to fix things or beautify the garden and it’s nice knowing my donation can have a real impact there.”\nSonya Lehto, medical writing associate director, also donates to the local public schools her children attended—specifically their music programs where her daughter played viola. She also donated to the school’s soccer and cross-country teams. Over the years, she has seen how the doubles match helps all three activities at the school and continues to help new students.\n“The coaches and teachers are very important leaders and influencers of our kids and it’s nice to have some resources at their disposal that can be provided through donations,” Lehto said. “That way they’re not stressed over every dollar and dime, and they can focus on the work they do for the students.”\nFinding the right place to give is often a personal choice for the Amgen employees who participate in Giving Tuesday.\nFor Heather Binda, a senior director of commercialization, the spectrum of her giving spans pediatric cancer foundations, organizations that bring STEM & the arts to children in underserved communities and groups supporting teens and athletes with differing abilities.\nBrittney Drake, a material compliance associate based in Colorado, gives to a variety of animal rescue groups. Monique Robbins, a marketing senior manager in Deerfield, Illinois, donates to groups that assist victims of domestic violence—an area she has been involved with for 25 years.\n“When you see these groups help people find their way out and that those lives are changed forever, it’s immensely rewarding to know you helped,” Robbins said. “By giving, you’re helping those who were in that terrible circumstance overcome and break the cycle.”\nAll of them noted that they value donating on Giving Tuesday the most—marking it on their calendars and often saving their money to give on the Tuesday after Thanksgiving to provide the recipient organization with the maximum benefit from the double-match.\n“It’s more money for the organization you already care about and want to give to,” Drake said. “Giving Tuesday is the time to do it. The double-match makes those dollars go so much further. It’s the most bang for your buck.”\nChhaya said it doesn’t matter who you choose to give to because there is so much need and so much work to still be done in the world.\nGiving Tuesday and the Amgen Foundation’s double-match program is just a way to make those efforts a little easier for those doing the work. He said his life's vision is to use modern technology to make the operations of charity organizations as efficient and effective as possible.\n“It’s the least I can do, for the things I have been blessed in my life with,” he said. “And I hope it inspires others to give, too,” he said."
    },
    {
        "Ticker": "AMGN",
        "Company": "Amgen",
        "Source_URL": "http://www.amgen.com/newsroom/press-releases",
        "Content_Type": "Website Content",
        "Raw_Text": "November 2025\nOctober 2025\n10.31.2025\nAMGEN ANNOUNCES 2025 FOURTH QUARTER DIVIDEND10.31.2025\nAMGEN'S LANDMARK PHASE 3 REPATHA DATA TO BE PRESENTED AS LATE BREAKER AT THE AMERICAN HEART ASSOCIATION SCIENTIFIC SESSIONS 202510.29.2025\nAMGEN ANNOUNCES WEBCAST OF 2025 THIRD QUARTER FINANCIAL RESULTS10.17.2025\nFDA APPROVES TEZSPIRE® FOR CHRONIC RHINOSINUSITIS WITH NASAL POLYPS10.06.2025\nAMGEN MAKES REPATHA® AVAILABLE THROUGH AMGENNOW, A DIRECT-TO-PATIENT PROGRAM IN THE U.S.10.02.2025\nLANDMARK PHASE 3 TRIAL (VESALIUS-CV) MEETS PRIMARY ENDPOINTS IN A CARDIOVASCULAR PRIMARY PREVENTION STUDY OF 12,000 PATIENTS\nSeptember 2025\n09.26.2025\nAMGEN ANNOUNCES $650M EXPANSION OF U.S. MANUFACTURING, CREATING HUNDREDS OF NEW JOBS09.08.2025\nAMGEN AND KYOWA KIRIN ANNOUNCE TOP-LINE RESULTS FROM ROCATINLIMAB PHASE 3 ASCEND LONG-TERM EXTENSION STUDY IN ADULTS WITH MODERATE TO SEVERE ATOPIC DERMATITIS09.04.2025\nAMGEN TO PRESENT AT THE MORGAN STANLEY 23RD ANNUAL GLOBAL HEALTHCARE CONFERENCE09.02.2025\nAMGEN INVESTING MORE THAN HALF A BILLION DOLLARS IN NEW, STATE-OF-THE-ART CENTER FOR SCIENCE AND INNOVATION AT U.S. GLOBAL HEADQUARTERS\nAugust 2025\n08.29.2025\nAMGEN TO PRESENT AT THE 2025 WELLS FARGO HEALTHCARE CONFERENCE08.25.2025\nREPATHA® NOW INDICATED FOR ADULTS AT INCREASED RISK FOR MAJOR ADVERSE CARDIOVASCULAR EVENTS DUE TO UNCONTROLLED LDL-C08.05.2025\nAMGEN REPORTS SECOND QUARTER 2025 FINANCIAL RESULTS08.01.2025\nAMGEN ANNOUNCES 2025 THIRD QUARTER DIVIDEND\nJune 2025\n06.30.2025\nAMGEN ANNOUNCES POSITIVE TOPLINE PHASE 3 RESULTS FOR BEMARITUZUMAB IN FIBROBLAST GROWTH FACTOR RECEPTOR 2b (FGFR2b) POSITIVE FIRST-LINE GASTRIC CANCER06.23.2025\nRESULTS FROM AMGEN'S PHASE 2 OBESITY STUDY OF MONTHLY MARITIDE PRESENTED AT THE AMERICAN DIABETES ASSOCIATION 85TH SCIENTIFIC SESSIONS06.18.2025\nAMGEN'S PHASE 2 MARITIDE DATA TO BE PRESENTED AT THE AMERICAN DIABETES ASSOCIATION 85TH SCIENTIFIC SESSIONS06.13.2025\nAMGEN AND FOOTBALL LEGEND BARRY SANDERS HIGHLIGHT DANGERS OF BAD CHOLESTEROL IN NEW DOCUMENTARY06.05.2025\nAMGEN TO PRESENT AT GOLDMAN SACHS 46TH ANNUAL GLOBAL HEALTHCARE CONFERENCE06.02.2025\nIMDELLTRA® SIGNIFICANTLY REDUCED RISK OF DEATH BY 40% IN SMALL CELL LUNG CANCER PATIENTS\nMay 2025\n05.30.2025\nAMGEN TO PRESENT AT JEFFERIES GLOBAL HEALTHCARE CONFERENCE05.16.2025\nAMGEN TO PRESENT AT THE 2025 RBC CAPITAL MARKETS GLOBAL HEALTHCARE CONFERENCE05.09.2025\nAMGEN TO PRESENT AT THE BANK OF AMERICA MERRILL LYNCH GLOBAL HEALTHCARE CONFERENCE05.01.2025\nAMGEN REPORTS FIRST QUARTER 2025 FINANCIAL RESULTS\nApril 2025\n04.28.2025\nAMGEN ANNOUNCES WEBCAST OF 2025 FIRST QUARTER FINANCIAL RESULTS04.25.2025\nAMGEN ANNOUNCES $900 MILLION MANUFACTURING EXPANSION, CREATION OF 350 NEW JOBS IN OHIO04.11.2025\nIMDELLTRA® DEMONSTRATED SUPERIOR OVERALL SURVIVAL IN SMALL CELL LUNG CANCER04.03.2025\nUPLIZNA® (INEBILIZUMAB-CDON) IS NOW THE FIRST AND ONLY FDA-APPROVED TREATMENT FOR IGG4-RELATED DISEASE\nMarch 2025\n03.13.2025\nUPLIZNA® (INEBILIZUMAB-CDON) SIGNIFICANTLY IMPROVES GENERALIZED MYASTHENIA GRAVIS SYMPTOMS IN ACETYLCHOLINE RECEPTOR AUTOANTIBODY-POSITIVE PATIENTS OVER 52 WEEKS03.08.2025\nAMGEN AND KYOWA KIRIN PROVIDE TOP-LINE RESULTS FROM ROCATINLIMAB PHASE 3 IGNITE STUDY IN ADULTS WITH MODERATE TO SEVERE ATOPIC DERMATITIS03.04.2025\nAMGEN ANNOUNCES 2025 SECOND QUARTER DIVIDEND03.01.2025\nPOSITIVE RESULTS FROM TEZSPIRE® (TEZEPELUMAB-EKKO) PHASE 3 WAYPOINT TRIAL HIGHLIGHT RAPID, SUSTAINED EFFECT IN CHRONIC RHINOSINUSITIS WITH NASAL POLYPS\nFebruary 2025\n02.28.2025\nAMGEN TO PRESENT AT THE 45TH ANNUAL TD COWEN HEALTH CARE CONFERENCE02.14.2025\nAMGEN TO PRESENT AT CITI'S 2025 VIRTUAL ONCOLOGY LEADERSHIP SUMMIT02.07.2025\nAMGEN TO PRESENT AT THE 35th ANNUAL OPPENHEIMER HEALTHCARE LIFE SCIENCES CONFERENCE02.04.2025\nAMGEN REPORTS FOURTH QUARTER AND FULL YEAR 2024 FINANCIAL RESULTS\nJanuary 2025\n01.31.2025\nAMGEN ANNOUNCES WEBCAST OF 2024 FOURTH QUARTER AND FULL YEAR FINANCIAL RESULTS01.17.2025\nFDA APPROVES LUMAKRAS® (SOTORASIB) IN COMBINATION WITH VECTIBIX® (PANITUMUMAB) FOR CHEMOREFRACTORY KRAS G12C-MUTATED METASTATIC COLORECTAL CANCER01.08.2025\nAMGEN TO PRESENT AT 43RD ANNUAL J.P. MORGAN HEALTHCARE CONFERENCE"
    },
    {
        "Ticker": "AMGN",
        "Company": "Amgen",
        "Source_URL": "http://www.amgen.com/newsroom/press-releases/2025/11/amgens-repatha-cuts-risk-of-first-major-adverse-cardiovascular-events-by-25-in-landmark-phase-3-vesaliuscv-trial",
        "Content_Type": "Website Content",
        "Raw_Text": "Study Also Shows 36% Reduction in Risk of Heart Attack\nRepatha is the First and Only PCSK9 Inhibitor to Significantly Reduce the Risk of First Heart Attack and Stroke\nIn this landmark study of more than 12,000 patients with atherosclerosis or diabetes who had no prior heart attack or stroke, Repatha demonstrated a 25% relative reduction in the risk of a composite of coronary heart disease (CHD) death, heart attack or ischemic stroke (3-P MACE), and 19% reduction in a broader composite that also included any ischemia-driven arterial revascularization (4-P MACE). Repatha also reduced the risk of heart attack by 36%. In a cohort of patients included in a lipid sub-study, the median achieved LDL-C was 45 mg/dL compared to 109 mg/dL in the placebo arm.\n\"The VESALIUS-CV results deliver clear and compelling evidence that intensive LDL-C lowering is critical to reducing cardiovascular risk,\" said\nRepatha significantly reduced the risk of most secondary endpoints, including the following composites: heart attack, ischemic stroke or any ischemia-driven revascularization; CHD death, heart attack or revascularization; cardiovascular death, heart attack or ischemic stroke; and CHD death or heart attack. In addition, there were numerical trends for reduced mortality rates in the Repatha arm, including cardiovascular death (21% relative risk reduction), CHD death (11% relative risk reduction) and all-cause death (20% relative risk reduction), as well as a trend toward lower ischemic stroke (21% relative risk reduction).\n\"Building on the success of FOURIER, in which we showed that adding evolocumab to statin therapy in patients with a prior heart attack or stroke reduced the risk of subsequent major adverse cardiovascular events, we now show that in the much larger population of patients with atherosclerosis or diabetes, but without a prior heart attack or stroke, that adding evolocumab to their lipid regimen substantially reduces their risk of MACE,\" said\nResults also showed reduction in risk of cardiovascular events in the nearly 60% of trial participants who had diabetes, reinforcing the urgent need to manage LDL-C in these patients who remain largely undertreated.\n\"Cardiovascular disease remains the leading cause of mortality and morbidity for people living with diabetes, driven by risk factors including high LDL-C. Reducing this risk needs to be prioritized in primary care settings where the majority of people living with diabetes receive care,\" said Osagie Ebekozien M.D., M.P.H., CPHQ, Chief Quality Officer,\nNo new safety signals were identified, and tolerability was consistent with the current prescribing information in the\nCardiovascular disease is the leading cause of death worldwide.1 Every 40 seconds, a heart attack or stroke occurs in the\nRepatha was first approved in 2015 and has since been used by more than 6.7 million patients globally.3,4 Earlier this year, the\nAbout the VESALIUS-CV Trial\nVESALIUS-CV is a Phase 3, double-blind, randomized, placebo-controlled global clinical trial designed to evaluate the impact of LDL-C lowering with evolocumab on MACE in adults at high CV risk without prior heart attack or stroke.\nVESALIUS-CV enrolled more than 12,000 patients with known atherosclerotic cardiovascular disease (ASCVD) or high-risk diabetes, who had no history of heart attack or stroke, an LDL-C ≥ 90 mg/dL, or non-high-density lipoprotein cholesterol (non-HDL-C) ≥ 120 mg/dL, or apolipoprotein B ≥ 80 mg/dL; and treated with highest tolerated dose of statin and/or ezetimibe. The median baseline LDL-C was 122 mg/dL (IQR, 104-149 mg/dL) on local lab testing. Participants were randomized to receive Repatha or placebo in addition to optimized lipid-lowering therapy and were followed for a median of approximately 4.6 years.\nCardiovascular disease (CVD) remains a major global health threat, linked to multiple interrelated risk factors like high LDL-C, Lp(a), obesity, diabetes and hypertension.5,6 These risks often coexist and require a comprehensive approach to prevention and care.\nAbout Repatha\nRepatha is a human monoclonal antibody that inhibits proprotein convertase subtilisin/kexin type 9 (PCSK9). Repatha binds to PCSK9 and inhibits circulating PCSK9 from binding to the low-density lipoprotein (LDL) receptor (LDLR), preventing PCSK9-mediated LDLR degradation and permitting LDLR to recycle back to the liver cell surface. By inhibiting the binding of PCSK9 to LDLR, Repatha increases the number of LDLRs available to clear LDL from the blood, thereby lowering LDL-C levels.\nRepatha is the most extensively studied PCSK9 inhibitor, with clinical and real-world evidence across diverse populations and CV risk profiles.7 The clinical benefits and safety of Repatha have been studied for 15 years in 51 clinical trials with over 57,000 patients.8 Repatha is approved in 74 countries, including the\nINDICATIONS\nRepatha is a PCSK9 (proprotein convertase subtilisin/kexin type 9) inhibitor indicated:\nThe safety and effectiveness of Repatha® have not been established in pediatric patients with HeFH or HoFH who are younger than 10 years old or in pediatric patients with other types of hypercholesterolemia. For full prescribing information, visit www.Repatha.com.\nIMPORTANT SAFETY INFORMATION\nPlease see full Prescribing Information.\nAbout Amgen\nAmgen discovers, develops, manufactures and delivers innovative medicines to help millions of patients in their fight against some of the world's toughest diseases. More than 40 years ago, Amgen helped to establish the biotechnology industry and remains on the cutting-edge of innovation, using technology and human genetic data to push beyond what's known today. Amgen is advancing a broad and deep pipeline that builds on its existing portfolio of medicines to treat cancer, heart disease, osteoporosis, inflammatory diseases and rare diseases.\nIn 2024, Amgen was named one of the \"World's Most Innovative Companies\" by Fast Company and one of \"America's Best Large Employers\" by Forbes, among other external recognitions. Amgen is one of the 30 companies that comprise the Dow Jones Industrial Average®, and it is also part of the Nasdaq-100 Index®, which includes the largest and most innovative non-financial companies listed on the Nasdaq Stock Market based on market capitalization.\nFor more information, visit Amgen.com and follow Amgen on X, LinkedIn, Instagram, YouTube and Threads.\nForward-Looking Statements\nThis news release contains forward-looking statements that are based on the current expectations and beliefs of Amgen. All statements, other than statements of historical fact, are statements that could be deemed forward-looking statements, including any statements on the outcome, benefits and synergies of collaborations, or potential collaborations, with any other company (including BeOne Medicines Ltd. or Kyowa Kirin Co., Ltd.), the performance of Otezla® (apremilast), our acquisitions of ChemoCentryx, Inc. or Horizon Therapeutics plc (including the prospective performance and outlook of Horizon's business, performance and opportunities, and any potential strategic benefits, synergies or opportunities expected as a result of such acquisition), as well as estimates of revenues, operating margins, capital expenditures, cash, other financial metrics, expected legal, arbitration, political, regulatory or clinical results or practices, customer and prescriber patterns or practices, reimbursement activities and outcomes, effects of pandemics or other widespread health problems on our business, outcomes, progress, and other such estimates and results. Forward-looking statements involve significant risks and uncertainties, including those discussed below and more fully described in the Securities and Exchange Commission reports filed by Amgen, including our most recent annual report on Form 10-K and any subsequent periodic reports on Form 10-Q and current reports on Form 8-K. Unless otherwise noted, Amgen is providing this information as of the date of this news release and does not undertake any obligation to update any forward-looking statements contained in this document as a result of new information, future events or otherwise.\nNo forward-looking statement can be guaranteed and actual results may differ materially from those we project. Discovery or identification of new product candidates or development of new indications for existing products cannot be guaranteed and movement from concept to product is uncertain; consequently, there can be no guarantee that any particular product candidate or development of a new indication for an existing product will be successful and become a commercial product. Further, preclinical results do not guarantee safe and effective performance of product candidates in humans. The complexity of the human body cannot be perfectly, or sometimes, even adequately modeled by computer or cell culture systems or animal models. The length of time that it takes for us to complete clinical trials and obtain regulatory approval for product marketing has in the past varied and we expect similar variability in the future. Even when clinical trials are successful, regulatory authorities may question the sufficiency for approval of the trial endpoints we have selected. We develop product candidates internally and through licensing collaborations, partnerships and joint ventures. Product candidates that are derived from relationships may be subject to disputes between the parties or may prove to be not as effective or as safe as we may have believed at the time of entering into such relationship. Also, we or others could identify safety, side effects or manufacturing problems with our products, including our devices, after they are on the market.\nOur results may be affected by our ability to successfully market both new and existing products domestically and internationally, clinical and regulatory developments involving current and future products, sales growth of recently launched products, competition from other products including biosimilars, difficulties or delays in manufacturing our products and global economic conditions, including those resulting from geopolitical relations and government actions. In addition, sales of our products are affected by pricing pressure, political and public scrutiny and reimbursement policies imposed by third-party payers, including governments, private insurance plans and managed care providers and may be affected by regulatory, clinical and guideline developments and domestic and international trends toward managed care and healthcare cost containment. Furthermore, our research, testing, pricing, marketing and other operations are subject to extensive regulation by domestic and foreign government regulatory authorities. Our business may be impacted by government investigations, litigation and product liability claims. In addition, our business may be impacted by the adoption of new tax legislation or exposure to additional tax liabilities. Further, while we routinely obtain patents for our products and technology, the protection offered by our patents and patent applications may be challenged, invalidated or circumvented by our competitors, or we may fail to prevail in present and future intellectual property litigation. We perform a substantial amount of our commercial manufacturing activities at a few key facilities, including in Puerto Rico, and also depend on third parties for a portion of our manufacturing activities, and limits on supply may constrain sales of certain of our current products and product candidate development. An outbreak of disease or similar public health threat, and the public and governmental effort to mitigate against the spread of such disease, could have a significant adverse effect on the supply of materials for our manufacturing activities, the distribution of our products, the commercialization of our product candidates, and our clinical trial operations, and any such events may have a material adverse effect on our product development, product sales, business and results of operations. We rely on collaborations with third parties for the development of some of our product candidates and for the commercialization and sales of some of our commercial products. In addition, we compete with other companies with respect to many of our marketed products as well as for the discovery and development of new products. Further, some raw materials, medical devices and component parts for our products are supplied by sole third-party suppliers. Certain of our distributors, customers and payers have substantial purchasing leverage in their dealings with us. The discovery of significant problems with a product similar to one of our products that implicate an entire class of products could have a material adverse effect on sales of the affected products and on our business and results of operations. Our efforts to collaborate with or acquire other companies, products or technology, and to integrate the operations of companies or to support the products or technology we have acquired, may not be successful. There can be no guarantee that we will be able to realize any of the strategic benefits, synergies or opportunities arising from the Horizon acquisition, and such benefits, synergies or opportunities may take longer to realize than expected. We may not be able to successfully integrate Horizon, and such integration may take longer, be more difficult or cost more than expected. A breakdown, cyberattack or information security breach of our information technology systems could compromise the confidentiality, integrity and availability of our systems and our data. Our stock price is volatile and may be affected by a number of events. Our business and operations may be negatively affected by the failure, or perceived failure, of achieving our sustainability objectives. The effects of global climate change and related natural disasters could negatively affect our business and operations. Global economic conditions may magnify certain risks that affect our business. Our business performance could affect or limit the ability of our Board of Directors to declare a dividend or our ability to pay a dividend or repurchase our common stock. We may not be able to access the capital and credit markets on terms that are favorable to us, or at all.\nAny scientific information discussed in this news release relating to new indications for our products is preliminary and investigative and is not part of the labeling approved by the\nCONTACT:\nREFERENCES\nView original content to download multimedia:https://www.prnewswire.com/news-releases/amgens-repatha-cuts-risk-of-first-major-adverse-cardiovascular-events-by-25-in-landmark-phase-3-vesalius-cv-trial-302609344.html\nSOURCE"
    }
]