[
    {
        "Ticker": "AMZN",
        "Company": "Amazon",
        "Source_URL": "https://www.aboutamazon.com/news",
        "Content_Type": "Website Content",
        "Raw_Text": "Amazon News\n3294 results - showing results 1 - 12\n3294 results\nLatest News\nFilter\n(0)Latest News\n3294 results - showing results 1 - 12\n3294 results\n3294 results - showing results 1 - 12\n3294 results\nFilter\n(0)3294 results - showing results 1 - 12\n3294 results"
    },
    {
        "Ticker": "AMZN",
        "Company": "Amazon",
        "Source_URL": "https://www.aboutamazon.com/amazon-news-today",
        "Content_Type": "Website Content",
        "Raw_Text": "Read the latest Amazon news\nWe’re reinventing online shopping to make it faster and easier and to make customers’ lives better every day.\nRufus can search for products based on activity, event, purpose, and other use cases, and automatically add items to your cart, tell you if you’re getting the best price, find top deals every day of the year, auto-buy items at a set price, and take a handwritten grocery list and add the items to your cart.\nCustomers can now browse, finance, and purchase Ford Blue Advantage certified pre-owned vehicles from participating Ford dealers on Amazon Autos.\nPrime Video kicks off Black Friday with an exclusive broadcast of the Skins Game golf competition featuring four PGA TOUR superstars.\nStores, Shopping, and Prime\nFind out about Prime benefits, small businesses, our retail stores, and other new features\nProduct discovery through visual search is faster and easier with Lens Live.\nSince launching a year ago, Haul has massively grown its selection and expanded to serve customers in 25 locations—with plans for more in 2026.\nWith Amazon's Cyber Monday event kicking off November 29, we're here to answer all your questions.\nPatrick Ryan’s ‘Buckeye’—a true Great American Novel—comes in at No. 1 from Amazon’s wide selection this year.\nAmazon Web Services (AWS)\nLearn about innovations like Bedrock and Q, plus community initiatives and skills trainings\nGet the latest updates on how Amazon supports small businesses, creates jobs, sets up sustainability initiatives, and develops educational programs near AWS data centers.\nResearch shows that highly interactive, game-based learning leads to better knowledge outcomes.\nAWS addresses the critical AI skills gap by enabling professionals at any level to develop valuable expertise for today's high-demand roles.\nAdvanced AI technology will transform handwritten notes and analog footage into a searchable database for scientists to gain deeper insights.\nArtificial Intelligence (AI)\nDiscover how Amazon is transforming lives through generative AI\nThe service translates between English and Spanish, and from German to English, expanding opportunities for Kindle Direct Publishing authors.\nThe subsea cable will create alternative data pathways between Maryland and County Cork, delivering fast and reliable cloud and AI services across the Atlantic.\nLearn how small-yet-impactful innovations, such as Amazon smile lights and improvements to the delivery app, are reshaping the experience of delivery drivers.\nPartnership will enable OpenAI to run its advanced AI workloads on AWS’s world-class infrastructure starting immediately.\nPlug into what's new with devices like Echo, Fire TV, Kindle, and Ring\nLearn how key features and Alexa+ capabilities can simplify your daily routines and enhance your home experience.\nAmazon and BMW Group collaborate to deliver more intelligent, conversational, and personalized in-car voice assistant experiences.\nIntroducing our most advanced Echo devices yet, featuring premium audio, next-generation AI processing and Omnisense sensor fusion for more proactive and personalized Alexa+ experiences.\nThe all-new Kindle Scribe lineup is thinner, lighter, and faster with new productivity features, including AI-powered notebook search.\nExplore how Amazon is reducing packaging waste and increasing renewable energy\nGet the latest updates on how we’re reducing our water footprint and investing in innovations to address water scarcity.\nGet a first look at a future SMR (small modular reactor) that will help power AI and cloud services with advanced nuclear energy in the Pacific Northwest.\nAmazon's new delivery station doubles as an exercise in sustainability, packed with more than 40 market-ready technologies and systems designed to reduce its resource usage and shrink its carbon footprint.\nA first-of-its-kind harvest marks a milestone in Amazon’s commitment to climate innovation.\nLearn more about how we support our employees and their families\nAmazon is working closely with UN agencies and other first responders as Melissa threatens widespread devastation.\nFrom preserving affordable homes to delivering millions of meals, Amazon's community investments address pressing challenges facing our neighbors.\nWe are donating and delivering emergency supplies to impacted communities from our Disaster Relief hub in Mexico.\nFor many employees, Amazon offers health care starting on day one of employment, along with mental health and well-being resources, cancer support, and 24/7 access to medical advice.\nLearn about our efforts in housing equity, education, volunteering and in reducing food insecurity\nLearn how we invest in the community, help power the local economy, and support our employees in the Puget Sound region.\nLearn how we invest in the community, help power the local economy, and support our employees in Arlington, Virginia.\nAmazon's investments are boosting the Empire State's economy while creating opportunities for New Yorkers.\nInvestment supports students, employees and those looking to expand their skills as the workforce adapts to changing economy.\nGet the latest on Prime Video, Amazon MGM Studios, Audible, Amazon Music, and more\nThe Game Awards on December 11 will honor the year’s best games and creators.\nStep into the Hudson Valley’s premier event space where one demanding entrepreneur and his young staff navigate event planning, workplace drama, and farm life challenges in this new unscripted series.\nFind out who’s playing, how to watch, and who won each week. Plus, get all the latest ‘Thursday Night Football’ news from Prime Video.\nPrime Video’s fourth season of ‘Thursday Night Football’ is packed with divisional matchups and features two holiday showdowns.\nAmazon Leo is a simple nod to the low Earth orbit satellite constellation that powers the network.\nGet answers to your questions about how Amazon will provide internet connectivity from space.\nAmazon.com released its third quarter earnings report on October 30.\nThe following message was shared with Amazon employees earlier today."
    },
    {
        "Ticker": "AMZN",
        "Company": "Amazon",
        "Source_URL": "https://www.aboutamazon.com/stores-amazon-shopping-news",
        "Content_Type": "Website Content",
        "Raw_Text": "Latest news about our stores and shopping\nRufus can search for products based on activity, event, purpose, and other use cases, and automatically add items to your cart, tell you if you’re getting the best price, find top deals every day of the year, auto-buy items at a set price, and take a handwritten grocery list and add the items to your cart.\nCustomers can now browse, finance, and purchase Ford Blue Advantage certified pre-owned vehicles from participating Ford dealers on Amazon Autos.\nSince launching a year ago, Haul has massively grown its selection and expanded to serve customers in 25 locations—with plans for more in 2026.\nShop everything you need for the season, from fresh grocery and pantry essentials to electronics and beauty products to stocking stuffers under $10.\nFollowing positive customer response to Amazon Haul, the Bazaar app extends this shopping experience to new destinations, offering customers products across fashion, home, and lifestyle categories in a dedicated shopping experience.\nThe service translates between English and Spanish, and from German to English, expanding opportunities for Kindle Direct Publishing authors.\nA pivotal decision to invite independent sellers into Amazon’s store in 2000 has driven tremendous business growth for entrepreneurs while transforming the retail industry.\nNew automated micro-fulfillment center at a Whole Foods Market in Plymouth Meeting, PA lets customers simultaneously purchase natural, organic, and national name-brand products for online delivery or in-store pickup.\nThe full-color book features a curated wonderland of stories and games, with exclusive and top-rated toys perfect for physical and digital playtime.\nHelp Me Decide expands Amazon’s suite of AI shopping tools, pairing you with the right product with the tap of a button.\nPrime members now save $0.10 per gallon at approximately 7,500 bp, Amoco, and ampm locations across the U.S.\nParents and guardians can get expert medical advice and treatments for their kids for conditions including pink eye, skin rashes, head lice, and asthma Rx renewals.\nU.S. beta launched in the Amazon Shopping app, featuring fashion, home, lifestyle, electronics, and other products, all backed by Amazon’s A-to-z Guarantee, with delivery times of one to two weeks.\nPrime members can buy tickets to the early screening of ‘Wicked: For Good’ and see it four days before its theatrical release.\nInnovative pharmacy kiosks at One Medical offices will allow patients in select areas to receive medications within minutes of their appointment, closing a critical gap in care.\nAdd to Delivery, our latest feature for Prime members, makes it easier than ever to add what you need, when you remember you need it.\nHundreds of primary care providers have been specially trained to provide comprehensive, personalized care to help patients during this significant yet underserved transition.\nAmazon Pharmacy automatically applies manufacturer-sponsored coupons directly to eligible orders, making medications more affordable.\nYou might also like\n- Teams around the world invent on behalf of our customers every day to meet their desire for lower prices, better selection, and convenient services. One way we guarantee a wide selection of products is through the 1.7 million small and medium businesses around the world selling on Amazon.com and offering more options for customers.\n- An Amazon Prime membership comes with much more than fast, free delivery. Check out the shopping, entertainment, healthcare, and grocery benefits, plus updates available to members."
    },
    {
        "Ticker": "AMZN",
        "Company": "Amazon",
        "Source_URL": "https://www.aboutamazon.com/amazon-aws-news",
        "Content_Type": "Website Content",
        "Raw_Text": "Latest news about AWS\nAWS addresses the critical AI skills gap by enabling professionals at any level to develop valuable expertise for today's high-demand roles.\nAdvanced AI technology will transform handwritten notes and analog footage into a searchable database for scientists to gain deeper insights.\nThe subsea cable will create alternative data pathways between Maryland and County Cork, delivering fast and reliable cloud and AI services across the Atlantic.\nThe collaborative infrastructure innovation delivers nearly half a million Trainium2 chips in record time, with Anthropic scaling to more than one million chips by the end of 2025.\nThe models include Anthropic’s most intelligent model with advanced opportunities for agentic AI and sophisticated coding for AWS customers, as well as their most efficient model.\nAs organizations work to implement generative AI solutions, AWS continues to expand its certification portfolio to meet growing demand for validated AI expertise.\nQuick Suite helps you cut through the noise of fragmented information, siloed applications, and repetitive tasks to focus on what matters.\nFrom Afghanistan evacuations to Hurricane Helene relief efforts, AWS Wickr supports nonprofit and U.S. Army operations, enabling secure combat zone communications.\nNBA and AWS announce a partnership that will enhance broadcasts and provide fans with live stats to help them dive deeper into the game.\nAWS’s structured virtual training program removes the guesswork from starting a career in the tech industry.\nAWS continues to invest in being the best place to run open weight models with five new options that enhance model choice in Amazon Bedrock to further meet customers’ needs.\nCustomers can access advanced open weight models in Amazon Bedrock and Amazon SageMaker AI, bringing together OpenAI and the world’s most comprehensive and broadly adopted cloud.\nAmazon Bedrock AgentCore leads the announcements, alongside new listings in AWS Marketplace and a $100 million investment to boost agentic AI development.\nThe Pennsylvania Energy and Innovation Summit brought together Amazon leadership, policymakers, and energy and AI executives to advance U.S. technological leadership.\nNew tools will allow customers to better protect their digital assets, identify important security issues, defend against cyberattacks, and more.\nThe largest global technology investment announcement in Australia’s history will help build national AI capability and position Australia as a global AI and technology leader.\nPlanned investment will establish multiple innovation campuses, create 1,250 jobs, and support new workforce development training programs and local community projects\nPlanned investment in Richmond County will create hundreds of jobs and support new workforce development training programs and local community projects.\nAWS’s free cloud workforce development program AWS re/Start helps unemployed and underemployed people launch life-changing tech careers.\nAmazon’s investment in its data center locations is helping create jobs, support economic growth, provide education and training opportunities, and much more.\nAWS AI scientist Nashlie Sephus reveals how free AI tools can boost businesses, from making product recs to advising on when to fly a hot air balloon.\nYou might also like\n- We’ve long believed that AI will transform every customer experience and industry. Whether you’re watching shows on your Fire TV, shopping for must-have products on Amazon.com, reading on Kindle, or one of the more than 100,000 enterprise customers using AI and machine learning services offered through AWS, check out how we’re innovating with AI."
    },
    {
        "Ticker": "AMZN",
        "Company": "Amazon",
        "Source_URL": "https://www.aboutamazon.com/amazon-news-devices-kindle-alexa",
        "Content_Type": "Website Content",
        "Raw_Text": "Latest news about devices and services\nAmazon and BMW Group collaborate to deliver more intelligent, conversational, and personalized in-car voice assistant experiences.\nIntroducing our most advanced Echo devices yet, featuring premium audio, next-generation AI processing and Omnisense sensor fusion for more proactive and personalized Alexa+ experiences.\nThe all-new Kindle Scribe lineup is thinner, lighter, and faster with new productivity features, including AI-powered notebook search.\nRing's new technology powers neighborhood safety with ultra-clear video and features that turn cameras into community tools for pet owners.\nConveniently refresh your memory on thousands of best-selling eBook series with the new Recaps feature on Kindle devices and the Kindle app for iOS.\nDiscover how to chat naturally with Alexa+ and customize your Echo Show 15 and 21 experience with personalized features and widgets.\nFind some of the best Prime Day deals on Kindle devices and e-readers that come with everything you need to enjoy your favorite books.\nWith Kindle Unlimited, millions of digital books, audiobooks, comics, and magazines are at your fingertips. Learn how the monthly Kindle Unlimited membership works.\nLearn about the incredible digital playground that let kids safely discover a treasure trove of shows, books, podcasts, games, and more.\nA new era at Ring starts with detailed alerts that let you distinguish between urgent and everyday activity at a glance.\nEngineers rigorously tested the eero Outdoor 7 in extreme conditions to create a Wi-Fi solution that fit even the most demanding customer needs.\nAmazon Kids+ delivers award-winning original shows alongside thousands of books, games, and videos children love.\nFrom indoor cameras to Blink’s newest Video Doorbell (2nd gen), explore affordable smart security solutions for every corner of your home.\nWhat began as Charli Riggle's passion project is now Amazon's largest disability inclusion initiative, reaching employees worldwide.\nAmazon has been working to make its devices and services accessible to everyone for a decade, and the company is just getting started.\nWith over 250 million devices sold globally, Amazon expands its Fire TV lineup with a brand-new Omni Mini-LED Series and refreshed 4-Series—plus, the new Soundbar Plus Series.\nAmazon is introducing new accessibility updates, including a Dual Audio feature, expanded hearing aid support, and new tactile device packaging.\nKindle Scribe lets you take notes on millions of books and documents, write lists and journals, and even summarize and refine your notes using AI.\nAlexa+ is our next-generation AI assistant that gets things done—it solves daily problems, keeps you entertained, helps you stay connected, and can converse about virtually any topic.\nYou might also like\n- We’ve long believed that AI will transform every customer experience and industry. Whether you’re watching shows on your Fire TV, shopping for must-have products on Amazon.com, reading on Kindle, or one of the more than 100,000 enterprise customers using AI and machine learning services offered through AWS, check out how we’re innovating with AI.\n- An Amazon Prime membership comes with much more than fast, free delivery. Check out the shopping, entertainment, healthcare, and grocery benefits, plus updates available to members."
    },
    {
        "Ticker": "AMZN",
        "Company": "Amazon",
        "Source_URL": "https://www.aboutamazon.com/entertainment-news",
        "Content_Type": "Website Content",
        "Raw_Text": "Features include opt-in personalized bet tracking with FanDuel, customizable Multiview, and AI-powered Key Moments and Rapid Recap.\nStep into the Hudson Valley’s premier event space where one demanding entrepreneur and his young staff navigate event planning, workplace drama, and farm life challenges in this new unscripted series.\nFind out who’s playing, how to watch, and who won each week. Plus, get all the latest ‘Thursday Night Football’ news from Prime Video.\nPrime Video’s fourth season of ‘Thursday Night Football’ is packed with divisional matchups and features two holiday showdowns.\nThe two co-hosts will break down the biggest stories and highlights of the week in the world of sports, beginning Tuesday, November 25.\nFind out what films are coming to theaters and Prime Video, including ‘After the Hunt’ with Julia Roberts and ‘Culpa Nuestra.’\nCheck out the trailer for Celia Aniskovich’s forthcoming documentary, which follows five families that bring New York City’s sidewalks to life with Christmas trees every year.\nFour international friendlies will be available for pay-per-view order on Prime Video through new agreement with Integrated Sports Media.\nThe new destination transforms music listening into an interactive community for fans without having to leave the app. Rolling out in beta today to customers in Canada.\nCumberbatch brings his theatrical talents to Amazon's popular ‘5-Star Theater’ campaign, dramatically performing real customer reviews of holiday gift favorites.\nThe first three episodes of the second season of ‘Maxton Hall,’ based on the best-selling book series from Mona Kasten, are now available to watch.\nThe service translates between English and Spanish, and from German to English, expanding opportunities for Kindle Direct Publishing authors.\nExplore the real filming locations behind 'Maxton Hall: The World Between Us'—from Oxford cafés to a German castle—ahead of the Season 2 premiere on November 7.\nMichelle Pfeiffer leads an all-star cast in this holiday comedy about a mom who ditches family chaos for an unexpected Christmas adventure of her own.\nSettle in for holiday romance as Tyler Perry’s newest film features Shannon Thornton navigating love, career challenges, and unexpected connections in a snowy Colorado setting.\nAudible's cast for the series includes Hugh Laurie as Albus Dumbledore, Matthew Macfadyen as Lord Voldemort, and Frankie Treadaway as Harry.\nYou might also like\n- An Amazon Prime membership comes with much more than fast, free delivery. Check out the shopping, entertainment, healthcare, and grocery benefits, plus updates available to members.\n- We want to make it easy for employees to develop their skills to grow their careers. More than 700,000 employees globally have participated in our free education and skills training programs since 2019. We’ve also invested hundreds of millions of dollars to provide free cloud computing skills training to millions of people around the world with programs for the public."
    },
    {
        "Ticker": "AMZN",
        "Company": "Amazon",
        "Source_URL": "https://www.aboutamazon.com/artificial-intelligence-ai-news",
        "Content_Type": "Website Content",
        "Raw_Text": "Latest news about AI at Amazon\nRufus can search for products based on activity, event, purpose, and other use cases, and automatically add items to your cart, tell you if you’re getting the best price, find top deals every day of the year, auto-buy items at a set price, and take a handwritten grocery list and add the items to your cart.\nAWS addresses the critical AI skills gap by enabling professionals at any level to develop valuable expertise for today's high-demand roles.\nThe service translates between English and Spanish, and from German to English, expanding opportunities for Kindle Direct Publishing authors.\nAdvanced AI technology will transform handwritten notes and analog footage into a searchable database for scientists to gain deeper insights.\nThe subsea cable will create alternative data pathways between Maryland and County Cork, delivering fast and reliable cloud and AI services across the Atlantic.\nLearn how small-yet-impactful innovations, such as Amazon smile lights and improvements to the delivery app, are reshaping the experience of delivery drivers.\nIntroducing our most advanced Echo devices yet, featuring premium audio, next-generation AI processing and Omnisense sensor fusion for more proactive and personalized Alexa+ experiences.\nThe collaborative infrastructure innovation delivers nearly half a million Trainium2 chips in record time, with Anthropic scaling to more than one million chips by the end of 2025.\nPlanned investments of $40 billion in 14 APEC economies are projected to generate $45 billion for the U.S. GDP through adoption of American AI technologies and high-value job creation.\nHelp Me Decide expands Amazon’s suite of AI shopping tools, pairing you with the right product with the tap of a button.\nAmazon introduced a new agentic AI tool to help front-line employees as well as a robotics system to help expand Same-Day Delivery.\nFrom AI-powered predictions to specialized delivery vehicles, here’s how Amazon is bringing faster delivery speeds for a better shopping experience.\nAI-powered sensing capabilities and computer vision technology display real-time navigation and delivery instructions so drivers can rely less on their phones and more on their surroundings.\nDesigned with Amazon’s front-line employees in mind, these innovations reduce repetitive tasks, improve safety, and boost productivity—while speeding up delivery.\nAmazon Robotics has deployed these 10 robots across its operations, providing employees with the right technology to make their workday safer.\nThe models include Anthropic’s most intelligent model with advanced opportunities for agentic AI and sophisticated coding for AWS customers, as well as their most efficient model.\nAs organizations work to implement generative AI solutions, AWS continues to expand its certification portfolio to meet growing demand for validated AI expertise.\nQuick Suite helps you cut through the noise of fragmented information, siloed applications, and repetitive tasks to focus on what matters.\nNBA and AWS announce a partnership that will enhance broadcasts and provide fans with live stats to help them dive deeper into the game.\nThe all-new Kindle Scribe lineup is thinner, lighter, and faster with new productivity features, including AI-powered notebook search.\nRing's new technology powers neighborhood safety with ultra-clear video and features that turn cameras into community tools for pet owners.\nAmazon has invested $16.7B to support DSPs and their drivers throughout seven-year program history.\nAs world leaders gather for UNGA80, Amazon's Chief Global Affairs Officer discusses how Project Kuiper and responsible AI can address pressing global challenges.\nAWS continues to invest in being the best place to run open weight models with five new options that enhance model choice in Amazon Bedrock to further meet customers’ needs.\nYou might also like\n- We’ve long believed that AI will transform every customer experience and industry. Whether you’re watching shows on your Fire TV, shopping for must-have products on Amazon.com, reading on Kindle, or one of the more than 100,000 enterprise customers using AI and machine learning services offered through AWS, check out how we’re innovating with AI.\n- Every day, we invent on behalf of our customers, partners, and communities. We are focused on delivering a constellation of devices, services, and experiences that empower our customers to stay connected, safe, informed, productive, educated, and entertained. Our customers inspire us, and they’ve been at the heart of how we invent and evolve our products."
    },
    {
        "Ticker": "AMZN",
        "Company": "Amazon",
        "Source_URL": "https://www.aboutamazon.com/sustainability-company-reports-news-updates",
        "Content_Type": "Website Content",
        "Raw_Text": "Latest news about sustainability\nGet a first look at a future SMR (small modular reactor) that will help power AI and cloud services with advanced nuclear energy in the Pacific Northwest.\nAmazon's new delivery station doubles as an exercise in sustainability, packed with more than 40 market-ready technologies and systems designed to reduce its resource usage and shrink its carbon footprint.\nAcross the globe, we continue to find ways to reduce our packaging, while making the materials we use easier to recycle. Here’s a look at our progress so far.\nThe Pennsylvania Energy and Innovation Summit brought together Amazon leadership, policymakers, and energy and AI executives to advance U.S. technological leadership.\nAmazon is committed to decarbonizing its delivery fleet and has rolled out more than 25,000 custom electric delivery vans across the U.S.\nThe largest global technology investment announcement in Australia’s history will help build national AI capability and position Australia as a global AI and technology leader.\nThrough alternative delivery models (such as on-foot, Amazon Hub Delivery and e-bikes), Amazon packages reach customers in big cities.\nAmazon’s investment in its data center locations is helping create jobs, support economic growth, provide education and training opportunities, and much more.\nFrom recycling boxes to buying pre-owned products, here are a few ways to be more sustainable this Earth Month as an Amazon shopper.\nWith our Climate Pledge Friendly program, it’s easy to identify and buy over 1.4 million products with sustainability features across electronics, beauty, apparel, household, and more.\nAvailable through the Sustainability Exchange, this service will offer science-based carbon credits to suppliers, business customers, and Climate Pledge signatories.\nWith more than 600 projects worldwide, Amazon is also supporting solar and wind initiatives in regions with polluted grids to help curb emissions.\nThe investments in Butts and Douglas counties are expected to create hundreds of jobs and enhance Georgia’s position as a hub for cutting-edge digital innovation.\nThe investment is expected to create hundreds of new AWS jobs and support thousands of jobs in the local economy, while bolstering local communities across Ohio.\nYou might also like\n- We’ve long believed that AI will transform every customer experience and industry. Whether you’re watching your favorite show or movie on Prime Video, shopping for products on Amazon.com, asking Alexa a question, or one of the more than 100,000 enterprise customers using AI and machine learning services offered through Amazon Web Services (AWS), check out how we’re innovating with AI.\n- We aim to make our customers’ lives better and easier every day and to have a positive impact on our local communities all around the world, using our scale and abilities to take on some of society’s most pressing challenges."
    },
    {
        "Ticker": "AMZN",
        "Company": "Amazon",
        "Source_URL": "https://www.aboutamazon.com/amazon-relief-fund-news-community",
        "Content_Type": "Website Content",
        "Raw_Text": "Latest news about our community impact\nLearn how we invest in the community, help power the local economy, and support our employees in the Puget Sound region.\nGet the latest updates on how Amazon supports small businesses, creates jobs, sets up sustainability initiatives, and develops educational programs near AWS data centers.\nInvestment supports students, employees and those looking to expand their skills as the workforce adapts to changing economy.\nNew Oxford Economics research reveals communities with Amazon facilities experience more business growth, higher wages, and reduced need for public assistance.\nThe 2025 Pro Bono Report showcases how Amazon teams are expanding our impact with innovative AI tools, professional expertise, and by partnering with organizations to create lasting impact in underserved communities.\nThe inaugural Culture and Creative Industries Impact Report outlines how Amazon is helping bring local stories to global stages—through books, audio, Prime Video, live sports, and more.\nThe kits are produced for local first responders to use in the aftermath of disasters, designed to be as simple as flipping a light switch.\nFrom Afghanistan evacuations to Hurricane Helene relief efforts, AWS Wickr supports nonprofit and U.S. Army operations, enabling secure combat zone communications.\nAmazon donates and delivers emergency supplies to American Red Cross and other partners from our Disaster Relief hubs after disasters strike. Here's how our hubs work.\nAWS’s structured virtual training program removes the guesswork from starting a career in the tech industry.\nAs part of the White House's Pledge to America's Youth, Amazon will support AI skills training for 4 million learners and provide curricula for 10,000 educators by 2028.\nPlanned investment will establish multiple innovation campuses, create 1,250 jobs, and support new workforce development training programs and local community projects\nWhen hurricanes, wildfires, or other natural disasters strike, Amazon quickly meets community needs.\nPlanned investment in Richmond County will create hundreds of jobs and support new workforce development training programs and local community projects.\nAmazon’s investment in its data center locations is helping create jobs, support economic growth, provide education and training opportunities, and much more.\nGet the latest updates on how Amazon supports small businesses, creates jobs, sets up sustainability initiatives, and develops educational programs in data center communities.\nHigh school seniors received a $40,000 Amazon Future Engineer Scholarship to study computer science starting this fall with a paid internship opportunity."
    },
    {
        "Ticker": "AMZN",
        "Company": "Amazon",
        "Source_URL": "https://www.aboutamazon.com/about-us",
        "Content_Type": "Website Content",
        "Raw_Text": "Amazon’s “Day 1” mentality is our approach to doing everything with the energy and entrepreneurial spirit of a new organization on its first day.\nWorking to earn and keep our customers’ trust is the single biggest driver of Amazon’s Day 1 approach. Amazon’s decision-making process asks employees to consider whether an action is a one-way door—consequential and nearly irreversible—or a two-way door, easy to change course and go back. Discover more about who we are through our Leadership Principles.\nLearn more about us\n- Our workplace is made up of a talented, global team of individuals who work hard every day to create a great experience for customers, employees, partners, and the communities where we serve.\nWe invest in the success of our employees\nAmazon will spend over $1.2 billion to provide free skills training to employees—helping them further their careers in tech and in-demand roles such as cloud computing. Learn more about how we help our employees grow their skills and careers.\nLatest news\nCumberbatch brings his theatrical talents to Amazon's popular ‘5-Star Theater’ campaign, dramatically performing real customer reviews of holiday gift favorites.\nShop everything you need for the season, from fresh grocery and pantry essentials to electronics and beauty products to stocking stuffers under $10.\nA pivotal decision to invite independent sellers into Amazon’s store in 2000 has driven tremendous business growth for entrepreneurs while transforming the retail industry.\nAmazon and BMW Group collaborate to deliver more intelligent, conversational, and personalized in-car voice assistant experiences.\nNew automated micro-fulfillment center at a Whole Foods Market in Plymouth Meeting, PA lets customers simultaneously purchase natural, organic, and national name-brand products for online delivery or in-store pickup."
    },
    {
        "Ticker": "AMZN",
        "Company": "Amazon",
        "Source_URL": "https://www.aboutamazon.com/about-us/leadership-principles",
        "Content_Type": "Website Content",
        "Raw_Text": "Customer Obsession\nWe hold ourselves and each other accountable for demonstrating the Amazon Leadership Principles through our actions every day. Our Leadership Principles describe how Amazon does business, how leaders lead, and how we keep the customer at the center of our decisions. Our unique Amazon culture, described by our Leadership Principles, helps us relentlessly pursue our mission of being Earth’s most customer-centric company, best employer, and safest place to work.\nCustomer Obsession\nOwnership\nInvent and Simplify\nAre Right, A Lot\nLearn and Be Curious\nHire and Develop the Best\nInsist on the Highest Standards\nThink Big\nBias for Action\nFrugality\nEarn Trust\nDive Deep\nHave Backbone; Disagree and Commit\nDeliver Results\nStrive to be Earth’s Best Employer\nSuccess and Scale Bring Broad Responsibility"
    },
    {
        "Ticker": "AMZN",
        "Company": "Amazon",
        "Source_URL": "https://www.aboutamazon.com/about-us/shareholder-letters",
        "Content_Type": "Website Content",
        "Raw_Text": "Read earlier letters to our shareholders\nTo our shareowners: One thing we’ve learned from the COVID-19 crisis is how important Amazon has become to our customers. We want you to know we take this responsibility seriously, and we’re proud of the work our teams are doing to help customers through this difficult time.\nYou might also like\n- Amazon’s workplace is made up of a talented, global team of individuals who work hard every day to create a great experience for customers, employees, partners, and the communities where we serve.\n- Amazon employees use the Leadership Principles every day as we’re discussing ideas for new projects, deciding on the best solution for a customer's problem, or interviewing candidates."
    },
    {
        "Ticker": "AMZN",
        "Company": "Amazon",
        "Source_URL": "https://www.aboutamazon.com/about-us/amazon-reports",
        "Content_Type": "Website Content",
        "Raw_Text": "Employees are the heart of Amazon. It's why we're committed to providing employees with healthcare and financial benefits that start on day one, opportunities for career advancement, and a safe and equitable workplace.\n- Healthcare benefits start on Day 1 for many Amazon employees.\n- We've committed $1.2 billion to provide pre-paid education and free skills training to employees.\n- We’re continuing to make year-over-year progress on safety; in the U.S., we’ve improved our Recordable Incident Rate (RIR) by 28% and Lost Time Incident Rate (LTIR) by 75% since 2019.\n- At Amazon, we are committed to and invested in safety—it’s good for our people, for our customers, for our communities, and for business. Find out more about what we are doing to improve safety across our Amazon Operations.\n- New Oxford Economics research reveals communities with Amazon facilities experience more business growth, higher wages, and reduced need for public assistance.\nAmazon is committed to the success of small businesses. We invest billions of dollars annually to provide entrepreneurs with a constantly improving set of tools and resources to help them gain access to capital, quickly launch in our store, and build their brands.\n- More than 60% of sales in Amazon’s store come from independent sellers—most of which are small to medium sized businesses.\n- Independent sellers now employ over 2 million people in the U.S. in support of their Amazon selling business.\n- Independent sellers—who make up more than 60% of sales in Amazon’s store—have reached historic milestone, generating $2.5 trillion in sales.\n- Our fifth annual report highlights the continued success of our strategy to drive counterfeits to zero.\n- Amazon’s blueprint for public and private sector partnership to stop counterfeiters is our call for collaboration on the investments and innovations needed to protect consumers from counterfeit products.\nOur investments and job creation efforts have unlocked new opportunities for hundreds of thousands of families across the U.S. and around the world. But our support goes beyond creating jobs—we use our scale, technology, resources, and passion for invention to help the communities where we operate thrive.\n- Amazon has committed $2.4 billion to create or preserve affordable homes for over 50,800 residents, with properties required to remain affordable for 99 years to ensure generational stability for families.\n- We’ve delivered more than 60 million meals directly to over 200,000 households facing food insecurity.\n- Through programs like Amazon Future Engineer, Amazon has supported over 1.1 million students with 17 million+ hours of free STEM education.\n- In this report, we share a bit more about how we’re using our collaborative and innovative approach to create positive change in support of our communities, with a particular focus on the Puget Sound area.\nDownload the report (PDF) - Learn more about how we’re using our collaborative and innovative approach to create positive change in support of our HQ2 community in northern Virginia and National Capital Region neighbors.\nDownload the report (PDF) - The 2025 Pro Bono Report showcases how Amazon teams are expanding our impact with innovative AI tools, professional expertise, and by partnering with organizations to create lasting impact in underserved communities.\nDownload the report (PDF) - Amazon commissioned this report to deepen understanding of the impact of home delivery support for food assistance programs that quickly transport vital groceries to people in need for free.\nDownload the report (PDF) - When Amazon Web Services (AWS) invests in communities, there is a ripple effect of that investment. AWS investment in the US enables job retention, cloud training and education, community engagement, and long-term financial stability for individuals.\nDownload the study (PDF) - Our 2024 Pro Bono Report highlights how the legal team has devoted more than 65,000 hours of volunteer work to provide access to justice for underserved causes and communities.\nDownload the report (PDF) - Our 2023 Pro Bono Report highlights how the legal team has devoted more than 52,000 hours of volunteer work to provide access to justice for underserved causes and communities.\nDownload the report (PDF)\nWe strive to create real, long-lasting impact on our customers, the communities where we operate, and the planet. That means sustainability has become a core way in how we operate—from our transportation network to our packaging approach, carbon-free energy procurement and more—as we continue to make progress towards our Climate Pledge commitment.\nLearn more about our commitment to sustainability.\nLearn more about our commitment to sustainability.\n- Our 2024 Sustainability Report covers a range of priority topics, highlighting Amazon’s efforts to scale our work globally, collaborate with others, and invest in and innovate more sustainable solutions.\n- Copies of all filings we make with the Securities and Exchange Commission (SEC) are publicly available, including Form 10-Q quarterly reports, form 13F holdings reports, Form 8-K reports, and more.\n- Explore a variety of corporate governance documentation and reports, including letters to shareholders, our sustainable bond framework and allocation report, tax principles, and more."
    },
    {
        "Ticker": "AMZN",
        "Company": "Amazon",
        "Source_URL": "https://www.aboutamazon.com/news/retail/amazon-agentic-ai-gen-ai-shopping",
        "Content_Type": "Website Content",
        "Raw_Text": "Key takeaways\n- Amazon’s AI-powered innovations help customers find, discover, and evaluate products from our broad selection.\n- We work backwards from the customer to solve online shopping pain points and offer a variety of convenient next-gen conversational, visual, and auditory tools to help customers shop in a way that feels most natural.\nAmazon has been using AI to improve the customer shopping experience for over 25 years. What began as machine learning algorithms to recommend books has evolved into AI-powered tools that help customers quickly discover and evaluate products in our store.\nAmazon now offers the broadest selection in retail, carrying hundreds of millions of products, including more than 300 million items available with fast, free delivery for Prime members, across more than 35 categories including home, apparel, beauty, grocery, and household essentials. We offer this vast selection because Amazon customers expect a wide variety of options, but evaluating products and making a choice can take time. Let’s say you’re shopping for a coffee maker in a physical store—you might find five to 10 models on the shelf. In Amazon’s store, there are many more coffee maker options available. For one customer, a red single-serving coffee maker with an easy to clean filter may make the most sense; for another customer, an industrial-sized stainless steel multi-purpose espresso machine may be the perfect choice. Our shopping experience is personalized and designed to help customers find and discover the products that are right for them, using signals including reviews, price, availability, delivery speed, return rates, and browsing and shopping history.\nAI-powered search and discovery\nOur traditional search bar has long connected customers to Amazon’s broad selection and low prices, helping them quickly find the right products while sparking exploration and discovery. Over the past couple of years, we have further refined our search capabilities using AI, and our systems now better understand the intent behind a customer’s search. It's not just about matching keywords anymore—it's understanding what customers are actually looking to buy. This AI-powered approach is more effective and more comprehensive, better understanding the full context of what shoppers want.\nThese advancements in our traditional search models have enabled us to rapidly grow and experiment in next-gen search experiences. Our new AI-powered features are making shopping even more convenient by helping customers discover and evaluate products in whatever way feels most natural to them. We take an iterative approach to building and launching these experiences, often rolling them out in beta to test and learn what resonates with customers. If another feature better solves a customer pain point, we evolve and move on quickly.\n01 / 08\nBoth our feature set and rate of customer adoption continue to grow. For example:\n- More than 250 million customers have used Rufus this year; monthly users are up 140% YoY and interactions are up 210% YoY. Customers that use Rufus during a shopping journey are 60%+ more likely to convert.\n- Review highlights receive hundreds of millions of impressions weekly, and customers who engage with review highlights have increased by 100% year over year.\n- Hear the Highlights—which has expanded from hundreds of products at launch to millions of products currently—has been used by millions of customers who've streamed more than seven million minutes of content, with nearly half of all customers listening to full episodes.\n- Nearly 20% of customers who created Interests added a recommended item to their cart.\n- Photo searches in Amazon Lens have more than doubled since 2023, and the launch of Lens Live has increased engagement in Amazon Lens by 13%.\n- Billions of personalized size recommendations are generated each month for customers.\n- With Alexa+, we’re also seeing customers having deeper, more helpful shopping conversations, and when customers explore items, they are resulting in three times more on-device purchases compared to the classic Alexa.\n- Products available to purchase through our agentic AI experience Buy for Me have increased from 65K at launch to over half a million presently, and we’re seeing positive customer response as we show selection found both on- and off-Amazon.\nWe use AI in many ways to make shopping in our store more convenient for customers—here are some of the ways customers are using AI-powered features to shop:\nRufus – The all-in-one AI assistant for shopping\nRufus, our AI assistant for shopping, helps you shop smarter by answering any shopping question, providing personalized recommendations based on your shopping history, tracking prices, shopping agentically on your behalf, and more.\n- Use it when: You want to use an AI assistant purpose built for shopping that remembers your preferences, sets price alerts, purchase items for you, shops on-and off-Amazon brands, provides styling recommendations, compares items, reorders products, researches big purchases, digitizes handwritten lists, finds deals, and more.\n- Sample questions: “Buy this dress when it drops to $75,” “Order both pairs of headphones I browsed yesterday,” “Are these golf clubs right for me?,” “Are any items on my wish list on sale?,” “Based on what you know about my daughter, recommend holiday gifts for her,” “Is this a good price?,” “Find a pair of pants that look like this image.”\n- Find it: In the Amazon Shopping app (chat bubble with sparkles), on product detail pages via suggested questions, and in Amazon Lens Live.\nAI for product recommendations and discovery\nInterests\n- Use it when: You have a mainstream or unique interest and want to be notified when new selection is available in Amazon’s store.\n- Sample prompts: “Model building kits and accessories for hobbyist engineers and designers,” “latest pickleball gear and accessories,” “I'm looking for wall art to decorate my home. I want something abstract or modern made of black metal, not canvas. Maybe a geometric, minimalist piece. I'm into industrial-style decor that makes a statement, nothing too traditional or painted.”\n- Find it: The Interests button in the Me tab (pictured above in the left image).\nAmazon Lens and Lens Live\n- Use it when: You spot an item in person or on social media and want to find a visually similar item.\n- Use it on: As long as it’s available in Amazon’s store, anything!\n- Find it: The camera icon in the search bar (pictured in the above left image).\nBuy for Me\n- Use it when: You want to seamlessly purchase a product not available in Amazon’s store.\n- Sample searches: “Calpak backpack,” “Jenni Kayne candle,” “Faherty sweater.”\n- Find it: When you search for a brand in the Amazon Shopping app, you’ll see results found in Amazon’s store, and in some cases, additional relevant products from other stores labeled “Shop brand sites directly.” You can link directly to these sites, or in some cases, you’ll see a link to Buy for Me. You can also use Rufus to find items in the Buy for Me experience.\nAI for product research and evaluation\nHelp Me Decide\n- Use it when: You’ve viewed several similar products and want a tailored purchase decision made for you\n- Example: If you’re looking for a new tent and recently browsed cold-weather sleeping bags, looked at large stoves for car camping, and purchased hiking boots for kids, Help Me Decide may recommend an all-season, four-person tent that’s warm and spacious enough for the whole family’s upcoming adventure.\n- Find it: If customers have browsed similar products but haven’t made a purchase, the “Help Me Decide” button will appear at the top of the product detail page, or in “Keep shopping for” on the homepage and Me tab.\nReview highlights (Customers say)\n- Use it when: You’ve zeroed in on a product and want to quickly understand what customers say without spending a lot of time reading reviews. When you click on a product aspect, e.g., “speed” in the image above, you can also see how many times customers have mentioned that aspect, positive and negative review sentiment, and direct quotes from customers about that aspect of the product.\n- Find it: Directly above reviews on product detail pages where multiple customers have left reviews. You can also ask Rufus, “What do customers say?”\nHear the Highlights\n- Use it when: You prefer to listen or multitask rather than read product details, customer reviews, and additional product information.\n- Examples: Keurig coffee maker, Ninja personal blender, rain shower head.\n- Find it: On select product detail pages in the Amazon Shopping app directly under the product image.\nShopping Guides\n- Use them when: You want to research an unfamiliar category.\n- Sample categories: TVs, area rugs, dog food, running shoes, face moisturizers.\n- Find them: Shopping Guides automatically appear in “Keep Shopping For” and at Amazon.com/guides.\nPersonalized size recommendations\nPersonalized size recommendations consider your fit preferences, product details, such as style, size chart, and customer reviews, to suggest the best size for you, helping you find styles you will love and want to keep.\n- Use it when: You aren’t sure what size to purchase.\n- Find it: On apparel and shoe detail pages underneath product images.\nWe believe AI is going to change virtually every customer experience we know. We value feedback from customers on our AI-powered shopping features, using it to guide our product roadmap and evolve features to best serve their needs. We will continue to test, learn, and develop features in our store that help customers discover and evaluate products, making shopping even more convenient."
    },
    {
        "Ticker": "AMZN",
        "Company": "Amazon",
        "Source_URL": "https://www.aboutamazon.com/news/retail/amazon-rufus-ai-assistant-personalized-shopping-features",
        "Content_Type": "Website Content",
        "Raw_Text": "Our AI assistant now has account memory, understanding customers based on their individual shopping activity. Whether you’re an avid trail runner, a budding artist, a fashionista, or a documentary film buff, it provides more personalized, relevant, and helpful answers and product search results based on this information. If you’ve previously shared you have 5- and 8-year-old sons who love sports, a golden retriever that sheds, or that you prefer organic produce, it remembers those details and considers them while generating answers and product search results. For example, if you ask Rufus about gifts to buy your kids for the holidays, it knows to recommend age-appropriate books about legendary sports athletes, sports-themed video games for the Xbox, and athletic apparel. If you’re asking questions about the Roomba robotic vacuum cleaner, our AI assistant will highlight how cleaning up pet hair is a key feature of the Roomba. Or, if you’re searching for groceries to make your favorite pasta recipe, it will prioritize selection of organic tomatoes."
    },
    {
        "Ticker": "AMZN",
        "Company": "Amazon",
        "Source_URL": "https://www.aboutamazon.com/news/community/jamaica-caribbean-hurricane-melissa-amazon-disaster-relief",
        "Content_Type": "Website Content",
        "Raw_Text": "14 hours ago\nMeals are part of Amazon’s multi-faceted aid effort for hurricane-impacted communities\nWhen your home is no longer standing, every part of your life is altered—even eating three meals a day can be a challenge.\nTo help combat hunger after Hurricane Melissa, Amazon has partnered with Operation BBQ Relief, donating warehouse space near Tampa, Florida so the nonprofit could meet its goal to send more than 228,000 meals to Jamaica. Amazon also donated more than 67,000 shelf-stable food items for their meal boxes, including tuna, green beans, and milk.\nHurricane Melissa landed as the strongest hurricane to hit the island on Oct. 28, leaving a trail of devastation and displacing more than 30,000 households. Amazon’s Disaster Relief team, who work year-round to help communities after disasters strike, launched a multi-faceted aid effort to help Jamaicans recover from Melissa in partnership with more than eight nonprofits. As part of the effort, Amazon also donated:\n- 150,000+ emergency supplies—including tarps, generators, water filters, and hygiene kits—to communities in need from Amazon’s Disaster Relief hub near Atlanta. The items were delivered via Amazon Air.\n- 2,500+ pounds of free solar-powered batteries and Wi-Fi connectivity kits to enable emergency operations at hospitals, police stations, and community centers. This marked the first time Amazon delivered our new disaster relief technology kits outside of the U.S.\n- 8,800+ solar lights and power banks for communities still without electricity. After the Category 5 hurricane, repairing the island’s energy infrastructure may take months.\nAmazon’s nonprofit partners in Hurricane Melissa response include:\nAmazon’s relief partners encourage those who want to help to make a cash gift to a trusted nonprofit, as needs vary and unrequested items can cause more harm than good.\nSince 2017, Amazon has donated and delivered more than 26 million relief items, including tarps, water filters, and diapers, to support people impacted by more than 200 disasters worldwide. Amazon operates 15 disaster relief hubs around the world to assist communities in crisis and shares technology to help emergency responders assess and react to changing conditions.\nNovember 5, 2025 2:09 PM\nDonated tech is part of larger effort to support emergency response to Hurricane Melissa\nAmazon has donated a suite of portable technology solutions to power and connect hospitals, police stations, and emergency operations in Jamaica as part of our commitment to help Caribbean communities recover from Hurricane Melissa—one of the strongest hurricanes in history.\nThis marks the first time Amazon has delivered our new disaster relief technology outside of the U.S. The milestone flight landed today in Kingston with 2,500 pounds of solar-fueled batteries along with satellite-powered Wi-Fi connectors. Amazon’s disaster relief tech solutions previously supported Hurricane Helene and California wildfire recovery.\nAfter Hurricane Melissa caused widespread devastation across western Jamaica, much of the island faces weeks to months without power. Amazon’s nonprofit partners requested tech solutions to power their lifesaving operations, including providing healthcare to injured survivors, delivering meals to displaced families, and saving homes from further damage.\nThe tech relief is one part of Amazon’s larger Hurricane Melissa relief efforts. More than 150,000 emergency supplies—including urgently needed tarps, generators, water filters, and hygiene kits—have also been donated from Amazon’s Disaster Relief hub near Atlanta. The hub is stocked year-round with relief supplies so Amazon can help nearby disaster-impacted communities as quickly as possible. Amazon operates 15 Disaster Relief hubs around the world to help when disasters strike.\n“Amazon is working with multiple nonprofit partners to ensure communities in Jamaica get the help they need. To share a sense of the devastation caused by Hurricane Melissa, almost no building in Black River is standing or protected by a roof after the storm, including homes, the library, and the school. To get aid where it’s needed, roads must be cleared, space for emergency supplies must be found, and specific needs must be assessed. The recovery effort for the Caribbean will take many hands, and being part of this global effort represents the very best of Amazon,” said Amazon’s Head of Disaster Relief Abe Diaz.\nGetting food where it’s needed is another way Amazon is helping after Hurricane Melissa. Amazon donated warehouse space near Tampa, Florida to the nonprofit Operation BBQ Relief. Its now buzzing with activity as the nonprofit prepares more than 180,000 meals for hurricane-impacted families in Jamaica.\n\"Amazon's donation of its distribution facility has transformed this relief effort from aspiration to reality. The warehouse space, dock access, and infrastructure provided means we can reach thousands of Jamaican families who desperately need support. Every meal kit assembled here represents hope, nourishment, and dignity for people facing crisis. This isn't just logistics—it's compassion at scale,\" said Jeremy Bruce, Operation BBQ Relief senior head of technology, volunteers and communications.\nAmazon’s partners in Hurricane Melissa response include:\nSince 2017, Amazon has donated and delivered more than 26 million emergency supplies and shared lifesaving technology in response to more than 200 hurricanes, wildfires, floods, and other natural disasters. Learn more about our disaster relief efforts.\nOctober 28, 2025 4:12 PM\nOur focus is helping as quickly as possible as Melissa lands as the strongest storm to ever hit Jamaica\nAmazon is working closely with UN agencies and other first responders to ensure communities in Jamaica and the Caribbean have the emergency supplies and technological resources they’ll need to recover as quickly as possible from Hurricane Melissa, a slow-moving storm with record-breaking strength.\nHurricane Melissa made landfall Tuesday in Jamaica as a Category 5 storm, the strongest to directly hit the island since records began and the most powerful storm in the world this year. Hurricane Melissa is also impacting Cuba, the Bahamas, Bermuda, and other Caribbean islands.\nAmazon is positioning supplies for nonprofits and first responders from our Disaster Relief hub near Atlanta, which is stocked with tarps, blankets, medical devices, and other emergency supplies so that Amazon can help nearby disaster-impacted communities within hours. Amazon operates 15 Disaster Relief hubs around the world to quickly respond to disasters when they strike. Employee and partner safety is Amazon’s first priority in the wake of Hurricane Melissa. Dedicated teams are working around the clock to provide alerts and up-to-date information to inform operational decisions.\nIn response to Hurricane Melissa, Amazon is also serving as a technology advisor to help communities restore power and internet connectivity as soon as possible as the storm is expected to cause catastrophic infrastructure damage and isolate communities. Emergency donations from Amazon are being coordinated for delivery by ocean and air.\n\"My heart is with everyone in Melissa’s path,\" said Amazon's Head of Disaster Relief Abe Diaz. \"As someone who grew up in Puerto Rico, I’ve experienced the devastating damage hurricanes like Melissa can inflict, but I’ve also experienced the power of communities acting together for a common cause. Amazon’s approach to supporting communities starts with listening to local organizations about what people actually need. We've positioned donated emergency supplies at our Atlanta Disaster Relief hub to use Amazon's logistics capabilities to get them to communities quickly. What matters most is that these supplies reach the right places at the right time to support community-led recovery efforts.“\nOur partners in Hurricane Melissa response include:\nSince 2017, we have donated and delivered more than 26 million emergency supplies and shared lifesaving technology in response to more than 200 hurricanes, wildfires, floods, and other natural disasters. Learn more about our disaster relief efforts."
    },
    {
        "Ticker": "AMZN",
        "Company": "Amazon",
        "Source_URL": "https://www.aboutamazon.com/news/retail/amazon-autos-buy-cars-online-ford",
        "Content_Type": "Website Content",
        "Raw_Text": "Customers looking to buy their next vehicle online can now browse, finance, purchase and schedule pick-up for thousands of certified pre-owned models available from their local Ford dealer on Amazon Autos. All certified pre-owned vehicles from participating Ford dealers are backed by Ford Blue Advantage warranties.\nFord offers three certification levels to meet a range of customer needs. Gold Certified vehicles undergo a 172-point inspection, with a 12-month/12,000-mile (whichever comes first) limited warranty covering more than 1,000 components. EV Certified vehicles receive a specialized 127-point inspection, with a 12-month/12,000-mile comprehensive limited warranty covering more than 1,000 components. Blue Certified vehicles, which may include Ford and other brands, come with a 90-day/4,000-mile (whichever comes first) limited warranty. Each tier of protection comes with roadside assistance, offering customers peace of mind within the convenience of the Amazon Autos store.\nQualified customers may also be eligible to secure financing through one of several lenders for their next used vehicle.\n“The addition of Ford certified pre-owned vehicles to Amazon Autos represents an exciting expansion of our store, giving customers access to thousands of quality vehicles backed by Ford's comprehensive inspection and warranty programs, said Fan Jin, global leader of Amazon Autos. “By working with exceptional Ford dealers who share our commitment to customer service, we're creating a car buying experience that combines trusted vehicle certification with the convenience Amazon is known for. “\n“We are excited to support our dealers in launching Ford Blue Advantage vehicles (CPO) on Amazon Autos,” said Robert Kaffl, executive director, Ford U.S. Sales and Dealer Relations. “Amazon Autos allows Ford Dealers to offer their certified pre-owned vehicles through Amazon’s accessible digital platform, while maintaining the benefits that customers enjoy from their relationships of our Ford Dealers. It’s about delivering the best of both worlds to our customers.”\nAmazon Autos connects customers with trusted dealers across the country, allowing them to seamlessly browse, finance, and purchase new, used, and certified pre-owned vehicles online. As part of the experience, customers can browse inventory from a participating Ford dealer within a 75-mile radius and shop certified pre-owned cars and trucks by various criteria, including make, model, year, and color. Each vehicle listing includes transparent, itemized pricing, vehicle history, and full specifications.\nOnce a customer decides on a vehicle, they can secure financing, start paperwork, and schedule a convenient pickup time at their local Ford dealer. Streamlining the initial shopping and financing steps frees up time at the dealership to allow dealers to focus on the valuable in-person experience.\nTrusted dealers, trusted protection\nAll certified pre-owned vehicles sold by Ford dealers on Amazon Autos undergo a thorough inspection process and comes with a 14-day/1,000-mile money back guarantee through Ford Blue Advantage. Customers shopping on Amazon Autos can view service history and condition reports for added transparency.\nEach comprehensive limited warranty provides protection for key parts such as the engine, battery, transmission, and electrical system. Participating Ford dealers may also offer extended service plans for customers seeking additional coverage, offering customers more confidence in their online vehicle purchase.\nFor Ford dealers, Amazon Autos creates a new digital channel to showcase their certified pre-owned inventory to millions of Amazon customers. Dealers maintain their essential role in the transaction, including setting pricing, vehicle delivery, service, and building ongoing customer relationships.\nFord certified pre-owned vehicles are now available on Amazon Autos in Los Angeles, Seattle, and Dallas with plans to expand to additional cities in the coming months."
    },
    {
        "Ticker": "AMZN",
        "Company": "Amazon",
        "Source_URL": "https://www.aboutamazon.com/news/entertainment/golf-prime-video-skins-game",
        "Content_Type": "Website Content",
        "Raw_Text": "Prime Video will broadcast the the Skins Game golf event the morning of November 28 before the third annual Black Friday Football game and a brand-new NBA on Prime doubleheader. This will be the first iteration of one of golf’s most celebrated television franchises since its last event in 2008.\n“We’re thrilled to help relaunch the Skins Game as part of an unprecedented day of live sports on Prime Video this Black Friday,” Charlie Neiman, Prime Video’s head of sports partnerships, said. “Partnering with PGA TOUR Studios, Pro Shop, and Propagate Content to broadcast this storied event with four of the game’s most captivating stars opens more than 15 hours of exclusive live sports coverage on Prime Video, and underscores our commitment to delivering innovative, premium sports programming to fans around the world.”\nThe Skins Game will feature Tommy Fleetwood, Shane Lowry, Xander Schauffele, and Keegan Bradley. The event will be played at Panther National golf course in Palm Beach Gardens in Florida.\nHere’s everything you need to know about the Skins Game on Prime Video, including how to watch the iconic golf event.\nHow to watch the Skins Game golf event on Prime Video\nCoverage of the Skins Game will begin at 9 a.m. ET, exclusively on Prime Video.\nPrime Video is included with a Prime membership, which costs $14.99 per month or $139 per year. Amazon also offers discounted membership options providing the same benefits of a regular Prime membership at only 50% of the cost for young adults and qualifying government assistance recipients.\nPrime Video is available on hundreds of compatible devices. Stream from the web or using the Prime Video app on your smartphone, tablet, set-top box, game console, or select smart TVs. Prime Video content can also be downloaded for offline viewing on iOS, Android, and Fire devices.\nWhat is the Skins Game?\nOriginally introduced in 1983 as an unofficial money event on the PGA TOUR, the Skins Game became a staple on the sports calendar, showcasing high-stakes competition among golf’s biggest stars, including Jack Nicklaus, Arnold Palmer, Fred Couples, Gary Player, and Tiger Woods.\nThe format for this version will remain true to the traditional structure, where each hole carries a dollar value and tied holes roll over to raise the stakes.\nThe Skins Game will feature a “reverse purse” where all players will begin the competition with $1 million on the scoreboard. Fans will watch as the players’ fortunes rise and fall with every hole won or lost, adding a new layer of tension, drama, and strategy to every shot.\nWhat else can I watch on Prime Video?\nThere are plenty of other Amazon Original series to watch on Prime Video, like The Lord of the Rings: The Rings of Power, Fallout, The Boys, and Reacher. Members can also stream programming from partners such as Apple TV+, HBO Max, Crunchyroll, MGM+, Peacock Premium Plus, and FOX One via Prime Video subscriptions, as well as more than 800 free ad-supported (FAST) Channels."
    },
    {
        "Ticker": "AMZN",
        "Company": "Amazon",
        "Source_URL": "https://www.aboutamazon.com/news/entertainment/the-game-awards-prime-video",
        "Content_Type": "Website Content",
        "Raw_Text": "The event will air live from the Peacock Theater in Los Angeles at 8 p.m. ET. and stream globally on Prime Video at no additional cost with a Prime membership.\nThe Game Awards will honor the year’s best games and creators. It also features feature world premieres, major new game announcements, and musical performances.\nHere's everything you need to know about The Game Awards, including how to watch the event on Prime Video.\nHow to watch 'The Game Awards' on Prime Video\nA Prime membership costs $14.99 a month or $139 annually.\nAmazon also offers discounted membership options providing the same benefits of a regular Prime membership at only 50% of the cost. Young adults (ages 18–24) and college students can try Prime for Young Adults. Qualifying government-assistance recipients can try Prime Access.\nWhat is 'The Game Awards'?\nThe Game Awards is an annual celebration honoring achievements in the video game industry. Created and hosted by Geoff Keighley, the event combines award presentations with world premieres of upcoming titles, major new game announcements, and musical performances.\nThe show has grown significantly since its 2014 debut, with the 2024 edition reaching more than 154 million livestreams across all platforms, including YouTube, Twitch, X, and TikTok, and co-streamed by more than 11,000 creators.\nThe Game Awards will include Twitch Drops, rewarding Twitch viewers who watch 30 minutes or more with exclusive in-game content and a limited-edition TGA chat badge. Details on this year’s Drops campaign will be revealed closer to the event.\nDuring the live broadcast, viewers can expect Prime-exclusive, limited-time deals across nominated games, new releases, hardware and more, revealed in real time and running for up to 24 hours, while supplies last.\n'The Game Awards' nominees\nClair Obscur: Expedition 33 and Death Stranding 2: On the Beach lead this year's nominations, with Clair Obscur appearing in an impressive nine categories and Death Stranding 2 in seven.\nBoth titles are competing for the prestigious Game of the Year award alongside Donkey Kong Bananza, Hades 2, Hollow Knight: Silksong, and Kingdom Come Deliverance 2. Clair Obscur also earned three separate acting nominations in the Best Performance category, while also dominating technical categories including Art Direction, Audio Design, and Score & Music.\nOther strong contenders include Ghost of Yōtei with six nominations across artistic and narrative categories, while Hades 2 and Hollow Knight: Silksong tallied five nominations each. Meanwhile, Grand Theft Auto 6 remains the most anticipated upcoming title despite not being eligible for other awards this year."
    },
    {
        "Ticker": "AMZN",
        "Company": "Amazon",
        "Source_URL": "https://www.aboutamazon.com/news/community/amazon-seattle-bellevue-puget-sound-news",
        "Content_Type": "Website Content",
        "Raw_Text": "21 hours ago\nHonoring service and strength from Seattle\nFrom November 4-11, Amazon proudly joined Operation Green Light for Veterans—a nationwide effort led by the National Association of Counties (NACo) and the National Association of County Veterans Service Officers (NACVSO) to shine a green light in support of veterans, service members, and their families. Across the country, hundreds of Amazon buildings glowed green as a symbol of gratitude and unity.\n\"By lighting hundreds of Amazon buildings green across the country for Operation Green Light, we're proud to stand alongside the National Association of Counties in honoring those who have served,\" said Charlotte La Belle, head of Amazon's global military affairs and U.S. Army veteran. \"Veterans bring exceptional leadership, expertise, and dedication to Amazon every day. This initiative reflects our deep commitment to supporting their transition to roles in the private sector and encouraging other organizations to join us in celebrating and supporting our veteran community.\"\nAcross the Puget Sound region, Amazon employees are turning their own lights green at home and volunteering with local veteran-focused organizations, creating a ripple of appreciation that extends beyond the workplace. The Warriors at Amazon employee-led group—representing more than 20,000 members globally—continues to lead by example, championing mentorship, service, and community engagement that strengthens Amazon's culture of belonging. Their dedication reminds us that honoring service isn't just about recognition, it's about action.\nAs Amazon sites across Washington state joined in, Operation Green Light became more than a visual tribute—it became a reminder of Amazon's ongoing commitment to opportunity, belonging, and community for those who've served. Each act of service and each light, from Seattle to Spokane, illuminated what it means to stand united in gratitude.\nNovember 6, 2025 8:59 AM\nAmazon expands its support for Puget Sound food banks with over $2 million in additional funding\nAmazon is dedicated to ensuring communities have reliable access to food year-round. As part of our overall commitment, we’ve donated an additional $2 million+ to local food banks in the Puget Sound region to meet increased demand. Throughout 2025, we’ve also used our transportation network to deliver more than 4.5 million meals, on behalf of local food banks, directly to Puget Sound residents and have donated more than 2.8 million meals to local community organizations to help those experiencing hunger in Washington state.\n\"Food security remains a serious challenge in the Puget Sound region, with recent demand on local food banks reaching record levels,\" said Bettina Stix, global director of community impact at Amazon. \"These donations combined with Amazon’s free home delivery and bulk delivery services offered to food banks strengthen the infrastructure of our local food system and ensure our neighbors have reliable access to nutritious meals.\"\nThe contributions support key regional organizations addressing food insecurity, including Food Lifeline, Snoqualmie Food Bank, Edmonds Food Bank, Northwest Harvest, and Emergency Food Network. These funds will help provide thousands of families with nutritious meals, holiday food assistance, and year-round hunger relief services.\nAmazon helps food banks reach more people using our established last-mile infrastructure and logistics expertise. On top of financial donations, our delivery network—including Delivery Service Partners, Amazon Flex, and Amazon Shipping—has delivered more than 60 million meals directly to over 200,000 families experiencing food insecurity across the United States since 2020.\nWe also provide bulk transportation services for free, moving tens of thousands of pounds of food weekly between suppliers, food banks, and community distribution points using our fleet of vehicles. In addition, our grocery stores regularly donate excess food donations to local food banks. Together, these efforts help ensure food reaches families in need regardless of transportation costs, barriers, or mobility challenges.\nOctober 29, 2025 9:00 AM\nAmazon and Gary Sinise Foundation donate vital equipment to Puget Sound area firefighters\nThe donation included a $56,000 grant to the Bellevue Fire Foundation for thermal imaging cameras that allow firefighters to see through smoke and darkness, and $50,000 to South King Fire Department in Federal Way for 14 self-contained breathing apparatuses and two night-vision helmets.\nDuring the events, Amazon volunteers and local public officials served meals to first responders to thank them for their service and dedication to community safety.\n\"First responders play an essential role in keeping our communities safe, and we're proud to support the Gary Sinise Foundation to help ensure fire departments across Puget Sound have the equipment and resources they need,\" said Dean Allsopp, community engagement manager for Amazon.\nWith this recent contribution, the total amount of first responder grants provided across Washington state now exceeds $450,000. Previous grantees include Spokane County Fire District 10, Franklin County Fire District, Everett Fire Department, West Pierce Fire and Rescue, and Seattle Fire Department.\n\"Through our partnership, Amazon has displayed incredible compassion for our mission and a commitment to delivering direct meaningful impact to the heroes of our communities, the first responders who put their lives on the line every day to keep us safe,\" said Chrissy Kreisel, senior director of corporate and foundation relations at the Gary Sinise Foundation.\nThe Gary Sinise Foundation was established in 2011 by actor and humanitarian Gary Sinise, who has supported veterans, first responders, and defenders for more than 40 years. Amazon's three-year partnership with GSF extends beyond Washington state, supporting programs including annual healing retreats for families of fallen heroes and the construction of specially adapted smart homes nationwide.\nSeptember 30, 2025 3:34 PM\nCelebrating culture and community at Seattle's 18th annual Chinatown International District (CID) Night Market\nLast year, Amazon stepped up and supported the CID Business Improvement Area to bring the Night Market back to the historic neighborhood.\nAmazon proudly presented the 18th annual Chinatown-International District (CID) Night Market Saturday, September 26, marking the company's second consecutive year supporting the vibrant community celebration. During the event, the historic streets of Seattle's CID were transformed into a lively festival featuring more than 100 local vendors, performers, and thousands of neighbors and community members.\n\"The Night Market has always held a special place in my heart. Growing up in the Chinatown-International District, I experienced firsthand how these cultural celebrations strengthen the fabric of our community,\" said Taylor Hoang, senior manager for Community Engagement at Amazon. \"This isn't just about one day and one night of festivities, it's about honoring traditions, supporting family-owned businesses, and ensuring this historic neighborhood continues to thrive. That's what being a good neighbor truly means—showing up consistently and contributing meaningfully to the communities where we live and work.\"\nThis year's Night Market overlapped with the Mid-Autumn Moon Festival, a 3,000-year-old tradition celebrated across Asia that marks the end of the summer harvest. The Seattle celebration made its debut in August 2006 as a small gathering organized by the youth leadership group WILD (Wilderness Inner-city Leadership Development) to bring residents, visitors, and vendors into the neighborhood as part of National Night Out. In 2023, the Night Market was canceled due to a lack of sponsorship. The following year, Amazon stepped in with a $250,000 three-year commitment as the lead sponsor.\n\"The Night Market is a great event because it shows what the neighborhood could look like at its peak,\" said Tuyen Than, executive director of the Chinatown-International District Business Improvement Area. \"And that's what we're going for: a Night Market, but all throughout the year.\"\nSeptember 26, 2025 10:12 AM\nAmazon celebrates grand opening of Rainier Valley Food Bank's new facility\nThe Rainier Valley Food Bank celebrated the grand opening of its newly renovated facility this month, welcoming hundreds of community members to the expanded space. Amazon contributed $1 million to the food bank's capital campaign, helping support its transformation from a small 1,200-square-foot location into a nearly 12,000-square-foot resource center.\n\"Amazon's generous contribution to Rainier Valley Food Bank directly addresses one of our city's most pressing challenges—ensuring all Seattle residents have access to affordable, nutritious food,\" said Seattle Mayor Bruce Harrell. \"As we continue efforts to expand healthy food access, we recognize this investment doesn't just expand a building - it strengthens a vital community resource that provides dignity, nutrition, and hope for thousands of South Seattle residents.\"\nAmazon's contribution reflects the company's commitment to addressing food insecurity in its hometown communities. Using the same delivery network that serves our retail customers, Amazon partners with food banks like Rainier Valley Food Bank to bring groceries directly to the doorsteps of families in need for free. Since 2020, Amazon has delivered more than 50 million meals across the US and UK, including 4.5 million meals in the Puget Sound region alone.\nThe renovation of Rainier Valley Food Bank not only expands its footprint, allowing for more space to help people in need, but it also creates an elevated shopping experience and offers services beyond only food distribution. This includes:\nA grocery-store-style shopping area with refrigerated sections, fresh produce, and essential items\n- A commercial kitchen for preparing ready-to-go lunches and hot meals\n- A dedicated resource center providing housing assistance and employment information\n- Outdoor courtyard and garden space for community gatherings\nThe new facility is now open providing essential services to South Seattle residents in need. Learn more about Amazon's commitment to food security and how we're helping fight hunger in our communities.\nSeptember 19, 2025 4:33 PM\nAmazon housing fund supports groundbreaking of Mary's Place and Mercy Housing Northwest family shelter and affordable housing in Burien\nWith support from Amazon, Mary's Place and Mercy Housing Northwest broke ground today on a project that will combine an emergency family shelter with permanent affordable housing. The campus will provide shelter and comprehensive services for 200 family members alongside 90 units of affordable housing, including 34 units designated for families transitioning from homelessness to stable housing.\nThe Burien campus represents a new approach to addressing family homelessness by creating a seamless pathway from crisis to stability. Families will benefit from wraparound services including health resources, educational support, and economic empowerment programs as well as connections to schools and community networks.\n\"Amazon has a long history of support for Mary's Place, and we're humbled to support both Mary's Place and Mercy Housing Northwest in this project. Public-private partnerships are essential as we tackle complex challenges, including homelessness,\" said David Zapolsky, chief global affairs and legal officer at Amazon. \"Amazon is proud to support innovative solutions that make a tangible difference in our communities. This project represents a significant step forward in our collective efforts to ensure every family has a safe place to call home.\"\nGovernor Bob Ferguson emphasized the collaborative nature of the initiative: \"Housing is too expensive in Washington, and there is not enough of it. For many Washingtonians, this campus will be a path from crisis to stability—and a place to call home.\"\nWhen the project is completed in 2027, the campus will stand as a model, here and elsewhere, for how communities can address family homelessness.\n\"This project represents a fundamental shift in how we approach family homelessness,\" said Dominique Alex, chief executive officer of Mary's Place. \"By collocating emergency shelter with affordable housing, we're creating a true continuum of care that allows families to rebuild their lives without the disruption of moving to unfamiliar neighborhoods. This model recognizes that stable housing is critical, and it's exactly what families tell us they need most. We are deeply grateful for the tremendous support from so many partners, funders, and advocates who have helped us reach this milestone.\"\nSeptember 12, 2025 9:59 AM\nCelebrating 10,000 affordable homes: Partnerships driving housing impact across Puget Sound\nWhen Amazon announced our housing commitments in 2021, we set ambitious goals to address the affordable housing crisis in our hometown communities. Today, thanks to collaboration with community organizations, public officials, and mission-aligned developers, we've reached a significant milestone: more than 10,000 affordable homes created or preserved across the Puget Sound region. What makes these investments truly special is our commitment to ensuring these properties remain affordable for 99 years—securing housing stability for generations to come.\nThis achievement represents over $900 million in housing investments in the Puget Sound, benefitting 22,000 residents. Behind these numbers are families with access to stable, quality housing near jobs, schools, and transportation.\n\"When I think about these affordable homes, I see families finding stability and new opportunities,\" said Alice Shobe, director of community impact at Amazon. \"I'm grateful to celebrate this milestone with our amazing housing partners, passionate community advocates, and the local officials who've championed these efforts. These are solutions that will make a difference for generations to come.\"\nThese 10,000 homes represent meaningful collaborations across the Puget Sound region. From our $100 million commitment to transit-oriented housing in Bellevue, to partnering with BRIDGE Housing to preserve 200 affordable apartments in Kirkland, each project responds to unique local needs. The Four Amigos Beloved Community in Seattle's Columbia City neighborhood offers multi-generational families spacious homes near light rail, with the newly-opened Connection Angle Lake with Mercy Housing Northwest providing 130 energy-efficient homes.\n\"Amazon's partnership has been transformative for affordable housing development in the Puget Sound region. Their approach combines critical financial resources with a genuine commitment to long-term community stability through 99-year affordability requirements,\" said Joe Thompson, president, Mercy Housing Northwest. \"At Connection Angle Lake, this partnership allowed us to create not just housing, but a community where residents can thrive near transit, jobs, and services.\"\nAmazon is energized by what these partnerships have accomplished and are actively seeking additional opportunities to collaborate. Amazon's housing fund is currently accepting applications for Puget Sound projects through September 30.\nAugust 4, 2025 12:11 PM\nPrime Video, Seattle Seahawks, and Smithsonian team up to spark a love of reading in Seattle youth\nPrime Video, the Seattle Seahawks, and the Smithsonian Institution brought their \"TNF for Good\" literacy initiative to Boys & Girls Clubs of King County's Ballard location.\nMore than 125 kids were helped by Amazon volunteers to choose from a \"lawn library\" of over 1,300 books that were on display at the event. Those who attended designed bookmarks, engaged with Seattle Seahawks Legend Ben Obomanu, and took photos with Seahawks mascot Blitz.\nThe Seattle event represents one stop in the nationwide Thursday Night Football collaboration between Prime Video, Boys & Girls Clubs of America, and the Smithsonian that aims to donate 1 million books to youth across all NFL markets in 2025. The effort reflects the partners' shared commitment to promoting literacy and fostering a love of reading among young people.\n\"Having a partner like the Smithsonian curate a collection of books rich in diverse stories and perspectives reflects the vibrancy of our 32 Clubs. At Boys & Girls Clubs, we use these stories to spark a love of reading that fuels imagination, and when a young person's imagination is ignited, it opens the door to a thriving, full life,\" Boys & Girls Clubs of King County CEO Lori Bae said. \"We're especially grateful to the Seattle Seahawks, who go beyond the game by sending their support with legends, dancers, and Blitz to inspire and encourage our youth. And to Amazon, who consistently shows up to ensure every young person has access to the tools, experiences, and support they need to thrive.\"\n\"There's something truly magical about watching a child's face light up when they find a book that speaks to them,\" said Kevin Burkhart, board member of Boys & Girls Clubs of King County and director of Echo Product & Marketing at Amazon. \"Being here today reminds me why this work matters so much. These moments create lasting impact that will extend far beyond today.\"\nJuly 28, 2025 1:18 PM\nAmazon and Ascend Hospitality Group support 800 Bellevue students with back-to-school event\nIn celebration of the new school year, Amazon and Ascend Hospitality Group (AHG) teamed up for the fifth year of \"Ascend Has Your Back,\" providing backpacks to 800 local students in need. Students enjoyed an afternoon at a \"Summer of Soccer\" party at Amazon Fresh in Bellevue, where they received backpacks for school, personalized their packs with school supplies and fun keychains, played soccer-influenced games, met members of the Eastside's new pre-professional soccer club Midlakes United, and enjoyed lunch courtesy of Amazon.\nAmazon's Chief Global Affairs and Legal Officer David Zapolsky joined Bellevue Mayor Lynne Robinson, Bellevue Deputy Mayor Mo Malakoutian, and AHG Co-Founder and CEO Elaina Morris at the event. Five nonprofit partners—Boys & Girls Club of Bellevue, Rainier Athletes, Bellevue Family YMCA, Bellevue Lifespring, and 4 Tomorrow—also participated alongside dozens of Amazon volunteers to help students prepare for the school year. Amazon Fresh provided hundreds of healthy snacks for students to take home.\n\"Education is a huge part of what we care about, and we want to do what we can to ensure access to education for all students in our communities,\" said David Zapolsky, Chief Global Affairs and Legal Officer at Amazon. \"In 2017, we started Amazon Future Engineer, and we've been able to reach more than 2 million students around the world, including students in Bellevue, with everything from elementary school exposure to STEM to post-secondary scholarships. I continue to be inspired by our community's efforts to support students.\"\nJuly 25, 2025 3:25 PM\nBumbershoot Gives Back, powered by Amazon, turns music passion into community action\nAmazon and Bumbershoot kicked off their second annual Bumbershoot Gives Back, powered by Amazon, campaign at Rainier Beach Urban Farm and Wetlands. Volunteers gathered to harvest crops in support of food security efforts across the Puget Sound and in return, receive a free ticket to Bumbershoot.\nThe initiative builds on last year's success, which resulted in 127,000 pounds of food collected for local food banks. This year, the program aims to mobilize more than 2,000 community volunteers to support food banks in delivering 15,000 meals. As a thank you, each volunteer will receive a free two-day festival ticket. It's a powerful incentive to address one of our region's most pressing challenges—one in 10 Washingtonians faces food insecurity.\n\"Seattle's arts and music scene is core to this city's identity and an integral part of our cultural fabric,\" said David Zapolsky, Amazon chief global affairs and legal officer. \"We're extending Bumbershoot Gives Back, powered by Amazon, mobilizing 2,000 volunteers and employees to provide 15,000 meals to those in need across 14 food banks in the Puget Sound. This initiative reflects how the arts can be a catalyst for addressing critical needs in our communities, and Amazon's commitment to supporting local traditions and the food security of our neighbors. When we combine Seattle's creative spirit with direct community action, we can transform the joy of music into meaningful impact for those who need it most.\"\nSince stepping in as a title sponsor in 2023 following a four-year hiatus, Amazon has helped revitalize Bumbershoot, making it more accessible through reduced ticket pricing and providing thousands of free tickets to underserved communities. The festival now welcomes approximately 40,000 attendees over Labor Day weekend, August 30-31. Learn more and sign up to volunteer.\nJune 23, 2025 2:04 PM\nAmazon employees beautify Puget Sound communities during Global Month of Volunteering\nAs part of Amazon's fourth annual Global Month of Volunteering (GMV), more than 7,600 employees volunteered their time at more than 580 different events across the Puget Sound. From downtown Seattle to Bellevue and places in between, teams of employees worked with more than 220 community organizations to clean up local parks, pack essential supplies, and prepare and serve food.\nIn Bellevue, Amazonians participated in the City of Bellevue’s \"Keep Bellevue Beautiful\" initiative. Volunteers fanned out across downtown Bellevue, collecting trash and debris to enhance the city’s shared spaces.\n“We are grateful for the opportunity to be part of the 'Keep Bellevue Beautiful' initiative,” said Beryl Tomay, VP of Amazon Transportation. “Our volunteers' efforts reflect Amazon's commitment to the communities where we live and work.”\nThese park and neighborhood cleanups represent just a fraction of GMV's impact. From joining Backpack Brigade to pack weekend food bags for Seattle students who rely on school meals, to hosting mock interviews and resume building sessions for adults in need of work, employees worldwide volunteered alongside community organizations where support is needed most.\nAmazon’s community engagement extends beyond volunteer hours. We're working side-by-side with community partners to increase access to affordable housing, alleviate hunger, strengthen education, and help those impacted by natural disasters when they occur. Since 2021, Amazon has donated more than $244 million to local charities and nonprofit organizations across the region, while investing $720 million through Amazon's housing fund to preserve and create over 9,900 affordable homes throughout Puget Sound.\nJune 17, 2025 1:59 PM\nAWS, Seattle Seahawks, and Play Like a Girl' team up to inspire next generation of STEM leaders\nWhen 100 middle and high school girls from across the Seattle area arrived at the Virginia Mason Athletic Center this month, they found more than just the Seahawks' practice facility–they discovered a world where sports and technology seamlessly intersect.\nTech Touchdown, a collaboration between Amazon Web Services (AWS), the Seattle Seahawks, and nonprofit Play Like a Girl, transformed the Seahawks training center in Renton into an interactive learning lab where young athletes explored how cloud technology powers modern sports experiences.\n\"It was an awesome and inspiring day at the Seahawks Training Facility,\" said Julia White, AWS chief marketing officer. \"Helping these talented young women see themselves in both sports and STEM was incredibly rewarding.”\nParticipants rotated through three AWS-powered stations. At My Cause My Cleats, students used generative AI to design custom cleats similar to those NFL players wear for charitable causes, each taking home a custom design keepsake. The NFL Football Throw station tested quarterback abilities with sensor-equipped footballs that feature the same technology used to track throws by NFL players. Finally, at a Seahawks Hologram station, participants could “interact” with former Seahawks wide receiver Ben Obomanu and see themselves transformed into holograms.\nThe day also featured appearances by current Seahawks’ players, including wide receiver Dareke Young and linebacker Boye Mafe who participated in flag football drills alongside students.\n\"We're going to show him how it's done!\" one student declared before showcasing her athleticism and taking the flag.\nMay 21, 2025 4:51 PM\nBreaking Ground on Acer House: Amazon-backed project brings bold vision to Seattle’s Central District\nDavid Zapolsky, Chief Global Affairs & Legal Officer at Amazon, joined Seattle Mayor Bruce Harrell and local housing developers Great Expectations and Urban Black, to break ground on Acer House, a 121-unit mixed-use community that will provide affordable homes and micro-retail spaces for local entrepreneurs in Seattle’s Central District.\nMade possible through a $12.6 million low-rate loan from Amazon's housing fund, the development represents an innovative approach to creating affordable housing without traditional funding mechanisms like tax credits or subordinate public loans. Acer House will serve households earning between 40% and 80% of Area Median Income (AMI), and feature six commercial spaces for small local businesses.\n\"By combining affordable housing with opportunities for local entrepreneurs, this project helps preserve the cultural fabric of the Central District while creating pathways for economic mobility,\" said David Zapolsky. \"We're honored that Amazon's housing fund could help make this vision a reality.”\nThe project leverages the City of Seattle's Multi-Family Tax Exemption program and fulfills the City’s Mandatory Housing Affordability requirements. What makes Amazon's housing investment particularly impactful is that while many public funds specify affordability for 15 to 40 years, Amazon's housing fund ensures affordability for 99 years on most developments.\nAcer House is a recent example of Amazon's commitment to affordable housing. Since launching with an initial $2 billion commitment in 2021, Amazon has pledged $3.6 billion toward creating or preserving 35,000 affordable homes across the Puget Sound, National Capital, and Nashville regions. In the Puget Sound region alone, Amazon has committed $780 million to support more than 9,900 affordable homes, with $230 million dedicated specifically to Seattle.\nMay 15, 2025 11:41 AM\nAmazon contributes $250,000 to the Chinatown International District to establish Ambassadors Program, fostering a safe and vibrant neighborhood\nMayor Harrell announces a combined $1 million investment by the City, The Asian American Foundation (TAAF), and Amazon to improve “blocks, businesses, and lives” in the heart of the historic neighborhood.\nIn a shared effort to support safety, economic revitalization, and community well-being in one of Seattle’s most historic and culturally rich neighborhoods, Seattle Mayor Bruce Harrell, TAAF, Amazon, and the Chinatown International District Business Improvement Area (CIDBIA) announced the Chinatown-International District (CID) Ambassadors Program, launching June 1, 2025.\nThe CID Ambassadors Program will train neighborhood ambassadors to serve Japantown, Chinatown, and Little Saigon. These teams will work block by block to assist small businesses, welcome visitors, and foster safer, more vibrant neighborhoods.\n\"The Chinatown-International District is a vital part of Seattle's cultural and economic fabric and Amazon is proud to support the CID Ambassadors Program as part of our contributions to the revitalization of this important neighborhood,” said David Zapolsky, Chief Global Affairs and Legal Officer of Amazon. “Our investments in Friends of Little Sài Gòn and to revive the CID Night Market reinforce our commitment to fostering economic development, public safety, and cultural celebration.”\nThis also marks the launch of TAAF’s new “TAAF Cities” initiative to spur historic public and private investment to strengthen cities with large Asian American and Pacific Islander (AAPI) populations, of which Amazon is a founding partner. “TAAF Cities” bring together local community, government, business, and nonprofit leaders to develop innovative, community-rooted solutions that promote economic opportunity, safety, and cultural pride. Seattle, a major cultural and economic hub with some of the nation’s oldest and most dynamic AAPI communities, was chosen to kickstart the effort.”\nMay 8, 2025 6:49 AM\nAmazon's Josh Hirschland named to Puget Sound Business Journal's 40 Under 40\nPuget Sound Business Journal named Josh Hirschland, principal product manager for Amazon Community Impact, a 40 Under 40 honoree for his innovative work addressing food insecurity in the Puget Sound community.\nAs the Amazon Community Delivery program lead, Hirschland applies his logistics expertise to create sustainable, scalable solutions that help get meals directly to the doorsteps of community members in need. Under his guidance, Amazon has offered pro bono delivery for more than 40 million meals to people experiencing food insecurity since 2020—2 million meals across the Puget Sound region.\nThe program launched during the early days of the COVID-19 pandemic when food pantries faced unprecedented demand and many families couldn't leave their homes. Hirschland leveraged Amazon's last-mile delivery network to bridge this gap, transforming an initial pilot into a fully operational program within weeks.\nToday, Amazon Community Delivery partners with more than 35 organizations in 16 states and expanded to the UK last year. In the Puget Sound region, Amazon collaborates with seven different food banks, including United Way of King County, to serve more than 4,000 families.\nAmazon believes everyone should have access to healthy food and continues to address the rising rates of food insecurity by partnering with local organizations.\nMay 5, 2025 1:37 PM\nAmazon is helping fund 9,900+ affordable homes across the Puget Sound\nJared Johnson of Chinatown Preservation & Development talks with Seattleites about Beacon Pacific Village, an affordable housing community with a childcare center and healthy aging and wellness center, situated close to transit, schools, healthcare, and shopping. This multi-generational community received a $3M grant from Amazon’s housing fund, which has fund or preserve more than 9,900 affordable homes across the Puget Sound.\nMay 1, 2025 1:44 PM\nAmazon and the Seattle Storm engage Puget Sound youth through Community Hoops clinics\nAmazon's continued partnership with the Seattle Storm is supporting the second annual series of Community Hoops clinics—a collaborative effort to bring free, accessible basketball programming to youth across the Puget Sound region.\nAs part of the collaboration, 45 youth participants from Mary’s Place participated in a clinic at the Storm’s Center for Basketball Performance in Seattle’s Interbay neighborhood—many of them experiencing the sport for the first time. A five-week series at the Family First Community Center in Renton welcomed 50 youth weekly from the Benson Hill neighborhood. In Tukwila, 88 students from elementary to high school levels came together for a day of skills-building and community.\n“The kids had a wonderful time and were so grateful for the experience,” said Zoë Bill, Youth Services Director at Mary’s Place. “Beyond enjoying basketball, they walked away feeling celebrated and a part of something special. Opportunities like this have a lasting impact.”\nThe Seattle Storm’s youth basketball program, Jr. Storm, leads the clinics—putting together drills, offering encouragement, and sharing their love for the game. Their involvement helps create an inspiring environment where kids not only learn basketball fundamentals but also connect with role models.\nIn 2024, Amazon and the Storm hosted eight clinics in partnership with local organizations—reaching hundreds of young athletes and their families. These clinics are just one example of the many ways Amazon invests in local communities across the Puget Sound. We remain committed to supporting neighborhoods where our employees and customers live and work through collaboration with local organizations and programs that create meaningful opportunities for future generations.\nApril 22, 2025 9:42 AM\nAmazon gives $2 million to support critical food security initiatives in Seattle region\nAmazon's investment will help two local food banks expand their capacity to serve community members with essential groceries and services.\nAmazon provided $2 million to support the growth of two food banks in the Seattle region, with grants of $1 million each to White Center Food Bank and Rainier Valley Food Bank. The donations will help both organizations expand their capacity to provide more community members experiencing food insecurity with vital groceries.\nWhite Center Food Bank will use Amazon's grant to support its move to their new, permanent facility in downtown White Center. The location provides improved accessibility through nearby public transportation routes and allows the organization to expand its services.\nRainier Valley Food Bank will use its grant to support the renovation and expansion of its facility. The improvements will create a community food hub with that can meet urgent food needs with increased capacity for food storage, a commercial kitchen, and gathering spaces to build community.\nIn addition to supporting the critical work of local food banks, Amazon is committed to addressing food insecurity through multiple initiatives across the communities where we operate. We collaborate with nonprofit organizations, leverage our logistics expertise, and engage our employees to help provide millions of meals to individuals and families in need. Since 2020, our Community Delivery program, which provides free delivery of charitable groceries, has delivered more than 40 million meals with 35 partners in 16 states.\nFebruary 27, 2025 4:49 PM\nAmazon's $100 million commitment to affordable housing in the City of Bellevue\nAmazon is committing $100 million in the City of Bellevue to accelerate the production of affordable housing for low-to-moderate income families. This commitment will support projects throughout Bellevue, with a particular focus on projects supported by the City and on Bellevue's three city-owned transit-oriented sites—giving low-to-moderate income families close proximity to community resources.\nDavid Zapolsky, Chief Global Affairs and Legal Officer at Amazon, announced the news at the ground breaking of Spring District, a BRIDGE Housing Community that will bring 234 affordable homes to the City of Bellevue through a transit-oriented development.\nFebruary 26, 2025 1:20 PM\nAmazon’s return to office boosts Seattle’s foot traffic and local economy\nAmazon teams returning to offices are playing a major role in the continued revitalization of downtown Seattle. New data is showing a surge in foot traffic—benefiting local businesses and the broader downtown economy.\nThe Downtown Seattle Association (DSA) reports that weekday worker foot traffic in South Lake Union and the Denny Triangle reached 74% of January 2019 levels, up from 62% the previous year. Across downtown, foot traffic increased 9% from January 2024, reaching 57% of pre-pandemic levels. Nearly 2 million unique visitors came downtown in January, 14% more than the previous year.\nAmazon’s presence has been a key driver of this uptick. Our 50,000 Seattle employees, along with those in Bellevue and Redmond, are bringing a sense of renewed vibrancy to these communities. Amazon teams are also feeling energized by the shift—excited by the innovation, collaboration, and connection that takes place with teams collaborating in-person.\nMany local business owners are noticing a welcome increase in weekday customers. “Coffee shops are full, lunch spots are buzzing, and there’s more activity in the area,” noted Downtown Seattle Association President and CEO Jon Scholes.\nFebruary 3, 2025 10:44 AM\nAmazon’s commitment to flexible, sustainable commutes in HQ1\nAt Amazon, we value the connections and opportunities that come from being part of vibrant, downtown communities. By investing in innovative transit options and fostering partnerships, we are able to offer employees a variety of commuter benefits and services to reach their destinations.\nAcross our headquarters cities and in other major metro areas, our employees have access to a variety of reimbursable public transportation costs, free commuter shuttles, and flexible monthly subsidies for commuting expenses.\nIn Puget Sound, we take additional steps to enhance connectivity and help reduce traffic congestion, including:\n- Expanded shuttle services: We increased shuttle routes serving our Puget Sound HQ, including over 30 commuter shuttle routes as far as Mill Creek, North Bend, and West Seattle, intercampus shuttles between our Seattle, Bellevue, and Redmond offices, and shuttles that transport Amazonians to the office from transit hubs and locations around the Puget Sound region.\n- Rideshare: Amazon recently launched a first of its kind Lyft Pass program in Seattle and Bellevue, allowing employees to utilize their Flexible Commuter Subsidy to match rides with fellow Amazonians.\n- Biking: Through their Flexible Commuter Subsidy, Amazon employees can utilize the subsidy to cover costs including: bike leases, bike-share, maintenance, and bike parking. Offices also include bike cages for storage and showers for bikers to get ready for the work day.\n- Sustainable transportation partnerships: Amazon is proud to support local partners that share a commitment to greener commuting options. BellHop, the first all-electric shuttle service in the Pacific Northwest, is one partnership that helps employees replace car trips with a sustainable micro-transit option.\n- Investing in public infrastructure: We work with policymakers and support transit investments that help expand access to public transportation.\n- Amazon advocated for the Move Ahead Washington statewide transportation package which funds over $730 million in traffic reduction projects, including free transit for residents age 18 or younger.\n- Amazon has contributed more than $1.6 million to campaigns that have expanded transit access and invested in and preserved transportation infrastructure.\n- Amazon directly invests in transportation infrastructure, including $10.8 million toward Eastrail and the Grand Connection Crossing.\nAs we move forward, Amazon will continue to explore new ways to enhance our employees’ commute experiences while helping build stronger, greener communities.\nJanuary 30, 2025 12:57 PM\nAmazon supports Memorial Stadium redevelopment in Seattle\nAmazon is proudly contributing $2 million to the redevelopment of Memorial Stadium, helping to ensure that the iconic venue remains a cherished part of the Seattle community and a vital part of its future. This donation clinched the project’s fundraising by helping it meet its final goal, which included $110 million in public and private funding.\nOriginally built in 1947 to honor Seattle students who lost their lives in World War II, Memorial Stadium has served as a meaningful community hub for decades. From high school football games and graduations, to large-scale events like the Seattle World’s Fair ceremonies, the stadium has played an integral role in the cultural fabric of the city. As the venue has fallen into disrepair, Seattle Public Schools and the City of Seattle partnered with One Roof Stadium Partnership (ORSP) for an ambitious redesign that will result in a modern, state-of-the-art facility. The redevelopment will allow Seattle Public Schools to retain ownership and primary use, while also increasing its capacity and capabilities to host even more events.\n“Amazon’s donation to the Memorial Stadium demonstrates our long-term commitment to building accessible communities in the Puget Sound,” said David Zapolsky, Senior Vice President, Global Public Policy and General Counsel at Amazon. “We’re thrilled to help transform the stadium into a space for everyone in the community, where neighbors can come together and connect. This reimagined stadium will open doors for more community members and expand upon its legacy, remaining a cherished part of Seattle’s history for years to come.”\n\"Amazon's generous contribution to the Memorial Stadium redevelopment showcases the power of public-private collaboration in driving systemic change,” said Tracy Myers, Executive Director of King County Play Equity Coalition. \"By modernizing this iconic venue, we're not only preserving Seattle's heritage but also creating a space where young athletes from all backgrounds, particularly those from historically underserved communities, can access the transformative benefits of sports and physical activity.”\nScheduled for completion by 2027, the new stadium will increase capacity to over 8,000 and feature additional spaces for athletics, arts, and community events. It will honor the original Memorial Wall, with new elements aligning with the City of Seattle’s goals for equity, sustainability, and community resilience. The reimagined stadium will remain an important centerpiece of Seattle Center—continuing its legacy of creating opportunities for students and the broader community to thrive for years to come.\nThe donation is also part of Amazon’s broader commitment to the Puget Sound region, where we continue to invest in housing, education, food security, and other causes that make a tangible impact in our community. Last year alone, we contributed $68 million to 120 Washington state community partners. Since 2021, we have also committed more than $780 million to help create or preserve affordable housing for nearly 19,000 people through the Amazon Housing Equity Fund. Read more about our commitment to the Puget Sound community in our 2024 Community Impact Report.\nDecember 19, 2024 6:10 AM\nAmazon invests in vital program to combat food insecurity for Tukwila Schools\nAmazon has reaffirmed its dedication to supporting communities across the Puget Sound with an investment in Still Waters, a nonprofit organization addressing food insecurity in the Tukwila area. With an $80,000 commitment, Amazon is ensuring that Still Waters’ after-school and weekend food program remains fully funded through the 2026-2027 school year.\nThis vital program currently supports three local elementary schools, reaching 220 students each week. It provides the nutritious meals students need to stay focused, learn effectively, and maintain their overall health. An initial $40,000 donation from Amazon has already secured funding for the 2024-2025 school year, while the remaining $40,000 will co-fund the program’s continuation for the following two school years in collaboration with the City of Tukwila.\nLocal leaders have recognized the importance of this partnership. Tukwila Mayor Thomas McLeod expressed his appreciation, stating, “Still Waters provides critical food security for kids in the Tukwila School District. Amazon’s support ensures that kids will have healthy meals and not go hungry.”\nFor Still Waters, Amazon’s commitment means the continuation of a program that many families rely on. Abigail Tabason, Executive Director of Still Waters, shared her gratitude, saying, “At Still Waters, our team believes in order to achieve food and educational equity in Tukwila Schools, all students deserve access to nutrition. We are so grateful for the support from Amazon and the City of Tukwila. This will ensure there is no interruption of this program that many Tukwila families rely on.”\nThe impact of Amazon’s contributions extends well beyond this latest effort. Since 2021, the company has donated over 8 million pounds of food in Washington State and provided more than $2.9 million to local organizations in the Puget Sound region. These investments are part of Amazon’s broader commitment to addressing food insecurity and supporting individuals and families in need.\n“Amazon has been deeply connected to the Puget Sound region for more than 30 years,” said Taylor Hoang, Senior Manager for Community Engagement at Amazon. “We remain committed to taking a hands-on approach to work with nonprofits and community partners to find creative solutions for some of our region’s most pressing needs. We’re proud to be able to support organizations like Still Waters in their critical work to help combat food insecurity.”\nDecember 17, 2024 10:41 AM\nAmazon’s Winter Wonderland brings holiday cheer to Puget Sound families\nOver 1,000 children and their families gathered at the Amazon Meeting Center in Seattle for a day filled with holiday magic. Each child had the chance to select toys, books, and other goodies while creating special memories with their families. Parents and guardians also received a $50 gift credit per child to shop on Amazon.com, with purchases delivered directly to their homes—making the holidays brighter and more convenient.\n01 / 04\nWinter Wonderland welcomed families through partnerships with local nonprofits including Byrd Barr Place, El Centro de la Raza, Treehouse, Rainier Athletes, and Wellspring Family Services. Families also enjoyed photo opportunities, seasonal crafts, refreshments, and live holiday music. Adding to the excitement, former Seattle Seahawks players along with Seahawks mascots and dancers, made special appearances throughout the day.\nAmazon’s Senior Vice President of Global Public Policy, David Zapolsky, had the opportunity to sit down with KING 5’s New Day Northwest to chat about Winter Wonderland while reflecting on how Amazon has cultivated a \"culture of giving.” This comes to life through hundreds of thousands of volunteer hours from our teams, and investments that uplift communities where our customers and employees live and work.\nAt Winter Wonderland, 300 Amazon volunteers staffed the toy shop, assisted at online shopping stations, led craft activities, and even dressed up as holiday mascots to spread festive cheer.\nNovember 22, 2024 9:55 AM\nAmazon expands partnerships with Puget Sound food banks to deliver groceries to neighbors in need\nNovember 15, 2024 9:38 AM\nAmazon and the Gary Sinise Foundation team up to support Washington state first responders\nIn honor of National First Responders Day, observed on October 28th, Amazon once again joined forces with the Gary Sinise Foundation (GSF)—a leader in supporting first responders, veterans, and their families—to celebrate and support those who put their lives on the line for their communities.\nAmazon and GSF donated more than $200,000 in new equipment to fire departments across Washington state. This equipment is enhancing first responders’ ability to perform their lifesaving work safely and effectively.\nAmazon and GSF visited local fire departments to present the grants and serve meals to first responder teams as a small token of gratitude. Spokane County Fire District 10, Franklin County Fire District 3, Everett Fire Department and West Pierce Fire & Rescue were all chosen as this partnership prioritizes under-resourced fire departments with larger numbers of volunteer firefighters. The fire departments used the grants to purchase fire safety equipment, such as educational inflatables, bail out kits and extrication equipment, critical for enabling firefighters to quickly escape compromised structures and remove individuals from trapped vehicles or buildings.\n“Through our incredible three-year partnership, Amazon has displayed immense compassion for our mission and a commitment to delivering direct, meaningful impact to the heroes of our communities—the first responders who put their lives on the line every day to keep us safe,” said Chrissy Kreisel, senior director of corporate and foundation relations at the Gary Sinise Foundation.\nGSF was established in 2011 under the philanthropic direction of award-winning actor and humanitarian Gary Sinise, who has been a staunch supporter of veterans, first responders and defenders for more than 40 years. From providing equipment to hosting events like GSF’s healing retreats for families of fallen military and first responder heroes, Amazon is proud to be able to make a tangible difference.\nNovember 12, 2024 6:00 AM\nCommunity Impact Report: Amazon showcases commitment to Puget Sound Region\nAt Amazon, we live our mission of making our customers’ lives better and easier every day. We also bring this innovative, inventive spirit to empower the communities we call home, using our scale and abilities to take on some of society’s most pressing challenges. Working side-by-side with community partners, we’re increasing access to affordable housing and alleviating hunger. We’re strengthening education, promoting literacy, and helping people gain skills for the future.\n- We contributed $68 million last year in support of more than 120 community partners dedicated to making the Puget Sound region a better place to live. Through initiatives large and small, our partners’ work has an indelible impact—increasing access to cultural events, providing free gifts for the holiday season, supporting a free electric shuttle service, and addressing the needs of people experiencing homelessness.\n- Since launching the Amazon Housing Equity Fund in 2021, we have committed over $780 million to help create or preserve affordable housing for more than 18,900 low- to moderate-income individuals so they can live in the communities they serve and love. This is especially important for first responders, teachers, nurses, and service industry employees who are getting priced out of expensive metro areas like ours.\n- We’ve donated more than 8 million meals to local organizations like Food Lifeline, FareStart, and Ballard Food Bank, helping them address food insecurity and hunger across the region. And we have used our logistics network to deliver more than 2 million meals to families, making it easier for them to access the food they need.\n- We continue to invest in programs to help children in grades K-12, higher-education students, and adult learners unlock their potential. By focusing on critical digital skills, we prepare these individuals for the jobs of the future. Through Amazon Future Engineer we delivered 146,000 student hours of STEM education, literacy, and career exploration courses across the Puget Sound. And over 58,000 learners have accessed free training and education at the AWS Skills Center in Seattle.\nThese are just a few of the ways that we are giving back to the region that we call home. We are committed to supporting and collaborating with our neighbors and communities throughout the Puget Sound Region. We know that—working together—we can build an even brighter future.\nOctober 29, 2024 10:21 AM\nAmazon celebrates the opening of Overlook Walk and Revitalization of Seattle’s Waterfront Park\nEarlier this month, Amazon team members joined City of Seattle Mayor Bruce Harrell, the Office of the Waterfront, and other community leaders to celebrate the much-anticipated opening of Seattle’s new Overlook Walk.\nLocated where the Alaskan Way Viaduct once stood, Overlook Walk creates the first ever pedestrian connection between Seattle’s downtown and waterfront—bridging a nearly 100-foot gap between Pike Place Market and the Waterfront Park Promenade adjacent to Elliott Bay. Visitors and residents will enjoy ample seating, stunning views, a new children’s play area, as well as landscaping that reflects the cultural heritage and natural environment of the Pacific Northwest.\n“Seattle’s latest iconic urban element, Overlook Walk, is joining the roster of recognizable, dynamic Seattle landmarks—as a symbol of our city’s identity,” said Mayor Harrell during the opening ceremony.\nAs part of Amazon’s continued commitment to invest in the community for its neighbors across the Puget Sound region, the company provided $7 million in funding to the revitalization of Seattle’s Waterfront Park.\n\"Amazon is thrilled to have played a part in bringing Overlook Walk to life, which shows our dedication to building a more accessible and connected community,\" said David Zapolsky, Senior Vice President of Global Public Policy and General Counsel at Amazon. \"This new pathway seamlessly connects downtown, Pike Place Market, and the waterfront, celebrating Seattle’s innovative spirit, natural beauty, and the power of collaboration.\"\nOverlook Walk marks the near completion of a decades-long Waterfront Park effort, to fully open to the public in 2025.\nOctober 17, 2024 1:38 PM\nAmazon signs agreement to bring new nuclear energy to Washington\nAs the energy needs of our business and customers continue to grow, we’re continuing to invest in renewables while also finding additional sources of carbon-free energy that can both help power our operations and bring new sources of energy to the grid. Nuclear power is one part of that mix—it can be brought online at scale, and has a decades-long record of providing a reliable source of safe carbon-free energy for communities around the world.\nWe recently announced that we’ve signed several agreements to support the development of nuclear energy projects—including enabling the construction of several new Small Modular Reactors (SMRs). SMRs are an advanced kind of nuclear reactor with a smaller physical footprint, allowing them to be built closer to the grid. They also have faster build times than traditional reactors, allowing them to come online sooner.\nIn Washington, our agreement with Energy Northwest, a consortium of state public utilities, will enable the development of four advanced SMRs. The reactors will be constructed, owned and operated by Energy Northwest, and are expected to generate roughly 320 megawatts (MW) of capacity for the first phase of the project, with the option to increase to 960 MW total—enough to power the equivalent of more than 770,000 U.S. homes. These projects will help meet the forecasted energy needs of the Pacific Northwest beginning in the early 2030s and is expected to support up to 1,000 temporary construction jobs and as many as 100+ permanent jobs once fully operational, according to Energy Northwest.\nOctober 4, 2024 1:12 PM\nAmazon is hiring 5,000 people across Washington as it heads into the holiday season\nAs the 2024 holiday shopping season approaches, Amazon announced that it’s hiring for 250,000 full-time, part-time, and seasonal roles across the U.S., including 5,000 positions in Washington, including 4,000 in the Seattle-Tacoma-Bellevue region.\nSeasonal Amazon jobs offer competitive pay, flexible schedules, and the opportunity to be part of the bustling retail industry during its busiest time of year. Many of these seasonal roles also come with the potential to transition into regular, full-time employment after the holidays. All seasonal employees earn at least $18 per hour and have access to benefits like health care from the first day on the job.\nWe’re also looking forward to welcoming back many familiar faces—each season we see many individuals come back year after year to be a part of the holiday season here at Amazon. In fact, nearly one-third of people who have come to work at Amazon as a holiday hire return. Whatever someone’s personal circumstances may be, Amazon has an opportunity for them.\nA great example of an employee who found a long-term career at Amazon is Liv Uribe, currently based out of Washington state. She started in a seasonal role at the PHX5 fulfillment center in 2011 and, after nine promotions, is now a Senior Regional Human Recourses Manager. “The seasonal position allowed me to get my foot in the door at Amazon,” said Liv. “I loved the company and the people I worked with, and saw the opportunities to grow, so I pursued a full-time role after that first holiday season.\"\nLast month we also announced our largest annual wage increase ever for our hourly associates. Members of our front-line team will be received at least an additional $1.50 per hour starting September 29, which brings their average base wage to more than $23 per hour in Washington, and more than $30 in total compensation including elected benefits.\nOctober 3, 2024 10:00 PM\nAmazon expands partnerships with Puget Sound food banks to deliver groceries to neighbors in need\nEvery Monday, Amazon Flex drivers arrive at West Seattle Food Bank to pick up boxes of healthy food to deliver them to families and individuals in need, for free. In partnership with local nonprofit United Way of King County (UWKC), and building on their existing delivery program with West Seattle Food Bank, Amazon recently expanded our Community Delivery program to support food banks in the University District, Auburn, Covington, and Kent. People who receive these deliveries have signed up through the Home Grocery Delivery Program facilitated by UWKC, which partners with Amazon and local food banks to donate and deliver vital groceries right to their doorstep.\n“Amazon makes it possible to think about this program long-term,” said Sara Seelmeyer, food security program manager, UWKC. “The home delivery program began during the pandemic and continues because it has proven to be invaluable in serving those most at-risk in our community, but it is not sustainable without Amazon's support. Currently, Amazon donates this service for roughly 900 deliveries per week.”\nAmazon believes everyone should have access to healthy food and is addressing hunger with local partners by tapping into the company’s technology and delivery network where access to food can be a struggle. So far, Amazon’s Community Delivery program has delivered over 1.8 million meals to more than 4,000 families across Puget Sound.\nOctober 3, 2024 11:51 AM\nAmazon Sponsors Return of the Night Market to Seattle’s Chinatown-International District\nThe annual Night Market in Seattle's historic Chinatown-International District returned on Saturday, September 21st, following Amazon's $250,000 commitment to bring the food and culture street festival back for the next three years. As part of the diverse fabric that makes up the Puget Sound community, Amazon was proud to help bring back this unique local event.\nHosted by the Chinatown-International District Business Improvement Area (CIDBIA), the 2024 Night Market was a lively celebration of culture, food, and community, drawing over 30,000 visitors from across the region and providing a boost in foot traffic to the district. More than 100 vendors participated, with a mix of traditional and modern food and beverage offerings, as well as local artisans selling handmade goods. Attendees also enjoyed live music, dancing, martial arts demonstrations, and other cultural performances throughout the evening.\nIn celebration of the market’s return, and as part of its commitment to addressing food insecurity, Amazon partnered with Uwajimaya grocery stores to donate 75,000 pounds of food to local food banks. Amazon will contribute 50,000 pounds of food to organizations including Asian Counseling and Referral Services (ACRS) and Hopelink. Uwajimaya has launched an in-store donation campaign to fund the additional 25,000 pounds of food.\n“At Uwajimaya, we’ve been a proud part of this community since 1928, and we believe in the strength of community and the importance of giving back,” said Denise Moriguchi, President and CEO of Uwajimaya. “Partnering with Amazon on this food drive allows us to leverage our shared commitment to supporting local families, especially during the back-to-school season when the need for nutritious meals is crucial. By working together, we’re able to make a lasting impact, both by providing essential resources and by strengthening the cultural fabric of the neighborhoods we’ve served for nearly a century.”\nSeptember 13, 2024 2:30 PM\nAmazon teams up to clean Seattle’s parks: 300 volunteers make an impact\nOn September 7, more than 300 Amazon employees and their families participated in Amazon's fourth Parks Cleanup in partnership with Seattle Parks Foundation and Seattle Parks and Recreation (SPR). Volunteers at Green Lake Park, Meadowbrook Park, Seward Park, and Genesee Park/Playfield spread 110 yards of mulch, fertilized 80 trees, removed 900 square feet of invasive weeds, and cleaned up litter from 300 feet of shoreline.\nAt Seward Park, Amazon’s Vice President of Sustainability, Kara Hurst, joined the cleanup alongside AP Diaz, Superintendent of Seattle Parks and Recreation, and Kristen Milliron, COO of Seattle Parks Foundation. Together, they highlighted the importance of maintaining green spaces for the community.\nSeptember 11, 2024 1:20 PM\nAmazon and Bumbershoot partnership surpasses food donation goal\nOver Labor Day weekend, more than 30,000 fans gathered at Seattle Center for the annual Bumbershoot Arts & Music Festival. The event brought people together to enjoy and experience an eclectic mix of music, multimedia art, dance, performances, and food from 29 local restaurants.\nAs part of this year’s festival, Amazon teamed up with Bumbershoot for \"Bumbershoot Gives Back: Powered by Amazon,\" a community-driven initiative aimed to address food insecurity in the region. Together, we surpassed our goal of donating 90,000 pounds of food, ultimately providing 127,000 pounds to food banks across the Puget Sound. Additionally, Conscious Alliance, a nonprofit hunger relief organization, organized a virtual food drive where supporters received a limited-edition Bumbershoot poster in exchange for donations that provided meals toward the program.\nThroughout the summer, Bumbershoot and Amazon mobilized more than 2,000 volunteers who contributed more than 10,000 hours of service to 15 local organizations, including food banks and community gardens. These volunteers dedicated time to combat food insecurity by delivering groceries, sorting food, and harvesting gardens, earning free two-day festival tickets for their efforts.\nAmazon takes a hands-on approach to address key issues like hunger in the communities in which we live and work. By investing in and collaborating with community partners, we’re providing a direct and positive impact on the lives of those in need.\nSeptember 10, 2024 9:00 AM\nAmazon joins the fun at the 18th annual SLU Block Party\nLast month, 6,500 people came out to enjoy the fun and festivities at the 18th annual South Lake Union (SLU) Block Party, coming together to support local businesses and community organizations in celebration of the neighborhood’s culture and history.\nThis year’s SLU Block Party was a lively affair, with 34 community booths, seven food trucks, and a variety of activities, showcasing what makes SLU special. From the energetic performances by Pacific Northwest artists Little Lies, Thief Motif, and Nite Wave, to a yoga session led by Core Power Yoga, there was something for everyone. Guests of all ages also participated in the “Street Scramble” neighborhood scavenger hunt and played lawn games.\nAmazon’s role in the SLU Block Party goes beyond sponsorship. We’re proud to support the diverse mix of businesses, nonprofits, and community-based organizations that call SLU home. This year, several of our own retail tenants, including the Gage Academy of Arts—a nonprofit art school that recently relocated to Amazon’s SLU campus—Kathmandu, and Bright Horizons, joined in the festivities. The Block Party provided these and other local businesses with an opportunity to further connect with the community and strengthen the neighborhood’s ties.\n“Our mission has always been to create vibrant, 18-hour districts that benefit both Amazonians and the surrounding neighborhood,” said Shannon Loew, vice president of Global Real Estate & Facilities, Amazon. “The SLU Block Party is a perfect example of how we bring this mission to life, fostering a lively and connected community that supports a diverse mix of businesses, arts, and cultural organizations.”\nAmazon remains committed to supporting the people and organizations that make the Puget Sound region a dynamic place to live and work. Events like the Block Party remind us that our greatest achievements come from working together, building connections, and creating spaces where everyone feels welcome.\nWe’re already looking forward to next year’s Block Party and can’t wait to see how the community continues to thrive.\nAugust 27, 2024 5:00 AM\nAmazon Fresh cultivates healthy eating habits and educational opportunities across the Puget Sound\nAmazon Fresh has teamed up with Whole Foods Market Foundation by donating $250,000 to fund 83 school gardens across the country, including local schools across the Puget Sound region. This initiative aligns with Amazon Fresh's long-term vision of positively impacting local communities by promoting access to healthy food choices and educational initiatives.\nAmong the beneficiaries are Halilits Elementary on Bainbridge Island, Morningside Academy, Graham Hill Elementary School, and Technology Access Foundation in Seattle, as well as Wildwood Elementary in Federal Way and Hazelwood Elementary School in Newcastle. These schools will receive Whole Kids Garden Grants provided by Amazon Fresh, enabling them to establish or enhance their edible gardens and engage students in hands-on learning about growing and enjoying fresh produce.\n\"We're thrilled to support these local schools and their efforts to cultivate a love for nutritious foods among students,\" said Stockton Young, regional manager for Amazon Fresh in the Puget Sound region. \"By providing access to edible gardens, we aim to inspire a new generation of kids to develop an understanding of where their food comes from.\"\n\"When kids have a hand in growing fruits and vegetables, they are more likely to try them, enjoy them, and inspire other kids to do the same. Additionally, kids who grow up enjoying fruits and vegetables are more likely to continue eating them through adulthood,\" said Carol Medeiros, executive director of Whole Foods Market Foundation. \"We’re so grateful to Amazon Fresh whose generous donation in the Whole Kids Garden Grant program this year will allow more students to get a jumpstart on a lifetime of enjoying healthy food.\"\nThrough this collaboration, Amazon Fresh reinforces its commitment to investing in the well-being of local communities. By nurturing a love for fresh produce and sustainable practices from an early age, the company hopes to inspire positive change and contribute to a healthier, more sustainable future for all.\nAugust 20, 2024 4:04 PM\nFirst newly-constructed affordable housing community to receive Amazon funding in King County opens\nSince the Amazon Housing Equity Fund (HEF) launched in January 2021, we’ve dedicated $3.6 billion to help fund more than 35,000 affordable homes across the Puget Sound region, the Arlington, Virginia/D.C. region, and Nashville, Tennessee. Today, Amazon celebrated the opening of Grata at Totem Lake―the first newly-constructed affordable housing community to receive HEF funding in King County.\nThere is a great need for more affordable housing across the Puget Sound―this is especially true on the east side of Lake Washington. Grata at Totem Lake will help address this need with 125 units, ranging from studios to 4-bedroom apartments, for residents earing less than 60% of the county’s area median income (AMI), and with 88 of these homes reserved for residents earning under 50% AMI.\nGrata at Totem Lake will also contribute to residents’ quality of life by providing easy access to nearby transit, groceries and retail, healthcare, schools and other resources. The building is also energy-efficient and includes rooftop solar arrays, green-rated appliances in each unit, a design that reduces energy usage, and EV-charging stations.\n01 / 02\nTWG Development led the development of Grata at Totem Lake, which received a $12.5 million low-rate loan from the HEF, along with funding from A Regional Coalition for Housing (ARCH), the Washington State Housing Finance Commission, and Key Bank. This new development illustrates what can happen when the private sector, public sector, and community-based organizations collaborate to address the need for more affordable housing.\nOf the $3.6 billion that Amazon has dedicated to help create or preserve affordable housing through Housing Equity Fund, $2.2 billion has been committed to help create or preserve more than 21,000 affordable homes so far, including over $780 million to help create or preserve more than 8,600 affordable homes across the Puget Sound. Over 80% of the affordable housing developments funded by Amazon have been in partnership with local, state, and federal government, and we plan to build on these partnerships to help create more communities like Grata at Totem Lake. Learn more about Amazon's Housing Equity Fund and what Amazon is doing in the Puget Sound region for our employees, neighbors, and the community.\nJuly 11, 2024 4:00 PM\nAmazon teams with Bumbershoot to provide free tickets while fighting hunger\nAs the community gears up for the Bumbershoot arts and music festival later this summer, Amazon has partnered with Bumbershoot on the “Bumbershoot Gives Back” initiative, an effort to support food security for our neighbors in the region. The collaboration will deliver 90,000 pounds of food to food banks in the region, while providing fans with meaningful ways to serve the community and opportunities to receive Bumbershoot festival tickets in the process. To kick off the program, Amazon donated 30,000 pounds of food to the Asian Counseling & Referral Services’ (ACRS) food bank in Seattle’s Chinatown-International District. Amazon volunteers helped unload the donated food that will support ACRS’ food security programs across the Puget Sound.\nTo encourage community participation, Amazon’s support will make 2,000 two-day festival tickets available for free to those who volunteer their time with select local nonprofits tackling food insecurity across the Puget Sound. There will also be limited-edition posters available for sale, with each purchase providing 80 meals to contribute to the program.\nThe collaboration is part of a larger effort to address the issue of food insecurity in Western Washington, which impacts over 1.5 million of our neighbors.\n“We’re proud of our investments across Seattle and the Puget Sound region over the last 30 years, and as we continue to grow, so does our responsibility to the places where we live and work,” said David Zapolsky, Senior Vice President, Global Public Policy and General Counsel for Amazon. “Amazon is committed to working with our partners to find creative solutions that empower our community. This year, we’re excited to be working with an iconic local institution like Bumbershoot to have our sponsorship support critical needs in the region. Through this work, our impact will result in thousands of volunteers mobilizing across the Puget Sound while we infuse local food banks with 90,000 pounds of food.”\nAmazon’s work to tackle food insecurity nationwide has resulted in more than 88 million pounds of food donated to food banks, pantries, kitchens, and shelters in the U.S. since 2021, with more than seven million pounds donated within Washington state. In addition, more than $2.9 million has been donated to local organizations to support individuals and families experiencing food insecurity since 2021 in the Puget Sound.\nJuly 5, 2024 6:20 AM\nAmazon celebrates Seafair and military veterans\nThis year marks the 75th anniversary of Seafair, the biggest summer celebration in the Pacific Northwest. Amazon is honored to sponsor the annual Fourth of July fireworks at Gas Works Park for the fourth year in a row.\nThe fireworks are both a beloved local family tradition, as well as an opportunity for our Puget Sound community to honor veterans while celebrating the contributions and sacrifices of military families everywhere. This milestone 75th anniversary event coincides with Amazon’s celebration of surpassing our goal to hire 100,000 veterans and military spouses this year. In support of veterans and their families, Amazon offers a broad range of programs built to address challenges specific to our military community, including Warriors@, an affinity group that helps smooth the transition to civilian careers.\nWhether joining as an hourly or a salaried employee, employees also receive comprehensive benefits, including health care from Day 1 on the job and a wide range of career growth and training programs.\nDavid Zapolsky, Amazon’s senior vice president of Global Public Policy and General Counsel, sat down with Seattle’s New Day Northwest morning show to share why Amazon’s employment opportunities and alignment of skills represent a great workplace for veterans.\nAlso joining Zapolsky and host Amity Addrisi was Ansel Doub, a Navy veteran and Amazon site leader who has been with Amazon for nearly 12 years. Doub shared how he’s benefitted from mentorship and being welcomed by the military community within Amazon—as well as how this represents a full circle moment for him, as he participated in Seafair while on a Naval ship back in 2004.\nFollowing a full day of July Fourth fun at Gas Works Park and the South Lake Union viewing areas, Amazon’s own Alexa also joined the festivities this year, with hosts calling on Alexa to start the fireworks during the live televised broadcast.\nJune 11, 2024 2:25 PM\nAmazon adds $1.4 billion to the Housing Equity Fund to create and preserve more affordable homes in the Puget Sound\nWe’re now extending our commitment to the Amazon Housing Equity Fund with an additional $1.4 billion in funding to create and preserve 14,000 more homes in three of its hometown communities—Washington State's Puget Sound region; the Arlington, Virginia/National Capital region; and Nashville, Tennessee. This brings the total to more than $3.6 billion to fund more than 35,000 affordable homes across these three regions. The extension of the Housing Equity Fund underscores our commitment to affordable housing and to helping thousands of families live closer to where they work or near transportation hubs, removing a major barrier to success. To date, Amazon's Housing Equity Fund has funded a total of 8,600+ homes across the Puget Sound region and increased affordable housing stock by 30% in Bellevue, WA.\nMay 31, 2024 3:00 PM\nAmazon volunteers join in with \"Keep Bellevue Beautiful\" initiative\nLast week, Amazon employees participated in the City of Bellevue’s \"Keep Bellevue Beautiful\" volunteer event. In collaboration with the City of Bellevue, 100 Amazonians took to the streets for a massive trash pickup effort. Volunteers worked diligently to clean up and beautify various areas around downtown. This effort is a testament to our dedication to fostering safe, clean, and vibrant communities.\n\"Amazon’s involvement sets a high standard for corporate social responsibility,” said Mayor Lynne Robinson of Bellevue. “We are grateful for their continued support and dedication to our city. Their efforts during this event not only enhance the beauty of Bellevue, but also strengthen the bonds within our community.\"\nAmazon has been a key player in the \"Keep Bellevue Beautiful\" program since its launch in August 2023, standing out as the only large-scale corporate participant to date. This involvement underscores our role as a leading community partner, committed to making a positive difference in the places where our employees live and work.\n\"We are proud to be a part of the ‘Keep Bellevue Beautiful’ initiative,” said Luli Chaluleu, vice president of Talent Acquisition for Worldwide Amazon Stores. “Our volunteers' hard work reflects Amazon’s core values of community engagement and environmental responsibility. We look forward to continuing our partnership with the City of Bellevue to create a better future for everyone.\"\n“Keep Bellevue Beautiful,” was just one event during Amazon’s Global Month of Volunteering, a company-wide initiative to engage in volunteering across our many global communities, demonstrating the company's strong commitment to community involvement and environmental stewardship. Amazon is dedicated to supporting local community causes. Since 2021, we have donated over $244 million to local charities and nonprofit organizations, establishing ourselves as the region's largest corporate contributor. Additionally, through the Amazon Housing Equity Fund, we have invested $720 million to preserve and create over 8,000 affordable homes across the Puget Sound region.\nMay 10, 2024 10:13 AM\nAmazon, named amongst the region's top corporate philanthropists, is tackling the most pressing community issues such as housing affordability and hunger\nAmazon was recognized by the Puget Sound Business Journal for a third year in a row. The company’s $244M community investment over the past three years—$68 million in 2023—is creating measurable and positive impacts across the region.\nAccording to the Building Industry Association of Washington, 84% of families in Washington state cannot afford to buy a home. Low- and middle-income households are disproportionately affected as they often struggle to afford basic necessities because housing costs consume more than 30% of their monthly income. At the same time, according to Food Lifeline, the region saw a 63% increase in visits to local food banks in 2023.\nAlongside our local partners, Amazon is providing immediate support to address the region’s most pressing issues, while investing in long-term solutions that can be sustained over time. For example, a partnership with Mary’s Place provided more than 160,000 bed nights at the organization’s shelter inside Amazon’s Seattle headquarters to families experiencing homelessness. Amazon’s Housing Equity Fund (HEF) was started to preserve existing, and create newer, affordable homes near modes of transit, schools, and health care facilities. HEF has already helped fund more than 8,000 affordable homes and supported over 17,000 low-to-moderate-income residents.\nAmazon is also using its unique logistics capabilities to reduce hunger. In 2023, Amazon delivered more than 500,000 pounds of food to nonprofits in the Puget Sound region, and has donated more than 7 million pounds of food to food banks, pantries, kitchens, and shelters across Washington state since 2021.\nWhile we are thankful to our partners for the progress we’ve made together in our hometown, there is more work to be done. Amazon will continue to invest in issues that matter most to our neighbors, and collaborate with local organizations, to ensure an even brighter, more equitable tomorrow.\nApril 27, 2024 9:00 AM\nAmazon celebrates opening of new 2 Line light rail line with Bellevue leaders\nOver the past few years, Amazon has continued to share news of our investments and growth across Puget Sound headquarters. Amazon continues to make progress towards our commitment to bring 25,000 jobs to Bellevue, and we’ve opened several new offices across the area, from Sonic and Dynamo in Bellevue, to Silverstone in Redmond. We also know that while jobs and workspaces are important, Amazon is equally as committed to ensuring our growth is sustainable and that we’re investing in the right infrastructure to support our hiring. As a result of this work, we’re excited to celebrate the opening of the East Link Extension, officially known as the 2 Line, that will serve eight new stations from South Bellevue to Redmond, further connecting cities and neighborhoods across the Eastside.\n“Our downtown Bellevue campus was designed around the connectivity that mass transit provides, both for the community and the businesses that are growing here,\" said David Zapolsky, senior vice president, Global Public Policy and General Counsel at Amazon. “Not only will this investment provide easier access to downtown Bellevue for our 12,000 Amazon employees in the city, but as we continue to invest in affordable housing with access to nearby public transit through the Amazon Housing Equity Fund, the 2 Line will also begin to open up new opportunities for the broader community.”\nAs part of the 2 Line opening and Amazon’s hands-on approach to supporting mass transit, we will provide up to 15,000 pre-loaded ORCA cards to members of the community to promote ridership and support increased public transit access for the community.\nOur commitment to Bellevue goes beyond the jobs we create, the investment we bring, and the infrastructure we support. Amazon continues to work closely with the community and its leaders to ensure that we’re helping to address the issues that matter most to them. This includes contributing over $270 million to create and preserve 1,700 affordable homes on the Eastside through Amazon’s Housing Equity Fund; donating nearly $3 million to Bellevue LifeSpring through the Right Now Needs Fund to help address students’ basic and immediate needs like food, shelter, clothing, and school supplies so students arrive at school prepared to learn; and direct funding and support to over 100 non-profits on the Eastside.\nApril 19, 2024 9:43 AM\nAmazon funds the revitalization of Seattle local beach park\nAmazon celebrated the grand re-opening of Seattle’s Be'er Sheva Park on Saturday, April 13, 2024. The park has undergone significant renovations, and Amazon is proud to provide support to close the funding gap needed to complete the project.\n“Amazon’s generous, transformational support helped the Rainier Beach community bring the vision for this project to fruition,” said Rebecca Bear, president and CEO, Seattle Parks Foundation. “Be’er Sheva Park now has beach access, restored salmon habitat, a cultural stage, and much needed picnic areas. The park now better reflects the needs of the neighborhood and will support a thriving community in Rainier Beach.”\nThe improvements, resulting from a public-private partnership led by Seattle Parks and Recreation, Rainier Beach Link2Lake, and the Seattle Parks Foundation, includes art installations, a boardwalk with lighted paths, and a stage for cultural performances, along with new access to the beach for members of the local community. Located in southeast Seattle, the 25.5-acre park on the shores of Lake Washington is the perfect place to visit on a summer day. With stunning views of the Cascade Mountains, it is a popular destination for picnics, family gatherings, yoga classes, and more.\n“The Rainier Beach community is one of Seattle’s most dynamic and diverse neighborhoods. Amazon remains committed to providing solutions for causes that drive meaningful change for our neighbors across the Puget Sound region,” said Taylor Hoang, senior community engagement manager at Amazon. “The re-opening of this park brings the community access to native plants, artwork, walkways, and beach access just in time to enjoy this spring and summer.”\nApril 12, 2024 8:00 AM\nWith support from Amazon, 445 homes are staying affordable in southeast Seattle\nAmazon’s Housing Equity Fund is providing $11.8 million+ in below-market loans, grants to preserve these affordable homes for current and future residents.\nAccess to affordable housing is one of the greatest challenges facing low to moderate-income households, including residents in communities across the Puget Sound region where Amazon has a strong presence.\nPreservation of existing affordable housing is one of the most effective ways to ensure affordability, as it helps keep people in their homes who might otherwise be priced out, and helps ensure homes that are affordable today stay affordable for the long-term.\nIn cities like Seattle, however, where the cost of residential real estate continues to climb, many naturally occurring affordable rental units (homes that have, historically, been affordable to renters) are at risk of being sold and converted to market-rate homes, putting them out of reach for current and future residents in need of affordable housing.\nFor these reasons, The Amazon Housing Equity Fund (HEF) prioritizes efforts to preserve (and improve) existing affordable housing, making it possible for low to moderate-income residents to stay in their communities. Two existing affordable Seattle apartment communities, the Claremont and Lake Washington Apartments, have been kept affordable by SouthEast Effective Development (SEED), a local nonprofit dedicated to improving the quality of life in Southeast Seattle through housing, economic development and the arts. With $11.8 million in financial support from HEF, SEED was able to ensure these 445 homes stay affordable for the next 99 years.\n“Southeast Seattle is facing some of the greatest displacement pressures in Washington State. The Claremont and Lake Washington Apartments will provide a critical resource for residents in need of quality, affordable housing. We’re thankful for Amazon’s support, which is helping us keep these homes affordable today and for future generations,” said Michael Seiwerath, Executive Director, SEED.\nThe Claremont, located in Seattle’s Mt. Baker neighborhood, consists of 68 affordable homes for families earning between 50% to 80% of the Area Median Income (AMI). Lake Washington Apartments, located in Seattle’s Rainier Beach neighborhood (and within walking distance of Lake Washington), consists of 377 affordable homes for families earning between 30% to 60% AMI. Both of these apartment communities are in highly desirable neighborhoods—close to mass transit, schools, employment centers, and other neighborhood amenities.\n“When we keep existing homes affordable, we help foster greater equity across our communities,” said Senthil Sankaran, Managing Principal, Amazon Housing Equity Fund. “By preserving the affordability of the Claremont and Lake Washington Apartments, HEF and SEED are helping current and future residents have access to high-quality affordable homes and surrounding resources that contribute to a better quality of life.”\nApril 4, 2024 7:45 AM\nContinuing to expand our Puget Sound headquarters in Bellevue\nOver the last few months we’ve shared some exciting updates about the expansion of our Puget Sound headquarters in Bellevue. In December, we announced that 1,000 employees moved into the first half of Sonic, also known as Tower 555. Then in February, we celebrated the opening of our next building, Dynamo, bringing an additional 1,500 employees to Bellevue, Washington. And today we’re excited to share that we are continuing construction on the remaining 22 floors at Sonic, bringing online an additional 500,000 square feet of collaborative workspace in Bellevue. Once complete later this year, Sonic will provide space for more than 4,500 employees total.\nEmployees can take in the view from the Sonic balcony.\n\"Amazon's continued investment in Bellevue is another show of confidence that our city is growing and open for business,\" said Joe Fain, president and CEO of the Bellevue Chamber. \"Nearly 80% of polled residents shared that the growth that Amazon and other tech companies have brought to Bellevue has been good for the city. As the office market across the globe continues to show signs of post-pandemic strain, Bellevue is bucking the trend and breathing fresh life into its Downtown.\"\nOur expansion to Bellevue is part of Amazon’s natural growth progression in our Puget Sound headquarters. Since we first announced the expansion in 2020, we’ve brought more than 12,000 jobs to the city and we remain committed to our long-term plans to bring 25,000 jobs here. Bellevue provides more space for us to create good jobs and offers a business-friendly community with great amenities, a high quality of life, and a fantastic talent pool.\nIn addition to investing in our Puget Sound headquarters, Amazon is also committed to supporting causes that are important to the local community. Since 2021, we’ve donated over $174 million to local charitable groups and nonprofit organizations, making us the region’s largest corporate giver. We also continue to invest in affordable housing initiatives through the Amazon Housing Equity Fund, which has contributed $670 million to preserve and create more than 7,200 affordable homes in the Puget Sound region.\nMarch 21, 2024 10:14 AM\nAmazon's Housing Equity Fund announces $122 million commitment to help create or preserve more than 1,700 affordable homes across Puget Sound\nAmazon announced today that since December 2023, the company’s Housing Equity Fund (HEF) has committed more than $122 million to help preserve and support the development of over 1,700 affordable homes in Seattle, Bellevue, and Kirkland.\n“Since launching the Amazon Housing Equity Fund three years ago, we’ve moved quickly to support local organizations and developers to increase the supply of affordable housing—and we’ve seen the impact we can make,” said Alice Shobe, global director of Amazon Community Impact. “In Bellevue, for example, where we now employ more than 12,000 people, we’ve helped increase the number of affordable housing units by 20%.”\nToday’s announcement includes partnerships with nine local organizations focused on affordable housing. These affordable homes are located near resources residents need (like transit, schools, and employment centers) and will serve individuals and families earning between 50% to 80% of the area median income. These communities include:\n- Ardea at Totem Lake in Kirkland, is a new affordable housing community under development by TWG, and will include 170 new homes reserved for seniors.\n- MLK Family Housing is a new mixed-use development under construction in Rainier Valley that will include 147 new affordable homes. This project is a partnership with The Low Income Housing Institute (LIHI).\n- Altaire at Jackson Park in North Seattle, a partnership between SRM Development and the Urban League of Metropolitan Seattle, will provide 206 affordable homes less than a mile from the Shoreline South/148th Link light rail station.\n- Crossroads Apartments is an adaptive reuse affordable housing community by Great Expectations LLC. The project will transform the former Sagebrook Senior Living Center, a vacant assisted living facility, into 108 affordable homes in Bellevue.\n- The Terrapin Apartments is being developed by Johnson & Carr and will provide 155 new affordable homes within a half-mile of the new Bellevue Downtown Link light rail station.\n- Atrium Court Apartments will include 201 affordable homes, and Trace 4001 will include 191 affordable homes. Both projects are in Seattle’s Othello neighborhood, are close to the Othello light rail station, and are being developed by Nitze-Stagen.\n- Bode Greenwood, a development in Seattle’s Greenwood neighborhood by Bode Affordable Living, will consist of 117 new affordable homes for individuals.\n- The Claremont Apartments is an existing affordable housing community in Seattle’s Mt. Baker neighborhood and includes 68 affordable homes. The Lake Washington Apartments is an existing affordable housing community in Seattle’s Seward Park neighborhood, and includes 377 affordable homes. Amazon’s support will enable local nonprofit SouthEast Effective Development (SEED Seattle) to keep both of these apartment communities affordable for 99 years.\nSince its launch in 2021, HEF has helped to significantly increase multifamily affordable housing throughout the region. Today’s announcement brings Amazon’s affordable housing commitments across the Puget Sound to a total of $670 million to help make over 7,200 homes available to more than 15,500 residents. Learn more about the Amazon Housing Equity Fund.\nMarch 18, 2024 6:15 AM\nAmazon volunteers support Seattle/King County Clinic—providing free medical care to patients in need\nFor the third consecutive year, the Amazon team was proud to support the 2024 Seattle/King County Clinic through sponsorship and team volunteer efforts. As the largest volunteer-driven health clinic in Washington State, the Seattle/King County Clinic offers free healthcare services to thousands of people in our community who need it most.\n\"Every person deserves access to quality healthcare, and the Seattle/King County Clinic is doing vital work to address health disparities by ensuring the most in-need members of our community receive treatment,\" said Ty Rogers, VP of corporate communications and board member of Seattle Center Foundation. \"Amazon is proud to support this effort, and we’re committed to promoting health equity by ensuring these services are accessible. Thank you to everyone who came together to make this clinic happen, including the many Amazonians who volunteered their time to support our community.\"\nAmazon has deep roots in the Puget Sound region and is dedicated to the area’s long-term success. That’s why Amazon is expanding the impact of this private-public partnership by committing additional funding to support clinic operations for the next three years.\n“I’m so impressed with how teams at Amazon demonstrate a commitment to our culture of giving back to the community,” said Venkat Ramamurthy, senior software developer for Amazon and clinic volunteer. “After realizing how complex the healthcare system is, and the barriers so many face finding care, I was inspired to get involved. Volunteering at the clinic allows you to meet fascinating people from all walks of life while being part of something that has a huge and lasting impact.”\nThe clinic, held February 15-18 at Seattle Center, brought together nearly 100 cross-sector partners spanning healthcare organizations, civic agencies, nonprofits, and private businesses. As healthcare costs rise, and available public services remain difficult to navigate, the clinic fills an urgent need for accessible care.\n“We’re so grateful for Amazon’s generous support of Seattle/King County Clinic,” said Julia Colson, co-founder and project executive for the clinic. “Since our inception in 2014, together with our partners and volunteers, we have provided more than $23 million in critical dental, vision, and medical services free of cost to more than 27,000 individuals. That is the power of partnership.”\nFebruary 15, 2024 5:00 AM\nAmazon donates $9 million to organizations providing shelter and support services for individuals experiencing homelessness across Puget Sound\nToday Amazon announced a donation of $9 million in grants to six local organizations addressing the urgent needs of people experiencing homelessness across the Seattle region. Major recipients include Mary’s Place and Plymouth Housing, with additional funding to support The YMCA, The YWCA, YouthCare, and Friends of Youth.\n“As the number of people experiencing homelessness in our region continues to grow, it is important to support the organizations directly helping youth, families, and individuals,” said Alice Shobe, Global Director of Amazon in the Community. “From providing cash donations to local nonprofits to address soaring costs and increased demand, to investing more than $550 million to add over than 5,500 affordable homes in the Puget Sound, we are committed to helping tackle these challenges.”\nThe $9 million in grants will go to the following organizations:\nAmazon is donating $6 million to Mary’s Place in support of its ongoing operations and to provide funding toward a new affordable housing development in Burien, WA. The project will replace an existing shelter and provide more than 200 beds of emergency family shelter, housing, outreach, and prevention services for families, along with 90 units of permanently affordable housing to be developed by Mercy Housing Northwest.\n“Our partnership with Amazon has brought hope and housing to hundreds of women and families in our community. The love and support from Amazonians is life-changing,” said Mary’s Place CEO, Dominique Alex. “Today’s generous gift will help us increase critical shelter capacity and realize our big dream of making affordable housing more accessible for our guests and neighbors in South King County. We are so grateful to our incredible Amazon neighbors!”\nSince 2016, Amazon has committed more than $100 million in cash and in-kind donations to support Mary’s Place’s work to address family homelessness in King County. In 2020, Amazon and Mary's Place united to open the Mary’s Place Family Center in The Regrade—a first-of-its-kind permanent family shelter built inside one of Amazon’s office buildings in its Seattle headquarters.\nPlymouth Housing is a nonprofit that works to eliminate homelessness and address its causes by preserving, developing, and operating safe, quality, supportive housing. Plymouth also provides adults experiencing homelessness with opportunities to stabilize and improve their lives. Amazon is donating $2 million to Plymouth Housing to support the recent spike in demand for the organization’s services. Amazon has supported Plymouth Housing in multiple annual fundraising events, and in 2019, Amazon donated $5 million to their PROOF campaign, which helped create 600 new affordable homes.\n“This incredible investment from Amazon allows Plymouth Housing to bring even more of our neighbors from life on the streets into the dignity of a permanent home,\" said Karen Lee, CEO of Plymouth Housing. \"We look forward to our continued partnership with Amazon and to working together to ensure that our most vulnerable neighbors receive the housing and supportive services that they need to thrive and leave homelessness behind for good.”\nThe YMCA, YWCA, YouthCare, and Friends of Youth will use their grant funding to support their critical work serving the needs of people experiencing homelessness across the region, including families, women, and youth.\nThe donations announced today are the latest effort from Amazon to help address homelessness across Puget Sound. In addition to supporting the work of these organizations, Amazon is investing to increase affordable housing across the region. Learn more about Amazon’s community impact efforts.\nFebruary 6, 2024 8:00 AM\nAmazon to fund return of landmark Night Market in Seattle’s historic Chinatown-International District\nThe Chinatown-International District’s annual Night Market has been a hallmark event in downtown Seattle since its inception in 2006—attracting thousands of visitors each fall to enjoy all the district has to offer. However, rising production costs and decreasing sponsorship forced the cancellation of the 2023 Night Market. Knowing the positive impact the Night Market has for small businesses, the local culture, and on the Seattle community, Amazon is excited to announce that we are committing $250,000 to ensure the market will continue for the next three years.\nEach year, the market brings neighbors and the wider community to the Chinatown-International District (CID) to try a variety of cuisines, enjoy cultural performances, and browse vendor booths. In addition, the market adds much-needed foot traffic to the rich and varied small businesses that make up the district.\n\"Ahead of the Lunar New Year, and with Amazon’s generous donation and support, we’re thrilled to celebrate and bring this beloved community tradition back to the neighborhood after announcing its pause last summer,\" said Monisha Singh, executive director of the Chinatown-International District Business Improvement Area, the nonprofit that organizes the event. “The market, while celebrating culture and community, also serves as an important fundraiser for the critical work we do year-round to support those that live and work in our neighborhood—including our more than 400 small businesses. We look forward to welcoming visitors back to the Night Market this September to enjoy all that the CID has to offer.”\n“Coming from a family of CID small business owners, I know how important the Chinatown-International District Night Market is to our community,” said Seattle Citywide Councilmember Tanya Woo. “It’s been a fixture of the neighborhood for nearly 20 years and has helped so many small businesses grow. That’s why I am so excited by this support to ensure it continues. My hope is that this funding will allow for the Night Market to endure for generations to come.”\nThe Market is planned for September 2024.\nDecember 15, 2023 3:20 PM\nAmazon donates toys and spreads joy in the Puget Sound Region this holiday season\n‘Tis the season for giving! From setting up a Winter Wonderland in downtown Seattle for the community to hosting toy drives and shopping opportunities to support underserved children and families, Amazon is partnering with local organizations to help make this a special holiday season.\nOver 300 Amazon employees volunteered at our Winter Wonderland Toy Store, which provided gifts to underserved families across the Puget Sound region to give their loved ones. With help from organizations like Wellspring Family Services and Rainier Athletes, the Winter Wonderland Toy Store welcomed hundreds of families to pick out over 13,000 gifts for the holidays, courtesy of Amazon.\nAmazon also hosted an employee toy drive and donated more than 5,000 toys for children and families currently living at Mary’s Place Family Shelters. The toys were transported via Amazon delivery vans and hand-delivered by Amazon employees to the Mary’s Place Family Shelter locations in Seattle at our Puget Sound headquarters and in Bellevue.\nAnd in South Lake Union, our neighbors are welcome to enjoy our downtown Seattle campus Winter Wonderland, which includes larger-than-life snow globes and trees adorned with lights—perfect for holiday photo opportunities. We provided complimentary hot chocolate and hosted winter season performances from the Dickens Carolers, who delighted pedestrians with acoustic versions of their holiday music favorites. Winter décor will be up until January 8, 2024.\nIn the last two years, Amazon has become the largest corporate philanthropist in the Puget Sound region with more than $174 million donated to hundreds of local nonprofits and charitable organizations. We have deep roots in the Puget Sound region and are committed to its long-term sustainable growth and success. Learn more about our efforts in the Puget Sound Community.\nDecember 14, 2023 11:08 AM\nAmazon Helps Puget Sound students explore next-generation technology, including AI\nAmazon volunteers helped students explore computer science and artificial intelligence (AI) as part of CSEdWeek—a national effort to advocate for equity, and celebrate the contributions of students, teachers, and partners to the technology industry.\nIn the Puget Sound, Amazon Future Engineer partnered with Seattle Public Schools and Bellevue School District to host Hour of Code events with over 100 local elementary school classrooms. Amazon volunteers used the new Hour of Code Dance Party: AI Edition, a collaboration with Code.org that gave students an hour-long introduction to coding and AI. Students created their own virtual music video set to hit songs from artists including Miley Cyrus, Harry Styles, and more. The activity provided an introduction to AI, including learning about large language models and how they are used to power the predictive analytics responsible for creating new images, text, and more.\n“This is what we mean when we say ‘we want our kids Seattle ready.’ We're thankful our students can explore computer science in a way that’s safe with guidance from adults, so they can take it to the next level,” said Dr. Brent Jones, superintendent, Seattle Public Schools. “When we consider jobs of the future, we don't know what they are right now, but they'll have some aspect of coding. We can fight it or we can embrace it. I believe our students are learning how to embrace technology, naturally.”\nAdditionally, Amazon donated $1.5 million to Computer Science Teachers Association (CSTA) to update the CSTA K-12 Computer Science Standards to reflect rapid advancements in technologies like AI, help teachers incorporate career exploration initiatives in their classrooms for students, and maintain the CSTA Annual Conference as the premier professional learning event for CS educators. Learn more about Amazon’s efforts to expand access to computer science and STEM education.\nNovember 29, 2023 2:43 PM\nHow you can help end hunger in the Puget Sound region this holiday season with Amazon and Food Lifeline\n01 / 07\nOn November 22, fans and community members descended upon the Climate Pledge Arena before the Seattle Kraken game with canned goods in tow to support the “Together to End Hunger” food drive, say hello to Buoy, and catch artist, Stevie Shao, creating a mural in real time that was donated to Food Lifeline. The event was a collaboration between Amazon, Food Lifeline, and Shao to raise awareness about food insecurity in Puget Sound while also collecting food to support the community. Amazon delivered 1800 pounds of food, which equates to roughly 1500 meals, from this initiative to Food Lifeline who will distribute it across nearly 400 food distribution sites in the region.\nAmazon’s partnership with Food Lifeline is an important one that dates back to 2008. Today, this partnership is more important than ever since over 1.5 million people in western Washington will visit food banks this year, which is a 50% increase from last year.\n“With Amazon’s support through the donation of millions of pounds of food, logistical support, and financial contributions, Food Lifeline is able to better serve and deliver for Puget Sound residents facing food insecurity every day. We’d like to thank Amazon for their ongoing commitment to helping end hunger in their hometown community, everyone who has supported the 'Together to End Hunger' initiative, as well as those who support individually by donating their own time, money, and voice to support this cause,” says Ryan Scott, chief development officer of Food Lifeline.\nIf you haven’t had a chance yet, it’s not too late to support the work of Food Lifeline and make an impact on Puget Sound families this holiday season. Visit their website to donate or volunteer and check out scenes from the “Together to End Hunger” food drive above.\nNovember 17, 2023 9:51 AM\nAmazon celebrates its apprenticeship programs that offer employees paid opportunities to learn new skills and get on-the-job training\nTimed to National Apprenticeship Week (NAW), Amazon celebrated our various apprenticeship programs with organized local events in Seattle and Washington, D.C., and virtual viewing parties around the world. We also announced our 1,000th conversion from apprentice to full-time Amazon employee. The events offered an opportunity to recognize the achievements of current apprentices and recent apprentice graduates in cloud, mechatronics, and robotics roles, and hear from program leadership and our local partners. In Seattle, Amazon cohosted the events with Apprenti, a Seattle-based non-profit organization that administers the Amazon programs and coordinates with training providers.\nClint Daguplo started as a seasonal associate in July 2020, but he always had a passion for robotics. He decided to participate in the MRA program. “The apprenticeship program was great because I was able to earn the certifications needed for a job in robotics, while being paid during the learning and on-the-job training. Throughout the program, I was able to learn about the different opportunities Amazon offers to grow your career and to grow as a person.” After completing the MRA program, Clint landed a role as a Control Systems Technician on the Reliability and Maintenance Engineering team at an Amazon robotics site in Seattle.\nNAW is a nationwide celebration that highlights the value of Registered Apprenticeships in advancing our economy, promoting equity, and supporting underserved communities. Amazon offers numerous paid apprenticeship programs that provide employees opportunities classroom learning and on-the-job training to earn the certifications and training hours needed to land technical and nontechnical roles. Read more about the benefits of on-the-job training programs like our apprenticeships from Nick Curry, Senior Manager of Emerging Talent Pipelines at Amazon.\nNovember 16, 2023 6:00 AM\nGage Academy to open non-profit art school in Amazon’s re:Invent building\nIn 2024, Gage Academy of Art will move from its current location in the Capitol Hill neighborhood into Amazon’s re:Invent building located in South Lake Union.\n“Creating space for the arts is vital for fostering a thriving downtown that brings together diverse retail, dining, entertainment, and culture options, and we’re thrilled that our Puget Sound headquarters will host Gage Academy of Art as part of this effort,” said John Schoettler, vice president of Global Real Estate and Facilities at Amazon. “Gage Academy is an essential part of the Seattle arts scene and we look forward to experiencing firsthand the positive impact it will have on the surrounding community.”\nGage Academy of Art is a fixture of the Seattle arts community. The school is committed to excellence in the fields of painting, drawing, and sculpting, and has invited art makers of all ages, abilities, and backgrounds to become a part of its vibrant learning community. More than 3,000 adults and young people enroll each year in Gage Academy’s ateliers, classes, workshops, and youth programming. Gage also hosts another 8,000 community members across its campus, partner locations, and online for free lectures, community art programs, and family-friendly events when it moves to its new space in South Lake Union, the school can serve a larger, more diverse student body in a central location and close to more public transportation options.\n“We want to thank Amazon for supporting Gage Academy and our longstanding mission to make the arts accessible to Puget Sound community members of all ages,” said Kathleen Allen, executive director, Gage Academy of Art. “This partnership with Amazon and relocation downtown will allow us to develop a state-of-the-art facility that aligns with our commitment to excellence in arts education.”\nThe new 14,000-square-foot space is designed by architecture firm NBBJ and will include innovative and flexible classrooms, art studios, and communal student spaces that promote collaboration. The design will embody openness through its multi-level spaces and accessibility through its central downtown location and proximity to multiple public transportation options.\nNovember 13, 2023 3:43 AM\nCommunity Impact Report: Puget Sound\nAs Amazon continues to grow, we know that our customers, employees, and the communities where we operate have high expectations of us. They look to us to have a positive impact beyond our investment and the jobs we create, and they want to see us apply our innovative spirit and resources to help address the many challenges their communities face. We want to do that, too.\nNovember 10, 2023 9:26 AM\nHow Amazon and Food Lifeline are partnering to help end hunger in Puget Sound\nSince 2008, Amazon has supported the critical work of Food Lifeline and its mission to end hunger in Western Washington. Food Lifeline sources millions of pounds of healthy, surplus food from partners across the region. From June 2022 through July 2023, 1.5 million people in Western Washington visited area food banks, which was a 50% increase over the previous year. Through its work, Food Lifeline delivers food to more than 400 distribution sites across Puget Sound to feed our neighbors every single day.\n“Our weekly deliveries of food from Amazon and its partners are a key component in the work we do in Western Washington,” says Ryan Scott, chief development officer of Food Lifeline. “The yellow crates they deliver are everywhere in our warehouse and are a testament to Amazon’s commitment and hard work in helping end hunger.”\nThis November, we’re excited to expand our partnership in support of Food Lifeline’s “Together to End Hunger” holiday initiative. Beginning November 6, a food donation bin designed by local Seattle artist, Stevie Shao, will be set up at Kraken Community Iceplex to collect food items for donation to Food Lifeline.\nOn November 22, fans and neighbors can join us before the Seattle Kraken game on the southwest plaza outside Climate Pledge Arena from 3-7 p.m. PST for the “Together to End Hunger” Food Drive presented by Amazon to benefit Food Lifeline. Bring canned goods to donate, see Stevie Shao create a “Together to End Hunger” mural live, and pick up your own “Together to End Hunger” advocacy patch featuring Shao’s design. All food collected by Amazon will be delivered to Food Lifeline, then transported to food distribution sites across Puget Sound.\n“We’re building a movement to end hunger,” said Scott. “And the key to building a movement is raising awareness. The more people understand the problems, the more action they will take. With our “Together to End Hunger” holiday initiative, Amazon is helping bring more people into the conversation, and more voices mean more action.”\nFood Lifeline is one of several organizations that Amazon supports financially and logistically to help people facing food insecurity across Puget Sound. Learn how Amazon partners with additional food assistance organizations across the U.S. and other ways Amazon invests in the Puget Sound community.\nNovember 6, 2023 8:00 AM\nAmazon partners with the Gary Sinise Foundation to support Seattle first responders on the front lines\nAmazon is partnering with the Gary Sinise Foundation (GSF) to give $150,000 to the Seattle Fire Department to fund new safety equipment and firefighter mental health resources to support the needs of first responders in Seattle.\n“Our firefighters bravely respond to unthinkable challenges, and this can take a toll on mental health,” said Guy Palumbo, director, Amazon Public Policy. “We must make sure that, as a community, we are investing in our first responders, so they’re able to continue their life-saving work. This grant is our way of saying ‘thank you’ for serving our city with dedication and courage.\"\nThe donation is part of a new three-year commitment from Amazon to GSF to honor military veterans and first responders, and will help fund first responder grants for state-of-the-art equipment. This includes resources like a revolutionary PeerConnect app, which provides peer support, wellness tools, self-assessment, mental health programming, and resources to Seattle Fire team members. The Department will also be equipped with 900 pairs of cutting-edge extrication gloves, ensuring hand protection in various rescue scenarios.\n“We are grateful to have been selected for this grant from GSF and Amazon,” said Seattle Fire Chief Harold D. Scoggins. “With nearly every dollar of our department budget allocated, finding the money for new equipment and training can be challenging. Through this generous grant, we’re able to provide each firefighter with the tools they need, while continuing to build programs that help firefighters deal with the traumatic and stressful situations they encounter daily. Neither would have been possible without GSF and Amazon’s support.”\nGSF has a long-standing mission of honoring defenders, veterans, first responders, their families, and those in need through various programs, initiatives, and contributions like this one.\n“Our first responders are on the front lines of our communities, running into danger and risking their lives every day to keep their cities safe,” said Donna Palmer, executive director, GSF. “On behalf of our founder, Gary Sinise, and our incredible partner, Amazon, we are honored to provide this essential equipment to the Seattle Fire Department to show our deep gratitude for these heroes and their service to their community.”\nA day of appreciation\nEarlier in October, to mark National First Responders Day, volunteers from Amazon and GSF team members gathered at Seattle Fire Station 2 in Belltown to extend their appreciation. Seven members of the Amazon First Responders affinity group, a group of former first responders, volunteered to serve meals to the firefighters in attendance. In addition, two therapy dogs joined to help lend a “paw” to support firefighters during the event.\nNovember 2, 2023 8:00 AM\nAmazon is sizing up and investing in its Washington workforce for the holidays\nIn September, we shared that Amazon would be creating more than 250,000 full-time, part-time, and seasonal fulfillment center and transportation roles for the holiday season. In Washington state, that means 7,000 new opportunities for people looking for a new job, interested in making a career pivot, or just looking for a short-term way to earn extra money. And the roles we provide are for those at any career stage. In fact, 56% of associates hired by Amazon in the Seattle area were previously not working, and for 11% of those people, their role at Amazon was their first job.\n“When I first started at Amazon, I was a seasonal employee, and then I really quickly became a blue badge, full-time employee,” said Laci Temple, a delivery station associate in Sumner, Washington. “You have a lot of opportunities here that you can take advantage of.”\nWhat’s more, Amazon is also investing $1.3 billion this year toward pay increases for customer fulfillment and transportation employees, bringing the average pay for those roles to over $20.50 per hour. Some fulfillment centers are also providing bonuses, like $3,000 being offered at a fulfillment center in Arlington, Washington.\n“I came to Amazon earlier this year because I was looking for an opportunity that would allow me to run my business and earn a paycheck after hours,” said local Amazon employee and farmer Grace Graver, an associate who works at Amazon’s fulfillment center in Kent, Washington. “You get medical and dental benefits from day one. Not only that, but the retirement benefits are great. It’s really easy to enroll in, and HR walks you through everything.”\nWe provide career advancement opportunities, anytime access to earned pay, health, vision, and dental insurance from the first day on the job; a 401(k) with company match; up to 20 weeks of paid pregnancy/parental leave for birth parents (six weeks for eligible supporting parents); and Amazon’s Resources for Living program, a free benefit offering mental health and financial services and support for employees, their families, and their households.\nOctober 31, 2023 3:32 PM\nDelivering the Future takes attendees behind the scenes on our latest innovations\nIn October, Amazon hosted Delivering the Future at our Puget Sound headquarters. 100+ reporters from around the world got a behind-the-scenes look at our latest innovations that will help us better serve customers, support employees, and show up for communities we serve around the world. Learn how Amazon is driving innovation, right here in the Puget Sound:\n- Amazon announces 8 innovations to better deliver for customers, support employees, and give back to communities around the world\n- Amazon announces 2 new ways it's using robots to assist employees and deliver for customers\n- Amazon is launching ultra-fast drone deliveries in Italy, the UK, and a third location in the U.S.\n- Amazon announces its first automated U.S. fulfillment center to eliminate plastic delivery packaging\n- Amazon unveils new AI-powered technology that will inspect delivery vans and help keep drivers safe\nOctober 30, 2023 3:30 PM\nAmazon’s Global Month of Volunteering effort delivers 90,000 hygiene kits to Puget Sound organizations that support disaster relief\nTens of thousands of Amazon employees from 51 countries around the globe participated in Amazon’s Global Month of Volunteering, an initiative dedicated to building stronger communities in the cities and towns where our employees live and work. Volunteers cleaned up parks, donated school supplies and clothing to students, built houses for families experiencing homelessness, assembled wish boxes for kids, and delivered meals to local food banks.\nIn Seattle, employees gathered at Amazon’s Day 1 Playfield to volunteer with Clean the World to build and deliver more than 90,000 hygiene kits to Puget Sound organizations that support disaster relief efforts around the world. Clean the World provides recycled soap and hygiene supplies to people who have limited access to essential items that help prevent illnesses and diseases.\nOctober 25, 2023 3:05 PM\nAmazon Housing Equity Fund Brings minority-led developers together in Seattle\nOn October 16 and 17, 2023, 25 fellows from the Amazon Housing Equity Fund’s Housing Equity Accelerator Fellowship (HEAF) program met in Seattle, Washington to visit several affordable housing developments across the region and to share their experiences as program members—a key goal of the Housing Equity Fund is to support diverse developers and minority-led nonprofits focused on affordable housing.\nVisiting fellows toured four affordable housing properties—some that were complete, under construction, and yet to break ground—while learning from local developers at these project sites. Fellows also shared insights regarding how the Amazon Housing Equity Fund is helping them grow their businesses while creating more affordable homes across their respective communities.\nCollectively, the Amazon Accelerator program includes 38 diverse developers from the Puget Sound Region, the Arlington, Virginia/ Washington D.C. region, and Nashville, Tennessee. Learn more about the Amazon Housing Equity Fund and its Accelerator program.\nOctober 23, 2023 12:40 PM\nAmazon gives another $1.7 million to help meet the basic needs of students from underserved communities in Seattle and Bellevue, Washington\nAmazon provided a new $1.7 million donation to Alliance for Education and Bellevue LifeSpring to support the immediate needs of students from underserved communities in Seattle and Bellevue, Washington. These nonprofit organizations will use the contributions to help manage their respective Right Now Needs Funds—programs designed to ensure students in the Puget Sound region have their basic needs covered, from from food to clothes to school supplies. Amazon’s donation includes $1 million to the Alliance for Education to support all 104 schools within the Seattle Public Schools district and $700,000 to Bellevue LifeSpring to support all 30 Bellevue School District schools.\nOctober 2, 2023 11:10 AM\nAmazon’s Washington state investment grows to $225.7 billion\nLast week, we released the latest findings from Amazon’s . Since 2010, we’ve invested more than $225.7 billion in Washington state. Keystone Strategy, a third-party consultancy has found that these investments, including infrastructure and compensation to our employees, have helped to expand the local economy and support an additional 487,200 indirect and induced jobs across the state in fields like health care, retail, construction, and education. Additionally, more than $205 billion has been added to the state’s gross domestic product (GDP) thanks to our investments and job creation, on top of what we’ve directly invested.\n“Amazon is proud of our role in keeping the Puget Sound region and Washington state economic engines running,” said Ron Frierson, director of Economic Development for the Western U.S. at Amazon. “From the hundreds of thousands of direct and indirect jobs we’ve created and supported across the state, to the development of our global headquarters and infrastructure investments, we’re proud of the opportunities we helped to unlock for Washingtonians.”\nWe also know that our responsibilities here go beyond our business investments, and we’re committed to the causes that matter to the community. In the last two years alone, Amazon has become the largest corporate philanthropist in the Puget Sound region, with more than $174 million donated to local nonprofit groups and charitable organizations. On top of this, we’ve also provided more than $500 million to create and preserve more than 5,300 affordable homes here through the Housing Equity Fund, Amazon’s $2 billion commitment to address the national housing affordability challenges starting in our hometown communities.\nSeptember 21, 2023 9:00 AM\nAmazon volunteers help keep clean up Seattle parks\nAmazon volunteers helped clean up five parks around Seattle as part of Amazon’s Global Month of Volunteering initiative. This is the second year Amazon volunteers participated in the Seattle Parks cleanup activity, where they assisted with picking up litter, weeding, and mulching activities, all in the name of beautifying the parks.\nFrom September 1-30, tens of thousands of Amazon employees will volunteer to support the communities where they live and work, adding to the company’s local investments throughout the year, as part of the Global Month of Volunteering initiative. In collaboration with hundreds of community organizations, employees will help support causes they are passionate about—from climate change, education, and food insecurity, to disaster relief and housing inequity.\nSeptember 19, 2023 9:00 AM\nAmazon to help moderate-income residents become homeowners across the Puget Sound\nAmazon’s Housing Equity Fund (HEF) launched a $40 million pilot program that will help up to 800 families and individuals become homeowners, including residents from underserved communities across Puget Sound. The pilot is in partnership with the National Housing Trust (NHT) and will support a range of innovative homeownership models led by local nonprofit organizations in the Puget Sound region (as well as organizations in the Arlington, VA and Washington, D.C. region, and Nashville, TN). NHT will partner with these organizations to acquire and build affordable homes for sale to local residents (the majority of them making below 80% of the area median income).\nAfrican Community Housing & Development (ACHD) is one of the Puget Sound-area organizations participating in this initiative. \"This funding will allow ACHD to further develop our holistic services and affordable homeownership projects for the African Diaspora community in King County,\" said Hamdi Abdulle, ACHD Executive Director. \"ACHD knows that when we invest in affordable homeownership, we invest in advancing human dignity.\"\nSince 2021, HEF has committed more than $1.7 billion to create or preserve more than 14,000 affordable homes for renters across the company’s hometown communities, including more than 5,300 homes across Puget Sound. Learn more about this pilot program and Amazon’s Commitment to Housing Equity.\nSeptember 19, 2023 9:00 AM\nAmazon in the Puget Sound\nLooking for the latest news about what’s happening around our Puget Sound headquarters? You’re in the right place.\nWith more than 75,000 employees here, we continue to invest in the community, help power the local economy, and provide well-paying jobs with leading benefits. As Amazon grows, so does our responsibility to the people and places that we call home.\nWe’re committed to addressing issues that matter most to the Puget Sound community including affordable housing, education, and homelessness. We offer employment, pre-paid education, and technical skills training to move into higher-paying roles, and up to 20 weeks of paid parental leave across the U.S.\nA lot is happening here—be sure to check back regularly to discover the latest about Amazon’s community commitments and how we’re investing and unlocking opportunity for our hometown region.\n- How Amazon is helping Puget Sound employees develop skills and land the jobs of the future\n- 9 statistics that show how Amazon’s return to office is helping to bolster Seattle businesses\n- Amazon named top corporate giver in Puget Sound region\n- Meet the 8 rising Seattle artists selected for Amazon’s Artist in Residence program\n- Amazon commits $25 million to new public-private housing fund that will build affordable homes near public transit across Washington state\n- Amazon donates $3 million to community colleges’ computer science programs in the Puget Sound region\n- Amazon to fund construction of 568 affordable homes in Seattle\n- Amazon welcomes 4 new small businesses to Puget Sound HQ"
    },
    {
        "Ticker": "AMZN",
        "Company": "Amazon",
        "Source_URL": "https://www.aboutamazon.com/news/aws/amazon-data-centers-locations-news",
        "Content_Type": "Website Content",
        "Raw_Text": "November 17, 2025 6:00 AM\nNeighbors helping neighbors: Amazon's partnership with Loudoun Education Foundation feeds students' potential\nIn Loudoun County, Virginia, food insecurity remains a hidden challenge. According to the Virginia Department of Education, in fall 2024, 1 in 4 Loudoun County students were considered economically disadvantaged. Through a partnership between Amazon, the Loudoun Education Foundation (LEF), and Delivery Service Partner (DSP) Silkway Express LLC, local students receive critical support through the FUELED program.\nFUELED addresses food insecurity through in-school pantries and weekly meal bags for the weekends. \"The partnership with Amazon has been a game changer,\" says Courtney Soria, FUELED program assistant. \"It has meant possibility for our program. It's meant services to schools and students that just weren't feasible before.\"\nThe program now distributes approximately 1,500 bags of groceries weekly to local students in need—a record number made possible through collaborative logistics support. What began as a parent-led initiative has transformed into a comprehensive support system. In addition to lending logistics support, Amazon also provides financial support, and volunteers help package groceries every first Tuesday of the month.\nKrislyn Schell-Smith, FUELED program coordinator, explains that Amazon's involvement came after supporting STEM programs, when the company asked, \"What else could we help you with?\"\n\"Being a good neighbor means you're involved in your community. This is our delivery area, so it's natural that we help where we actually serve customers,\" said Yerlan Sagymbayev of Silkway Express LLC.\nThe impact extends beyond nutrition. \"Enabling our children to focus on their studies has a huge impact. It allows them to dream and participate more fully at school,\" shares Jane Kennedy, family liaison at Dominion Trail Elementary. \"Our community is so grateful for all the work that's being done.\"\nSince beginning data center operations in Loudoun County in 2006, Amazon has helped drive grassroots programs like this one through education and volunteerism. While addressing food insecurity remains an ongoing commitment, this partnership demonstrates how community collaboration can create powerful outcomes for students in need.\nNovember 10, 2025 11:00 AM\nAmazon partners with Goodr to open free grocery store in Newton County, Georgia\nA new resource provides Newton County students and families with additional access to nutritious food in a convenient shopping environment.\nIn Newton County, Georgia, where roughly 9% of residents experience food insecurity, a new solution has taken root at Alcovy High School. Amazon has partnered with Goodr and Newton County Schools to open a no-cost grocery store on campus, providing students and their families with monthly access to fresh produce, shelf-stable food, and household essentials.\nThe store addresses an important need in the community by creating an additional resource for families. By placing the grocery store directly inside the high school, the program removes transportation barriers and provides convenient access to healthy food.\n\"Today is a celebration not just of a store but of how a community sees itself,\" said Jasmine Crowe-Houston, founder and chief executive officer of Goodr. \"What we're launching here is about more than food. It's about restoring agency, offering choice, and reminding families they deserve more than crisis aid.\"\nEligible families can schedule monthly shopping appointments and request emergency access when needed. The store is stocked with fresh produce, proteins, dairy products, grains, culturally relevant staples, and hygiene items.\n\"The opening of this Goodr Grocery Store represents what's possible when businesses, nonprofits, and schools come together with shared purpose,\" said Afrika Alsup, community engagement manager at Amazon. \"These meaningful partnerships allow us to contribute to community-driven solutions that make a tangible difference in students' lives.\"\nThis initiative aligns with Amazon's commitment to strengthening data center communities where employees live and work, focusing on education and hyperlocal social impact that creates meaningful opportunities for students and families to thrive.\nNovember 7, 2025 10:07 AM\nGrassroots community projects across three Georgia counties awarded Amazon funding\nAmazon awarded a total of $400,000 in grants to 41 community projects across Newton, Butts, and Douglas counties through the Amazon Community Fund. These grants empower grassroots organizers to bring their visionary ideas to fruition, reflecting Amazon's commitment to driving positive change in our data center communities.\nRecipients gathered for two receptions at the Butts County Performance Arts Center and Legacy Arena on October 21 and 24. Amazon representatives and grant recipients shared remarks highlighting the local impact of these initiatives.\n\"The funding from the Amazon Douglas County Community Fund is helping us bring real-life learning initiatives into community spaces,\" said Monte Applewhite of the GoSayHELLO Foundation. \"This support allows us to help people of all ages become more comfortable with technology and see how AI can create new opportunities in their lives.\"\nApplications opened on July 2 and closed on August 27. Recipients could apply for up to $10,000 in grants to launch new projects or expand existing ones that addressed various themes, including STEM education, affordable housing, food insecurity, and sustainability.\n\"I am deeply honored to receive funding from the Amazon Butts and Newton Counties Community Fund. This incredible support represents an investment in the bright futures of our students. Thanks to this partnership, young minds will have the opportunity to explore coding, innovation, and leadership through our Newton Kids Code and EmpowHER summer camps,\" said Jennifer Williams, director of instructional technology and media services at Newton County Schools.\nThis initiative is part of Amazon's ongoing data center investments across our regions, including Georgia. The Amazon Community Fund in Georgia follows our education equity programs for STEM learners such as Think Big Experiences and SOOFA Ranch BeeSmart program, the Taste of Douglasville event, and our partnership with Goodr to build a new grocery store.\nNovember 5, 2025 9:02 AM\nFrom volunteer to lead ambassador: My journey with the Boardman Food Pantry\nAmazon data center employees have volunteered at the Boardman Food Pantry in Boardman, Oregon, for years. After a fire destroyed the food pantry in summer 2025, Amazon volunteers are supporting operations at a temporary location while assisting with rebuilding efforts. AWS Data Center Engineer Cesar Solis's experience exemplifies Amazon's commitment to community:\nFour years ago, Solis was invited by his manager to help with a holiday delivery at the pantry. Walking in that day, he discovered that although the facility wasn't large in size, it offered heart and hope to the community. The love shown toward local residents inspired Solis, who immediately became committed to community service.\nSolis has participated in community work through Amazon Think Big Spaces, career fairs, and the Humane Society. After several years of volunteering, he became a lead ambassador—a role that allows him to deepen those connections and expand Amazon's impact in Boardman.\n“What makes this work meaningful is seeing the difference we make firsthand—the smiles, the thank-yous, and sometimes tears of gratitude. In our small community, each act of kindness creates powerful ripples that touch many lives. When fire destroyed the Boardman Food Pantry—the only one serving our area—their spirit remained unbroken,” said Solis.\nThe response from his Amazon colleagues was immediate and heartfelt. Over 20 employees gathered at the food pantry's temporary location, unloading pallets of food, restocking shelves, and assembling more than 100 meal packages for affected families.\nRecently, Solis joined his Amazon team at a fundraising auction where the company contributed $100,000 toward rebuilding the pantry. Alongside Kerry Person, vice president of Data Center Planning and Delivery, and fellow team members, Solis participated in sharing Amazon's commitment to community development in Boardman.\nOctober 30, 2025 12:06 PM\nAmazon breaks ground on $10 billion data center project in North Carolina\nAmazon celebrated the start of a new chapter in Richmond County, North Carolina, with a groundbreaking celebration that brought together state leaders, members of Congress, and local community champions. Amazon Vice President of Economic Development Roger Wehner and Amazon leaders ceremoniously broke ground on what will be a transformative data center campus in North Carolina.\nThe planned $10 billion investment in North Carolina announced earlier this year represents more than infrastructure development. It's set to create a ripple effect of economic opportunity throughout the community, including 500 high-skilled jobs, STEM education programs, and a community fund to support local businesses and organizations.\n\"This marks the beginning of a new chapter for Richmond County as we build the infrastructure that will power tomorrow's economy,” said North Carolina Lieutenant Governor Rachel Hunt. “Amazon's investment - one of the largest in our state's history - positions North Carolina at the forefront of artificial intelligence and cloud innovation for decades to come. I'm proud to celebrate this milestone and look forward to the impact this project will have on our communities.\"\nCommunity impact starts now\nThis week, Amazon held a Fiber Optic Fusion Splicing Certificate course with Richmond Community College, where students received hands on training from industry professionals. There was also a four-hour micro course for high schoolers interested in entering the data industry. In total, 80 people took part in these courses.\n\"Skills development creates lasting benefits for local communities, which is why we're committed to investing in workforce training wherever we operate,\" said Roger Wehner, Amazon VP of Economic Development. \"Our Fusion Splicing program opens new career paths for participants who learn fiber optic installation and maintenance. These are essential skills needed to build the digital infrastructure that will connect our nation for generations to come.\"\nOctober 17, 2025 8:57 AM\nAmazon empowers student innovators at DubHacks 2025\nAmazon will provide tools, mentorship, and career opportunities for the next generation of innovators.\nWhen you were growing up, what bold imaginative ideas did you have? At this year's DubHacks 2025, the largest hackathon in the Pacific Northwest, students at the University of Washington are daring hackers to answer that very question.\n\"Instead of just building with crayons and coloring when you were younger, you get to code and build,\" explained DubHacks Director Erika Ni. \"There's no more limits. It's just creativity.\"\nLast year's winners created the project Empowering Memories. Developers wanted a solution that could help those affected by Alzheimer's, after witnessing a loved one struggling with daily interactions including forgetting familiar faces.\n\"Amazon and AWS can connect with the student base. They're able to help guide them in their projects,\" said Ni. \"Give advice and support to these teams that really help drive them to becoming better innovators, better builders.\"\nDuring the weekend-long event, AWS engineers including Mitchell Roberts and Suheel Farooq will be on site, helping students take on the hacking challenge. Amazon is one of DubHacks 2025's flagship sponsors (Pink Tier), offering students access to artificial intelligence and machine learning (AI/ML) products and services.\n\"We'll be sharing a lot of information around how we work behind the scenes in our day to day life,\" said Farooq.\nThere's also a career fair where students can interact directly with Amazon employees. Two hundred people applied for software development engineer internships at Amazon during DubHacks 2024.\n\"Showing them that there are real people behind these products and services, that Amazon and AWS provide really gives them hope and gives them motivation that they can achieve success in their careers,\" said Roberts.\nAnd they hope, by the end of the weekend, more students will look to change the world as Amazon employees.\n\"The reason I enjoy working at Amazon the most is because it challenges me to innovate on the fly,\" said Roberts. \"I'm challenged every day to perform above and beyond any other company that I've worked at.\"\n\"At Amazon, no one would stop you from learning anything,\" said Farooq. \"At every step, I was learning something new. So it is up to you.\"\nOctober 7, 2025 2:14 PM\nCommunity organizations celebrate completion of Amazon-funded solar project in eastern Oregon\nAmazon's renewable energy initiative with GRID Alternatives celebrated a significant milestone as various community organizations across eastern Oregon gathered for a ribbon-cutting ceremony at the Boardman Senior Center on October 6. Nine local organizations received new rooftop solar panels from Amazon and GRID Alternatives, the nation's largest nonprofit solar installer.\nThe solar installations benefit a diverse range of community organizations, including senior centers, transitional housing, and Head Start schools across eastern Oregon, and they are already making an impact. \"In the few months that we have had the solar panels provided by Amazon, we have already seen a significant reduction in our monthly electric bills,\" said Rick Weiss, president of the Boardman Senior Center Board of Directors. \"We appreciate this partnership with Amazon and their contribution to the Boardman Senior Center.\"\nThese organizations can now \"generate their own carbon-free energy while cutting their electric bill by an average of 80% over the next 30 years,\" according to Daniel B. Dumovich, director of strategic initiatives at GRID Alternatives. This sustainability initiative represents Amazon's ongoing commitment to eastern Oregon communities, where the company has maintained data center operations for more than a decade. The success of the project demonstrates how corporate and nonprofit partners can collaborate and foster meaningful impact that addresses both environmental sustainability and local community needs.\nThe event also featured a volunteer activity where Amazon and community members assembled over 80 sustainability kits for the Boardman Senior Center. Amazon's investment in eastern Oregon has exceeded $30 billion since 2012, which includes supporting various community initiatives across the region as part of the company's commitment to being a good neighbor and creating lasting change in the region.\nOctober 3, 2025 11:00 AM\nAmazon launches global Think Big Circle to connect young STEM learners worldwide\nThis week, Amazon launched Amazon Think Big Circle, a new global collaboration platform connecting Amazon Think Big Spaces globally across our data center communities. The initiative furthers Amazon's commitment to fostering science, technology, engineering, and math (STEM) education in communities where we operate.\nThe launch will coincide with the Tangible World Cup, a global STEM challenge sponsored by Amazon and led by Leva Foundation. This online competition will bring together more than 1,900 learners from more than 30 countries to solve Tangible Coding challenges, showcasing how accessible technology can bridge educational gaps in underserved communities.\n\"The Think Big Circle represents our belief in the power of connecting young learners to global exposure and engagement,\" said Sarah Georgiades, head of Americas community engagement, Amazon Data Centers. \"Creating opportunities for students to collaborate across borders and engage with STEM education in inclusive, hands-on ways, will support our joint efforts to facilitate the next generation of diverse innovators who will shape our future in these very critical fields.\"\nAmazon Think Big Circle will serve as a hub for continued collaboration between Think Big Spaces, supporting co-created programs and peer-to-peer learning. More than 200 students from Amazon data center communities including northern Virginia, eastern Oregon, Dublin, Zaragoza, Mumbai, and Cape Town participated in the launch event, with students and educators gathering in Think Big Spaces.\nThis initiative aligns with Amazon's priority to support equitable STEM education, one of our four key community pillars alongside Local Skills Development, Sustainability, and Hyperlocal Social Impact. By working closely with local organizations and community members in our data center locations, we aim to create meaningful, long-term initiatives that drive positive change where our employees live and work.\nThrough these global initiatives, Amazon continues to invest in supporting resilient communities and empowering future builders with the skills they need to thrive in an increasingly digital world.\nSeptember 26, 2025 10:33 AM\nAmazon's Virginia community initiative hits a home run with Fredericksburg Nationals event\nThis summer, Amazon teamed up with Turner Construction Company and Renato's Spreading Smiles to create a special experience for 75 children from local Virginia shelters. Together, we hosted these resilient kids at a Fredericksburg Nationals baseball game—for many, their first time experiencing America's favorite pastime. The children participated in special activities, including joining the player high-five tunnel and singing the National Anthem on the field. As part of the same community initiative, Amazon team members also organized activities for more than 30 families and 60 children at Hope House Homeless Shelter and the Bragg Hill community, including cookouts with face painting, STEM activities, and snow cones. These community partnerships represent Amazon's ongoing commitment to Virginia, where our data center investments continue to support local economic development and community engagement programs throughout the region.\nSeptember 11, 2025 9:12 AM\nAmazon's community initiatives create lasting impact in eastern Oregon\nAmazon's commitment to being a good neighbor in eastern Oregon takes shape through community programs that create lasting impact, address local needs, and open new opportunities. In 2024 alone, this translated to more than $2 million in investments supporting community initiatives across the region.\nOne key initiative is Amazon's contributions to local projects through its partnership with ChangeX, which provides microgrants of up to $10,000 to fund local grassroots projects. Through this program, Amazon has committed $980,000 to help launch or expand more than 120 community-focused projects in Morrow and Umatilla counties.\nEducation stands as another cornerstone of Amazon's community efforts. \"Programs like Amazon's Think Big Spaces and Girls' Tech Programs are opening doors for our students, especially young women to explore STEM in ways that are hands-on, relevant, and inspiring,\" said Tricia Mooney, superintendent of Hermiston School District. \"These opportunities are helping our students see what's possible and giving them the tools to dream big, right here in Umatilla County.\"\nThis commitment to education extends through programs like We Build It Better, which has reached more than 800 students across seven area schools, and the GO STEM Mobile Maker Lab partnership with Eastern Oregon University, bringing hands-on STEM learning directly to students.\nBeyond education, Amazon supports community groups throughout the region.\n\"Amazon's sponsorship has had a meaningful and lasting impact on the veteran community in eastern Oregon,\" shared Shannon White, executive director of the Pacific Northwest Veterans Alliance. \"The company's support has enabled us to host inclusive, morale-boosting events that bring together hundreds of veterans and community members to honor service, foster connection, and promote mental health awareness.\"\nFrom supporting local grassroots projects to expanding educational opportunities and fostering community connections, Amazon's diverse investments in eastern Oregon reflect a commitment to long-term regional growth and creating lasting opportunities.\nSeptember 5, 2025 10:18 AM\nAmazon partnered with Hayward schools to launch student internship program\nAmazon deepened its commitment to the Hayward, California, community by expanding its partnership with Hayward Unified School District (HUSD) to support a comprehensive Summer Internship Scholarship Program for high school students. The sponsorship supported the program where more than 20 students participated. At the end of the program, the students shared their experience with families, school district and Hayward city officials, teachers, and members of the community in a heartwarming graduation ceremony. This partnership enabled participation by removing financial barriers that might otherwise prevent students from accessing valuable career experiences.\n\"Our partnership with Amazon has been a true 360-degree collaboration,\" said Norma Diaz, career pathways TOSA, HUSD. \"Not only have students gained eye-opening exposure to STEM careers and fully committed to building valuable workforce skills, but local businesses have also directly benefited by witnessing the incredible talent within Hayward Unified School District.\"\nThe program began with soft skills development workshops and culminated in 80-hour internship placements with local industry partners. Students received ongoing support from the district's Career Technical Education (CTE) team, with coordination through the district's college and career coordinator, CTE teacher on special assignment, and college and career technicians at each high school.\n\"This partnership empowers our students to imagine, explore, and take confident steps toward their career goals,\" said Veronica Ortiz, college and career coordinator, HUSD. \"Through programs like Girls' Tech Day, We Build It Better, and Spring Break Tech Camp, our youth gained hands-on experience and discovered what is possible.\"\nThis initiative represented Amazon's continued investment in building a strong, skilled, and future-ready workforce across our data center communities, creating pathways to success for students while strengthening connections between education and industry that benefited the local economy.\nSeptember 3, 2025 11:32 AM\nAmazon helps students across data center communities prepare for back-to-school success\nAs students prepare to return to classrooms this fall, Amazon partners with local organizations in communities where it operates data centers to ensure children start the school year with the supplies and resources they need to succeed.\nIn South Bend, Indiana, La Casa de Amistad's annual \"Ready, Set, School!\" event brought the community together in a celebration of education. Presented by Amazon, the event welcomed families to La Casa's location where the first 1,000 students received clear backpacks and selected their own school supplies.\n\"La Casa has always been a place where our Latino and immigrant families can feel welcomed, supported, and celebrated,\" said Juan Constantino, executive officer, La Casa de Amistad. \"We know education is the main path to success and opportunity and we're thrilled to start the year together on a positive note.\"\nBeyond school supplies, \"Ready, Set, School!\" offered free meals, activities, music, raffles, and a resource fair featuring community partners, including the St. Joseph County Health Department providing immunizations.\n\"La Casa de Amistad is incredibly grateful to our partners at Amazon for their generous sponsorship,\" Constantino added. \"With their help, we provided thousands of supplies to local students.\"\nIn Woodbridge, Virginia, Amazon supported the Prince William County Community Foundation's annual back-to-school community event, which distributed more than 3,500 backpacks, school supplies and resources to increase school readiness throughout the region.\nIn Hermiston, Oregon, Amazon also supported Agape House with a community donation and backpacks for local students, ensuring rural communities receive much-needed educational resources. These initiatives helped turn \"supply lists\" into \"success lists\" for thousands of students ready to write their stories for the new school year.\nAugust 28, 2025 7:35 AM\n“More work than we've ever seen\": Amazon celebrates construction milestones in Mississippi\nAmazon celebrated major construction milestones on its data center operations in Mississippi alongside local leaders, businesses, and the essential professionals whose daily efforts drive the project forward. At a breakfast hosted at the Madison County Economic Development Authority, Amazon recognized the remarkable pace of construction progress and highlighted the growing economic impact these facilities are already having on the local community.\nWhen Amazon announced its planned investment of $10 billion in the Magnolia State to build two data center complexes, few anticipated how quickly the construction would advance. This success stems from the dedication of local inspectors, fire marshals, utility workers, and vendors who form the project’s operational foundation and are vital for creating unprecedented job opportunities throughout the region.\n“It’s brought in more work to this area than we’ve ever seen,” said Jeff Cox, president of Birdsong Construction, a second-generation company based in Clinton, Mississippi. “We’re seeing transformational progress that’s creating careers and building Mississippi’s future.”\nThis collaboration has achieved remarkable milestones. In just over 14 months, the project went from groundbreaking to having its first section operational, with over 60 Mississippi companies assisting in key roles.\n“We knew we had ambitious goals, but what we didn't know was just how incredible our local partnerships would become,” said Roger Wehner, vice president of economic development at Amazon Web Services. “To our suppliers and county partners—thank you. When challenges arose, you brought solutions. When schedules were tight, you found ways to deliver results while maintaining the quality our customers demand.”\nJoey Deason, executive director at Madison County Economic Development Authority, added, “At the end of the day, this collaboration translates to increased paychecks, expanded small business opportunities, and a stronger tax base for generations.\"\nAugust 26, 2025 10:58 AM\nAmazon's $39.2 billion investment boosts eastern Oregon's economy\nMore than a decade ago, Amazon Web Services (AWS) built its first data centers in eastern Oregon. Since then, AWS has remained committed to long-term support of the community, and we are proud to call both Morrow and Umatilla counties home.\nSince 2011, Amazon has significantly contributed to eastern Oregon's economic growth. The construction, connection, operation, and maintenance of AWS data centers have injected $39.2 billion into the local economy, supporting 8,320 full-time equivalent jobs annually. This investment represents more than infrastructure development—it's an economic catalyst strengthening the region's position as a technology hub and creating opportunities for businesses of all sizes.\n\"AWS has been a strong partner in the growth and success of eastern Oregon,\" said Torrie Griggs, chief executive officer, Boardman Chamber of Commerce. \"Their long-term investment has helped drive our regional economy—supporting more than 8,000 jobs each year and adding over $11.8 billion to our GDP since 2012. In Morrow County, their presence means good-paying local jobs, reliable tax revenue, and funding that directly impacts our schools, emergency services, and infrastructure. These are real impacts that make a difference for the people who live and work here.\"\nThe impact extends beyond direct employment. In 2024, AWS paid $54.2 million in property taxes and fees, benefiting local communities. This investment is strengthened through Amazon's support of educational initiatives. The company invested in Blue Mountain Community College programs, providing $150,000 for lab and training equipment to serve students in data center programs and contributing $100,000 annually in scholarships for local students enrolled in these programs.\nEastern Oregon has established itself as an economic leader in the Pacific Northwest, and these investments help transform the region's economic landscape. The combination of infrastructure development, job creation, educational support, and community investment creates a foundation for growth and innovation, positioning eastern Oregon at the forefront of the digital economy.\nAugust 7, 2025 1:43 PM\nAWS data centers in New Albany: Powering Ohio's future\nToday, the New Albany Chamber of Commerce hosted AWS, state and local leaders at a community event to celebrate the local impact of this investment. Since 2015, Amazon has invested $6.2 billion in cloud computing infrastructure in New Albany alone, contributing $1.4 billion to Licking County's gross domestic product (GDP) to date and supporting more than 1,500 local jobs each year.\n“AWS has become a strong and valued partner in New Albany,” said New Albany Mayor Sloan Spalding. “Your presence here brings world-class technology and infrastructure, but even more importantly, a deep commitment to community impact.”\nKey community initiatives announced today:\n- A $200,000 investment in New Albany's new Fieldhouse and Community Center. This facility will be the home of an Amazon Think Big Space, a hands-on STEM lab for local students.\n- The Amazon Community Fund for Central Ohio will award $100,000 in micro-grants to grassroots projects in Franklin and Licking counties focused on STEM education, sustainability, skills training, and social impact.\n- A $50,000 contribution to the New Albany Community Foundation, which supports their renowned Lecture Series, fostering lifelong learning and community dialogue.\nAcross Ohio, Amazon invested more than $19.7 billion to build cloud computing infrastructure and contributed $6.2 billion to GDP over the last decade, supporting nearly 6,500 local jobs annually.\n“Amazon is investing in more than just buildings—they’re investing in people and our communities,\" said Ohio Lt. Governor Jim Tressel. \"That’s the kind of momentum that helps all Ohioans reach their full potential.”\nAt AWS, we are grateful for the powerful partnership between state and local leaders, business and community—together, we are advancing technology, supporting education, and building an innovative future for Ohio.\nAugust 1, 2025 9:30 AM\nAmazon Eastern Oregon Community Fund recognizes community champions\nGrassroots leaders are bringing their visionary ideas to life across Eastern Oregon through the Amazon Eastern Oregon Community Fund, a community grant initiative that puts decision-making power directly in local hands. Twenty-nine innovative projects—ranging from classroom coding programs to community health initiatives—are taking shape as the result of a program designed to amplify diverse voices.\n\"What makes these projects so powerful is how they're designed by people who deeply understand their communities' challenges,\" said Jorge Carrillo, Amazon community engagement manager.\nThe fund supports a diverse range of priorities including sustainability, health and wellbeing, STEM education, and economic development. For Heppner Jr/Sr High School's coding program, the support transformed learning possibilities for rural students.\n\"Having the tools we need to really code for a purpose allows students to excel in their growth,\" said Stefanie Spivey, a teacher whose students now have access to comprehensive materials beyond limited free online resources.\nCommunity celebrations on July 29 and 30 honored these changemakers, bringing together local leaders and grant recipients to showcase the collective impact of these investments across both counties.\nThe momentum continues as Amazon launches a second funding round open through September 8, offering grants for nonprofits, individuals, and community groups. This initiative is part of Amazon's broader commitment to the areas where the company operates data centers and infrastructure, reflecting a long-term investment in Eastern Oregon's digital and economic future.\nBy centering local expertise and prioritizing community-led solutions, the Amazon Eastern Oregon Community Fund complements Amazon's infrastructure investments with community-focused programs like educational partnerships with Blue Mountain Community College and initiatives such as Amazon Girls' Tech Day that empower young women in technology.\nJuly 10, 2025 3:18 PM\nAmazon partners with Georgia technical colleges to offer fiber optic training courses\nAt two Georgia technical colleges, students aren't just learning what it takes to build data centers, they're building confidence.\n\"It's a very lucrative job. It's a very interesting job, and anybody can do it,\" said fiber optic fusion splicing instructor Dwayne Holst with Sumitomo Electric Lightwave.\nTo meet the increasing demand for skilled workers who can install and maintain the complex fiber optic networks that power data centers, AWS hosted dozens of local students in a free two-day training course of fiber optic installation and repair.\n\"It's basically an existential moment in technical history,\" said Holst. \"There's a huge need for skilled labor and Amazon is trying to be proactive.\"\nKesha Cole is trying to be proactive too. She's been in the airline industry for more than 25 years and brought her nephew along.\n\"I definitely see tech as future,\" said Cole. After all, much like the airplanes she deals with, data centers are also taking off. \"I'm seriously considering how I can build a career around it.\"\nCole knew nothing about fiber optic splicing before taking the courses. When she recently had fiber optic internet installed in her home, she thought, \"I could never do that. That's too many wires.\"\nBut then, she spent two days learning all about them at Southern Crescent Technical College in Griffin, Georgia.\n\"If you had to ask me right now, 'Hey could you do a splice for me?' I could do it,\" Cole said confidently. \"I think that had a lot to do with the professor being hands-on with us. He was right there with us the entire time.\"\nDays later, the instructors were back helping other students build confidence at West Georgia Technical College in Douglasville, Georgia.\n\"There are three requirements that the contractors are looking for to get somebody into the job. The number one requirement they have is are you dependable?\" explained Holst. \"Two, are you willing to work? Three, are you willing to learn?\"\n\"The Douglas County community really seems very excited that this project is here and is starting,\" said Kristen Buoy, the vice president of academic affairs at West Georgia Technical College. \"We hope to build some programming around other needs with AWS as AWS continues to build out the facility.\"\nJuly 8, 2025 1:33 PM\nAmazon launches community grant applications to support Georgia counties\nAmazon is investing in the heart of Georgia communities with the launch of two new community funds totaling $400,000. Applications are now open for the Amazon Douglas County Community Fund and the Amazon Butts and Newton Counties Community Fund, designed to empower local change makers as part of the broader infrastructure investment in Georgia.\nBoth funds offer microgrants ranging from $500 to $10,000 for individuals, schools, non-profits, and community organizations to bring their neighborhood improvement ideas to life. Projects can focus on STEM education, affordable housing, food insecurity, sustainability, or digital skills development.\n\"The most meaningful community solutions come from people with deep roots and firsthand knowledge of local needs,\" said Afrika Alsup, Amazon community engagement manager. \"These funds put resources directly into the hands of grassroots leaders who can create lasting positive change in their neighborhoods. When we empower local voices, everyone benefits.\"\nThe funds will be administered by ChangeX, a nonprofit organization that helps citizens lead impactful neighborhood projects. Successful applicants will participate in a 30-day challenge with mentorship and resources to kick-start their ideas. Information sessions will be offered to interested applicants from all three counties. Applications remain open through August 27, 2025.\nThe Amazon Community Fund is just one way Amazon is striving to make a positive impact in Georgia. Amazon has sponsored several STEM experiences and community projects thus far, including the SOOFA Ranch BeeSmart program, the Taste of Douglasville event, and a partnership with Goodr to bring a new community mini-market to the area.\nAdditionally, Amazon Web Services (AWS) recently launched initiatives in Georgia this year to provide free tech skills training through no-cost programs such as the AWS Fiber Optic Fusion Splicing Certification Courses and Workshops at Southern Crescent Technical College and West Georgia Technical College.\nJune 30, 2025 11:31 AM\nAmazon funds 19 Central Ohio projects and opens new round of applications\nAmazon awarded $100,000 in grants to 19 community projects through the Amazon Central Ohio Community Fund while opening applications for the next round. These micro-grants support local visionaries driving meaningful change in communities where Amazon operates.\n\"At Amazon, we're passionate about elevating grassroots organizations doing vital work in our communities,\" said Carolyn Jackson, Amazon Community Engagement Manager. \"Through targeted micro-grants, we're helping bring local dreams to reality by providing resources directly where they'll make the most difference.\"\nThe Central Ohio grants focus on STEM education, sustainability, and digital skills. Among recipients, Friends of the Lower Olentangy Watershed (FLOW) is creating outdoor classrooms at Valley Forge Elementary School featuring native plants and educational seating.\n“This funding has been so helpful in increasing the urban green space that we have in the Olentangy Watershed,\" said Laura Fay, FLOW Science Committee Chair. \"These funds allowed us to create an outdoor classroom for our youngest residents that will only get better over time.\"\nSimilarly, Hilliard Food Pantry Plus will expand its Share Closet program, adding an extra operating day and improving storage.\n\"Thanks to funding from the Central Ohio Community Fund, our Share Closet Manager is now able to dedicate full-time attention to the Share Closet,\" said Erin West, Hilliard Food Pantry executive director. \"This support is strengthening our organization's overall ability to serve the community.\"\nStarting today, the next round of the Amazon Central Ohio Community Fund focused in Franklin and Licking Counties is accepting applications until August 1, 2025. Nonprofits can apply for grants up to $10,000, while individuals and community groups can request up to $5,000. These investments complement Amazon's other Ohio initiatives in our data center communities including Think Big Experiences, tree planting events, and workforce development programs in fiber optic technology.\nJune 12, 2025 11:28 AM\nAWS Summit Washington, DC delivers life-changing job offers and 3,000 backpacks for local students in Northern Virginia\nThe AWS Summit in Washington, DC transformed into more than a tech conference on June 10, surprising 22 graduates with career opportunities and supporting local students through a backpack initiative at the Walter E. Washington Convention Center.\nIn an emotional highlight of the event, graduates of Northern Virginia Community College's AWS Information Infrastructure Pre-Apprenticeship (I2PA) program received surprise full-time job offers from Amazon and its partners. The graduates, now have access to technical careers with salaries that can significantly improve their families' financial futures.\n\"This is a very happy moment for me. I feel amazing, especially as a woman... I feel like more women should definitely come in and try it out,\" said Shakyra Hill, I2PA graduate. \"I was introduced to this program through my mother and brother... When they came back around, I knew I wanted to be a part of it.\"\nSimultaneously, Summit attendees participated in a backpack assembly project. Together, they packed over more than 2,000 backpacks filled with school supplies for Prince William County students, working in partnership with the Prince William County Community Foundation (PWCCF). This initiative is part of a larger push to support the official 2025 Back-to-School Community Event.\n\"Parents spend over $500 preparing their kids to go back to school, so the backpack packing initiative really helps them with essential supply costs,\" said Dr. Vanessa M. Gattis, CEO and founder of PWCCF. \"When you see the smiles on their faces... they know they have the school supplies they need.\"\nThe Summit also featured a panel discussion with community leaders highlighting Amazon's long-term local infrastructure investments. Panelists included Dr. Gattis, Randall Stamper, associate vice chancellor for Career Education and Workforce Programs, Curry Roberts, president of the Fredericksburg Regional Alliance, Jeff McCormick, AWS Virginia Operations Leader, and Mike Hammer, vice president at Clark Technologies.\nMay 27, 2025 1:20 PM\nAmazon's community impact across data center communities in the US\nMay 27, 2025 1:18 PM\nAmazon partners with Hayward schools to launch STEM spring break camp\nAmazon joined forces with Hayward Unified School District (HUSD) and iDTech this spring to host an immersive Spring Break STEM Camp in Hayward, California. The initiative provided 40 students ages 7-17 from underserved and underrepresented communities with a fully sponsored opportunity to explore technology through hands-on learning experiences.\nThe weeklong camp offered students engaging courses including VR game design, coding, BattleBots, and 3D printing. Students also connected with Amazon mentors during special \"Lunch with an Amazonian\" sessions, gaining practical insights into technology careers and future possibilities.\nThe impact of this partnership resonated throughout the Hayward community. Every single participant reported learning something new about using technology, with students creating their own tech projects, from designing virtual reality games to building robots. The program particularly emphasized inclusion, with over half of the participants being young women exploring STEM fields.\nMaya, a 9-year-old participant in the VR Game Design course, said, \"This program helped me discover my passion for technology, gave me confidence in my abilities, and made me excited about all the possibilities in AI and robotics.\"\n\"We are proud to partner with Amazon and iDTech to offer this incredible opportunity to our students. This spring break camp opened doors for our underrepresented youth to explore the world of technology in a hands-on, engaging environment,\" said Chien Wu-Fernandez, superintendent at HUSD. \"It’s partnerships like these that help us inspire future innovators and ensure every student has access to high-quality learning experiences.\"\nThe success of this spring partnership has already led to discussions about expanding technology education initiatives in Hayward. Amazon and HUSD are building a strong foundation for equitable technology education in the community. This initiative represents more than just a spring break program–it’s ensuring students in our data center communities have access to quality STEM education and the opportunity to shape the future of technology.\nMay 2, 2025 10:29 AM\nAmazon expands STEM access in Loudoun County, Virginia with New Think Big Corners and Think Big Mobile Van\nAmazon, Loudoun County Public Schools (LCPS), and the Loudoun Education Foundation (LEF) celebrated a significant milestone in STEM education with the opening of four new Amazon Think Big Corners in elementary schools across the county. A ribbon-cutting ceremony at Potowmack Elementary School on April 29 marked the official launch of these innovative learning spaces.\nThe Think Big Corners, now established at Potowmack, Forest Grove, Frederick Douglass, and Guilford elementary schools, are designed to provide students with hands-on STEM learning experiences. These mini labs are equipped with cutting-edge technology, including 3D printers and specialized supplies, fostering creativity and building crucial technical skills among young learners.\n\"LCPS and its Science office are thrilled to partner with Amazon in developing Think Big Corners. This initiative, a collaborative effort between four elementary schools and the Science office, aims to enhance STEM learning experiences for all students,\" said Darielle Timothy, Science Supervisor at Loudoun County Public Schools. \"These dedicated spaces will facilitate additional STEM lessons and problem-based learning activities, encouraging students to devise innovative solutions to global challenges.\"\nIn addition to the four Think Big Corners, Amazon introduced the first Think Big Mobile Van in the region, which will travel throughout Northern Virginia, bringing STEM education to an even broader range of students. The mobile platform will visit schools and community events, ensuring that more children have access to these valuable learning opportunities regardless of their location.\nThe initiative builds upon the success of the Amazon Think Big Space launched at Simpson Middle School in Leesburg, VA in 2022, which continues to serve as a computer science training hub for teachers and a creative learning environment for all students. As part of its commitment to empowering educators, Amazon will host in-person training sessions for teachers in these workspaces, as well as creative workshops for students.\nThis comprehensive approach ensures that both students and teachers have the support and resources they need to succeed in STEM education. These new Think Big Corners and the Think Big Mobile Van reflect Amazon's ongoing dedication to building meaningful community partnerships, supporting educators, and providing equitable access to STEM learning opportunities for all students in Northern Virginia."
    }
]