[
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/",
        "Content_Type": "Website Content",
        "Raw_Text": "In fact, we’re probably a part of the electronic device you’re using right now. Our lithography technology is fundamental to mass producing semiconductor chips. With it, the world’s top chipmakers are creating microchips that are more powerful, faster and energy efficient.\n2024 Annual Report\nDiscover our 2024 Annual Report, which highlights our financial performance, technological achievements and ESG commitments in the past year.\nIn this interactive section you will hear from our employees. You’ll also discover how we foster your well-being and what our networks and clubs are like. We’ll show you how you’ll be supported to develop and upskill, and what your compensation and benefits package could include."
    },
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/en/company",
        "Content_Type": "Website Content",
        "Raw_Text": "We provide chipmakers with everything they need – hardware, software and services – to mass produce patterns on silicon through lithography.\nASML is an innovation leader in the semiconductor industry. Find out what we do and why we do it.\nWe’re committed to independence, accountability and transparency, building a relationship of trust with our stakeholders.\nFind out more about how we’re shaping our sustainable future and contributing to the United Nation’s Sustainable Development Goals.\nAt ASML, we support our local communities through education, sports, arts and music, and other outreach activities."
    },
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/en/company/about-asml",
        "Content_Type": "Website Content",
        "Raw_Text": "ASML is an innovation leader in the semiconductor industry. We provide chipmakers with everything they need – hardware, software and services – to mass produce patterns on silicon through lithography.\nVision & mission\nWe believe that technology can be a force for good in the world.\nWe enable groundbreaking technology to solve some of society's toughest challenges. Together with our partners, we provide leading patterning solutions that drive the advancement of microchips.\nBeijing\nBerlin, Germany\nChandler, AZ, US\nHillsboro, OR, US\nHsinchu\nHwasung, South Korea\nLinkou\nSan Diego, CA, US\nShanghai\nShenzhen\nSilicon Valley, CA, US\nTainan\nTokyo, Japan\nVeldhoven, the Netherlands\nWilton, CT, US\nFacts & figures\n2024 Annual Report\nDiscover our 2024 Annual Report, which highlights our financial performance, technological achievements and ESG commitments in the past year.\nMore about ASML\nWith over 60 locations worldwide, we are a growing global force in the semiconductor industry.\nRead about who we are, what guides us, and how we strive to make the world better for future generations.\nR&D, manufacturing and customer support are the pillars of ASML’s organizational structure, supported by our corporate functions.\nFrom a leaky wooden shed to a global force, ASML's journey in the semiconductor industry began in 1984.\nThree continents, 16 countries and regions, 60 locations. Find out more about what it’s like working at a world leader in the semiconductor industry.\nWhat is ASML?\nASML is one of the world’s leading manufacturers of chip-making equipment. It’s a common misconception that we make chips, also called microchips or integrated circuits (ICs), but we actually design and manufacture the lithography machines that are an essential component in chip manufacturing. Our customers are companies such as Intel, who use our machines in ‘fabs’ – microchip manufacturing plants – to create microchips that are eventually used in many electronic devices, including smartphones, laptops and much more.\nWhat does ASML stand for?\nASML isn’t an abbreviation of anything anymore, though it does have its roots as one. In 1984, when ASML was founded as a joint venture between Philips and ASM International, the name ‘Advanced Semiconductor Materials Lithography’ was chosen and used as ‘ASM Lithography’ to reflect the partners in the joint venture. Over time, this name has become simply ‘ASML’.\nHow many employees does ASML have?\nThere are more than 44,000 ASML employees on payroll and flexible contracts, spread across offices in more than 60 locations worldwide. The company’s headquarters, located in Veldhoven, the Netherlands, comprises over half of all employees."
    },
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/en/company/about-asml/asml-at-a-glance",
        "Content_Type": "Website Content",
        "Raw_Text": "We’re a global team headquartered in Europe’s top tech hub, the Brainport Eindhoven region in the Netherlands. Our operations are spread across Europe, Asia and the US.\nLearn about ASML in one minute\nWe manufacture complex lithography systems critical to the production of microchips, unlocking the potential of people and society by pushing technology to new limits. Want to know how? Watch the video to find out in just 60 seconds.\n2024 financial figures\nMore about us\nAn innovation leader in the chip industry, ASML’s lithography solutions have been making giant leaps on this tiny scale since 1984.\nWe provide our customers with everything they need – hardware, software and services – to mass produce patterns on silicon.\nFrom a leaky wooden shed to a global force, ASML's journey in the semiconductor industry began in 1984.\nR&D, manufacturing and customer support are the pillars of ASML’s organizational structure, supported by our corporate functions."
    },
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/en/company/about-asml/vision-and-mission",
        "Content_Type": "Website Content",
        "Raw_Text": "Our purpose\nUnlocking the potential of people and society by pushing technology to new limits.\nOur vision\nWe enable groundbreaking technology to solve some of humanity’s toughest challenges.\nOur mission\nTogether with our partners, we provide leading patterning solutions that drive the advancement of microchips.\nOur values\nWhat guides us?Our company culture\nDiscover what it’s like to work at ASML. Dive into this interactive section to learn about compensation and benefits, well-being, volunteering and giving back to our communities, employee networks and sports clubs, exciting events, and learning and development.\nOur strategy\nThe five pillars of our business"
    },
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/en/company/about-asml/organization",
        "Content_Type": "Website Content",
        "Raw_Text": "Every day, our colleagues in R&D, Manufacturing, Customer Support, Sourcing and Supply Chain, and support functions take on the exciting challenge of building and maintaining the most advanced lithography systems in the world.\nResearch & Development\nWithout R&D, ASML wouldn’t exist. Our founders’ goal when they started the company in 1984 was to build a fast and accurate chip-making machine that could compete in the growing semiconductor industry – something that could never be achieved without a relentless focus on R&D, guided by the voice of our customers. In our Research department, ideas are explored and then passed on to Development & Engineering for designing and integration into our products and services. ASML continues to invest heavily in R&D.\nManufacturing\nIt’s one thing to design a product – it’s another to build and mass produce it. Our Manufacturing department assembles, builds and delivers all our systems from the prototype stage onwards. It also supports the installation of completed systems at customer sites. Each new generation of systems brings new manufacturing challenges, so sometimes Manufacturing’s job of putting it all together includes taking the machine apart and rethinking it.\nCustomer Support\nAfter a system is shipped to a customer, the real ‘magic’ begins. Thousands of our engineers worldwide are dedicated to a simple goal: making sure that the lithography systems at our customers’ sites are running smoothly, 24/7. Both in the field and at Global Support Centers on three continents, they aim to detect problems before they can impact production. They carefully monitor each machine’s performance and take corrective action whenever needed. In the rare case that a machine goes ‘down’, our Customer Support engineers spring into action and work together around the clock to get it back up and running as fast as possible.\nSourcing and Supply Chain\nThis team works across the business and around the world. Sourcing and Supply Chain teams make sure that all our departments have what they need, when they need it. From idea to end product, their job is to find the right suppliers and work closely with them, and get parts to customers on time – all while working to reduce our environmental impact and minimize waste.\nSupport functions\nAlthough they may not come into daily contact with a machine's design, manufacturing or upkeep, our colleagues in corporate functions like HR, Legal, IT, Sales & Marketing and Finance enable the company to run smoothly."
    },
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/en/company/about-asml/history",
        "Content_Type": "Website Content",
        "Raw_Text": "ASML's history is rich with innovation and collaboration. Read more to learn how we've grown into the semiconductor industry leader we are today.\nAs they moved into their new quarters in a shed near the Philips buildings at Strijp T in Eindhoven, our founders could never have imagined that in just three decades, ASML would become a global innovation leader.\nThe 1980s: humble beginnings\nIn 1984, electronics giant Philips and chip-machine manufacturer Advanced Semiconductor Materials International (ASMI) created a new company to develop lithography systems for the growing semiconductor market. Called ASM Lithography, we began our days inauspiciously, located in a leaky shed next to a Philips office in Eindhoven, the Netherlands. Building on the R&D that had been in the works since the early 1970s, that same year we launched our first system, the PAS 2000 stepper.\nWe grew fast, with Philips and ASMI scaling their investments to help make ASML a success. In 1985, with 100 employees on board, we moved into our newly built office and factory in Veldhoven, just a few kilometers from the Philips research labs. In 1986 we brought the PAS 2500 stepper to market, featuring new alignment technology that would be the foundation for many future innovations in our machines. That same year we established our existing partnership with lens manufacturer Carl Zeiss.\nBy 1988, we had begun to make in-roads in the Asian market, after Philips established a joint-venture foundry in Taiwan. In the United States, we grew from a few employees to 84, spread over five office locations. But in a market of fierce competition and many suppliers, the small unknown company from the Netherlands couldn’t catch a break. ASML had few customers and was unable to stand on its own two feet. Making matters worse, shareholder ASMI was unable to maintain the high levels of investment with little return and decided to withdraw, while the global electronics industry took a turn for the worse, and Philips announced a vast cost-cutting program. The life of our young cash-devouring lithography company hung in the balance. Guided by a strong belief in the ongoing R&D and in desperate need of funds, ASML executives reached out to Philips board member Henk Bodt, who persuaded his colleagues to lend a final helping hand.\nDuring this decade we launched what turned out to be our breakthrough platform, the PAS 5500. These classic lithography systems are still in use at customer fabs today.\nThe 1990s: from helping hand to IPO\nThe investment was put to good use. Within the year, we launched a breakthrough platform, the PAS 5500. With its industry-leading productivity and resolution, the PAS 5500 brought on board the key customers that ASML needed to turn a profit. It was a first step to maturity. In 1995, ASML became a fully independent public company, listed on the Amsterdam and New York stock exchanges. Philips sold half of its shares at the IPO and sold off the rest in the following years. The IPO brought in the capital to fuel our growth further, and we expanded our R&D and production facilities at De Run in Veldhoven, which would later become our new headquarters.\nDuring the 2000s we drastically improved our systems' resolution, with immersion technology, and productivity, with our revolutionary dual-stage TWINSCAN technology.\nThe 2000s: TWINSCAN and immersion technology pave the way\nIn 2001, we introduced the TWINSCAN system and its revolutionary dual-stage technology. These systems expose one wafer while the next wafer is being measured and aligned, which maximizes the productivity and accuracy of the system, boosting ownership value for our customers. In the same year, we completed the acquisition of the Silicon Valley Group to further strengthen ASML’s capabilities in semiconductor technological advancement. The TWINSCAN AT:1150i debuted as the first immersion machine in 2003, followed by the TWINSCAN XT:1250i, XT:1400i, and in 2006 the first volume production machine for immersion, the XT:1700i. In 2007, we shipped the TWINSCAN XT:1900i immersion system with a numerical aperture of 1.35 – the highest in the industry. With this new technology, we enabled our customers to produce even smaller chip features by projecting light through a layer of water between the lens and the wafer.\nLater in 2007, we acquired BRION, a leading provider of semiconductor design and manufacturing optimization solutions. This was the start of our ‘Holistic Lithography’ strategy. We united our knowledge of lithography systems with the skill to optimize the chip manufacturing process before, during, and after lithography. Another key product in the early phase of our Holistic Lithography strategy was YieldStar, our metrology system which provides real-time measurements and corrections during chip manufacturing. The first YieldStar (250D) was shipped to customers in 2008.\nStarting in the 2010s, we again changed the face of the semiconductor industry by introducing EUV lithography.\nThe 2010s: the holistic era\nIn 2010, we shipped the first prototype extreme ultraviolet (EUV) lithography tool (TWINSCAN NXE:3100) to the research facility of an Asian chipmaker, marking the beginning of a new era in lithography. EUV lithography uses light of a shorter wavelength to manufacture smaller chip features, resulting in faster, more powerful chips.\nIn 2013, we acquired Cymer, the San Diego-based manufacturer of lithography light sources, to accelerate the development of EUV. We shipped the second generation EUV system (NXE:3300) that year, with the third generation EUV system (NXE:3350) following in 2015. EUV lithography turned the corner in 2016, when customers began ordering our first production-ready system NXE:3400 in batches. During this time, we continued to improve the performance of our immersion lithography systems, and the NXT1970Ci and NXT1980Di, the work horses of the chip industry, were installed in customer factories around the world. For more information, visit Cymer.\nWe expanded our holistic lithography portfolio in 2016 with the acquisition of Hermes Microvision (HMI) , a leading supplier of e-beam metrology tools. Our joint effort resulted in the first shipment of the e-beam pattern fidelity metrology system (ePfm5) in 2017.\nFollowing the liquidation in 2018 of the high-tech company Mapper based in Delft, the Netherlands, ASML agreed to acquire the company’s intellectual property assets . We also offered suitable positions to Mapper’s highly skilled employees working in Research & Development and product assembly.\nNo one could have predicted the challenges that the world would face at the dawn of this decade. Yet our teams persevered, achieving several significant milestones against the odds.\nThe 2020s: unprecedented challenges, impressive innovations\nAt the beginning of 2020, EUV moved into high volume manufacturing and we celebrated the 100th EUV system shipment. But 2020 was also significant for another reason: the COVID-19 pandemic. Our teams around the world proved their ability to adapt and improvise by innovating new ways to support customers from a distance, lending their expertise to the pandemic response and reaching out to support our local communities.\nIn November 2020, the acquisition of Berliner Glas Group was completed and we officially welcomed the Berliner Glas team to the ASML family. The technical glass division of the group was divested to Glas Trösch Group in April 2021.\nIn 2023, we shipped the first of our next-generation EUV systems with a higher numerical aperture of 0.55 (known as ‘High NA’). This platform, called EXE, has a novel optics design and significantly faster stages."
    },
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/en/company/about-asml/locations",
        "Content_Type": "Website Content",
        "Raw_Text": "All offices\nASML Albany255 Fuller Road, NanoFab SouthAlbany, New York 12203United States+1 518 459 6500 ASML Austin201 West Howard Lane, Suite 300Austin, Texas 78753United States+1 512 813 7500 ASML Boise3130 S. Owyhee StreetParkview PlazaBoise, Idaho 83705United States\nASML Chandler2625 West Geronimo PlaceChandler, Arizona 85224United States+1 480 696 2888 ASML Clifton Park800 State Route 146Suite 365 Town PlazaClifton Park, New York 12065United States+1 518 371 0168 ASML Dallas870 North Dorothy Drive, Suite 706 Richardson, Texas 75081United States+1 972 792 2150 ASML Eagan2020 Silver Bell Road, Suite 1Eagan, Minnesota 55122United States+1 651 681 2400 ASML Fishkill60 Merritt Boulevard, Suite 105 Fishkill, New York 12524United States+1 845 231 5900 ASML Hillsboro7451 NE Evergreen ParkwayTwo Technology BuildingHillsboro, Oregon 97124United States+1 971 245 8401 ASML Lehi4000 N Flash Drive, Building 20c/o Texas InstrumentsLehi, Utah 84043United States\nASML ManassasInnovation Drive, 9450Ground Floor, Unit 1The Logis-Tech BuildingManassas, Virginia 20110United States+1 703 361 1112 ASML North Phoenix25700 Norterra DrPhoenix, AZ 85085United States\nASML Westbrook590 County Road, Suite 1Westbrook, ME 04092United States+1 207 541 5000 ASML San Diego17075 Thornmint CourtSan Diego, California 92127United States+1 858 385 7300 ASML Silicon Valley80 West TasmanSan Jose, California 95131United States+1 408 597 8600 HMI San Jose80 West TasmanSan Jose, California 95131United States+1 408 597 8600 ASML Wilton77 Danbury RoadWilton, Connecticut 06897United States+1 203 761 4000"
    },
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/en/company/governance",
        "Content_Type": "Website Content",
        "Raw_Text": "Our goal is to build a relationship of trust with our stakeholders, which include employees, customers, suppliers, shareholders and society.\nWe aim to be as open and transparent as possible about our structure, financial reporting, internal controls and procedures, and decision-making process. We also look for ways to improve by monitoring developments in corporate governance practice.\nGovernance structure\nASML has a two-tier board structure with a board of management responsible for managing the company under the supervision of an independent supervisory board. ASML’s shares are listed on Euronext Amsterdam and NASDAQ.\nBoard of Management\nOur executives set and achieve the company’s strategic direction, objectives and policies, and manage general affairs. ASML's Board of Management has five members. The CEO is the sole president and serves as the chair.\nSupervisory Board\nThe Supervisory Board consists of nine experienced business and technology professionals from around the world. In addition to overseeing business activities, they keep a keen eye on risk management, company culture, corporate social responsibility and the company’s relationship with shareholders, and safeguard our integrity in reporting and compliance.\nShareholders\nShareholders play an important role in ASML’s governance. Next to the Board of Management and the Supervisory Board, shareholders participate in our general meetings, held at least once a year.\nWe encourage ethical behavior at ASML, inside and out. Read more about our code of conduct here.\nLearn about ASML’s risk management framework and how risk influences our strategy.\nThe external auditor conducts financial audits in accordance with legal requirements and regularly provides the Audit Committee with its findings.\nBrowse ASML’s corporate governance policies and archives.\nTake a tour of the highlights to find out more about our performance and achievements, or download the full report."
    },
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/en/company/governance/board-of-management",
        "Content_Type": "Website Content",
        "Raw_Text": "Our executives set and achieve the company’s objectives, strategy and policies, and manage general affairs.\nASML’s Board of Management has five members. The CEO is the sole president and serves as chair.\nThe Supervisory Board appoints the members of the Board of Management and notifies shareholders at the AGM. Members are appointed for a term of up to four years and may be reappointed for consecutive terms.\nFrench national, 1973, member of the Board of Management since 2018 (term expires in 2028). Christophe joined ASML in 2008 and has held several management positions in marketing and product management.\nRead more\nDutch national, 1965. Roger joined ASML and was appointed a member of the Board of Management in 2018 (term expires in 2026).\nRead more\nFrench national, 1961. Frédéric joined ASML in 2009 as Executive Vice President and COO and was appointed to the Board of Management in 2010 (term expires in 2026).\nRead more\nAmerican national, 1967, member of the Board of Management since 2023 (term expires in 2027). Wayne joined ASML in 2018 as Executive Vice President of Customer Support.\nRead more\nAmerican and Irish national, 1967. Jim joined ASML in 2007 and was appointed a member of the Board of Management in 2024 (term expires in 2028).\nRead more\nRules of procedure\nFor more information on how the Board of Management operates and makes decisions, as well as how members are appointed, download the rules of procedure.\nRemuneration\nThe Supervisory Board Remuneration Committee determines the compensation of the members of the Board of Management according to the Remuneration Policy adopted at the AGM on April 23, 2025. For more details, see the Board of Management Remuneration Policy and the Remuneration Report."
    },
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/en/company/governance/supervisory-board",
        "Content_Type": "Website Content",
        "Raw_Text": "ASML’s Supervisory Board is composed of nine members. Nils Andersen became the Supervisory Board’s chair in 2023. Members of the Supervisory Board are appointed for a term of up to four years and may be reappointed twice.\nOur Supervisory Board members are experienced business and technology professionals from around the world.\nIn addition to overseeing business activities, they keep a keen eye on risk management, company culture, corporate social responsibility and the company’s relationship with shareholders, and safeguard our integrity in reporting and compliance.\nThe Supervisory Board meets at least four times per year.\nDanish national, 1958. Nils has been a member of the Supervisory Board since 2023 (term expires in 2027).\nChair of the Selection & Nomination Committee\nMember of the Audit Committee\nRead more\nAmerican national, 1961. Terri has been a member of the Supervisory Board since 2018 (second term expires in 2026).\nChair of the Remuneration Committee\nMember of the Selection and Nomination Committee\nRead more\nBelgian national, 1965. Birgit has been a member of the Supervisory Board since 2021 (second term expires in 2029).\nChair of the ESG Committee\nMember of the Audit Committee\nRead more\nAmerican national, 1961. Mark has been a member of the Supervisory Board since 2020 (second term expires in 2028).\nChair of the Technology Committee\nMember of the Selection and Nomination Committee\nRead more\nBritish national, 1961. Warren has been a member of the Supervisory Board since 2020 (second term expires in 2028).\nMember of the Audit Committee\nMember of the Technology Committee\nRead more\nGerman national, 1963. Alexander has been a member of the Supervisory Board since 2022 (first term expires in 2026).\nMember of the Remuneration Committee\nMember of the ESG Committee\nRead more\nDutch national, 1968. Karien has been a member of the Supervisory Board since 2025 (term expires in 2029).\nMember of the ESG Committee\nMember of the Remuneration Committee\nRead more\nDutch national, 1959. Jack has been a member of the Supervisory Board since 2023 (term expires in 2027).\nChair of the Audit Committee\nMember of the Remuneration Committee\nRead more\nBelgian national, 1971. An has been a member of the Supervisory Board since 2022 (first term expires in 2026).\nMember of the Technology Committee\nMember of the ESG Committee\nRead more\nSupervisory Board committees\nThe Supervisory Board currently has five standing committees. The Supervisory Board has assigned some of its tasks and responsibilities to its committees, but the Supervisory Board remains responsible for all decisions, including those made by Supervisory Board committees. See the Rules of Procedure for full details on the Supervisory Board and the committees.\nAudit Committee\nAssisting in overseeing the integrity and quality of our financial reporting and the effectiveness of risk management and controls.\nRead more\nRemuneration Committee\nOverseeing the development and implementation of remuneration policies.\nRead more\nSelection and Nomination Committee\nAssisting with the preparation of the selection criteria and appointment procedures for the Supervisory Board and Board of Management.\nRead more\nTechnology Committee\nProviding advice with respect to our technology plans required to execute the business strategy.\nRead more\nESG Committee\nOverseeing the ESG strategy and performance aimed at sustainable, long-term value creation.\nRead more\nAdditional information\nFind out more about how the Supervisory Board is appointed, operates and makes decisions.\nAll current members of the Supervisory Board are considered fully independent as defined by the Dutch Corporate Governance Code.\nRemuneration\nAt the AGM, ASML shareholders determine the remuneration of the members of the Supervisory Board based on the Supervisory Board’s proposal and according to the Remuneration Policy adopted at the AGM on April 26, 2023. For more details, see the Supervisory Board Remuneration Policy and the Remuneration Report below."
    },
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/en/company/governance/shareholders",
        "Content_Type": "Website Content",
        "Raw_Text": "Shareholders play an important role in ASML’s governance. Next to the Board of Management and the Supervisory Board, shareholders participate in our general meetings, held at least once a year.\nA share in the company means a voice in its governance. Shareholders are invited to attend our annual general meetings, vote on important topics, and raise any issues or questions they might have.\nShareholder meetings\nAt our annual general meeting (AGM), the Board of Management reports on the past year’s activities. In addition to the management report and financial statements, the dividend policy and the remuneration report are discussed, as well as any other topics on the agenda. Find out more about our most recent AGMs here.\nASML shares\nRead about our stock exchange listings, share structure, see our major shareholders and links to other important information.\nInvestor days\nAt our investor days (held every two years), we inform shareholders, analysts and other stakeholders about our long-term strategy and financial model."
    },
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/en/company/governance/code-of-conduct",
        "Content_Type": "Website Content",
        "Raw_Text": "The Code influences how we make decisions and guides us in our interactions with colleagues, customers, suppliers, shareholders and society as a whole. The Code helps us maintain the highest standard of ethics, integrity and respect.\nOur ethics program offers the necessary support, advice, training, and communication to enable employees and others to understand and follow our Code. We encourage and enable anyone to speak up if they observe behavior that violates our Code.\nSpeak Up & Non-retaliation Policy\nOur Speak Up & Non-retaliation Policy allows anyone to report issues with respect to our Code. We are committed to an open culture of trust and honest communication, where violations of the Code are not tolerated. People who speak up will be protected for raising concerns about suspected misconduct in good faith. Reports will be treated confidentially and parties can report concerns anonymously.\nHow to Speak Up\n| Location | Phone number |\n|---|---|\n| China | +86 4001200809 |\n| France | +33 971079402 |\n| Italy | +39 0694803200 |\n| Malaysia | +60 (0)1548771204 |\n| Netherlands | +31 (0)852081789 |\n| Singapore | +65 31580506 |\n| South Korea | +82 237005103 |\n| Taiwan | +886 00801128172 |\n| UK | +44 141 673 6062 |\n| USA | +1 203 769 9406 |\n| Germany | +49 3083792500 |\n| Israel | +972 77 223 0423 |\n| Ireland | +35 3818001476 |\n| Japan | +81 (0)345104476 |\n| Belgium | +32 784 80109 |\nCode of Conduct for Suppliers\nAt ASML, we conduct business on the basis of fairness, good faith and integrity, and we expect the same from our partners and suppliers. ASML became a member of the Responsible Business Alliance (RBA) in 2011 and adopted the RBA Code of Conduct, which provides guidance in four critical areas: labor, health & safety, environment and ethics. To reinforce our commitment to the supplier network, we expect our key suppliers and their suppliers to comply with the RBA Code of Conduct and to develop their own strategies, policies and processes to follow it.\nAnti-Bribery & Anti-Corruption Policy\nWe are committed to conducting business with business fairness, integrity and respect for the law and our values. Our Anti-Bribery & Anti-Corruption Policy details our commitment and the measures we take to prevent bribery and corruption at ASML. The Policy is designed to help employees and affiliates understand the internal and external requirements to report any suspicious or actual anti-corruption behavior and to help comply with these requirements.\nCompetition Law Compliance Policy\nWe are committed to fair competition and fairness in dealing with our business partners including suppliers, co-developers, customers and other industry peers. ASML does not condone any form of conduct that is considered illegal under applicable competition laws or is contrary to our Code. Our Competition Law Compliance Policy demonstrates our ongoing commitment to ensuring compliance with applicable competition laws and our Code.\nHuman Rights Policy\nASML is committed to respecting universal human rights and honoring our Code and values. Our Human Rights Policy applies to all our organizations and subsidiaries around the world, as well as to our suppliers.\nRead more\nInsider Trading Rules\nAccording to Dutch law, members of ASML’s Board of Management and Supervisory Board are required to notify the Dutch Authority Financial Markets (AFM) of any ASML financial instruments they hold or that are held on their behalf, as well as any transactions in those holdings that they make or that are made on their behalf.\nAll employees, including members of ASML’s Board of Management and Supervisory Board, are bound by ASML’s Insider Trading Rules."
    },
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/en/company/governance/risk",
        "Content_Type": "Website Content",
        "Raw_Text": "Dynamics in the global semiconductor industry present both opportunities and risks. ASML manages risk through an enterprise risk management (ERM) framework that integrates risk management into our daily business activities and strategic planning.\nOur risk management process\nEnterprise risk management is a continuous process. Its related activities are repeated regularly to identify and address risks, ensuring outcomes are relevant for effective decision-making.\nWe adopt a holistic approach combining both top-down (company-level) and bottom-up (organization and process-level) perspectives. This helps us identify, evaluate and manage risks at the right level. We continuously seek to improve our ERM process based on learnings, developments and best practices.\nRisk management governance structure\nWe deploy our ERM framework through a well-defined governance structure. ASML’s Risk and Business Assurance team, which reports to the CFO, coordinates the ERM process and associated activities across ASML.\nASML sets standards for risk management to identify, manage and monitor risks, supporting leadership in driving continuous, sustainable growth.\nRisk factors\nMany risks have the potential to impact our business and it is important to understand their nature. We assess risks using the ASML risk universe – a consolidated view of the risk categories that may have an adverse effect in achieving our business objectives. We review and update our risk universe frequently, taking into account a broad range of internal and external information sources, such as macroeconomic and industry trends, relevant guidelines and legislation, and stakeholders’ needs and expectations."
    },
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/en/company/governance/auditors",
        "Content_Type": "Website Content",
        "Raw_Text": "External auditor\nPricewaterhouseCoopers Accountants N.V. has been ASML’s external auditor since the reporting year 2025.\nAt the Annual General Meeting (AGM) held in 2025, PricewaterhouseCoopers Accountants N.V. (PwC) was appointed as the external auditor to issue an independent opinion on ASML’s financial statements for reporting year 2026. PwC’s first appointment as the external auditor was made at the 2023 AGM, with effect from the reporting year 2025. Furthermore, at the 2025 AGM, PwC was appointed as the external assurance provider for the sustainability statements for the reporting years 2025 and 2026.\nThe external auditor’s performance and work completed for ASML and all its subsidiaries are evaluated on an annual basis between the Audit Committee and the Board of Management, and the outcome is reported to the Supervisory Board and disclosed in the annual report and communicated to the General Meeting. The outcome of the annual evaluation is taken into consideration when assessing the potential reappointment of the external auditor.\nAt least once a year, the Audit Committee and the external auditor discuss their relationship with each other, as well as the external auditor’s relationship with the Board of Management. The Audit Committee, on behalf of the Supervisory Board, is responsible for approving the external auditor’s budget, fees and audit plan, which are determined annually.\nPricewaterhouseCoopers Accountants N.V.\nThomas R. Malthusstraat 5\n1066 JR Amsterdam\nThe Netherlands\nInternal audit function\nASML has an internal audit function. The internal audit function reports directly to the Supervisory Board’s Audit Committee and the Board of Management. Internal auditing is an independent and objective assurance and consulting activity guided by a philosophy of adding value and improving ASML’s operations. The internal audit function helps the company accomplish its objectives by bringing a systematic and disciplined approach to evaluating and improving the effectiveness of risk management, control and governance processes.\nThe establishment of these processes is the responsibility of ASML’s Board of Management. While maintaining an independent position, the internal audit function cooperates with the Board of Management to ensure risks are taken in a controlled way. The internal audit function provides assurance services to the Board of Management and the Audit Committee. The internal audit function’s advisory role is primarily the result of the recommendations included in internal audit reports addressing specific internal control weaknesses. Other advisory services are assessed against criteria meant to preserve the internal audit’s independence and objectivity."
    },
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/en/company/governance/governance-downloads",
        "Content_Type": "Website Content",
        "Raw_Text": "Configure your cookie settings and confirm to save your settings. You can withdraw or change your consent at any time on our cookie consent page.\nCookie consent page\nManage consent preferences\nStrictly Necessary Cookies\nAlways Active\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nFunctional Cookies\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nPerformance Cookies\nThese cookies monitor website performance and collect anonymous data on how visitors use a website. They allow us to count visits and traffic sources so we can measure and improve the performance of our site. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nTargeting Cookies\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly identifiable personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising."
    },
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/en/company/sustainability",
        "Content_Type": "Website Content",
        "Raw_Text": "To be a sustainability leader, we must drive progress toward a sustainable society. This means enabling ground-breaking technology that solves some of humanity’s toughest challenges.\nOur contribution to a digital, sustainable future\nIncreasing digitalization can pave the way to a society that is more environmentally and socially sustainable for everyone. It relies on the semiconductor industry’s ability to produce faster, more powerful microchips that are energy-efficient and affordable.\nBut the benefits our industry brings come at a cost, including energy and resource use. We are committed to innovating and investing to enable our company and the industry to reduce our negative impact.\nEnvironmental, social and governance (ESG) topics have become increasingly important to our customers, employees, suppliers, shareholders and society. We aim to respond to the continuously evolving needs of our stakeholders in the best way with our ESG sustainability strategy.\nWe focus on the ESG sustainability topics where we can have the biggest impact. For these so-called material topics, we define policies, targets and actions, and disclose progress against them in our annual reports.\nOur approach\nWhen we act sustainably as a business, it benefits everyone. We want to grow our company and increase our positive impact while minimizing our negative impacts on the environment and people.\nOur ESG sustainability strategy\nOur aim is to create long-term sustainable value for our stakeholders, while also contributing to the United Nations’ Sustainable Development Goals (SDGs).\nOur ESG sustainability strategy extends from our production operations, logistics and business facilities, to our suppliers, and our products and services, including their downstream impact. We have identified the nine key themes across E, S and G where we can reduce the negative impact and amplify the positive (see below).\nEnvironmental: We want to continue to expand computing power but with minimal waste, energy use and emissions. That's why we focus on energy efficiency and climate action and a circular economy.\nSocial: We want to ensure that responsible growth benefits all our stakeholders – we aim to offer an attractive workplace for all, to build and maintain a responsible supply chain, to fuel innovation in our ecosystem and to be a valued partner in our communities.\nGovernance: We act on our responsibilities and aim to fully anchor them in the way we do business through our focus on integrated governance, engaged stakeholders and transparent reporting.\nFor more information, download our sustainability policy and see our latest annual report for more on our sustainability performance.\nESG benchmarks and rating agencies give us objective insights into our performance and how we compare with industry peers. We focus on benchmarks that are recognized by our stakeholders, that are the most relevant in helping us drive continuous improvement, and that rely mostly on publicly available information.\n| ESG benchmark | 2022 | 2023 | 2024 | Comment |\n|---|---|---|---|---|\n| Sustainalytics | 10.9 (low risk) | 9.4 (low risk) | 8.4 (low risk) | We are ranked #1 in our industry |\n| MSCI | AAA | AAA | AAA | AAA is the highest possible score |\n| CDP | B | A- | A- | Our score in CDP climate (A is highest) |\n| RBA (Responsible Business Alliance) | Low risk | Low risk | Low risk | Based on RBA’s Self-Assessment Questionnaire |"
    },
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/en/company/community-engagement",
        "Content_Type": "Website Content",
        "Raw_Text": "As a global technology leader and employer, we play an active role in the communities we operate in. We partner with neighbors and local organizations to build meaningful relationships so that we can benefit from each other’s growth and thrive together. Our community program is fundamental to our ESG sustainability strategy.\nEducation\nAs the world moves closer to a fully digital future, we strive to improve the quality and accessibility of STEM (science, technology, engineering and math) education so that all members of society, especially children, have the opportunity to fulfill their potential.\nWe organize and support numerous initiatives that aim to share our enthusiasm and expertise in technology to inspire future generations. The ASML Junior Academy, our flagship education program, delivers fun and engaging STEM lessons for primary school classes in collaboration with Mad Science. We also participate in multiple educational events that promote career opportunities in technology, including Dutch Technology Week and Crafted.\nSports, arts and music\nCulture is the invisible bond that unites people in a community. We support initiatives and organizations that strengthen those bonds and help open them up for newcomers.\nWe collaborate with several organizations that have sports, arts and music initiatives in the communities where we work. For example, our experts are working with the Van Gogh Museum in Amsterdam and Van Gogh Brabant to find new ways to preserve historic paintings. We also have a long-term partnership with the Muziekgebouw in Eindhoven, bringing our employees and community members together through a shared passion for the stage.\nLocal outreach\nWe want to help strengthen our local communities, supporting initiatives that provide access to basic needs and help unlock the potential of disadvantaged community members.\nOur work includes supporting food banks, donating funds to charities and working with environmental organizations on conservation projects to care for those in need and protect our planet. We also recognize the power of volunteers to transform our communities and encourage employees to give back to their communities through our global volunteering program.\nApply for support\nWe always welcome new opportunities to sponsor activities, initiatives or organizations that align with our community engagement focus areas of education, sports, arts and music, and local outreach."
    },
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/en/company/community-engagement/education",
        "Content_Type": "Website Content",
        "Raw_Text": "Today, technology forms the foundation of almost all industries. As a result, STEM (science, technology, engineering and math) education is crucial for helping young people thrive in an increasingly technological world. We’re doing our part to share our science and technology knowledge, promote STEM initiatives and work hard to ensure that all young people have access to technical education to reach their potential.\nWorking with schools around the world\nASML Junior Academy\nThe ASML Junior Academy provides primary schools with engaging, structured STEM lessons for children. These lessons are delivered by our partner, Mad Science. In a number of cases, ASML employees are also involved, contributing their expertise to enhance the learning experience. The program is active in Veldhoven, the Netherlands, and Wilton, United States, with the ambition to reach 190,000 children in the coming years.\nSTEMup\nOur STEMup program helps secondary schools strengthen STEM education for first and second year students. Working with a STEM coach from WisMon, schools can choose one of four STEM classes developed by ASML. The pilot, which runs in the Veldhoven area into 2025, is supported by local educational organizations: FutureBites, Junior IOT, de Maakotheek and de Ontdekfabriek. Findings will inform the planned expansion of the program.\nHybrid teaching and STEM ambassadors\nThrough the hybrid teaching initiative, our employees swap the cleanroom for the classroom to teach technical subjects in schools and universities. They also volunteer as STEM ambassadors, giving lectures in educational settings and hosting students who visit ASML campuses.\nVan Gogh Museum and Van Gogh Brabant\nWe are involved in several collaborative initiatives with our partners at the Van Gogh Museum and Van Gogh Brabant. We are developing educational materials for schools on Van Gogh’s life and work, as well as the ‘Masterminds and Masterpieces’ program which challenges students to follow in Van Gogh’s footsteps by experimenting with color and light.\nThe Netherlands\nPromoting curiosity and creativity\nDutch Technology Week\nDuring this week-long, annual event in the Brainport region, we promote enthusiasm and pride in technology to strengthen the Dutch high-tech sector. We participate in various events to inspire young people about technology and technological studies.\nInclusive Talent tutoring program\nMany children lack access to tutoring, which widens the education gap for disadvantaged communities. To help close the gap, we launched the Inclusive Talent program in partnership with Center for Care and Spectrum Brabant. Through this program, our employees paired up with secondary school students to help them catch up on school subjects and make progress in their studies.\nAsia\nPartnering to inspire and empower\nTaiwan\nIn 2022, we partnered with the Van Gogh Museum, CommonWealth Magazine Foundation and Junyi Academy to localize our ‘Mastermind and Masterpieces’ program in Mandarin. 200 employees were trained as volunteers and STEM educators, leading UV light workshops in remote schools.\nChinese mainland\nWe support the Shanghai Science and Technology Museum, which organizes the Shanghai Future Engineer Competition. We also sponsor the ASML Youth Maker and Hacker Science and Technology Innovation contest, in which approximately 80 schoolchildren participate each year.\nUnited States\nSupporting innovators and creators of the future\nSan Diego\nWe support the Ocean Discovery Institute (ODI), whose mission is to use ocean science to empower young people. Through ODI, our employees participate in Q&A sessions for students to encourage them to grow their science knowledge. We also work with the Reuben H. Fleet Science Center and participate in the Fleet’s Better Education for Women in Science and Engineering (BE WiSE) program, which provides STEM education to young girls in San Diego County. We have also supported the nonprofit Science Delivered, funding take-home STEM kits for students in lower socioeconomic schools.\nGet in touch\nWant to get your school involved or know what events are coming up?\nGet in touch with us to find out about upcoming events, or how your school could be involved in our STEM initiatives through sponsorship, by hosting a guest teacher or through a visit to ASML.\nRequest a guest lesson from ASML\nThese lessons are currently available only in the Netherlands. If you are a primary or secondary school teacher, please complete the request form."
    },
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/en/company/community-engagement/culture",
        "Content_Type": "Website Content",
        "Raw_Text": "Culture is an invisible bond that unites people. Sports, arts and music are culture made visible. By promoting various local organizations and initiatives, ASML helps to strengthen those bonds while building an appreciation for our communities’ cultural expression.\nPartnership with PSV soccer club\nIn 2019, together with five other partners from the Brainport region, we became the main sponsor of PSV, the soccer club that sits at the heart of our local community. We also run a number of initiatives together with PSV, including training camps for school-aged children, supporting an online vitality program, developing interactive teaching programs and making soccer accessible for members of the community facing hardships or those who are new to the region.\n“As a Brazilian who left his former life behind to start over in a new country, this is huge for me. My heart is at the PSV stadium. At the stadium is where everything I love connects: sports, music, and people.\"\n- Andre Luiz da Silva, ASML product owner from Brazil\nVan Gogh Museum and Van Gogh Brabant\nWe collaborate with the Van Gogh Museum in Amsterdam and Van Gogh Brabant to help preserve the artworks and legacy of Vincent Van Gogh, who, like ASML, hails from the Brabant region of the Netherlands. As part of our partnership, we helped expand the Van Gogh Village Museum in Nuenen where visitors can learn about light and how Vincent van Gogh experimented with it in his paintings.\nGLOW light art festival\nBecause light is key to our work, we are a main partner and sponsor of the annual GLOW light art festival. This free event in Eindhoven, displays the works of famous national and international light artists throughout the city center over one week in November. Every year, almost 700,000 people attend the festival. Not only do we commission an artist to create a piece of art to be displayed alongside other artists’ work during the festival, but we also organize special events – such as guided tours in various languages – for international colleagues living in the Netherlands to help them feel at home and part of the local community.\nASML on Stage & Spotlight\nWe partner with the Muziekgebouw Eindhoven, the main concert hall in the city, which offers a wide selection of musical events and education. Once a year, the employees of ASML take to the stage, filling the hall with a diverse range of music genres – reflecting the diverse nature of the company – with our special annual event, ASML on Stage.\nFor members of our Brainport community in the Netherlands, we also host Spotlight, an event that welcomes people from across the Brainport region to take the Muziekgebouw Eindhoven stage to celebrate music, express their passion in a performance, and learn from talented artists. Spotlight is one way we are giving back to our community and proving that everyone has something to offer."
    },
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/en/company/community-engagement/local-outreach",
        "Content_Type": "Website Content",
        "Raw_Text": "We are committed to doing our share as a socially conscious business in the communities we are a part of. By partnering with businesses and organizations in the regions around the world where ASML is located, we are building trust and contributing to our communities.\nThe Netherlands\nExpanding access to basic needs and supporting our communities\nBrainport Eindhoven Partner Fund\nAs part of the Brainport Eindhoven Partner Fund, we help to strengthen the region and support local people who are struggling. Through this partnership, we participate in community activities to help tackle urgent social challenges in the region, for example by supporting services that provide budgeting and financial management advice for those in need.\nAffordable Housing project\nThere is a significant housing shortage in the Brainport Eindhoven region of the Netherlands, which puts serious pressure on affordability. People with low to middle incomes struggle to find affordable homes, and ASML's growth adds to their challenge. In 2023, we launched our Affordable Housing project, which aims to help increase the number of affordable homes for everyone in the Brainport Eindhoven region, primarily by providing support for the construction of new homes. We run this project in collaboration with several external parties, such as housing corporations, municipalities and real estate developers.\nOther social initiatives\nWe take part in a variety of social initiatives. For example, we provide yearly donations to the local food banks around our Dutch headquarters. In addition, we support the Eindhoven homeless shelter Springplank, which provides accommodation and advice for homeless people, as well as Stichting Leergeld, which organizes social activities and resources for children in poverty. We also facilitate regional activities that focus on building social connections and helping newcomers get acquainted with the region and local culture. Every year, we organize the ‘Angel Tree’: a collection of presents for children whose parents are clients of the local food bank.\nUnited States\nHelping those in need and protecting the environment\nFood bank support\nEvery December in San Diego, our employees help package and sort food at our annual Food Sorting Night at the San Diego Food Bank. In Silicon Valley, we have partnered with Second Harvest of Silicon Valley for over a decade. Our local team hosts food drives and organizes volunteer groups to sort food at local warehouses throughout the year.\nFamily Giving Tree\nWe support the Family Giving Tree charity in Silicon Valley, collecting school supplies, backpacks and personalized holiday gifts across the year to be donated to disadvantaged families and individuals in the community.\nBoys & Girls Clubs\nWe support the Boys & Girls Clubs of Silicon Valley’s summer enrichment programs, providing volunteers and funding for scholarships that offer lower-income students the opportunity to participate in STEM, sports, arts and wellness-focused summer camps.\nWilton Land Conservation Trust\nIn Connecticut, we work with the Wilton Land Conservation Trust to improve open space amenities and restore biodiversity. We removed invasive plant species and planted native plants and trees to support birds and wildlife at the Eugenia Slaughter Native Wildflower Meadow and Schencks Island in Wilton.\nAsia\nCaring for the planet and people\nBeach cleanups\nTo help preserve and protect nearby nature, our teams in Asia participate in regular beach cleanups. Colleagues, along with their families and friends, put their appreciation for the environment into action by removing garbage from reservations and nature parks.\nHoliday giving\nOver the holiday season, our Christmas Shoebox Project collects gifts that are prepared and wrapped by ASML employees. The shoeboxes are sent to children from economically disadvantaged families in remote areas, bringing a spark of holiday joy with each delivery.\nGreen communities\nASML aims to be a good corporate citizen and contribute to the current and future livability of our local communities. Even though biodiversity is not a material topic for ASML globally, we recognize its importance for local stakeholders. Our ambition is to prevent net loss of biodiversity and net deforestation resulting from our operations and building activity by preserving, safeguarding, restoring and enhancing our landscapes. Therefore, ASML assesses dependency and impact-related biodiversity risks. This assessment covers ASML’s own operations. No major risks were identified.\nApply for support\nWe always welcome new opportunities to sponsor activities, initiatives or organizations that align with our community engagement focus areas of education, sports, arts and music, and local outreach."
    },
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/en/technology",
        "Content_Type": "Website Content",
        "Raw_Text": "An innovation leader in the semiconductor industry, ASML’s lithography solutions have been making giant leaps on this tiny scale since 1984. In our technology, hardware meets software to provide a holistic approach to mass producing patterns on silicon.\nAll about chips\nMicrochips go by many names: integrated circuits, semiconductor chips, computer chips or, most simply, chips. Whatever you call them, these tiny pieces of silicon are the foundation of the digital world. They make our smartphones, cars, medical equipment and so many other now-common devices possible – and the tinier they get, the more advanced technology we realize in the everyday world. They may be small, but their impact is tremendous.\nPrinciples of lithography\nA lithography system is essentially a projection system. Light is projected through a blueprint of the pattern that will be printed (known as a ‘mask’ or ‘reticle’). The blueprint is four times larger than the intended pattern on the chip. With the pattern encoded in the light, the system’s optics shrink and focus the pattern onto a photosensitive silicon wafer. After the pattern is printed, the system moves the wafer slightly and makes another copy on the wafer.\nThis process is repeated until the wafer is covered in patterns, completing one layer of the wafer’s chips. To make an entire microchip, this process will be repeated 100 times or more, laying patterns on top of patterns. The size of the features to be printed varies depending on the layer, which means that different types of lithography systems are used for different layers – from our latest-generation EUV systems for the smallest features to older DUV systems for the largest.\nSoftware\nIf our hardware innovations are Batman, then software is its Robin. Even though you might know of ASML as a hardware company, we actually have one of the world’s largest and most pioneering software communities. It would be impossible for our lithography systems to manufacture chips at such increasingly small dimensions without the software we develop. As a result, our lithography systems are now a hybrid of high-tech hardware and advanced software. Our development teams work across a range of coding practices, providing innovative solutions to the intricate problems that affect the chipmaking systems at the heart of the electronics industry."
    },
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/en/technology/all-about-microchips",
        "Content_Type": "Website Content",
        "Raw_Text": "Configure your cookie settings and confirm to save your settings. You can withdraw or change your consent at any time on our cookie consent page.\nCookie consent page\nManage consent preferences\nStrictly Necessary Cookies\nAlways Active\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nFunctional Cookies\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nPerformance Cookies\nThese cookies monitor website performance and collect anonymous data on how visitors use a website. They allow us to count visits and traffic sources so we can measure and improve the performance of our site. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nTargeting Cookies\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly identifiable personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising."
    },
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/en/technology/all-about-microchips/microchip-basics",
        "Content_Type": "Website Content",
        "Raw_Text": "The building blocks of technology\nIt’s hard to imagine a world without microchips. They’re at the heart of the devices that we use to work, travel, stay fit and entertain ourselves – from cars to smartphones and from MRI scanners to industrial robots and data centers.\nMicrochips are everywhere. In 2021, semiconductor unit sales reached a record 1.15 trillion-unit shipments, and in 2022, global semiconductor industry sales topped €573.5 billion. By delivering new functionalities, better performance and lower cost with each generation, advances in chips have spawned new products and transformed industries.\n*Data source: WSTS\nWhat’s a microchip?\nA microchip (also called a chip, a computer chip, an integrated circuit or IC) is a set of electronic circuits on a small flat piece of silicon. On the chip, transistors act as miniature electrical switches that can turn a current on or off. The pattern of tiny switches is created on the silicon wafer by adding and removing materials to form a multilayered latticework of interconnected shapes.\nDigital gold\nSilicon is the material of choice in the chip industry. Unlike the metals normally used to conduct electrical currents, silicon is a ‘semiconductor’, meaning that its conductive properties can be increased by mixing it with other materials such as phosphorus or boron. This makes it possible to turn an electrical current on or off.\nThe good news is that it’s everywhere! Silicon is made from sand, and it is the second most abundant element on earth after oxygen. Silicon wafers are made using a type of sand called silica sand, which is made of silicon dioxide. The sand is melted and cast in the form of a large cylinder called an ‘ingot’. This ingot is then sliced into thin wafers.\nThe nano scale\nA microchip the size of your fingernail contains billions of transistors, so it’s easy to understand just how small the features on a chip need to be. Chip features are measured in nanometers. A nanometer is one billionth of a meter, or a millionth of a millimeter.\nFor comparison, a human red blood cell is 7,000 nanometers in diameter, and the flu virus is around 100 nanometers. The most advanced microchips contain features that are just a few dozen nanometers in size. ASML’s EUV (extreme ultraviolet) technology enables the scale of the smallest feature to be reduced even further. The smaller the features in the patterns that our systems can create, the more transistors manufacturers can fit on a chip, and the more the chip can do.\n‘Flavors’ of chips\nThere are two major ways to categorize microchips: by functionality and by type of integrated circuitry. In terms of circuitry, a chip can be analog, digital, or mixed. The difference between analog and digital function has to do with the electric signals they process. In digital chips, the signals are binary. In analog chips, the signals are continuous, meaning they can take on any value within a given range, and they use more traditional circuit elements (resistors, capacitors and occasionally inductors).\nIn terms of functionality, there are four main categories: Logic chips, Memory chips, application-specific integrated chips (ASICs) and system-on-a-chip devices (SoCs). The two most common types of chips, Logic chips and Memory chips, are digital: they manipulate and store bits and bytes using transistors. ASICs and SoCs are mainly a mix of analog and digital.\nLogic chips are the ‘brains’ of electronic devices – they process information to complete a task. Among Logic chips, CPUs (central processing units) are the ‘original’ chips, first designed in the 1960s. But there are also processors with specific functionality in mind, such as GPUs (graphical processing units, which are optimized for visual display) and NPUs (neural processing units, designed for deep and machine learning applications).\nMemory chips store information. There are two types of Memory: volatile and non-volatile. Volatile Memory chips, such as DRAM (Dynamic Random Access Memory), are the ‘working memory’ chips that save data only while the device’s power is turned on. Non-volatile Memory chips such as NAND Flash save data even after the device is turned off. For example, DRAM helps to run programs on your device, whereas NAND stores your photos. Whereas DRAM is fast, NAND is slow to read and write data.\nASICs are simple, single-purpose chips used for performing repetitive processing routines such as scanning a barcode.\nSoCs are essentially integrator chips. They are a relatively new type of chip that combines many chips and circuits in a single chip and may integrate things such as graphics, audio, camera, video and Wi-Fi.\nComputing power\nChip improvements are behind the incredible increase in computing power and memory function that has allowed technology to advance to where it is today. 1956 to 2015, computing power increased one trillion-fold, thanks to chips. Think about this: the computer that navigated the Apollo missions to the moon was about twice as powerful as a Nintendo console. It had 32.768 bits of Random Access Memory (RAM) and 589.824 bits of Read Only Memory (ROM). A modern smartphone has around 100,000 times as much processing power, with about a million times more RAM and seven million times more ROM.\nChips enable applications such as virtual reality and on-device artificial intelligence (AI) as well as gains in data transfer such as 5G connectivity, and they’re also behind algorithms such as those used in deep learning.\nAll this computing produces a lot of data. By 2025, the world will be producing 175 zettabytes (ZB) of data per year, or roughly the equivalent of one billion terabytes (TB). For comparison, according to market intelligence company IDC’s ‘Data Age 2025’ whitepaper, if you were to store 175 zettabytes on DVDs, your stack of DVDs would be high enough to circle the earth 222 times.\nThe popularity of maturity\nChips are in demand – especially chips made using older, ‘dry’ lithography equipment. How is new innovation in this more mature sector helping to drive advances in society, and how is ASML helping chipmakers to stay on top of the demand for chips?\nDoes ASML make microchips?\nNo, ASML doesn’t make chips. ASML makes photolithography machines, which our customers use to mass produce chips.\nWhat are microchips made of?\nMicrochips are printed on silicon wafers, which are made from silica sand.\nWhat are microchips used for?\nMicrochips are used in almost every electronic device we use today, including smartphones, gaming consoles, cars and medical equipment."
    },
    {
        "Ticker": "ASML",
        "Company": "ASML Holding",
        "Source_URL": "https://www.asml.com/en/technology/all-about-microchips/how-microchips-are-made",
        "Content_Type": "Website Content",
        "Raw_Text": "Microchips are made by building up layers of interconnected patterns on a silicon wafer.\nThe microchip manufacturing process involves hundreds of steps and can take up to four months from design to mass production. In the cleanrooms of the chipmakers’ fabs (fabrication facilities), air quality and temperature are kept tightly controlled as robots transport their precious wafers from machine to machine.\nTiny skyscrapers\nModern chips can have up to 100 layers, which all need to align on top of each other with nanometer precision (called 'overlay'). The size of the features printed on the chip varies depending on the layer, which means that different types of lithography systems are used for different layers. Our latest-generation EUV (extreme ultraviolet) machines are used for the most critical layers with the smallest features, and our DUV (deep ultraviolet) machines for the less critical layers with larger features.\nHow clean is ‘clean’?\nIf even the smallest speck of dust or other foreign materials ends up on the wafer, it can ruin the microchip, so chipmakers are careful to keep their fabs clean. Just how clean? About 10,000 times cleaner than the outside air. Most chipmakers have ‘ISO class 1’ cleanrooms that are ‘zero dust’, meaning there are no more than 10 particles between 100 and 200 nm in size per cubic meter of air, and none larger than 200 nm. In comparison, a clean, modern hospital has about 10,000 dust particles per cubic meter.\nThe air inside a cleanroom is filtered and recirculated continuously, and employees wear special clothing (sometimes called ‘bunny suits’) to help keep the air particle free.\nASML machines are also made in cleanrooms inside our EUV and DUV factories in Veldhoven, the Netherlands.\nLearn more about working in chipmaker fabs as a customer support engineer.\nTypes of chipmakers\nIntegrated device manufacturers (IDMs) such as Intel and Samsung both design and manufacture chips. Foundries, on the other hand, are companies that manufacture chips under contract for other companies. TSMC, GLOBALFOUNDRIES and UMC are examples of this type of chipmaker. A third type of chipmaker is the ‘fabless semiconductor company’ such as Qualcomm, Nvidia and AMD, who avoid the high costs of building and maintaining production facilities by focusing only on chip design. These companies might farm out their production to a foundry."
    }
]