[
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/",
        "Content_Type": "Website Content",
        "Raw_Text": "Experience the leading operating system for public safety\nExperience the leading operating system for public safety\nExperience the leading operating system for public safety\nNews and insights"
    },
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/moonshot",
        "Content_Type": "Website Content",
        "Raw_Text": "Gun-related deaths between police and the public have risen steadily for at least the past seven years\nWe must do something.\nIn 2023 in the U.S., 1,238 people — 1,193 civilians and 45 officers — lost their lives in gun-related incidents between police and the public*. In response, Axon is rallying partners around a “moonshot” goal to cut gun-related deaths between police and the public by 50% in 10 years.\nIt won't be easy.\nThese losses reflect a complex set of issues, and the impact on families and loved ones, communities, and our country as a whole is felt deeply and daily. We will need new ideas, new technologies, new training procedures, new policies, and even new regulations to guide the way.\nTogether, we can protect life.\nWe are calling on our own team members, leaders of the law enforcement profession, community organizations, technology companies, elected officials and others representing the best ideas to support and achieve this goal.\nIn short, we need a movement behind the mission to collectively develop realistic, research-based and responsible solutions to cut all gun-related deaths between police and the public in half by 2033."
    },
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/blog/from-call-to-closure-axon-ecosystem",
        "Content_Type": "Website Content",
        "Raw_Text": "Connecting the call: Turning 911 into real-time intelligence\nFor decades, the first seconds of an emergency have been the hardest to modernize. Dispatchers still rely on legacy systems built for landlines. Officers often arrive without full context. Critical details—caller location, urgency, threat level—move slower than the event itself.\nThat gap is finally closing.\nPrepared by Axon brings AI-powered automation and intelligence to the very first moment of every emergency. Its engine listens, transcribes, and interprets 911 calls in real time—identifying location, language, and urgency as they unfold. Callers can securely livestream video directly to dispatchers, showing them exactly what’s happening as it unfolds.\nThat intelligence and video now flow directly into Axon Fusus, the real-time crime center (RTCC) and operations platform trusted by agencies all over the world to manage live video, drones, and alerts from a single pane of glass. This unified operational view allows dispatchers, analysts, command center operators, and field officers see the same information, simultaneously.\nImagine calling 911 to report a car accident. The dispatcher answers; Prepared immediately transcribes and pinpoints the location. You stream what you see directly from your smartphone with a single tap. Within seconds, your video and call data appear in Fusus. A nearby traffic camera activates automatically. A drone launches to the area to get eyes on scene faster. Dispatchers guide responders around hazards while officers watch the same live feed en route. They arrive informed and ready, not guessing.\nThe flow of 911 information no longer stops at dispatch—it now travels with the officer. This is the new front end of public safety—faster, clearer, and connected from the very first call.\nConnecting the officer: Bringing AI-powered awareness to the field\nToday Axon also announces new capabilities in Axon Body 4 (AB4), giving officers in the field even more critical insight and real-time awareness directly from their body-worn cameras. Officers can now use that very device to silently request a drone assist from an RTCC operator to deploy directly to the officer’s location, providing live overwatch into Axon Fusus.\nAxon Assistant, an AI-powered digital partner available via Axon Body 4, adds even more capability. It’s a live connection to the entire Axon network and beyond—dispatch, command, other responders, and other sources—delivering hands-free updates and intel through simple voice and touch commands.\nLaunched in April with Real-Time Translation, the next set of capabilities is now available and include:\nAgency Info: gain real-time answers pulled from approved agency systems—like license plates or policies—helping officers make faster, better-informed decisions in the field.\nGeneral Info: get on-the-spot answers to field-relevant queries—from drug street names to math calculations—reducing time and attention spent searching or radioing for information.\nAdditionally, Axon is introducing a new premium connectivity subscription for Axon Body 4 that strengthens performance and reliability in the field. In further collaboration with FirstNet®, Built with AT&T, the companies are bringing forward even more connectivity with mission-critical priority—the highest level of priority on the FirstNet network—for Axon Body 4 livestreams. This gives agencies an added layer of reliability designed for major planned and unplanned public safety events, such as natural disasters, parades, and spontaneous protests. With mission-critical priority, supervisors, dispatchers, and command staff maintain uninterrupted, real-time visibility even when networks are congested—helping ensure faster decision-making, greater operational effectiveness, and enhanced officer safety.\nAs the first mission-critical live video solution for public safety, this collaboration between Axon and FirstNet represents a breakthrough in officer connectivity, keeping a reliable, real-time link open between every officer, every incident, and every command center when seconds matter most. This premium subscription builds on Axon Body 4’s powerful connected capabilities, giving agencies confidence that their video will work not only in everyday scenarios but also during the moments of highest stress when networks are strained, communities are watching, and officers need support the most.\nTogether, these tools create a connected rhythm of response, where officers, command, and technology operate as one. Responders stay safer, arrive more informed, and are ready to own the moment with clarity and precision.\nConnecting the community: Empowering the public to be part of the safety network\nIt takes more than a single agency to keep a city, town, or neighborhood safe—it requires innovative technology, integrated partnerships, and seamless connection across systems, departments, and the community members themselves.\nToday, Axon is introducing Community Shield, a simple, scalable solution that helps agencies proactively protect their communities and enables them to respond faster, reduce harm, and resolve more when an incident does occur. It unites real-time crime centers (RTCC), drone as first responder (DFR), counter uncrewed aerial systems (CUAS), and automatic license plate recognition (ALPR) technologies into one integrated package that delivers clarity, speed, and accountability across every phase of crime detection and emergency response.\nCommunity Shield brings together Axon Fusus, Axon Air DFR (in partnership with Skydio), Dedrone by Axon, and Axon Outpost, supported by more than 80 partner integrations. The result is a protective layer and connected operating picture—enabling agencies to better prevent crime, coordinate more effectively, cover more ground, and protect communities with greater confidence.\nBut technology alone isn’t enough. Safety also depends on connection with the communities being served and the people being protected.\nBuilding on that foundation, Axon is debuting Community Link, an enhanced suite of tools within Axon Evidence that allow agencies to more efficiently and effectively collaborate with residents and businesses via Axon Evidence.\nCommunity Link solutions include:\nCommunity Request: secure, voluntary video sharing from businesses and residents, including directly from Ring cameras.\nCommunity Notifications: real-time updates for 911 callers during active incidents.\nCommunity & Agency Surveys (formerly My90): two-way feedback tools that build transparency and trust.\nRetail Crime Hub Powered by Auror: a national collaboration platform integrated into the Axon Evidence investigative workflow to fight organized retail crime, which costs U.S. businesses more than $130 billion annually. [Source: National Retail Federation, 2024]\nTogether, Community Shield and Community Link strengthen the foundation of public safety, enabling agencies to protect and respond more effectively, while empowering residents and businesses to better support the safety of their communities.\nClosing the case: From response to resolution\nWhen an incident ends, every piece of information—video, audio, transcripts, GPS, and metadata—flows directly into Axon Evidence, maintaining a complete and traceable chain from the first call to the courtroom.\nAdditionally, Axon is preparing to launch the redesigned Axon Evidence experience, reimagined to make investigations faster, more intuitive, and more connected than ever. The new interface simplifies how agencies organize, review, and share evidence across cases, while continuing to add and enhance AI-powered automation to tasks like transcription, tagging, and redaction. It’s the same trusted system, but reimagined for the pace and complexity of modern public safety.\nAs part of this launch, Axon is introducing Brief One, an AI-powered capability included in the Axon AI Era Plan that accelerates digital evidence review for law enforcement. Built within Axon Evidence, Brief One automatically generates transcript summaries and identifies key moments—such as Miranda rights, field sobriety tests, or requests for identification—giving investigators faster insight into hours of video and audio. By surfacing critical details instantly and linking every AI summary back to its original source, Brief One helps agencies cut review time from hours to minutes, reducing backlog and keeping investigators focused on resolution instead of routine review.\nAgencies adopting connected workflows are already seeing measurable impact. Through drone-as-first-responder programs, some now achieve visual confirmation of a scene in under 90 seconds. Many are resolving one in four calls without dispatching an officer, freeing resources for higher priorities. Officers are cutting report-writing time in half and gaining faster access to policy guidance in the field.\nThe result: clearer decisions, faster resolutions, safer officers, accelerated justice—and more resilient communities.\nCall to closure: The next era of connected public safety\nBy connecting 911 intelligence, real-time operations, officer connectivity, community engagement, and digital evidence, Axon is delivering a continuous ecosystem that turns the fractured chaos of an emergency into seamless clarity.\nInformation should move as fast as emergencies do,” said Rick Smith, Axon’s founder and CEO. “Our mission has always been to protect life—and now, through AI and real-time connection, we’re giving agencies the power to make that protection smarter, faster, and more human.\nAxon will showcase this call-to-closure vision at IACP 2025, October 18–21 in Denver. For agencies and communities, it represents the beginning of a new era—one where everyone is better protected because everything is better connected.\nLearn more about Axon’s real-time innovations and IACP announcements at axon.com/iacp or in the Axon Newsroom at https://www.axon.com/newsroom."
    },
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/blog/axons-latest-ai-powered-solutions",
        "Content_Type": "Website Content",
        "Raw_Text": "From the first call to case closure, Axon’s expanding AI Era Plan helps agencies save time, strengthen cases, and keep officers focused on the community\nEvery call for service sets a complex process in motion — from the initial 911 call to seeking justice in court. Along that path, officers and investigators spend countless hours collecting, documenting, searching, analyzing, and sometimes just waiting for information.\nThe pressures on public safety aren’t slowing down. Staffing shortages are stretching agencies thin — only 14% report being fully staffed — and officers are spending over half their week on administrative work. That imbalance means less time for patrol, engagement, and priority calls. This dynamic can create a ripple effect: slower response times, mounting fatigue, and growing pressure on already limited resources.\nThe Axon AI Era plan is transforming that reality by saving time and improving efficiency at every step of the journey, helping agencies respond faster, build stronger cases, and return more officers to the field.\nProven results, real impact\nOne year after launch, the AI Era Plan is already transforming how agencies work. Take Draft One, our AI-powered report writing assistant: agencies using it are cutting report time by 50% or more. In Fort Collins, Colorado, that number jumps to 67% — giving officers hours back each week to be in the field, increasing presence and building trust.\nAnd it’s not just Draft One. A recent independent study found that Policy Chat, an AI-powered tool that provides instant, department-specific policy guidance, is returning answers 44% faster than traditional policy services, giving officers immediate clarity on agency policy when it matters most.\nAgencies are also seeing impactful results with Axon Assistant, which introduced real-time translation and other AI capabilities to Axon Body 4. Across the country, Axon Assistant is being used to bridge language barriers and build community trust. The Bernalillo Sheriff’s Office in New Mexico recently used real-time translation to de-escalate a potentially dangerous situation. See the video here.\nIn Florida, officers at the Tampa Police Department called Axon Assistant “a game-changer,” explaining that the technology is helping them be more efficient and communicate with people from “all different walks of life”. Major Kim Fruit summed it up best: “The real-time translation is just so effective. It has the most impact, not just with officers, but also the community. To be able to cut down on the time it takes to wait for a translator [is] so invaluable.”\nThe AI Era Plan also grows with your agency, delivering today’s solutions plus any new capabilities as they’re released.\nIf you're waiting, you're behind the curve. One of the most important things for me as a Chief is to find out what we can do to make our officers' jobs on their front lines more efficient, more effective, and get more engaged. Axon AI is doing that.\n- Chief Lee Bercaw, Tampa Police Department\nWhat's new in the AI Era plan\nIn this next wave we’re expanding the AI Era Plan with three new tools designed to reduce friction, strengthen investigations, and put time back in officers’ hands.\nBrief One: AI-powered evidence insights\nThe challenge: With hours of digital evidence to review, investigators can struggle to identify which files matter most, quickly.\nThe solution: Brief One accelerates evidence review by generating concise transcript summaries and identifying moments of interest in digital evidence. Instead of spending hours digging through files, investigators can quickly see what each piece of digital evidence is about and zero in on relevant moments such as Miranda rights, field sobriety tests, and more. With one click, they can verify against the source transcript or video, helping ensure accuracy without slowing down or replacing human judgement. Built directly into Axon Evidence, Brief One helps agencies save time, cut backlogs, and help strengthen every investigation while keeping decision-making firmly in the hands of officers.\nSmart Capture: Extract and use key details from driver’s licenses\nThe challenge: Officers often rely on radio calls and manual note-taking for routine checks, which can create delays in the moment and potential errors in downstream reporting.\nThe solution: Smart Capture replaces slow, manual workflows with a single scan in the Axon app. Instead of manually writing notes, walking back to the patrol car, or calling into dispatch, officers can instantly scan driver’s licenses to extract structured data like name, date of birth, license number, and more. They can then take quick actions such as pasting that information into third-party apps, searching a name across Axon Evidence transcripts, running a person search in Axon NCIC, or looking up a name in the Axon Records Master Name Index. This first Smart Capture capability focuses on driver’s licenses, paving the way for future scans of license plates and other key identifiers that will give officers even more insight in the moment. With fewer delays, less strain on dispatch, and a deep connection to the Axon ecosystem, each scan not only connects officers to information faster but also delivers cleaner, more consistent records for downstream reporting.\nAI Auto-Tagging: Reduce metadata gaps quickly\nThe challenge: Evidence backlogs and inconsistent tagging can impact case strength and slow investigations.\nThe solution: AI Auto-Tagging surfaces metadata suggestions by analyzing evidence metadata from other body-worn cameras on the scene and evidence transcripts. Officers can see these suggestions when reviewing their evidence and can choose to accept, edit, or decline. The result is more consistent, court-ready metadata without adding hours of manual desk work. AI Auto-Tagging is available now in the Axon app and is coming soon to Axon Evidence.\nWhat's improved\nWe’re not only adding new AI solutions — we’re also making the tools agencies already rely on smarter, faster, and more effective.\nDraft One:\nBody-worn camera audio captures what was said in the moment, but key details can often be visual or surface after the call. Post-incident narration, which launched earlier this year, lets officers add additional context and clarifications directly into Draft One. The narration paired with the original body-worn camera transcript, helps create an even stronger AI-generated first draft.\nA new enhancement coming later this month, will automatically analyze the transcript and generate incident-specific questions to help prompt an officer’s narration. Depending on the information in the BWC transcript, these questions will prompt officers to include details that may not have been captured on the transcript such as location, reason for the stop, and other visual observations. These tailored prompts help officers recall important facts and fill in additional context they might otherwise miss or have to spend time manually typing in. The added input strengthens the context provided to Draft One of each incident, resulting in an even more complete first draft.\nAfter you finish the call, there’s a button you can press to explain more about what happened and what other officers may have seen. If I say, ‘he was wearing a red shirt’ it will find where the description is in the draft and add it where it should be based off the interaction. Or I’ll use narration if another officer was on scene and I later ask them for details about anything they saw, heard, or did.\n- Constable Goodyear, Fredericton Police Force\nAxon Assistant:\nFinding answers in the field often slows officers down. Axon Assistant is becoming the true on-scene partner it was designed to be — helping officers access reliable information the moment they need it. With the General Knowledge channel, announced earlier this year, now live, officers can quickly look up reference information, clarify terminology, perform calculations, and more. When the Agency Info channel goes live in December, they’ll also be able to ask agency-specific policy questions — all by voice, without looking away from the scene.\nA future built on trust\nThe AI Era Plan is about more than new features — it’s about building technology with purpose. Every solution is guided by Axon’s Responsible Innovation Framework, which embeds human oversight, transparency, and rigorous testing for fairness and accuracy into every product we release. By applying AI where it adds real value, and by engaging diverse perspectives through our Ethics & Equity Advisory Council, we ensure innovation is both impactful and trustworthy.\nWith the AI Era Plan, agencies get smarter tools, faster workflows, and stronger communities — today and into the future.\nLearn more\nDiscover what’s new in the AI Era Plan and learn from customers using it now in our December 10, 2025, webinar—register here."
    },
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/blog/the-power-of-partnership",
        "Content_Type": "Website Content",
        "Raw_Text": "When a call for service comes in, the clock starts ticking. Law enforcement agencies move quickly to respond, investigate, and bring resolution. But closure is often difficult without the help of the community. Neighbors, businesses, and bystanders often hold key pieces of information that can make all the difference. At Axon, we’re committed to making that collaboration for agencies and communities easy, transparent, and built on trust. Our ecosystem helps connect communities and public safety professionals, making it easier for the public to contribute on their own terms and work together towards safer outcomes.\nIn-the-moment collaboration\nEvery call begins with a moment of uncertainty, and communities can play a vital role in bringing clarity. Community Connect is a voluntary program that lets residents and businesses securely share camera access with local law enforcement to enhance public safety. Businesses, organizations and schools can integrate their cameras directly into Axon Fusus, a real-time operations platform. This connection allows authorized law enforcement users to view live footage during emergencies, based on the specific settings and permissions defined by the camera owner. Access is always alert-based and logged, not continuous, ensuring choice, transparency and privacy at all times.\nIn the same program, residents and businesses can register their cameras to help agencies create a secure map within Axon Fusus, so agencies know who to contact for post-incident requests. This voluntary registry does not provide live access; it simply helps public safety connect with community members to gather relevant, valuable evidence when needed.\nBoth options empower community members to decide how they want to contribute to safety — with full control over when, how, and whether their cameras are accessed.\nAdditional community collaboration is possible via an integration with Citizen, a consumer app that enables users to alert others of nearby incidents. Available today in early access for select cities, the integration helps agencies see posts and videos that people choose to share publicly as events unfold. In participating pilot programs, law enforcement can also share verified updates in the app for people near an incident, for example, a road closure or a request to avoid an area.\nSoon, with Community Notifications, agencies will be able to send 911 callers proactive updates before help arrives, reducing anxiety and setting clear expectations.\nEach of these tools create opportunities for collaboration in the critical moments of a call, while ensuring privacy and choice remain in the hands of the community.\nAccelerating closure after the scene\nCommunity partnership doesn’t end once the call is over. Residents, retailers, and witnesses often hold key information that can accelerate an investigation and bring a case to closure.\nIn addition to tools like Community Connect, with Community Request, agencies can invite nearby Ring smart camera owners to voluntarily share relevant video. When submitted, footage transfers directly into Axon Evidence, preserving chain of custody, logging every interaction and keeping sensitive material secure from start to finish.\nThe Retail Crime Hub, powered by Auror, is another tool that extends collaboration to businesses by tackling one of the fastest growing threats to community safety: organized retail crime. What was once seen as only shoplifting has evolved into a violent, organized threat with real consequences for community safety and local economies. Losses topped $130B in 2024, with 10% of offenders driving 70% of loss according to Auror.\nIntegrated directly into Axon Evidence, the Retail Crime Hub helps law enforcement quickly identify repeat offenders, save time by gathering digital evidence in a few clicks, and collaborate with 26,000+ retail locations across the U.S. who are using Auror. What once took weeks of siloed effort can often be accomplished in hours, giving prosecutors the unified evidence they need to hold offenders accountable.\nAxon also offers a community survey tool that can help to close the loop even further, allowing agencies to gather community feedback after an incident and strengthen relationships long after the call has ended.\nTrust by design\nFor these partnerships to succeed, trust must come first. Axon’s community solutions are built with privacy, ethics, and governance at the core. Community sharing is always voluntary, requests are specific and time-bound, and agencies do not have continuous access to private cameras. Role-based permissions, audit logs, and policy-aligned retention help ensure accountability. These safeguards protect community rights while enabling meaningful collaboration, giving people confidence that their participation supports public safety without compromising their privacy.\nOur Responsible Innovation Framework guides these safeguards across product design and policy. We also engage external experts through the Ethics and Equity Advisory Council to pressure test decisions before they reach the field.\nClosing the call together\nPublic safety agencies and communities share the same goal: safe, thriving neighborhoods where trust runs deep. By making it easier for communities to participate—whether through a Ring camera, a Citizen app video, or feedback in a community survey—Axon helps agencies close the call. Not just with speed and efficiency, but with transparency and trust. Because in the end, it’s about solving crime faster and that happens most effectively when communities and public safety organizations work together.\nSee how Axon’s community solutions work in action—visit us at Booth #1323 during the International Association of Chiefs of Police (IACP) Conference."
    },
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/blog/responsible-intelligence-in-policing",
        "Content_Type": "Website Content",
        "Raw_Text": "Responsible intelligence in policing: Building technology that protects life and privacy\nIntelligence is at the heart of modern policing. The ability to see connections, understand context, and act quickly can transform how departments respond — helping officers anticipate threats, make informed decisions faster, and take action when seconds matter. As technology expands what’s possible, so does the duty to use it ethically. For Axon, that responsibility is the foundation of how we build.\nWe believe innovation should strengthen public safety while preserving privacy and trust. As agencies adopt real-time platforms and solutions to improve awareness, our goal is to ensure that every advancement we deliver reflects both security and accountability.\nExpanding visibility with purpose\nRoughly 75% of crimes involve a vehicle, making car-related data one of the most powerful investigative tools in policing. But vehicles move fast, cross jurisdictions, and leave little trace. For most agencies, capturing that vehicle information quickly and turning it into actionable intelligence isn’t easy.\nWe began addressing this challenge with Axon Fleet 3, our in-car system that delivers automatic license plate recognition (ALPR) and live video capabilities directly from patrol vehicles. Fleet 3 has read more than 8.1 billion license plates since release, contributing to over 20,000 felony arrests and 50,000 vehicle recoveries in the past year alone. These results demonstrated how powerful vehicle intelligence can be, and a connected view beyond the patrol car could only strengthen its capabilities.\nThat insight led to two new innovations in vehicle intelligence. Axon Outpost is a compact fixed camera that combines live streaming, ALPR, and vehicle attribute recognition — including make, model, and color — in one secure device. Axon Lightpost, developed with our partner Ubicquia, installs directly onto existing streetlights, transforming everyday infrastructure into real-time detection tools. Together with Fleet 3 and the Axon Fusus real-time operations platform, these systems help give agencies real-time awareness across their communities.\nData control by design\nPowerful technology is only as trustworthy as the safeguards that protect it. At Axon, our intelligence ecosystem is designed to keep agencies in control of their data.\nWith Axon systems, the agency manages its own data settings — including retention periods, deletion rules, and access permissions — in line with its internal policies and applicable laws. Those configurations are administered by authorized personnel. Axon does not have the ability to independently access, alter, share, or delete any evidence. Our role is to provide the secure platform and tools, while chain of custody and data management decisions remain with the agency.\nWe ensure that security is built into every layer. All evidence and data are encrypted in transit and at rest. Each file includes an audit trail that tracks access activity to help ensure accountability. Within our systems, access is limited to what’s necessary for each user’s role and is regularly reviewed for compliance.\nWe believe that transparency builds trust — meaning that agencies can review audit logs, confirm chain of custody, and verify data access at any time. These capabilities support accountability and help maintain public confidence that digital evidence is handled securely from capture through resolution.\nResponsible innovation in action\nTechnology can transform how public safety works, but only when it’s developed responsibly. Guided by our Responsible Innovation framework, we design every product to balance powerful capability with transparency, control, privacy, and partnership.\nOur goal is simple: to create solutions that support human decision-making, helping first responders act with greater awareness while protecting the people they serve.\n“We build with intention,” said Jeff Kunins, Axon’s Chief Product & Technology Officer. “Responsible Innovation is not just about avoiding harm—it’s about designing systems that work every day to make the right things easier and the wrong things harder.”\nBuilding trust through responsible intelligence\nPublic safety technology must earn trust as much as it earns results. Communities deserve to know that the systems designed to keep them safe also protect their rights. For us, that means embedding privacy and accountability into every stage of product design.\nResponsible intelligence gives agencies the awareness they need to act quickly and decisively — supported by data that is secure, auditable, and always under their control. It reinforces transparency between agencies and the communities they serve. And it sets a standard for how innovation should move forward: thoughtfully, transparently, and with respect for both safety and privacy.\nAs technology continues to reshape public safety, we see an opportunity to lead in both capability and integrity. We’re building for a future where innovation is measured not only by how much data can be captured, but also by how responsibly it’s used.\nAt Axon, that’s what progress looks like — technology that protects life and privacy with equal purpose."
    },
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/company",
        "Content_Type": "Website Content",
        "Raw_Text": "Transforming Public Safety with Technology\nProtect Life\nOfficers aren’t trained to shoot to kill. They are trained to stop a threat. They use the tools they are given, and often have less than a second to make life-or-death decisions. Let’s give them better tools and put the toughest decisions in the hands of the courts. One day the bullet will be obsolete. We’re working on a device that will out-perform the handgun in every situation and let the people on either side of the weapon go home safe at the end of the day.\nPreserve Truth\nWe have the potential for more objective sources of truth than ever before. Footage from body camera, CCTV, drones, smartphones and vehicles. All centralized, redacted and shared with an iron-clad chain of custody. With video at the heart of the record, we’ll help enable better insights, transparency with our communities, and decision making.\nAccelerate Justice\nOfficers spend up to 2/3rds of their shift doing paperwork. The technology exists today to remove this administrative burden. To streamline and automate the tedious, error-prone parts of an officer’s job. We’re building it into our agency tech stack, featuring Axon Records and Axon Evidence. These innovations will accelerate the path to justice, let officers go back to serving their communities and keep them nearby when we need them most.\nOur Impact\nOur\nImpact\nLet’s look at the numbers. We’re taking on some of society’s most difficult challenges. It’s controversial. But we’re driven by one clear goal: Protect life. The number that matters most is the estimate of lives saved. This represents the number of times lethal force was justified but not used because an officer used a TASER device to de-escalate the situation. We still have a lot to do, but we’re proud that officers have that choice.\nVisit Us\nSeattle\nScottsdale\nHo Chi Minh City\nTampere\nSydney\nAmsterdam\nLondon"
    },
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/moonshot/about-the-movement",
        "Content_Type": "Website Content",
        "Raw_Text": "A collective mission to drastically reduce gun-related deaths between police and the public\n#moonshot50in10\nThe moonshot goal was first introduced in 2021 and formally launched in 2022 by Axon Enterprise Inc. This mission has attracted broad-based support from law enforcement, community and municipal leaders including from these organizations:\nThe growing coalition represents diverse voices and perspectives across the U.S. who stand together in an effort to help cut gun-related deaths between police and the public by 50% in 10 years.\nIt's a complex challenge that will require commitment, change and solutions from all angles. We welcome any partner, organization or group who supports improving public safety to protect life."
    },
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/moonshot/latest-news",
        "Content_Type": "Website Content",
        "Raw_Text": "Participate in a roundtable\nWe’re convening a series of research-guided roundtables around the country to facilitate open discussions, perspective-sharing and ideation.\n→ JOIN A ROUNDTABLE\nShare your ideas and expertise\nWe don't yet have all the answers or actions. Share your ideas or get in touch to contribute in other ways we haven’t yet imagined.\n→ SHARE IDEAS\nWe want to hear from you. Contact us for other questions, comments, or media inquiries.\n→ GET IN TOUCH"
    },
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/blog",
        "Content_Type": "Website Content",
        "Raw_Text": "Sort order\nBridging the language gap: A conversation with John Kauffman on the power of Real-Time Translation\nRead now\nInside the evolution of 911: Building a more connected, capable communications system for emergency response\nRead now\nResponsible Intelligence in policing\nRead now\nAxon’s latest AI-powered solutions: Enabling agencies to do more from call to closure\nRead now\nThe power of partnership: How law enforcement, communities, and technology are closing the case\nRead now\nBuilding safer communities together: Axon and Ring launch Community Request partnership\nRead now\nEven more confidence in critical moments: Axon and FirstNet strengthen real-time visibility for agencies\nRead now\nAxon announces ecosystem advancements connecting every critical moment of public safety response\nRead now\nAxon + Prepared: Harnessing AI to transform the first call into the first intelligence for incident response\nRead now"
    },
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/blog/harnessing-ai-to-transform-911-response-with-axon-and-prepared",
        "Content_Type": "Website Content",
        "Raw_Text": "Axon + Prepared: Harnessing AI to transform the first call into the first intelligence for incident response\nAxon + Prepared: Harnessing AI to transform the first call into the first intelligence for incident response\nAxon has closed its acquisition of Prepared, an AI-powered emergency communications company bringing disruptive solutions that help agencies move more quickly from call to action. Together, Axon and Prepared will build on this progress by connecting devices, responders, and operators to deliver critical insights and a coordinated response in seconds. This $640 million acquisition advances Axon’s investment in teams and technologies that drive innovation and provide next-generation solutions for public safety. To dive deeper, watch the on-demand webinar.\nPrepared is now officially part of Axon\nPrepared is now officially part of Axon\nIt’s late at night when a homeowner dials 911 and whispers into the phone:\n“Creo que alguien acaba de entrar a mi garaje.”\nIn the background, Prepared's AI-powered 911 system translates on-screen for the call-taker:\n“I think someone just broke into my garage.”\nThe call taker doesn’t hesitate. They respond in English, and the system translates back into Spanish in real time, enabling seamless two-way communication.\nAt the same moment, Prepared flags “burglary” and “garage” as urgent keywords. This intelligence is automatically fed into the local agency’s Axon Fusus Real-Time Crime Center (RTCC). Nearby doorbell camera feeds are requested, and a neighbor grants permission for the agency to access via livestream. Within seconds, the neighbor’s camera confirms motion in the garage.\nFrom the nearest Skydio DFR dock, a drone takes flight, autonomously navigating directly to the scene. An RTCC analyst sees the suspect with a crowbar inside the open garage on a live video stream from that drone.\nThis same intelligence — gained through a translated call transcript, drone and video feeds — is verbally shared with responding officers through Axon Assistant on their body-worn cameras:\n“Burglary in progress at 114 Maple Avenue. Drone video shows suspect inside open garage carrying a crowbar. Resident is Spanish-speaking and not yet identified.”\nArmed with real-time AI-powered intelligence, the officers arrive prepared. Their body cameras, the drone on scene, and the activated camera streams provide the full picture to inform their response. The burglar is taken into custody.\nLess than three minutes have passed since the call came in.\nThis is the future of incident response — and it starts with Prepared by Axon.\nOwning the first 120 seconds\nThe first 120 seconds of a 911 call are critical for building context and shaping the right response, yet today most Priority 1 calls take 7–10 minutes for a response. That’s in part because too much critical data like caller details, language, or location often sits idle until CAD entry, leaving responders in the dark during the most urgent first minutes of a call for service. Language barriers, staffing shortages, and information overload add to the challenges Emergency Communication Centers (ECCs) face.\nPrepared changes all this. Now for calls like the fictionalized burglary above, AI instantly transcribes and translates information, flags urgent details, and equips call-takers to focus on what matters most: calming the caller and coordinating the response.\nThe platform is already showing impact today. In Baltimore, operators describe the experience as “like a 3D version of a 911 call,” because AI creates a multi-dimensional call experience, with transcription, translation, video, and data signals converging in real time to paint a fuller picture for both call-takers and responders. In effect, Prepared closes the gap between incident and response, with features that reduce confusion, improve accuracy, and even help improve retention for new call-takers overwhelmed by cognitive load. The entire PSAP gains a “second set of ears,” and responders gain clarity when more information is available sooner.\nIt's easy to navigate, and it's lifesaving. I've had situations where if Prepared was not available, the incident would've probably gone completely wrong.\nPlus, to continually improve future responses, Prepared’s AI doesn’t just support live calls—it learns from every call. Supervisors can now review 100% of calls instantly, with AI surfacing risk patterns and coaching opportunities. It also eases the burden on call-takers by automatically triaging non-emergency calls, which can be over 50% of call volume in some ECCs.\nThese innovations not only improve safety for communities, but also reduce litigation risk, strengthen public confidence, and give PSAPs the recognition and resources they deserve.\nPrepared continues to make life easier and more manageable under the headset.\nExpanding the Axon ecosystem with the 911 call of the future\nIncluding Prepared’s technology represents a pivotal step in Axon’s long-term call-to-closure vision: connecting every link of public safety, from the first call for help, through dispatch, response, investigation, and resolution. Consider what’s now possible:\nAxon Fusus can automatically connect real-time 911 audio and AI summaries into its real-time intelligence and command platform, and activate nearby sensors like cameras.\nAxon Air DFR with Skydio drones can be dispatched from Fusus based on AI-powered call classification and details.\nAxon Assistant can deliver AI-powered, hands and eyes-free intelligence to officers en route via Axon Body 4 cameras, turning call data into immediate, actionable insight.\nAxon Evidence can receive call transcripts, translations, and media as part of the case record, with AI flagging key moments for faster review.\nThe 911 call of tomorrow won’t just start a response, it will shape it, with an AI-driven lifeline that starts as soon as a call is made and carries intelligence directly to the field. ECCs are already the critical first piece of a coordinated, real-time response. By giving 911 call-takers and dispatchers the technology they deserve, Prepared by Axon can accelerate justice outcomes across the entire system and help Axon fulfill its mission to protect life. We are excited to bring Prepared into our leading product portfolio and continue to invest in this vision.\nAxon hosted a webinar featuring Rick Smith, CEO & Founder, Axon; Jeff Kunins, CTO & CPO, Axon; Chris Lindenau, SVP & GM, Axon Fusus; Michael Chime, CEO & Founder, Prepared where they shared about the future of 911.\nGet in touch\nLearn how Axon's ecosystem helps protect more lives in more places."
    },
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/newsroom/announcements/axon-fast-company-next-big-things-in-tech-2025",
        "Content_Type": "Website Content",
        "Raw_Text": "Our recognition in the Enduring Impact category—celebrating innovation from companies with more than 15 years in business—highlights our Real-Time Operations (RTO) ecosystem, powered by Axon Fusus, which is transforming how public safety agencies connect and collaborate in real time.\nHistorically, when incidents unfold, first responders faced fragmented systems and limited visibility. Axon Fusus unifies these systems by integrating live video, alerts, and data to give first responders a real-time view of what’s happening. That shared view helps agencies coordinate faster, make smarter decisions, and protect life more effectively.\nCommunities globally are already seeing the impact—from agencies solving cases in hours instead of days to real-time crime centers coordinating large-scale public events with greater safety and efficiency. We’re grateful to Fast Company for the recognition and, above all, to the agencies and first responders who rely on Axon Fusus to protect their communities every day."
    },
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/newsroom/press-releases/axon-announces-new-fixed-ALPR-camera-solutions-and-next-gen-AI-advancements-to-expand-real-time-public-safety-ecosystem",
        "Content_Type": "Website Content",
        "Raw_Text": "Axon and Ring Partner to Transform Community Collaboration in Public Safety\nSCOTTSDALE, Ariz., April 22, 2025 — At its annual user conference today, Axon (Nasdaq: AXON) announced a major expansion of its real-time network and public safety ecosystem, introducing new technologies, AI tools, and partnerships designed to help agencies respond faster, solve more crime, and build stronger community connections. As crime rates strain local resources and disconnected systems slow response, Axon’s latest announcements close critical gaps—bringing live intelligence, smarter infrastructure, and collaborative tools to the moments that matter most:\nAxon Outpost and Axon Lightpost—two new fixed, intelligent ALPR cameras—join Axon Fleet 3 to form a complete suite of fixed and mobile vehicle recognition solutions. Together, they go beyond traditional plate reads by capturing detailed vehicle attributes and extending real-time intelligence.\nAxon’s partner ecosystem expands, connecting third-party cameras through a new Works With Axon certified partner program and creating the most interoperable, intelligent public safety network integrated through Axon Fusus.\nAxon Assistant, an AI voice companion, launches via Axon Body 4, giving officers hands-free access to real-time translation, policy guidance, and general information, useful facts, and answers from the internet.\nAxon announces plans to integrate with Ring, a leading smart security company; empowering Ring customers to share—on their terms—relevant video with law enforcement to help solve crimes faster and safeguard neighborhoods.\n“Technology alone doesn’t build safer communities—people do,” said Rick Smith, Axon Founder & CEO. “Our job is to build the tools—and relationships—that help protect more lives in more places. With our latest product and partner announcements, we’re delivering on that promise like never before.”\nAxon Evidence network transforms with Ring community collaboration\nA new partnership between Axon and Ring, a leading smart security company, will help drive real-time community collaboration between residents and law enforcement. The integration gives Ring customers the choice to securely and privately share video footage with investigators in active cases—entirely on their own terms. Built with transparency and privacy at its core, the integration is designed to give individuals a meaningful role in protecting their neighborhoods without compromising privacy.\n“This is a new model for public safety—where communities are not just bystanders but active, empowered participants,” said Smith. “Technology should be a tool that builds trust, not fear. That’s why we’re proud to partner with Ring in working to deliver a system that respects individual rights while giving investigators what they need to solve crimes faster.”\nThe integration will work through the Community Request tool within Axon Evidence. When a crime occurs, law enforcement defines a geofenced area and timeframe. That request is sent to Ring customers who can then choose whether to share relevant footage. If they decide to participate, the footage is encrypted and securely added to the case file. If they decline, their information remains private—law enforcement does not know who declined or opted out.\n“At Ring, our mission is to make neighborhoods safer, and we’ve seen firsthand how our products and services can help connect lost loved ones or share critical information during natural disasters,” said Jamie Siminoff, Founder and Chief Inventor of Ring. “This integration with Axon will foster a vital connection between our neighbors and public safety agencies in their communities, giving them a way to work together to keep their neighborhoods safe.”\nExpanded ecosystem integrations enable faster response and investigations\nRing’s collaboration with Axon headlines a broader push by Axon to expand the public safety ecosystem with seamless integrations that empower agencies and communities alike.\nIn addition to Ring, Axon also announced a new integration with Citizen, the widely used public safety consumer app. This partnership creates enhanced communication and situational awareness for cities using the Axon Fusus real-time crime center platform — giving agencies live context, especially in areas without traditional infrastructure. It also allows public safety teams to communicate directly with communities through the Citizen app during and after active incidents.\nAnd in the retail space, Axon is integrating with Auror to combat organized theft and repeat offenders. Agencies can now receive investigative data and video evidence from retailers through the Retail Crime Hub powered by Auror in Axon Evidence, improving case building and accelerating justice while keeping store teams and shoppers safer.\nTogether, these integrations create a true network effect, with each additional device, app, or integration making the entire public safety system smarter, faster, and more effective.\nAxon’s new fixed intelligent camera goes beyond ALPR\nAlso unveiled at Axon Week was a new vehicle intelligence solution aimed at one of the most persistent challenges in public safety: identifying and tracking vehicles involved in crime. With 60–75% of serious incidents involving a vehicle, agencies need more than just license plates—they need richer, contextual data to make sense of what they’re seeing.\nAt the heart of the solution is Axon Fusus, Axon's real-time operations platform. New vehicle search capabilities will provide visibility and insight across every fixed, mobile, and community-sourced ALPR-enabled camera, providing real-time alerts, smarter search, and shared visibility across jurisdictions.\nAxon Fleet 3 in-car cameras with ALPR technology have read a total of 8.1 billion license plates, facilitating more than 20,000 felony arrests and 50,000 vehicle recoveries in the past year alone. To expand this impact, Axon has introduced two new first-party fixed camera solutions:\nAxon Outpost is an Axon-built fixed ALPR device that combines live streaming, plate reading, and vehicle attribute recognition in a single unit. It’s built for flexible deployment and integrates directly with Axon Fusus to deliver the full picture in real time.\nAxon Lightpost, developed in collaboration with Ubicquia, delivers similar capabilities in an easy-to-deploy form factor that can be installed on existing streetlights in under an hour.\n\"Ubicquia is transforming existing streetlight infrastructure into powerful public safety tools. Our UbiHub platform is easy to install, simple to relocate, and built to scale—allowing cities to deploy their video surveillance and LPR capabilities quickly and expand as needed,” said Ian Aaron, CEO of Ubicquia. “Our partnership with Axon accelerates our mission to make communities smarter, safer, and more connected, giving first responders, more visibility, better tools and law enforcement faster access to real-time insights.”\nBoth are fully integrated into Axon Fusus with smart search and alerts alongside live video. The intelligence network is easily expanded by Works With Axon, a new certified partner program that connects trusted third-party cameras—like Axis Communications, Bosch, InsightLPR, Verkada, and Leonardo ELSAG—into a unified, interoperable network. Axon has also joined forces with BusPatrol, the nation’s most widely deployed school bus stop-arm enforcement system, as it explores innovative ways of transforming everyday infrastructure into powerful public safety tools. The Works With Axon program gives agencies confidence that certified vendor cameras support self-service integration to Axon Fusus, appear on the map, and connect into real-time workflows alongside Axon devices.\n“This is not just about launching new tools,” said Smith. “It’s about fundamentally rethinking how we build technology in public safety—putting responsible innovation at the core, designing for the moments that matter, and extending real-time awareness into places and incidents where it’s never existed before.”\nThe AI Era Plan advances into its next wave, say hello to Axon Assistant\nTo help agencies do more with limited resources, Axon is rolling out the next wave of AI-powered tools that improve efficiency while keeping officers focused on the field. These solutions are part of the AI Era Plan, Axon’s long-term commitment to delivering scalable, responsible AI tools at a fixed cost to agencies.\nIn late 2024, Axon launched the AI Era Plan with Unlimited Auto-Transcribe and Draft One—the fastest-selling product in Axon’s history. Draft One is an AI report writer cuts report writing time by 40% or more. With new enhancements, it now supports post-incident dictation, third-person narratives, and multi-language audio.\nToday, Axon is also adding to the AI Era Plan: Unlimited Smart Detection to quickly identify and track human forms through video evidence; and Policy Chat for quick, clear answers to policy questions anytime, anywhere—like ChatGPT for an agency’s entire library of policies.\nAxon is also launching a new voice-enabled AI companion, Axon Assistant, built directly into Axon Body 4; no need to purchase new hardware. Axon Assistant launches with three key skills:\nReal-Time Translation immediately bridges language barriers through the body-worn camera; supporting over 50 languages, it helps officers communicate clearly during traffic stops, calls for service, and other community interactions.\nVoice-Enabled Policy Chat allows officers to ask questions and get clear, immediate answers to agency policy questions—complete with citations—over their Axon Body 4 camera, so they can make quick decisions with confidence.\nGeneral Q&A gives officers the ability to ask Axon Assistant everyday questions on facts that could be useful for them in the field, without taking their eyes off the scene.\nMore Axon Assistant skills—like license plate lookup, weather, and traffic information—will launch later in 2025, along with a continued stream of AI solutions that will be added to the AI Era Plan.\nBuilding with Responsible Innovation at the core\nUnderpinning all of these advances is Axon’s commitment to Responsible Innovation—a product development framework grounded in transparency, control, privacy, and community partnership. From AI to drones to real-time video, Axon designs its technology to extend human decision-making, not replace it.\nThis approach means:\nCommunity camera integrations are privacy-preserving by design.\nAI tools include audit logs, clear boundaries, and required human review.\nReal-time sensors focus on detecting threats—not tracking people—and actively facilitate responsible data usage through auditable retention policies, public agency transparency portals, and more.\n“We build with intention,” said Jeff Kunins, Axon’s Chief Product & Technology Officer. “Responsible Innovation is not just about avoiding harm—it’s about designing systems that work every day to make the right things easier and the wrong things harder.”\nDefining the blueprint for real-time public safety\nAxon’s latest technologies announced this week are more than standalone products—they’re part of a unified vision for the future of real-time operations, where communities and agencies are connected in the moments that matter, and critical intelligence flows without friction. Whether it’s a stolen vehicle tracked across city lines, a drone dispatched autonomously from a 911 call, or a training module that builds real-world de-escalation skills in VR, Axon is investing in a safer future built on openness, transparency, and speed.\nFor specific product and regional availability, customers should contact their Axon representative.\nFor more information about these announcements, please visit the Axon newsroom at axon.com/newsroom.\nAbout Axon\nAxon is the technology leader in global public safety. Our moonshot goal is to cut gun-related deaths between police and the public in the U.S. by 50% before 2033. Axon is building the public safety operating system of the future by integrating hardware devices and cloud software solutions that lead modern policing, defense and security. The Axon ecosystem includes TASER energy devices, body-worn cameras, in-car cameras, cloud-hosted digital evidence management solutions, productivity software, real-time operations capabilities and third-party integrations through Axon's partner network. Axon's growing global customer base includes first responders across international, federal, state and local law enforcement, fire, corrections and emergency medical services, as well as the justice sector, commercial enterprises and consumers.\nNon-Axon trademarks are property of their respective owners. [Axon, Axon Body, Axon Ecosystem, Axon Evidence, Axon Records, Draft One, TASER and Protect Life] are trademarks of Axon Enterprise, Inc., some of which are registered in the US and other countries. For more information, visit www.axon.com/legal. All rights reserved.\nFollow Axon on Social:\nLinkedIn: https://www.linkedin.com/company/axon-protect-life/\nInstagram: https://www.instagram.com/axon.enterprise?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==\nX/Twitter: https://twitter.com/axon_us\nFacebook: https://www.facebook.com/Axon.ProtectLife/\nNote to Investors\nPlease visit http://investor.axon.com, https://www.axon.com/press, www.twitter.com/axon_us and https://www.facebook.com/Axon.ProtectLife/ where Axon discloses information about the company, its financial information and its business.\nInvestor Contact\nErik Lapinski, Head of Investor Relations\nInvestors@axon.com\nMedia Contact\nAlex Engel, Vice President, Corporate Communications\npress@axon.com\nmedia hotline: (480) 444-4000\nSOURCE Axon"
    },
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/news",
        "Content_Type": "Website Content",
        "Raw_Text": "Axon reports Q3 2025 revenue of $711 million, up 31% year over year\nRead More\nAxon to acquire Carbyne, uniting cloud infrastructure and AI to redefine the 911 experience\nRead Now\nAxon to Release Third Quarter 2025 Earnings on November 4, 2025\nRead More\nPUBLIC RELATIONS\nINVESTOR RELATIONS"
    },
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/resources",
        "Content_Type": "Website Content",
        "Raw_Text": "From Hours to Minutes: How Brief One Transforms Jail Call Review\nRead Case Study\nOverload to Insight: How Brief One Helps Legal Professionals Work Smarter\nRead Case Study\nHow Oklahoma City Police Department transformed records management with Axon Records\nRead case study"
    },
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/news/puerto-rico-axon-expansion",
        "Content_Type": "Website Content",
        "Raw_Text": "The Puerto Rico Police Bureau has equipped officers across the territory with Axon Body 4 body-worn cameras backed by Axon’s digital evidence management solution, Axon Evidence.\nToday, Axon is pleased to announce that the Puerto Rico Police Bureau has equipped officers across the territory with Axon Body 4 body-worn cameras backed by Axon’s digital evidence management solution, Axon Evidence. This expansion follows the successful deployment of Axon Body 3 body-worn cameras and Axon Fleet 3 in-car cameras for first responders last year.\nThis latest deployment follows public policy issued by the Governor of Puerto Rico, Hon. Pedro Pierluisi Urrutia, and the directives set by the Secretary of the Department of Public Safety of Puerto Rico, Alexis Torres Ríos, in August of 2022 to deploy body-worn cameras as a part of a long term modernization strategy. According to Inspector Noel Méndez Rivera, Assistant Secretary for Operations and Intelligence, Department of Public Safety, Axon was selected due to the efficient live streaming functionality, geolocation and automatic activation with Axon Signal technology, as well as security and chain of custody of its body-worn cameras.\n“We are thrilled to partner with the Puerto Rico Police Bureau as they continue to enhance their public safety solutions to protect their communities,” said Vishal Dhir, Axon’s Senior Managing Director of Americas. “This latest procurement demonstrates their ongoing dedication to leveraging the latest technology to increase officer and community safety, putting them at the forefront of public safety technology and continuing the expansion of modernized public safety tools across the Americas.”\nLast year, Puerto Rico Police outfitted officers with Axon Body 3 body-worn cameras and Axon Fleet 3 in-car cameras, which were met with positive reception from both community and officers alike. With this latest purchase, Puerto Rico Police Bureau continues to demonstrate their commitment to keeping the citizens and first responders of Puerto Rico safe.\n“We are proud to continue to bring advanced technology solutions to our first responders,” said Inspector Méndez.\nBy outfitting officers with the latest body-worn cameras and solutions we are able to continue to protect the people of Puerto Rico."
    },
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/blog/category/news",
        "Content_Type": "Website Content",
        "Raw_Text": "Sort order\nAxon + Prepared: Harnessing AI to transform the first call into the first intelligence for incident response\nRead now\nThe Axon App for Android achieves FedRAMP authorization\nRead now\nAnnouncing the 2025 Axon Award Winners\nRead now\nAnnouncing the 2025 Axon RISE Awards Finalists\nRead now\nArizona helped build Axon. Now, we’re fighting for Arizona.\nRead now\nHeroes Among Us: Honoring the 2024 IACP/Axon Police Officers of the Year\nRead now\nDraft One and the Axon App for iOS achieve FedRAMP Authorization\nRead now\nAxon ignites the intelligence revolution for public safety at IACP 2024\nRead now\nAxon VR training curriculum achieves IADLEST National Certification\nRead now"
    },
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/news/taser-10-wins-good-design-award",
        "Content_Type": "Website Content",
        "Raw_Text": "Axon’s latest energy weapon has been praised for its enhanced design and long range\n“I hope people will see the TASER 10 as an effective tool to save lives. I also hope they recognize its appearance makes a bold statement that symbolizes its safety and strength for the community.”\n-Elliot Ortiz, Senior Industrial Designer, Axon\nAxon is proud to announce that the TASER 10, Axon’s latest generation less-lethal energy weapon, has been selected as a 2023 GOOD DESIGN Award winner in the category of Safety and Security.\nThe GOOD DESIGN Awards, now in their 73rd year, were created to “honor both products and industry leaders in design and manufacturing that have chartered new directions for innovation and pushed the envelope for competitive products in the world marketplace” [SOURCE]. Since inception, more than 50 nations across the globe have participated in this world-renowned program.\nAbout the TASER 10\nTASER 10 is the first TASER energy weapon to utilize a magazine with ten reloadable, single-probe cartridges. Featuring an overhauled propulsion system, each cartridge has a maximum range of 45 feet, nearly double the range of previous models. Each cartridge can be individually targeted and [deployed] to allow users to place each probe with precision.\nThe challenge of good design\nTo build trust in the TASER 10, the team knew the design had to be, for all intents and purposes, flawless from the customer point-of-view.\n“The first step was to understand the needs of the professionals that use these [weapons] in the field,” recalled Elliot Ortiz, Senior Industrial Designer. “We talked to law enforcement officers, security professionals, and previous TASER customers to get in-depth real world feedback, statistics and stories. It’s important to know what’s going on in an officer’s head during these high stress situations when the deployment of a TASER [weapon] might occur.”\nElliot shared that the primary goal for the TASER 10 was to make a less-lethal weapon that could effectively stop threats in more situations than ever before.\nAlthough the TASER 10 is the same size as its predecessor, the TASER 7, the weapon features ten cartridges as opposed to two, and can be used at almost double the range. This gives officers more time and distance to de-escalate critical situations without moving to lethal force.\nOne of the biggest hurdles was developing a TASER [weapon] officers trusted to use in dynamic situations where traditionally they would go for a firearm.\nIn addition to ensuring the weapon could function at a higher level than any less-lethal weapon before, the team also knew that for officers to truly feel comfortable using the TASER 10 in high pressure situations, the weapon needed to be simple to use.\n“We focused on making the TASER 10 simple, robust and more intuitive for officers...One of the biggest hurdles was developing a TASER energy weapon officers trusted to use in dynamic situations where traditionally they would go for a firearm.”\n“We developed hundreds of prototypes and got them into the hands of professionals. Every detail, from the smooth contour of the iron sight — the graphic design of live cartridges on the LCD display — to the added ribbing on the sides, needed to be carefully considered.”\nWhy were all of these seemingly small design features so critical? “Tackling these means the [weapon] won’t catch on a holster, be mistaken for loaded or unloaded, or slip in sweaty hands. The minutiae of design details like this are what we face when challenged with creating something like the TASER 10.”\nTrustworthy, effective, intuitive\nThe three words Elliot would use to describe the final design of the TASER 10? Trustworthy, effective and intuitive.\n“Designers will often use flowery words and symbolism to evoke a feeling about an object, so I’m obliged to say the TASER 10 is a compact, ergonomic, intuitive TASER [weapon] that exudes confidence and professionalism through the application of rigorously intentional detailing. But for something as demanding as the TASER 10, the design can be summed up in just 2 words: ‘no nonsense’”\nFor something as demanding as the TASER 10, the design can be summed up in just 2 words: ‘no nonsense’\nIn the end, Elliot’s team was able to pull off what some had considered the impossible. “I’m proud to be part of a team that can achieve such a cohesive and effective design. And I’m proud that officers adopted it so quickly. I believe the TASER 10 will save lives, and that’s the number one thing to be truly proud of.”\nThe new TASER 10 was also a Featured Finalist in the Social Impact Design category at the International Design Excellence Awards (IDEA)."
    },
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/news/being-black-in-law-enforcement",
        "Content_Type": "Website Content",
        "Raw_Text": "Recently, Chief Jeri Williams (Ret.) and University of Wyoming PD officer Trent Sewell (Ret.) joined Axon for a fireside chat on their careers and their experiences being Black in law enforcement.\n“Ironically enough, I joined law enforcement because originally I didn’t like cops,” began Sewell. “I figured, you know, if someone’s going to say ‘X, Y and Z’ what are (sic) good and bad about law enforcement...I’m going to be able to be a person who provides good and provides value to their community.”\n“My mom had a rule in the house that you either go to school or you work,” recalled Williams. She had just graduated from school, so she realized she had to “figure out something real fast.”\nAt the time Williams was graduating, Phoenix Police Department was looking for women and people of color to join their department. “They didn’t have enough [women and people of color] and they knew it...I decided I wanted to be a cop.”\nWhen Sewell decided to pursue a career in law enforcement, “a few of my relationships with my family definitely turned into a ‘Hey, happy birthday. Merry Christmas.’ That’s it...There was that challenge at home.” Sewell shared that he also lost many friends over his choice of career. Williams also initially struggled for acceptance from her family members on her choice of career path. And the challenges of being a person of color entering the policing profession did not start and end at home.\n“My first FTO (Field Training Officer) said to me ‘You’re gonna have problems here because you’re Black and female,’” she recalled. Williams shared that this statement didn’t deter her: “Don’t try to be one of the guys cause they’re never gonna accept you for one of the guys. Just be you.”\nDon’t try to be one of the guys cause they’re never gonna accept you for one of the guys. Just be you.\n- Chief Jeri Williams (Ret.)\nThis approach propelled her to great achievements. Williams was the first female police chief in both the city of Oxnard and Phoenix.\n“Being the first in anything brings a different set of responsibility,” admitted Williams. “I don’t want to be the only female, I want there to be other females that have the opportunity, as well as people of color.” A key to Williams’ leadership style? Consistency in how she treated her reports. “As a boss, I don’t believe you can treat everyone the same way cause (sic) there are different motivators, but you do need to be consistent.”\nSewell believes this idea of consistency also translates into the field. “The thing [...] is how do you treat people, how do you navigate conversations.” Sewell shared that he was able to find a mentor who helped him navigate community interactions. He also took time to watch those around him and learn how to best interact with community members to make a difference. In the end, he shared, it’s about finding a way to connect with individuals on a human level, to “let them know that ‘hey, actually I take my boots and my badge and stuff off and I’m still human outside of this.’”\nSewell believes a key piece of improving interactions between police and the community will be recruiting more individuals from historically-underserved communities to join the profession and drive change from inside.\nYou can be that person that can give some young person a great experience with being a police officer.\n- Chief Jeri Williams (Ret.)\nSewell and Williams made a point to express their gratitude for finding their careers in law enforcement. “It ended up being the career choice that really made a difference in the lives of the community as well as my own personal life,” shared Williams. “I wouldn’t trade a single day,” agreed Sewell. “I’d recommend everyone do it, to an extent. I think everyone needs to understand what it’s like to be on both sides...so that we have this, this ecosystem between the public and law enforcement.”\nThey also expressed pride that policing as a whole is working hard to evolve and improve when it comes to both recruiting and community engagement. “I know we’re better. I know we’re more transparent. I know we’re learning more. Do we have more to learn? Absolutely...What we used to do in the 80s and 90s is very different than what we do now in 2024...so I think we’ve made tremendous progress, but I think there’s more progress to be made.”\nWilliams and Sewell are continuing to be part of that progress. Today, Williams serves on the Axon Board of Directors, and Sewell works as a Campus Representative on the Axon Sales team. They both appreciate having the unique opportunity to work alongside their former peers and communities as they work to Protect Life, while also sharing their experiences from public safety with Axon employees who have not been in that position.\nA force for good\nBeing a force for good means working to instill positive change consistently. Over the past month, our Justice, Equity, Diversity and Inclusion team and Mosaic, our employee resource group for Black employees, have collaborated to bring impactful Black History Month programming to our entire company. In addition to the hosted discussion with Chief Williams and Trent Sewell, we held a virtual session on Balance, Health and Wellness, hosted a “Taste of Culture” event at Axon Headquarters and partnered with the Black Tech Achievement Awards on a new 'Force for Good Award.'\nBut celebrating Black contributions in both the tech and public safety industries is a year-round opportunity. As part of our work to encourage Black employees in tech and support our Black public safety partners, we are building strong relationships with organizations that serve communities currently underrepresented in tech, and working to ensure our workforce reflects the diverse tapestry of our customers and the communities in which they serve.\nThink Axon sounds like a good fit? Apply to join our team at axon.com/careers"
    },
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/news/women-in-policing",
        "Content_Type": "Website Content",
        "Raw_Text": "Safe Journeys is a new series that unveils the humanity behind public safety, as men and women share their journey of protection, empathy, resilience and who they are beyond the badge.\nWhat is the reality of working as a female in public safety? The answer to that question largely depends on where you live and work. We sat down with three successful women in policing to hear more about their careers and the challenges they have faced.\nMeet Fiona Wynne\nFiona Wynne is a Detective Inspector in Yorkshire, England, who “joined (policing) in an era when women officers were issued with a handbag and a tiny baton to fit in it.”\nToday, Wynne’s agency has a more balanced force in terms of gender demographics. “In my opinion, we are a much more professional service as a result. So much else has changed in 25 years, particularly in how we look after the wellbeing of officers.”\nThe old adage was when you come to work, leave your problems at home. But people aren’t robots, it’s important we look at the whole person and accept that we all have issues. I’m 54 and going through menopause. I’ve been part of a group trying to talk about that at work and break the taboo.\nNow as a Detective Inspector, Wynne tries to be a guiding force for other officers. She is constantly encouraging her direct reports to care for their mental and physical wellbeing, and not let work consume them. “It’s something that, as a manager, I’m really mindful of for my staff...it is so important to take time out and to just recharge batteries.”\nRead Fiona's full story\nMeet Carla Baker\nCarla Baker is a Sergeant in Vancouver, Canada who always knew she wanted to go into policing. “There’s no history of policing in my family, although my dad wanted to join (the force).” Baker’s father used to talk to her about the honor of a life in policing, which inspired her to pursue the career herself.\nIn grade school, she remembers being given a list of jobs and asked to choose a future career. She saw ‘Policeman’ on the list, and thanks to her many talks with her dad, she confidently crossed the profession out. In its place she wrote: ‘Police Woman.’\nWhen she joined the force, she wanted to make a positive impact for other women. “For 6 years I was in the domestic violence unit, my most stressful and rewarding role so far. I was helping women in incredibly difficult situations,” she shared.\nDuring her time in the domestic violence unit, Baker was able to make a true, lasting change on many lives. “One woman had her ex regularly climb up the fire escape to threaten or assault her. Thankfully we managed to get her into new accommodations. On Christmas Eve I received a text saying, ‘thank you for saving my life.’ Moments like that made it easy to get up every day and do the best that I could.”\nBy all accounts, Baker has been a shining example of a public servant, but she shared it hasn’t always been easy. Baker has a daughter, and sometimes balancing her personal and professional life felt like too much.\n(My daughter is) 16 now but when I first started in the academy she was one. And my husband worked night shifts with the city of Vancouver and it was very difficult.” Baker shared that family commitments often keep women in Canada from vying for promotions at work. “It’s added responsibility on top of their already very important responsibilities at home.\nLike Wynne, Baker shared the importance of taking time for yourself outside of work. She believes that maintaining a boundary between work and home life not only keeps you and your family healthier, but can make you more effective at work. “Having a life outside the service keeps you balanced when you’re dealing with people in the street, when you’re still in touch with what is going on around you and not just behind the blue line.”\nRead Carla's full story\nMeet Mable Chawinga\nMable Chawinga is a Senior Superintendent in Malawi. Chawinga initially didn’t have her sights set on a career in policing. It wasn’t until her sister told her “You need a job that makes you think; you have the talent, you have a critical mind.” She started to truly consider what type of impact she wanted to have.\nShe decided she wanted to serve her community, and applied to the Malawai Police Service. “At first the Malawi Police Service said I was too short, they wouldn’t take me in. But I kept pushing and eventually I got a letter saying they had changed their minds.”\nChawinga’s sister was able to see her graduate from police training school. Sadly, she passed away shortly after. For Chawinga, it was only motivation to keep going to make her sister proud.\nWherever I’m posted I make sure I have impact. I make sure I develop some initiative that makes a change at that place – ‘Mable is here, this has happened because of her.’ I want to be the Inspector General of Police one day, I’m still fighting on.\nMable’s dream to be the Inspector General of Police would be a huge step forward for women in policing in Malawi. “Women have traditionally been sidelined in most security activities” she shared. Additionally, women often have trouble being promoted because of regulations on where public safety professionals can work when they are married. “Because I am married, they will say ‘we cannot move you outside the capital city because your husband is there within, within that district.’” But Chawinga is undeterred.\n“I’ve had to fight for things for my whole life...That’s how my life has been, always pushing.” For Chawinga, she believes the best is still ahead.\nRead Mable's full story"
    },
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/news/josh-mazone",
        "Content_Type": "Website Content",
        "Raw_Text": "Safe Journeys is a new series that unveils the humanity behind public safety, as men and women share their journey of protection, empathy, resilience and who they are beyond the badge.\nIt was a calm night, and Sergeant Josh Mazone used the time to complete weapons inspections for Officers Matthew Duffy and Michael Christopher. Rather than go their separate ways when finished, the three stayed and chatted for a while, enjoying the quiet.\n“If we hadn’t done that” Mazone realized, “if we had just done the weapons inspections and then parted ways, Duffy and I would not have been where we were at when the call came out.”\nThe call was unlike any Mazone had responded to before.\nBorn and raised in Colorado, Mazone had always felt compelled to help others, but it wasn’t until his late twenties that he decided to pursue a career in uniform.\nAfter college, Mazone was working as a welder. “It just wasn’t clicking.” Almost as if by fate, he “had an opportunity to do some ride-alongs with a good friend of mine that I went to high school with...and I got hooked.”\nWhen he was introduced to policing, Mazone knew his desire to help people had brought him to this profession. He finally knew what he wanted to do. He knew how he could make a difference.\nHe heard the call from dispatch: ‘shots fired and someone screaming.’\nMazone and Duffy were both close to the call location, having stayed longer after weapons inspection. Both men headed towards the call, with Duffy arriving first. The update he radioed caught Mazone off guard:\nHe says, ‘Hey this is a structure fire. We’ve got an apartment complex fully engulfed.'\nMazone knew he and Duffy needed to work fast “or we’re just gonna stand here and watch this place burn.”\nNot hesitating, he and Duffy went into the burning building to evacuate the apartment’s residents.\n“It was pretty intense from that point on. The temperature of the air was pretty shocking to me” he admitted.\nWe talk about smoke, and smoke inhalation...no one really talks about how hot the air is.\nThe heat and smoke only reminded the duo how little time they had to save people as they evacuated residents door by door. Eventually, they made it to a breezeway. There, they met other officers who had arrived to the scene, including Michael Christopher, the third officer Mazone and Duffy had been chatting with earlier in the evening.\nThe group split up to evacuate the second and third floors simultaneously. Mazone and Duffy were on the second floor. The pair worked their way to an apartment directly above where the fire had originated. The door to the apartment was closed and wouldn’t budge.\n“I had a failed attempt at throwing my shoulder into it,” Mazone chuckled. The second attempt was more successful. “Boom. Just like that it opens.”\nInside was a family, including children. With Mazone and Duffy’s help, the entire family was able to escape.\nBy now, the smoke had ensnared Mazone. It became harder and harder to breathe as he and the other officers cleared the rest of the hall.\n“We’re all finally at a point where we’re gonna leave, right? We’re running. Let’s go, let’s go. And, boom. We hit this wall of smoke like nothing I’ve ever seen, nothing I’ve experienced.”\nThe officers had reached the doorway at the end of the apartment hall — just on the other side was a breezeway. Mazone fumbled for the doorknob. As he recalls it, his hand met Duffy’s at the handle. Together, the two pushed their way to fresh air.\nMazone and Duffy were transported to the hospital where they were treated for smoke inhalation and carbon monoxide poisoning.\nThe fire claimed the life of one individual, a resident who lived in the apartment where the fire started. Everyone else in the complex was able to safely evacuate, in part thanks to Sergeant Mazone.\n“I was right back to work the next night” shared Mazone, not dwelling on his own heroics. “Just the nature of the beast.”\nFor Duffy, the call ended up being one of his last. He had experienced many stressful calls during his time with Arvada Police, and the fire and his subsequent hospitalization had taken a toll on his family. “Family comes first,” affirmed Mazone with a nod. “End of story.”\n“We receive a lot of great training here. You can train all you want for different things, but you never really know how you’re going to act or...how it’s going to affect you emotionally, psychologically, until it’s there.”\nIt’s been nearly 12 years since those ride-alongs with a friend, but Mazone’s passion for police work and service remains as strong today as it was then.\n“There’s never a dull moment. But I wouldn’t trade it for the world. There’s terrifying moments, there’s sad moments, there’s everything, but no one night is like the other.”"
    },
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/news/ten-reasons-to-attend-axon-week",
        "Content_Type": "Website Content",
        "Raw_Text": "Registrations are open for Axon Week 2024! Register today at the link below:\nRegister now >\nTwo conferences in one\nLast year Axon hosted two major conferences: TASERCON and Axon Accelerate took place in April. With Axon Week 2024, we’re bringing both conferences together for one week-long event. A ticket to Axon Week 2024 gets you access to both industry-leading conferences:\nTASERCON is a training conference that focuses on the whole officer — not just on-the-job tools and tactics. At TASERCON, attendees to build new skills and strategies to save lives, achieve higher levels of performance and create long-lasting impact.\nAxon Accelerate is the premier public safety technology conference. Each year, Axon brings together leaders from across local and state law enforcement, corrections, fire, EMS and more to share best practices for leveraging cutting-edge technology to improve safety and accelerate justice worldwide.\nExciting product launches\nAt TASERCON 2023, Axon revealed the TASER 10. At Axon Accelerate 2023, we revealed the Axon Body 4.\nAxon Week 2024 will feature the launch of Axon’s latest innovative solutions. Be there and experience the future of public safety technology live.\nLocation, location, location\nTwo words: Miami Beach.\nAxon Week 2024 will take place in sunny Miami Beach. Take a week to enhance your skills and interact with the latest in public safety technology, all while being just steps away from the ocean.\nA major thank you to the Miami Beach Police Department for their partnership during the Axon Week planning process.\n70+ breakout sessions\nAxon Week 2024 will feature a wide variety of breakout sessions. Whether you’re a police chief or patrol officer, an evidence technician or district attorney, an expert trainer or new hire, Axon Week 2024 will feature breakout sessions designed for you.\nWe have 5 Primary tracks of content designed to equip your agency with the tools needed to lead in an ever-evolving landscape:\nRegistered attendees will also receive digital access to all breakout session recordings, so you can go back and watch any sessions you weren’t able to attend, or rewatch sessions you want to experience again.\nWatch one of the most popular sessions from Axon Accelerate 2023:\nProduct and partner engagement areas\nAxon Week 2024 will feature interactive experiences where attendees can interact with cutting edge public safety technology. Don’t just hold the new TASER 10 VR Controller, use one during the Axon VR training experience. We’re bringing together the best of both Axon and partner technology in interactive activations designed to keep you engaged and learning while having fun.\nSweet surprises\nAxon Week 2024 is of course about receiving world-class training and interacting with groundbreaking technology. But Axon events are also about having a good time. In the past, attendees have enjoyed things like the Axon Arcade and Freeze!, our ice cream shop. Axon Week 2024 will feature some new and exciting ways to connect, refuel and gain that extra bit energy to get you through the action-packed week.\nAdd-on events\nLooking to add to your Axon Week 2024 experience? On both Monday, April 22, and Friday, April 26, we will be offerings a number of optional certification courses and workshops. Attendees can register to receive their BWC certification, TASER 10 Instructor Certification, Pulse Graph Certification or Axon Investigate certifications. Attendees can also sign up for the join Axon’s Force Science De-escalation Instructor Course.\nJoining Axon Week 2024 from abroad? Participate in our 2024 Global Impact Summit for the unique chance to interact with Axon executives and other influential policing leaders from across the globe. Network, share experiences and gain insights from peers in the international law enforcement community.\nEpic keynote speakers\nIn recent years, Axon conferences have featured keynotes from the likes of Jocko Willink, Coach Bill Belichek and former President George W. Bush. We’ve got a great line-up of keynote speakers for this year, including Dan Marino, David Roberts and Rob Riggle. Learn more about our exciting keynote speakers.\nThe Axon Week Party\nAxon parties have become legendary, but this year in Miami Beach may feature the best one yet! Come for the live music, delicious food, fun times and of course, the beach vibes. As usual, we’ve got some fun surprises planned and you won’t want to miss this event.\nLearn from industry experts and your peers\nOne of the best things about in-person events is the chance to interact with and learn from your peers. At Axon Week 2024, meet new officers and leaders from around the world and share best practices.\nWe’ve seen connections formed at Axon Accelerate and TASERCON that result in years-long friendships and partnerships. Ultimately, when public safety leaders like you join forces together, great things happen.\nWe hope you will join us at Axon Week 2024. Together, we will build a safer future for communities around the globe.\nRegister Now\nWe hope you will join us at Axon Week 2024. Together, we will build a safer future for communities around the globe.\nRegister now >"
    },
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/news/jeremie-nix",
        "Content_Type": "Website Content",
        "Raw_Text": "Safe Journeys is a new series that unveils the humanity behind public safety, as men and women share their journey of protection, empathy, resilience and who they are beyond the badge.\n“My baby’s not breathing!”\nA white car stopped in the middle of the road, horn blaring. As Sergeant Jeremie Nix of the Marion County Sheriff’s Office drove upon the scene on his way home from work, he directed the car to the side of the road and watched as two women exited the vehicle. In the arms of one of the passenger’s was a tiny baby, dressed in an infant diaper and entirely stiff. Nix knew immediately this was no ordinary infant CPR call, and he jumped into action.\nOn May 9, 2018, Sergeant Jeremie Nix left work late. “I kind of got held up here at the agency because I ran into another supervisor friend of mine over [at] our training division and just happened to just, strike up a conversation on my way home.”\n“My wife and I had a date night planned that night,” recalls Nix. So to make up time on his way home, he took a different route than he normally would drive.\nThat alternate route would forever change the lives of two families.\nNix was on the phone with his wife when he heard “this horn just blowing — there’s this car stopped in the roadway next to me...I look over and I can see it’s a white car, there’s two females in it, and I can see they’re frantic.”\nNix directed the car to pull over next to him on the side of the road and watched as both females exited the vehicle.\n“My baby’s not breathing!” He heard one of the women shout. In her arms was a tiny baby, dressed in an infant diaper, and entirely stiff.\n“I remember as she’s carrying [the baby] to me, the way it was holding itself, it was very rigid...eyes are rolled in the back of his head, it’s not breathing, I can’t feel a heartbeat...I give him a couple breaths — his chest isn’t rising.”\nNix had radioed for an ambulance, but the more he examined the infant’s physical state, the more he realized he didn’t have time to wait for medics to arrive.\n“The rulebook is: wait for the ambulance. But at that point I knew...we’ve gotta throw the rulebook out the window.”\nThe rulebook is: wait for the ambulance. But at that point I knew...we’ve gotta throw the rulebook out the window.\n“I just told the mom ‘the hospital’s up the road, follow me.” Nix loaded the baby into his patrol car and raced towards a nearby hospital. He left the lights and sirens on his patrol vehicle running as he sprinted from the vehicle into the hospital’s emergency wing.\nThe first person he saw was the emergency room’s Head Trauma Nurse. Nix remembers handing off the infant and watching as the nurse accepted the child and disappeared down the hall.\n“Nobody has any idea what’s happening. Luckily, the mother...when I took off...had been in contact with the family member that was watching the baby earlier that day,” Nix remembers. “The baby had accidentally been given some medication that was not supposed to be given, and it basically overdosed the baby.”\nNow, a tiny infant lay in the hospital’s emergency wing, receiving medical attention for an accidental overdose. Sgt. Nix sat in the waiting room, praying for a positive update.\nThe hospital’s medical staff managed to revive the baby, who was now being transported to a neonatal trauma center in Gainesville, Florida for treatment and monitoring overnight.\nAs Nix received word the child was going to live, he finally exited the hospital and climbed back into his cruiser. Inside his patrol car, he was greeted by a familiar voice.\n“Are you ok?!”\nIn the chaotic series of events, Nix realized he had never ended the phone call with his wife, Nikki. She had remained on the phone the entire time, dressed for date night, wondering what was happening on the other end of the call.\nAs he described the events to his wife, Nix asked if she would still be ok to go to dinner – but in Gainesville.\n“You’re wanting to go see this kid,” she said. His wife knew from his suggestion his mind was still on the infant. Without hesitation, the couple rerouted to Gainesville.\nThey arrived and found the infant with “100 wires on him, and, oxygen, and all this crazy stuff,” Nix recalls. At one point a nurse picked up the recovering infant and attempted to hand him to his mother. “Nope,” the mother said, gesturing towards Nix. “Let him hold him.”\nThe baby reunited with the man who had saved his life hours earlier. And this would not be the last time the two would meet.\nAbout a month after the incident, Nix and his wife were asked by Nechole Crowell, the boy’s mother, to be the baby’s godparents. The little boy, Kingston, now fully recovered and old enough to walk and talk, calls his godparents regularly. He loves spending time with the couple, who he and his mom now consider family.\n“It’s just, kinda snowballed into this, really just a family relationship,” says Nix.\nNearly six years have passed since the day that changed his life forever, and Nix now has more time to reflect on his experience and his profession. “I truly believe that there are people that are designed to do this job” he shares. “I think there are people that just have good morals, good character — they care about the humankind, period. And they want to do a good job, they want to help people.”"
    },
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/news/engineering-at-axon-write-code-and-save-lives",
        "Content_Type": "Website Content",
        "Raw_Text": "“I’ve always gravitated toward complex mechanical challenges, something that really tests and forces me to improve my skills,” he told us. “With TASER 10, there were a ton of technical challenges. It was something that had never been done before, so that was really exciting to me.”\nExciting technical challenges are a common occurrence for engineers at Axon. Axon is the leader in TASER technology as well as many other public safety technologies. Few competitors means there are no examples to study, and no roadmaps to follow. Engineers are constantly innovating because they have no other choice. According to Firmware Director Chris Tucker, “It’s kind of like working in James Bond’s lab.”\nDesigning the TASER 10\nThe jump from TASER 7 to TASER 10 was a paradigm shift in less-lethal technology. In order to achieve a maximum range of 45 feet, the weapon required a completely overhauled propulsion system. Ryan's work was integral in ensuring the TASER 10 could accurately take down threats from 45 feet, nearly double the range of all previous TASER models.\nAfter six months of iterating, tweaking and testing, Ryan was finally able to deploy a TASER 10 prototype. The experience was exhilarating.\n“You get in the range and that first trigger pull is nerve-wracking. Taking the first shot is really exciting, and it's something that doesn't really happen at other engineering firms or companies,” he said.\n“I'm really proud of the accuracy that we're obtaining at 45 feet. I think that was a huge success for Axon and for my personal development.”\nMission and motivation\nPut simply, Axon engineers come to work every day to solve this challenge and save more lives. Last year, the company announced a moonshot goal to cut gun-related deaths between police and the public by 50% by 2033. Put simply, the work Axon engineers are performing saves lives.\nBefore Axon, Ryan bounced from contract to contract on various consumer electronic devices. While interesting, his work didn't feel necessary or urgent.\n“Then I came to Axon and realized that working on something that does change lives – and saves lives – is huge,” he said. “Our product needs to work and we have to solve these challenges, because there are lives at stake.”\nAxon's audacious mission and innovative products are largely the product of a visionary Founder and CEO, Rick Smith. Chris Tucker mentioned he was only a few weeks into his tenure at Axon when Smith stopped by his cubicle with a suggestion for the TASER 10’s warning system.\n“‘I really want this warning charge to sound kind of like Ironman charging up his beam,’” Tucker recalled Smith saying. “We’re like, ‘How do I make that into a sound?’”\nBut Tucker and his team figured it out, and when the sound debuted at TASERCON that year, the police officers in attendance commended the warning system as an effective de-escalation tool.\nReal-world feedback\nFeedback from a wide range of stakeholders, including public safety partners and civilian community members is a critical component of working at Axon. Many members of Axon’s staff are current or former law enforcement or military and all of us are community members with a passion to maintain public safety. The company is in constant contact with law enforcement groups and communities all across the country and around the world. Additionally, staff frequently experience ride alongs with police and other public safety customers.\nAll of this gives Axon engineers an incredible amount of access to their end-users, which means they can get instant and accurate feedback on their work.\n“Axon makes sure that when it comes up with a concept, it goes back to the customer and says, ‘Is this what you were looking for?’” said Tucker. “If they say, ‘Not quite,’ we’ll iterate on it, refine that product and once we’re ready for it, we’ll try to change the world with it.”\nGrowth and responsibility\nAxon places a lot of trust in each and every engineer. Leadership expects employees to tackle each task with their best foot forward, but is there for support when needed. At Axon, we aim far. It’s not about knowing exactly what to do every time; it’s about taking a risk, learning from any setbacks and knowing how to ask for help.\nSupport also means up-skilling engineers, whether they want to pursue technical expertise or master management. If you have drive and goals, Axon will push to help you achieve new heights.\n“Axon has generally been very supportive of sending engineers off to go learn about optics or some other topic they’re interested in, to go improve and hone their skills,” said Ryan.\nTucker said he told Axon he wanted to become a better leader, and leadership obliged by finding him a training program.\n“They put the opportunity in front of me and I made the most of it,” he said.\nProtect life with Axon\nIf you’re an engineer ready to challenge yourself while making a difference, Axon is the right place for you. Our products streamline justice and save lives.\nExplore the Axon job board for on-site and remote opportunities and apply today to write code and save lives."
    },
    {
        "Ticker": "AXON",
        "Company": "Axon Enterprise",
        "Source_URL": "https://www.axon.com/news/protect-life-in-real-time",
        "Content_Type": "Website Content",
        "Raw_Text": "Protect life in real time: RTCCs and the Axon ecosystem\nProtect life in real time: RTCCs and the Axon ecosystem\nToday Axon announced it has acquired Fusus, a global leader in real-time crime center (RTCC) technology. Read on for how real-time crime centers can increase safety in any environment and why greater situational awareness and collaboration across agencies and communities is critical to our shared mission.\nMay 3, 2023, started like any other weekday at the Northside Hospital in Midtown Atlanta. The waiting room was filled with patients and their loved ones. Doctors and nurses bounced from room to room providing care to their community. Outside the building, a bustling business district was about to take its collective lunch break.\nBut the day turned tragic when a gunman opened fire in the facility, killing one individual, wounding four others and unleashing an urgent manhunt that kept the community on edge.\nResponding in real time\nPolice dispatchers received the call at 12:08 p.m. A rush of officers, vehicles and specialty teams barreled toward Midtown. The area was put on lockdown as law enforcement officials began desperately searching for the suspect in the Atlanta metro area, where nearly 6.2 million people live. They knew the odds of quickly locating a lone suspect in a city that size were not favorable. But the city was crowded with something other than people: cameras.\n“The camera system on May 3 was vital for us to quickly identify and locate and apprehend this individual that was causing harm to our city,” said Atlanta Police Chief Darin Schierbaum in an Instagram post on May 4, 2023.\nIn roughly 22 minutes, Atlanta Police Department’s Video Integration Center (its real-time crime center, or RTCC) powered by Fusus, alerted authorities to the suspect. Through integrated CCTV camera feeds, they learned he had stolen an unattended vehicle from a gas station. Police continued to track him with views from state-owned Georgia Department of Transportation cameras and fixed-camera Automated License Plate Reader (ALPR) technology provided by Flock Safety. This led officers to a nearby condo complex, over 10 miles from where the original incident occurred, where Axon Body 3 body-worn cameras and Axon Fleet 3 in-car cameras with Axon Respond maintained visibility.\nFusus’ real-time technologies and seamless mutual aid capabilities — which help multiple agencies work together on the same platform — allowed officers from both Atlanta Police Department and Cobb County Police Department to close in and take the suspect into custody within just 8 hours of the first call being received.\nA real-time crime center helped quickly locate and arrest an Atlanta mass shooting suspect.\nExpanding the Axon ecosystem\nThe loss of life and the injuries of others during the tragedy in Atlanta have no place in our communities, where people should feel — and be— safe in public.\nReal-time crime centers like Fusus offer an unprecedented opportunity to increase safety in any moment, in every environment. They provide a “single pane of glass” to monitor active incidents by integrating live video footage and other data points from various locations within a community. With Fusus, hospitals, schools, retail stores, houses of worship, event venues and residential communities — whole cities and towns — are better protected and, importantly, can contribute to greater safety for everyone.\nThat’s why Axon recently acquired Fusus and is so optimistic about the promise of more robust real-time intelligence. Together, Fusus and Axon usher in a new era of public safety that strengthens Axon’s ability to deliver on its mission to protect life, capture and preserve truth, and accelerate justice.\nAxon's extensive network of public safety products already includes groundbreaking connected cameras like Axon Body 4 and Axon Fleet 3, life-saving de-escalation tools like TASER 10, real-time collaboration tools like Respond, and an open ecosystem of integrated partners. Adding Fusus to the Axon suite radically expands and deepens these real-time capabilities. It immediately gives public safety agencies the ability to access with permission CCTV camera feeds, including those maintained by the community, to see events unfolding with greater context and clarity.\nThese centers also have the ability to integrate and connect a wide range of sensors and data sources, including fixed, body-worn, fleet and ALPR cameras; gunshot detection sensors; social media feeds and more, to provide a comprehensive and immediate view of ongoing criminal activities or emergencies. Ultimately, by aggregating all of this information into a single pane of glass for public safety, real-time crime centers enhance situational awareness, improve response times and support proactive crime prevention efforts by leveraging up-to-the-minute information and analytics. This information can then be quickly and easily shared between collaborating agencies, ensuring accelerated justice for all involved.\nAtlanta Police Department’s Video Integration Center.\nAxon first delved into real-time solutions in 2019, when Axon Body 3 with Respond introduced livestreaming capabilities to give clearer insight into incidents as they unfolded. Since that time, other Axon devices and sensors, such as Fleet 3 in-car cameras and Axon Air drones, have incorporated livestreaming and live maps. And last year, Axon released Axon Body 4, with bi-directional voice communications enabled through the body-worn camera and a “Watch Me” feature that allows officers to request a second set of eyes on the scene for additional safety and support.\nOne officer from the St. Cloud Police Department in Minnesota used “Watch Me” to request support from a supervisor as he tried to locate a suspect in a basement, all without the need to remove one of his hands from his weapon, which he would have had to do if he were operating his radio. In other instances, investigators have taken witness statements via an officer’s body camera in order to proceed quickly with other aspects of the investigation.\nReal-time crime centers further extend and enhance the use cases and impact of real-time technology and have become a necessity for law enforcement agencies to rapidly and effectively respond to critical incidents. They also bring operational efficiencies to agencies often strapped for resources. Today, Fusus is used by more than 250 cities and counties, including Miami, Cleveland and Minneapolis, to deliver the same level of unified situational awareness that the first responders in Atlanta experienced during the Northside Hospital shooting in Midtown Atlanta.\nWest Palm Beach deploys a real-time crime center to bring a multitude of views into a single pane of glass.\nBut RTCCs are not only useful for violent threats; they can also help resolve cases where people may be in danger in other ways. In one instance, Fusus helped officers locate a woman with Alzheimer’s who had wandered away from her home. The real-time crime center allowed officers to track her boarding a bus, and she was brought home unharmed. Separately, one agency used Fusus to recover more than $200,000 worth of stolen property, locate 17 vehicles and seize 30 firearms in a six-month timeframe.\nProtecting more lives in more places\nThe sad truth is that more than 6 million people were victims of a crime in America in 2022 (Bureau of Justice Statistics). The United States also experiences an inordinate amount of mass shootings — more than 650 in 2023 alone (Gun Violence Archive). Separately, the Axon Public Safety Gun Fatality Database shows that in 2022, 1,201 people, including both officers and civilians, lost their lives in gun-related incidents between police and the public. In other areas of the globe, gang violence has surged in Latin America; drug trafficking has hit historic levels in Europe, increasing the threat of organized crime violence (Interpol Internationational); and human trafficking is prolific in South and Central Asia (Statista).\nPublic safety around the world demands new tools and innovation to keep people safe.\nThe good news is agencies are increasingly adopting technologies such as livestreaming, drones and real-time intelligence platforms, like Fusus, to help rapidly detect, respond to and resolve criminal activity in record time (think hours instead of weeks or even months) — ultimately helping to protect more lives in more places. This includes law enforcement officers and subjects involved in a given incident. With more immediate intelligence and support, response teams can make more informed decisions that limit the loss of human life, which is the basis for Axon’s moonshot goal to cut gun-related deaths between police and the public in half by 2033. Real-time crime centers will be central to that mission.\nTechnology played a huge role, but technology does not do any good without people who are determined to capture an individual who would do something like this.\n“If you rewind the hand of time four years, we probably wouldn’t be where we are today, right now,” said Chief Stuart VanHoozer of the Cobb County Police Department, which aided in the swift apprehension of the suspect in Atlanta. “Technology played a huge role, but technology does not do any good without people who are determined to capture an individual who would do something like this. And today we saw where those two things came together in an amazing way.”\nGet in touch\nLearn how Axon's ecosystem helps protect more lives in more places."
    }
]