[
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "http://www.astrazeneca.com/",
        "Content_Type": "Website Content",
        "Raw_Text": "The strong underlying momentum across our business through the first nine months of the year sets us up well to sustain growth through 2026 and has us on track to deliver our 2030 ambition.\nPascal Soriot, Executive Director and Chief Executive Officer, AstraZeneca"
    },
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "https://www.astrazeneca.com/what-science-can-do/stories-of-impact.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Our health needs a world of connections\nOur science is most powerful when we see health as interconnected to people, society and the planet. When we continually strive forward, progressing our understanding of disease. And when our teams are part of like-minded collaborations, co-creating innovative solutions that transform care.\nTogether, this is helping to make a big difference to our health.\nExplore our impact\nBy seeing a world of connections, we're creating opportunities to make a big difference to our health.\nJoining up ingenuity and technology through partnership and a willingness to innovate can transform care and make a big difference to our health.\nAll Stories\nResults\nAll Stories\n-\nRethinking prevention of recurrent C. diff infections\n-\nOur Oncology R&D strategy: driving innovation and transforming patient outcomes\n-\nUnlocking Tomorrow: Hope and Innovation in Bladder Cancer\n-\nAiming to reset the immune system to transform immunology\n-\nHCC Patient Charter: Collective Action to Transform HCC Care\n-\nAI-Driven Drug Discovery: Breakthrough technologies MapDiff and Edge Set Attention\nVeeva ID: Z4-69604\nDate of Preparation: October 2024"
    },
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "http://www.astrazeneca.com/our-company.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Our company\nWe are a global, science-led, patient-focused pharmaceutical company. We are dedicated to accelerating the delivery of life-changing medicines that create enduring value for patients, society, the planet and our shareholders.\nAstraZeneca at a glance\n$54.1bn\nTotal Revenue*\n>18%\nTotal Revenue growth*\n$13.6bn\ninvested in our science*\n*year ending 31 December 2024\nOur Purpose\nWe push the boundaries of science to deliver life-changing medicines.\nOur Purpose underpins everything we do. It gives us a reason to come to work every day. It reminds us why we exist as a company. It helps us deliver benefits to patients and create value for shareholders.\nOur Values\nWe follow the science. We put patients first. We play to win. We do the right thing. We are entrepreneurial.\nOur Values determine how we work together and the behaviours that drive our success. They guide our decision making and define our beliefs.\nOur strategy\nOur bold aspiration is to be pioneers in science, lead in our disease areas and transform patient outcomes. By 2030, we aim to launch 20 new medicines and achieve $80 billion in Total Revenue with sustained growth thereafter.\nOur strategic focus areas:\n- Deliver the next wave of pipeline innovation\n- Accelerate platform of therapeutic modalities\n- Transform R&D ways of working\nOur strategic focus areas:\n- Achieve industry-leading growth in our therapy areas\n- Transform care\n- Realise world-class supply chains\nOur strategic focus areas:\n- Deliver a great employee experience\n- Lead on climate, equity and resilience\n- Enable an agile organisation\nOur therapy areas\nWe're creating novel therapies that help people with cancer or other chronic and rare diseases. Our focus is on therapy areas where we can transform care and improve outcomes for patients.\nOncology\nWe are leading a revolution to transform cancer care. Our ambition is to eliminate cancer as a cause of death.\nWe seek to transform outcomes for people living with cancer through innovative medicines, powerful collaborations and a world-class, purpose-driven team.\nBioPharmaceuticals\nOur ambition is to transform care for billions of people living with chronic diseases and deliver long-lasting immunity.\nWe are working to intervene earlier to protect vital organs, slow or reverse disease progression, and achieve remission for often degenerative, debilitating and life-threatening conditions, so many more people can live better, healthier lives.\nRare Disease\nWe are dedicated to improving the lives of those living with rare diseases, and the people who support them.\nAlexion, AstraZeneca Rare Disease continues to build a diversified pipeline across disease areas with significant unmet medical need, using an array of innovative modalities, while expanding our global geographic footprint.\nOur approach to sustainability\nRecognising the interconnection between business growth and addressing the major health challenges of our time, our Sustainability strategy focuses on how we do business and how we make a positive impact — for the health of people, society and the planet.\nHow we make a sustainable impact\nThrough the power of science and innovation, we are taking action on climate and nature, health equity and health systems resilience. We collaborate with governments, health systems, patient groups, academia and NGO’s to focus our shared efforts where we can have the greatest impact — on local, regional and global health.\nHow we do business\nWe are guided by our Values and invest in our people to create long-term value, resilience and trust by operating responsibly, ethically and with robust governance.\nOur people\n94,300\nemployees**\n84%\nemployees believe that AstraZeneca is a great place to work**\n80%\nfeel valued for diverse opinions and thinking**\n** Annual Report 2024\nWe are dedicated to being a great place to work. One where everyone who chooses to work at our company is able to make a difference to patients, a meaningful contribution to society and a positive impact on our planet.\nWe foster an environment where our people feel they belong and are empowered to reach their full potential, perform at their best and make a valued contribution to the enterprise.\nBe among our employees who continue to make us an innovation-driven company that stands firmly among the world's leaders in pharmaceuticals.\nOur global strategic R&D centres\nOur centres in Cambridge (UK), Gaithersburg (US), Boston (US), Gothenburg (Sweden), Shanghai (China) and Beijing (China) are the driving force of our strategy and science, and key to our long-term success.\nVeeva ID: Z4-74985\nDate of preparation: June 2025"
    },
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "http://www.astrazeneca.com/our-company/history.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Our history\nTransforming the future of healthcare by unlocking the power of what science can do, for people, society and planet since 1913.\nAstraZeneca was founded in 1999 through the merger of Sweden's Astra AB and the UK's Zeneca Group PLC. This strategic merger combined each company’s strengths to drive scientific breakthroughs and bring innovative solutions to patients around the globe. Since then, we have remained steadfast in our commitment to science and our pursuit of cutting-edge research, continuing to deliver life-changing medicines and transform healthcare for people everywhere.\n2025\n2025\n2024\n2024\n2023\n2022\n2022\n2021\n2021\n2021"
    },
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "http://www.astrazeneca.com/our-company/our-people.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Our people\nWe have more than 89,900 people across the globe and dedicated to push the boundaries of science to deliver life-changing medicines to patients. Meet some of those individuals that are committed to transforming the lives of billions of people around the world.\nVeeva ID: Z4-70896\nDate of preparation: December 2024\nand help us deliver life-changing medicines. Be among our employees who continue to make us an innovation-driven company that stands firmly among the world’s leaders in biopharmaceuticals."
    },
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "http://www.astrazeneca.com/our-company/our-people/oncology.html",
        "Content_Type": "Website Content",
        "Raw_Text": "We use cookies to provide website functionality, to analyze site usage, the content you visit and how you use it, to enable social media features and assist in our marketing efforts, including showing you personalized content. Only Necessary Cookies will be stored by default, and by clicking “Accept All”, you agree to the storage of all cookies on your device. You may personalize your preferences, obtain more information, and withdraw or change your consent at any time by clicking on “Set Preferences” or by visiting our Cookie Notice link available on the site. For more information about the use of cookies please see the cookie notice web page."
    },
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "http://www.astrazeneca.com/our-company/our-people/biopharmaceuticals.html",
        "Content_Type": "Website Content",
        "Raw_Text": "We use cookies to provide website functionality, to analyze site usage, the content you visit and how you use it, to enable social media features and assist in our marketing efforts, including showing you personalized content. Only Necessary Cookies will be stored by default, and by clicking “Accept All”, you agree to the storage of all cookies on your device. You may personalize your preferences, obtain more information, and withdraw or change your consent at any time by clicking on “Set Preferences” or by visiting our Cookie Notice link available on the site. For more information about the use of cookies please see the cookie notice web page."
    },
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "http://www.astrazeneca.com/our-company/our-people/rare-disease.html",
        "Content_Type": "Website Content",
        "Raw_Text": "We use cookies to provide website functionality, to analyze site usage, the content you visit and how you use it, to enable social media features and assist in our marketing efforts, including showing you personalized content. Only Necessary Cookies will be stored by default, and by clicking “Accept All”, you agree to the storage of all cookies on your device. You may personalize your preferences, obtain more information, and withdraw or change your consent at any time by clicking on “Set Preferences” or by visiting our Cookie Notice link available on the site. For more information about the use of cookies please see the cookie notice web page."
    },
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "http://www.astrazeneca.com/our-company/our-people/research-and-development.html",
        "Content_Type": "Website Content",
        "Raw_Text": "We use cookies to provide website functionality, to analyze site usage, the content you visit and how you use it, to enable social media features and assist in our marketing efforts, including showing you personalized content. Only Necessary Cookies will be stored by default, and by clicking “Accept All”, you agree to the storage of all cookies on your device. You may personalize your preferences, obtain more information, and withdraw or change your consent at any time by clicking on “Set Preferences” or by visiting our Cookie Notice link available on the site. For more information about the use of cookies please see the cookie notice web page."
    },
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "http://www.astrazeneca.com/our-company/our-people/enabling-functions.html",
        "Content_Type": "Website Content",
        "Raw_Text": "We use cookies to provide website functionality, to analyze site usage, the content you visit and how you use it, to enable social media features and assist in our marketing efforts, including showing you personalized content. Only Necessary Cookies will be stored by default, and by clicking “Accept All”, you agree to the storage of all cookies on your device. You may personalize your preferences, obtain more information, and withdraw or change your consent at any time by clicking on “Set Preferences” or by visiting our Cookie Notice link available on the site. For more information about the use of cookies please see the cookie notice web page."
    },
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "http://www.astrazeneca.com/our-company/our-people/operations.html",
        "Content_Type": "Website Content",
        "Raw_Text": "We use cookies to provide website functionality, to analyze site usage, the content you visit and how you use it, to enable social media features and assist in our marketing efforts, including showing you personalized content. Only Necessary Cookies will be stored by default, and by clicking “Accept All”, you agree to the storage of all cookies on your device. You may personalize your preferences, obtain more information, and withdraw or change your consent at any time by clicking on “Set Preferences” or by visiting our Cookie Notice link available on the site. For more information about the use of cookies please see the cookie notice web page."
    },
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "http://www.astrazeneca.com/our-company/our-people/international.html",
        "Content_Type": "Website Content",
        "Raw_Text": "We use cookies to provide website functionality, to analyze site usage, the content you visit and how you use it, to enable social media features and assist in our marketing efforts, including showing you personalized content. Only Necessary Cookies will be stored by default, and by clicking “Accept All”, you agree to the storage of all cookies on your device. You may personalize your preferences, obtain more information, and withdraw or change your consent at any time by clicking on “Set Preferences” or by visiting our Cookie Notice link available on the site. For more information about the use of cookies please see the cookie notice web page."
    },
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "http://www.astrazeneca.com/our-company/leadership.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Our leadership\nOur leadership, which includes our Board of Directors and Senior Executive Team, is accountable to our shareholders for the responsible conduct of the business and our long-term success. It also represents the interests of all our stakeholders in ensuring that we deliver for patients by putting science at the heart of everything we do.\nBoard of Directors\nOur Directors are collectively responsible for the success of AstraZeneca. In addition, the Non-Executive Directors are responsible for exercising independent and objective judgement and for scrutinising and challenging management. The Board is responsible for setting our strategy and policies, oversight of risk and corporate governance and monitoring progress towards meeting our annual plans. It is accountable to our shareholders for the proper conduct of the business and our long-term success and represents the interests of all stakeholders. The Board has delegated some of its powers to five principal committees and the CEO. Members of the Board and their biographies are shown below.\nMichel Demaré\nNon-Executive Chair of the Board\nMember of the Board since September 2019 and Chair since April 2023.\nPascal Soriot\nExecutive Director and Chief Executive Officer\nMember of the Board and CEO since October 2012.\nAradhana Sarin\nExecutive Director and Chief Financial Officer\nMember of the Board and CFO since August 2021.\nSenior Executive Team\nIn addition to the Board of Directors, our Senior Executive Team, or SET, is the body through which our Chief Executive Officer (CEO) exercises the authority delegated to him by the Board. Our CEO leads the SET and has executive responsibility for the management, development and performance of the business. The Chief Executive Officer, Chief Financial Officer and SET also take the lead in developing our strategy for review, constructive challenge and approval by the Board as part of our annual strategy review process."
    },
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "http://www.astrazeneca.com/our-company/our-locations/cambridge.html",
        "Content_Type": "Website Content",
        "Raw_Text": "The Discovery Centre (DISC)\nA state-of-the-art global R&D facility located in the heart of the Cambridge Biomedical Campus.\nCambridge, one of the most exciting bioscience hotspots in the world, is home to the largest UK research and development centre – The DISC. Here more than 2,000 scientists work in drug discovery and development, across our therapy areas, each playing a central role in our mission to deliver life-changing medicines to patients. The DISC is uniquely designed to strengthen collaboration, promote openness, and improve the sustainability of every aspect of our science and our business operations.\nWe are at an exciting moment, as remarkable science and collaboration provide new opportunities to translate early discovery into meaningful medicines that can slow or even stop disease progression, prevent or even potentially cure disease. I look forward to the next chapter in BioPharmaceuticals, as we continue to push the boundaries of science and innovation to deliver life-changing medicines for use by patients across the world.\nScience in Pictures\nCelebrating science and the power of what science can do.\nSTEM community art project\nWe commissioned a giant art installation inspired by science, which was created by the People’s Picture in collaboration with our STEM community. It celebrates and recognises the role and impact of science through the medium of art and design.\nThe giant mosaic is an artistic interpretation of the building, DISC, the UK’s largest research and development centre. It is composed of over 8,000 pictures and 1,000 original images created by young people who attended inspirational science sessions in schools and community events hosted with our STEM partners.\nDesigning the future of R&D\nThe DISC represents our belief in what science can do. It enables scientists to discover new medicines more efficiently and deliver them more effectively, harnessing the power of data and artificial intelligence, digital technologies and novel precision medicine approaches.\nHere, as in all our research efforts worldwide, we’ll be striving to enhance our understanding of disease biology, discover new ways to target drivers of disease, better predict clinical success, and pioneer new approaches to engagement in the clinic.\nOur Cambridge culture\nLocated in the heart of the Cambridge Biomedical Campus we are surrounded by scientific institutions, academia and world-leading hospitals. We believe that interaction, collaboration and an entrepreneurial approach are vital for accelerating science and re-imagining healthcare.\nCollaboration\n- Collaboration and working in partnership across academia, biotech, and industry is key to advancing scientific innovation to transform healthcare and improve outcomes for patients.\n- The power of our physical proximity to our Cambridge neighbours creates unusual interfaces in a porous environment where talent can be shared, not siloed.\nCommunity\n- Through our STEM programmes, we aim to inspire the next generation, exciting them about science and the wide range of opportunities available in our industry.\n- We aim to show that science can be for everyone, growing the aspirations of young people.\nBy working with our neighbours and driving a convergence of innovation, collaboration and talent from the heart of the Cambridge Biomedical Campus and beyond, we continue to develop our culture and accelerate the science in our key therapy areas of Oncology, Cardiovascular, Renal & Metabolism, Respiratory & Immunology and rare diseases.\nCambridge’s unique blend of academic expertise and entrepreneurial spirit drives our strategy forward, enabling us to push the boundaries of science and bring innovative solutions to healthcare globally.\nA sustainable future\nWe are dedicated to making our science and our business sustainable. The DISC exemplifies this in every aspect of what we do – helping to protect the environment by how we operate our labs and discover, develop and produce our medicines.\nEnvironmental sustainability formed the design principles of The DISC, focusing on increasing energy efficiency and working with the natural environment with an aim to reduce heating and lighting consumption by over 40%. The DISC has been awarded an excellent rating by BREEAM, the world’s leading sustainability assessment for building projects. Our scientists are working in a building that follows best practice in low energy design and construction, in support of our path to deliver Ambition Zero Carbon. This will help us to achieve our Company target to reduce greenhouse gas emissions from our global operations (Scope 1 and 2) by 98% by 2026.\nVeeva ID: Z4-71364\nDate of preparation: January 2025"
    },
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "http://www.astrazeneca.com/our-company/our-locations/gothenburg.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Our people support the entire life cycle of medicines. That’s everything from idea generation through discovery research, via early and late-stage clinical development, to pilot scale manufacturing, distribution, global commercialisation, and product maintenance.\nGothenburg key facts\n3,000\n>1/3\n54.6%\nDesigning the future of R&D\nOur team of world-renowned scientists work in all our research therapy areas, including cardiovascular diseases, kidney diseases, metabolic diseases, respiratory diseases, immunity diseases, cancer, and rare diseases. One of the Gothenburg site’s unique features is that we have most of the resources and expertise needed to support the entire lifecycle of a medicine. That’s everything from idea generation to global commercialisation and product maintenance.\nHere, as in all our research efforts worldwide, we strive to enhance our understanding of disease biology, discover new ways to target drivers of disease, better predict clinical success, and pioneer new approaches to engagement in the clinic.\nOur largest unit for the manufacture of clinical supplies\nIn Gothenburg, we house our largest and most diverse set-up for the manufacture of clinical supplies. We have highly modern facilities for producing oral, parenteral, and inhaled products across research therapy areas, including capabilities for packaging, labelling and worldwide distribution. We continue to invest in the most modern processes and technologies, a recent example is a state-of-the-art continuous manufacturing line.\nPioneering activity-based labs\nA driving force behind the Gothenburg site’s scientific leadership is our fully flexible, activity-based labs that have inspired other businesses to follow suit. They enable meetings between scientists from different therapy areas and disciplines, which has proved to increase the number of experiments and hence opportunities for scientific breakthroughs of benefit for patients. Our activity-based labs help us to be more environmentally sustainable by reducing the need of space and increase the use of laboratory equipment. This makes it possible for us to invest in more advanced equipment.\nWatch the video to follow one of our scientists, Anita, as she spends a day in the lab. You can also take a virtual tour of some of our labs here.\nUnique culture of collaboration and open innovation\nOur site is an incredibly vibrant and diverse place, with about 3,000 employees and a high proportion of international talent. More than a third of our employees are born in another country. A wide range of different professional groups work here: chemists, doctors, economists, lawyers, communicators, project managers, laboratory assistants, IT specialists and many others. Inclusion and diversity are embedded into everything we do, driving creativity and people empowered to innovate for patients by challenging conventional thinking.\nNew collaboration models to create the future of healthcare\nTomorrow’s healthcare with a focus on prediction, prevention and personalisation requires a new level of interdisciplinary and cross-sectoral collaboration. In Gothenburg we partner with industry, academia, and the public sector across the globe. We are the initiators behind several innovation hubs as well as a life science cluster to develop health solutions that include medicines, but also go beyond them. Read more about some of our initiatives below. Interested in partnering with us? Visit our partnering page!\nGoCo Health Innovation City\nGoCo is a growing life science district encompassing our Gothenburg site and adjacent buildings and land. It was initiated late 2017 when we signed a ground-breaking land deal with the real estate companies Vectura and Next Step. The common aim was to develop the land surrounding our Gothenburg site into a new district for innovative actors within health and life science. The first new tenant, the Japanese biotechnology company Fujirebio, moved in 2020, and the district now contains a large array of health and life science actors.\nBioVentureHub\nOur BioVentureHub is a non-profit, innovation hub. It provides an inside track to our scientific expertise and facilities for innovative small and medium-sized enterprises and academic organisations. The BioVentureHub actors focus on New Modalities, Drug Delivery Technologies, Data & AI, and Digital Healthcare Solutions.\nBioVentureHub increases the speed of growth for its companies by enabling and nurturing a unique, knowledge based, “dare to share” culture. Thereby creating and capturing proven value for the companies, AstraZeneca, and the life science sector regionally, nationally, and globally, to ultimately benefit patients.\nOligoNova\nOligoNova is a national platform for research and development of therapeutic oligonucleotides. It was initiated by us and the University of Gothenburg in 2020 and gathers national experts within the area of therapeutic oligonucleotides representing academia, regions, institutes, industry, and small and medium enterprises. A central part is the OligoNova Hub, which is part of the SciLifeLab Drug Discovery and Development platform. The OligoNova Hub sits in our BioVentureHub and delivers resources and support to progress academic projects towards preclinical proof-of-concept.\nPhoto: Johan Wingborg, Gothenburg University\n100%\n1,4 billion SEK\n99%\nCommitted to young people\nWe work actively to spark young people's interest in science and technology in Sweden. We also work with Swedish non-profit organisations to improve young people’s mental and physical health.\nUniverseum\nWe have been a main sponsor of Scandinavia’s largest science centre for over ten years. During this time, we have had several joint projects, for instance Älska Kemi and Medicinjakten.\nThe International Science Festival\nWe collaborate with 'Vetenskapsfestivalen', one of Europe's leading popular science events for school children.\nMentorship and volunteering\nAll our employees are given eight hours each year to spend on volunteer work in the community. Together with Mentor Sweden, some of us act as mentors to students. Others engage in projects that directly or indirectly contribute to the wellbeing and health of young people through an extensive collaboration with the organisation Volontärbyrån.\nVeeva ID: Z4-69801\nDate of preparation: October 2024"
    },
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "http://www.astrazeneca.com/our-company/our-locations/gaithersburg.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Cookies\nWe use cookies to provide website functionality, to analyze site usage, the content you visit and how you use it, to enable social media features and assist in our marketing efforts, including showing you personalized content. Only Necessary Cookies will be stored by default, and by clicking “Accept All”, you agree to the storage of all cookies on your device. You may personalize your preferences, obtain more information, and withdraw or change your consent at any time by clicking on “Set Preferences” or by visiting our Cookie Notice link available on the site. For more information about the use of cookies please see the cookie notice web page."
    },
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "http://www.astrazeneca.com/media-centre.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Latest press releases\n-\nBaxdrostat demonstrated a statistically significant and highly clinically meaningful placebo-adjusted reduction of 14.0 mmHg in 24-hour ambulatory systolic blood pressure in patients with resistant hypertension in the Bax24 Phase III trial\n-\n9M and Q3 2025 results\n-\nGefurulimab demonstrates statistically significant and clinically meaningful improvement in Myasthenia Gravis Activities of Daily Living (MG-ADL) at week 26 with clinically meaningful improvement seen as early as week one in adults with gMG in PREVAIL Phase III trial\n-\nAlexion data presented at 2025 AANEM Annual Meeting and MGFA Scientific Session underscores pioneering C5 inhibition leadership in gMG\n-\nKoselugo approved in the EU for plexiform neurofibromas in adults with neurofibromatosis type 1\nMedical Releases\nThese press releases are specifically for health specialist/medical media and are not for consumer press."
    },
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "http://www.astrazeneca.com/media-centre/press-releases.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Latest\nResults\nLatest\n-\nBaxdrostat demonstrated a statistically significant and highly clinically meaningful placebo-adjusted reduction of 14.0 mmHg in 24-hour ambulatory systolic blood pressure in patients with resistant hypertension in the Bax24 Phase III trial\n-\n9M and Q3 2025 results\n-\nGefurulimab demonstrates statistically significant and clinically meaningful improvement in Myasthenia Gravis Activities of Daily Living (MG-ADL) at week 26 with clinically meaningful improvement seen as early as week one in adults with gMG in PREVAIL Phase III trial\n-\nAlexion data presented at 2025 AANEM Annual Meeting and MGFA Scientific Session underscores pioneering C5 inhibition leadership in gMG\n-\nKoselugo approved in the EU for plexiform neurofibromas in adults with neurofibromatosis type 1\n-\nTezspire approved in the EU for chronic rhinosinusitis with nasal polyps\n-\nDatroway demonstrated an unprecedented median overall survival improvement of five months vs. chemotherapy as 1st-line treatment for patients with metastatic triple-negative breast cancer for whom immunotherapy was not an option in TROPION-Breast02\n-\nEnhertu reduced the risk of disease recurrence or death by 53% vs. T-DM1 in patients with high-risk HER2-positive early breast cancer following neoadjuvant therapy in DESTINY-Breast05 Phase III trial\n-\nEnhertu followed by THP before surgery resulted in a pathologic complete response in 67% of patients with high-risk HER2-positive early-stage breast cancer in DESTINY-Breast11 Phase III trial\n-\nTezspire approved in the US for chronic rhinosinusitis with nasal polyps\nCan't find what you are looking for? Our Press Release archive contains all of our press releases dated before 2023 so you should be able to find just what you are looking for."
    },
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "http://www.astrazeneca.com/media-centre/articles.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Latest\nResults\nLatest\n-\nHidden in Plain Sight: The True Burden of Obesity & Diabetes\n-\nTransforming amyloidosis care by addressing barriers to earlier diagnosis\n-\nEmpowering inclusive, lifelong learning and development at AstraZeneca\n-\nUnveiling the Unseen: Uterine Cancer Demands Our Attention\n-\nThe UN at 80: Every Human Deserves a Longer, Healthier Future\n-\nTransforming breast cancer care for underserved patient populations"
    },
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "http://www.astrazeneca.com/media-centre/image-and-broadcast-library.html",
        "Content_Type": "Website Content",
        "Raw_Text": "All\nDownload\nCutting-edge science at AstraZeneca China: investment in local high-tech facilities\nCutting-edge science at AstraZeneca China: investment in local high-tech facilities\nDownload\nCutting-edge science at AstraZeneca China: investment in local high-tech facilities\nCutting-edge science at AstraZeneca China: investment in local high-tech facilities\nDownload\nCutting-edge science at AstraZeneca China: investment in local high-tech facilities\nCutting-edge science at AstraZeneca China: investment in local high-tech facilities"
    },
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "http://www.astrazeneca.com/media-centre/archive.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Here you can find the archive of all Press Releases prior to 2023\nFilter by date:\nShowing 1239 press releases before 2023\n-\nAstraZeneca showcases strength of haematology portfolio and pipeline across multiple hard-to-treat conditions at ASH 2022\n-\nAstraZeneca announces sale of its West Chester, Ohio (US) manufacturing site\n-\nAstraZeneca to acquire Neogene Therapeutics, accelerating ambition in Oncology cell therapy\n-\nAstraZeneca aims to redefine breast cancer care with new data across the treatment spectrum at SABCS 2022\n-\nAstraZeneca ranked in top three in the Access to Medicine Index\n-\nEnhertu recommended for approval in the EU by CHMP for patients with previously treated HER2-positive advanced gastric cancer\n-\nImfinzi plus chemotherapy recommended for approval in the EU by CHMP as first immunotherapy regimen for advanced biliary tract cancer\n-\nLynparza in combination with abiraterone recommended for approval in the EU by CHMP as 1st-line treatment for patients with metastatic castration-resistant prostate cancer\n-\nAstraZeneca expands global footprint in rare disease with availability of first Alexion rare disease therapy for patients in China\n-\nImfinzi and Imjudo with chemotherapy approved in the US for patients with metastatic non-small cell lung cancer\nAll of our latest press releases and articles are available to explore"
    },
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "http://www.astrazeneca.com/media-centre/contacts.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Media contacts\nGlobal Media Relations\nKim Blomley\nHead of Global Media Relations\nChristian Petrovic\nSenior Director, Global Media Relations\n(Corporate and Sustainability)\nAngela Fiorin\nSenior Director, Global Media Relations\nTara Parsell\nDirector, Global Media Relations\n(Oncology)\nGenevieve Tuck\nDirector, Global Media Relations\n(Oncology)\nFlavia Garcia\nDirector, Global Media Relations\n(Early Science)\nMichaela Menard\nDirector, Global Media Relations\n(Rare Disease)\nUS\nEurope & Canada\nFreja Annamatz\nDirector, Media Relations, Sweden\n+46 722 084 748"
    },
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "http://www.astrazeneca.com/media-centre/astrazeneca-investor-day-media-hub.html",
        "Content_Type": "Website Content",
        "Raw_Text": "The strong underlying momentum across our business through the first nine months of the year sets us up well to sustain growth through 2026 and has us on track to deliver our 2030 ambition.\nPascal Soriot, Executive Director and Chief Executive Officer, AstraZeneca"
    },
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "http://www.astrazeneca.com/sustainability/climate-change/product-sustainability.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Product sustainability\nOur approach to product sustainability\nWe are minimising the environmental footprint of our medicines to contribute to more sustainable healthcare delivery, while ensuring the highest standards of medical efficacy and safety.\nWe are focused on delivering innovation right across the product life cycle – from the research and development of a medicine, through to its manufacturing, supply and delivery to patients. Reducing our use of energy, water and materials is key, as is minimising our waste and adopting more circular business practices.\nOur key targets\n90% of total syntheses\n95% of paper-based\nWe know that the greenhouse gas (GHG) emissions from our product value chains contribute to our Scope 3 emissions. That's why we’re embedding sustainable decision-making, informed by data and science, across the product life cycle to reduce our environmental impact.\nWe want to ensure the environmental safety of our products and lead our industry in the management of Pharmaceuticals in the Environment (PIE), promoting responsible product stewardship.\nWe follow a life cycle approach for product sustainability\nSafety, health and environmental aspects are considered throughout our medicines development including through:\n- Environmental sustainability assessments of active pharmaceutical ingredient (API) manufacturing, formulation, packaging and devices.\n- Implementing our Life Cycle Assessment (LCA) programme, aligned with ISO 14040 and 14044 standards, allows us to understand the environmental impacts of medicines that account for 90% of our total sales revenue.\n- Establishing an internal Product Sustainability Index (PSI) to understand the environmental impacts of our launched products and inform sustainability improvement plans.\n- Applying green chemistry and engineering principles to our medicines development, as well as connecting our scientists to best practices.\n- Investing in new science and disruptive technologies that reduce environmental impact by enabling the development of shorter chemical sequences to create APIs and improve processes for new modality medicines.\n- Redesigning our packaging by adopting more circular approaches.\n- Setting resource efficiency targets for development projects. We use Process Mass Intensity (PMI), a measure developed by the pharmaceutical sector, to assess the sustainability of manufacturing processes.\n- Playing an active role in our sector, including through our engagement in the American Chemical Society Green Chemistry Institute Pharmaceutical Roundtable.\nProduct sustainability in action\nReducing Scope 3 GHG emissions from product use: Studies show that chronic respiratory diseases such as asthma and chronic pulmonary obstructive disease (COPD) difficult to treat, poorly controlled and associated with a greater carbon footprint of care.1\nAs part of our efforts to provide patients with access to treatment with a lower carbon footprint, we are progressing the transition of our respiratory pressurised metered-dose inhalers (pMDI) to a next generation propellant (NGP). pMDIs deliver essential, life-saving medicines for millions of people living with respiratory diseases worldwide.2 The new propellant HFO-1234ze(E) has a near zero Global Warming Potential (GWP) – 99.9% lower than propellants currently used in respiratory medicines. In May 2025, in a world-first, we received approval for one of our inhaled respiratory medicines using the next-generation propellant in the UK. We have submitted regulatory filings in the EU and China as well and aim to transition our wider pMDI portfolio to the near-zero Global Warming Potential propellant by 2030 as part of our Ambition Zero Carbon strategy.\nProduct Sustainability Index (PSI): We are focused on reducing our resource consumption and minimising waste production. By end of 2024, 71% of our launched products based on sales revenue had been assessed against the PSI to measure their environmental performance and inform improvement plans. The PSI programme is also being piloted on development projects, with an initial focus on carbon.\nCollaborating on a life cycle assessment standard for medicines\nWe are collaborating with peers through the Sustainable Markets Initiative Health Systems Task Force, the Pharmaceutical Environment Group (PEG) and NHS England to support the development of a sector-wide LCA standard for medicines.\nOur aim is to ensure a unified approach to measuring and reporting on the environmental impact of medicines and healthcare products. We are working with the British Standards Institution (BSI) to reach consensus among key stakeholders including healthcare systems, health providers, professionals, representative bodies, academics and patients. With support from experts including Quantis, the delivery of this LCA standard will support the assessment of and reduction in the environmental impact of medicines across the life cycle, as well as enable greater transparency across the sector.\nReferences\n- Bell, J et al. Greenhouse gas emissions associated with COPD care in the UK: Results from SHERLOCK CARBON. European Respiratory Journal 2021 58(suppl 65): PA3551; DOI: https://doi.org/10.1183/13993003.congress-2021.PA3551\n- World Health Organization Model List of Essential Medicines – 23rd List, 2023. In: The selection and use of essential medicines 2023: Executive summary of the report of the 24th WHO Expert Committee on the Selection and Use of Essential Medicines, 24 – 28 April 2023. Geneva: World Health Organization; 2023.[Online] Available at :https://www.who.int/groups/expert-committee-on-selection-and-use-of-essential-medicines/essential-medicines-lists [Accessed April 2025].\nVeeva ID: Z4-74570\nDate of preparation: May 2025"
    },
    {
        "Ticker": "AZN",
        "Company": "AstraZeneca",
        "Source_URL": "https://www.astrazeneca.com/media-centre/articles/sustainable-science-lab-to-patient.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Every day, we push the boundaries of science to deliver life-changing medicines. By embedding sustainability into everything we do – from the lab to the patient – we are committed to playing our part to deliver better healthcare outcomes with a lower environmental footprint, and creating positive societal impact, helping more people live healthier, better lives. This is Sustainable science.\nLearn more about our approach to Sustainable science\nFostering a sustainability mindset\nWhether in research and development, clinical innovation, manufacturing, or the treatment and delivery of healthcare, we encourage our employees and partners to adopt a sustainability mindset that embraces our core values.\nWe are creating a culture where colleagues bring a sustainability-focused mindset to everything they do. This ensures that our actions today not only uphold the highest standards but also pave the way for a sustainable legacy for future generations.\nSustainable science across the pharmaceutical value chain\nAcross our value chain, we are harnessing the power of sustainable science. By reducing our environmental impact, working inclusively, openly and ethically, and applying our science to drive equitable access.\nR&D: We’re focused on turning science into medicine, ensuring great science born in the lab can make a real difference to people’s lives. We’re doing this sustainably through our collaboration with My Green Lab and the “Switch Off Optimisation” programme, reducing the impact of our lab operations by engaging scientists across the organisation from lab-based colleagues in R&D to our operational colleagues across quality control. We’re also building state-of-the-art research and development facilities such as The Discovery Centre (DISC) in a way that is respectful of our planet.\nClinical trials: We’re committed to designing clinical programmes with equity at the forefront – from idea inception to patient care. Our approach includes increasing the diversity of clinical trial participants so trials better reflect the patients who may use our medicines, which ensures we have a robust and reliable body of evidence.\nManufacturing and distribution: Our commitment to sustainable operations recognises the interconnection between business growth, the needs of society and the limitations of our planet. We’re innovating to optimise the efficiency of our manufacturing processes and develop new sources of renewable energy. In line with our science-based decarbonisation strategy, Ambition Zero Carbon, our sites are reducing absolute greenhouse gas emissions to enable us to reduce our Scope 1 and 2 emissions by 98% by 2026. Through our “Positive Sourcing Programme” we promote ethical behaviour among our suppliers and with the introduction of electronic product information (ePI) we can improve access to materials for patients and reduce our environmental footprint.\nPatient care pathways: Everyone should have access to sustainable healthcare, no matter who they are or where they live. This is critical across the patient care pathway – from prevention, early detection and diagnosis to the effective treatment of disease. We’re working to improve equitable access and reduce the environmental footprint of care, for example by using the latest digital technologies for early screening as well as collaborating to decarbonise patient care pathways.\nPioneering new approaches to sustainable science through partnership\nWe know that we need to work together to build resilient, equitable and net zero health systems. However innovative our own approach to sustainable science, working collaboratively with others is key to driving impact at pace and at scale.\nThat is why we’re partnering across and beyond the healthcare sector, to accelerate the delivery of net zero, resilient health systems. Key initiatives where we play a leadership role include the Sustainable Markets Initiative (SMI) Health Systems Task Force, championed by our CEO Pascal Soriot and the Partnership for Heath System Sustainability and Resilience.\nBy taking a science-led, collaborative approach to lower the environmental and economic burden of healthcare, we can build more sustainable, resilient health systems – for people, society and the planet."
    }
]