[
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/",
        "Content_Type": "Website Content",
        "Raw_Text": "This website uses cookies to improve the site and your experience. By continuing to browse the site, you are agreeing to accept our use of cookies. If you require further information and/or do not wish to have cookies placed when using the site, you can modify your browser settings appropriately, or you may visit our cookies page.\nWe do not use cookies of this type.\nSome of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness.\nWe collect information about your use of this website through cookies and similar technology. Cookies are small text files that are placed on your computer or other web-accessing device by this website that allow us to recognize you and maintain your preferences when you return to our website. Cookie technology collects “clickstream” data, which does not include direct personal identifiers, but which reflects your activities on the website and helps us to customize our website experience and anticipate what may be of interest to our users, by monitoring traffic in popular areas and modifying the services and information to meet customer demand.\nWe use the following types of cookies:\nWe use cookies on this website to:\nWe do not allow other websites or third parties to use our cookies for their own purposes on your computer when you visit our website.\nOccasionally, we may use Internet tags (also known as web beacons, action tags, single-pixel GIFs, clear GIFs, invisible GIFs and 1-by-1 GIFs) on this website. We may deploy these tags and cookies through a web analytical service partner, which may locate and store the respective information, including your IP address, in a foreign country that may protect the protection of personal data differently than the country where such information is collected. These tags are placed on different pages of this website and we use this technology to measure the registered user’s responses to our websites, including how many times a page is opened and which information is consulted, as well as to measure the use of this page.\nThis website uses Google Analytics, a web analytics service provided by Google, Inc. (\"Google\"). Google Analytics uses cookies. The information generated by the cookie about your use of this website is generally transferred to a Google server in the United States and stored there. Because we have activated “internet protocol anonymization” on this website, Google shortens your IP address at a point within the European Economic Area before transfer to the United States. This means that the full IP address will be transferred to Google in the United States only in exceptional circumstances for shortening there.\nGoogle will use the received information to evaluate your use of this website for Biogen, to compile reports on website activity, and to provide other services related to website usage and internet usage. The IP address provided by your browser as part of Google Analytics will not be merged with any other Google data.\nMost web browsers allow control of cookies through the browser settings. You can set your browser to notify you when you receive a cookie, which will enable you to decide if you want to accept it or not. However, if you do not accept a particular cookie, certain elements of the website may not function correctly or completely.\nYou can prevent Google from collecting and processing your data (including your IP address) related to your use of this website, by downloading and installing the browser plug-in available at the following link: http://tools.google.com/dlpage/gaoptout?hl=en.\nIf you do not allow any cookies from our website, some functionalities and content may be affected and may not work properly.\nTo find out more about cookies, including how to see what cookies have been set and how to the delete them, visit www.allaboutcookies.org.\nWe may update the Cookies Policy for our website. We therefore recommend that you re-read this policy every time you access our website so that you are adequately informed about how and why we use cookies.\nThese are the specific cookies we use on this website, with information on how they function:\nNichole’s Story\nCareers\nWe came to Biogen to solve the unsolvable. We stay to create new possibilities and grow together. We work fearlessly and go beyond because we care deeply about making a difference and changing lives. If you are inspired by helping others, driven to discover transformative medicines, and want a career that can make a difference, we want to hear from you!"
    },
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/stories/alzheimers-disease-living-with-barry-story.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Barry: I used to do a lot of freehand drawing. That is one thing that I'm sad to say I've lost. My name is Barry, and I was diagnosed with Alzheimer's about five years ago.\nThe one thing that I found the most difficult through this whole process is being younger, so to speak. I was 61 or 62 when I was diagnosed. I'm now 66, but I had planned on working this whole time. I truly enjoyed what I did: interior design, kitchen design, custom cabinetry design, and it was something that I was doing and was successful at. And it was a sense of pride. It was a sense of income.\nA lot of people, my friends in their sixties and seventies, still working, being productive. That's sort of been taken away from me.\nI was already panicking that time was ticking. You know, before I lost awareness of me, my life, and then my husband, knowing that it's going to be harder for him. At one point I was like, you should go your way, I'll go my way. I don't want to, you know, you didn't ask for, you didn’t sign up for this.\nRandy: I was ignorant to the disease, so I really didn't know how to react other than the fact that I knew that it was something that would eventually take his life. And quite honestly, put us in a situation for many years to come that just really didn't fit into our plan. We were at that sweet spot where we're looking forward to living on the Cape and doing what we wanted and spending time together. It just felt like everything crashed. So, there was terror. There was sadness. There also was a time that we kind of started to pull our bootstraps up and say, we've got a plan for the future.\nBarry: I started to get things in place. We actually visited a couple of assisted living homes.\nIf I could make some decisions prior to, then that's off the table. I may not know exactly what's happening, but I'll know — I know now from peace of mind that those are things that I've sort of pre-selected, those I took control of with the will and how, you know, my husband is going to continue on after me.\nRandy: You know, it goes back to the for better or worse. He is my soul mate, and the plan is to be together for a long, long time."
    },
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/stories/alzheimers-disease-things-to-know.html",
        "Content_Type": "Website Content",
        "Raw_Text": "The burden of Alzheimer’s disease is immense, ultimately robbing many patients of their memories, cognitive function, and independence. The prognosis is fatal, and although much progress has been made in recent years, the need for additional treatment remains. Despite the fact that there have been many recent scientific breakthroughs, the field as a whole is known for its challenges. Why is Alzheimer’s research so complex and how do we ultimately tackle this debilitating disease?\n1. Many unknowns remain about the intricate changes within the brain\nThe human brain is “the most complex thing that has yet to be discovered in our universe,” with billions of cells and trillions of connections between those cells.1 Although Alzheimer’s disease is usually diagnosed in people 65 years of age and older, changes to the brain can start occurring years or even decades before symptoms appear.2 Advancements in sophisticated brain imaging techniques that monitor emerging pathologies have transformed our understanding of the natural history of Alzheimer’s and provided the means to identify patients and assess the effectiveness of potential therapies.\nThese pathologies include the abnormal accumulation of two proteins – amyloid beta protein, which clumps together to form “plaques,” and tau, which amasses inside neurons to produce “tangles.” Amyloid beta is a fragment of the larger amyloid precursor protein and is produced throughout the body, while tau is essentially brain specific and is involved in maintaining the structure of neurons.3\nAmyloid plaques form throughout the cerebral cortex, whereas tau tangles develop in a specific pattern, first affecting brain areas responsible for learning and memory. Research has shown that the presence and amount of tau tangles match well to the severity and types of symptoms that a person with Alzheimer’s disease experiences. These proteins can disrupt communication between brain cells, which can lead to the loss of brain function, neurodegeneration, and clinical decline — all traditional hallmarks of Alzheimer’s disease.4\nA growing body of research indicates that amyloid and tau work together to drive healthy neurons into a diseased state.3 “Think of amyloid-beta as the match that starts the forest fire and tau as the timber that fuels the fire,” explains Dominic Walsh, vice president and head of neurodegeneration research unit at Biogen, who has spent decades in Alzheimer’s research: “While plaques are detectable prior to symptoms, the appearance of tangles is more closely linked to symptom onset.”\nResearch over the past several years has greatly increased understanding of both amyloid beta and tau and the interplay between the proteins, although there remain many unknowns about the intricate changes that happen within the brain over time.\n2. Defeating Alzheimer’s disease warrants multiple scientific approaches\nGiven the complexity of the brain and disease pathology, along with the tremendous unmet need, researchers across the field are studying a broad range of potential ways to battle the disease. In fact, researchers at Biogen − a pioneer in Alzheimer’s disease − are studying a number of different approaches, or modalities, in hopes of finding treatment breakthroughs.\n“The best chance we have at defeating this disease is through a multifaceted scientific approach that involves multiple modalities and targets, to explore what will make a clinically significant impact for patients,” said Walsh.\nDifferent modalities include:\n- Antibodies that mimic our natural immune responses in the body and aim to either prevent amyloid beta plaques from forming or work to remove plaques that have formed.5\n- Antisense oligonucleotides (ASOs) that are comprised of the same types of building blocks that make up DNA and RNA, the protein-making machinery in the cell, and can modify, reduce, or restore important proteins such as tau.6\n- Small molecules which are low molecular weight compounds that are orally administered and can regulate how cells process certain proteins.7\nThe study of these modalities and other treatments, coupled with increased understanding of the disease itself, can help advance the field with the hope of breakthroughs to transform the trajectory of Alzheimer’s disease.\n3. Potentially game-changing research is underway\nIn a field historically filled with setbacks, a new era of Alzheimer’s disease research is underway.\nResearchers are not only investigating a range of modalities for potential treatments but are also looking at how to make treatments more convenient for patients, such as with less frequent, at-home administration. Studies are also looking at early intervention, which may offer the optimal window for therapeutic success to potentially stop or delay the onset of Alzheimer’s symptoms.8 In addition, as tools such as blood-based diagnostics become available, the hope is that in the future, patients who are confirmed to have Alzheimer’s disease pathology may be able to begin treatment earlier in the disease progression.\n“We believe that developments in diagnostics, as well as multiple approaches, used either together or in sequence, will be the future of Alzheimer’s treatment,” said Walsh. “The good news is that the course of Alzheimer’s research is more positive than it has ever been. Our goal is that the collective scientific efforts can create a brighter future for patients and families affected by this destructive and burdensome disease,” noted Walsh.\nTo learn more about Alzheimer’s disease research, visit our website.\n- National Library of Medicine, National Center for Biological Information. Discovering the Brain. https://www.ncbi.nlm.nih.gov/books/NBK234155. Accessed June 2023.\n- National Institute on Aging. Symptoms and Signs of Alzheimer’s Disease. Available at https://www.nia.nih.gov/health/what-are-signs-alzheimers-disease [nia.nih.gov]. Accessed June 2023.\n- Bloom GS. Amyloid-β and tau: the trigger and bullet in Alzheimer disease pathogenesis. JAMA Neurol. 2014 Apr;71(4):505-8. doi: 10.1001/jamaneurol.2013.5847. PMID: 24493463.\n- DeTure, M.A., Dickson, D.W. The neuropathological diagnosis of Alzheimer’s disease. Mol Neurodegeneration14, 32 (2019). https://doi.org/10.1186/s13024-019-0333-5\n- Mayo Clinic. Alzheimer’s treatments: What’s on the horizon? https://www.mayoclinic.org/diseases-conditions/alzheimers-disease/in-depth/alzheimers-treatments/art-20047780. Accessed June 2023.\n- Grabowska-Pyrzewicz, W et al. Antisense oligonucleotides for Alzheimer’s disease therapy: from the mRNA to miRNA paradigm. eBioMedicine. Sep 25;48(17):9840-9858. 1016/j.ebiom.2021.103691.\n- Ngo HX, Garneau-Tsodikova S. What are the drugs of the future? Medchemcomm. 2018 Apr 23;9(5):757-758. doi: 10.1039/c8md90019a. PMID: 30108965; PMCID: PMC6072476.\n- Crous-Bou, M., Minguillón, C., Gramunt, N. et al. Alzheimer’s disease prevention: From risk factors to early intervention. Alz Res Therapy9, 71 (2017). https://doi.org/10.1186/s13195-017-0297-z."
    },
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/company.html",
        "Content_Type": "Website Content",
        "Raw_Text": "About\nCookies and Other Technology Policy\nWe collect information about your use of this website through cookies and similar technology. Cookies are small text files that are placed on your computer or other web-accessing device by this website that allow us to recognize you and maintain your preferences when you return to our website. Cookie technology collects “clickstream” data, which does not include direct personal identifiers, but which reflects your activities on the website and helps us to customize our website experience and anticipate what may be of interest to our users, by monitoring traffic in popular areas and modifying the services and information to meet customer demand.\nWe use the following types of cookies:\n- First-party cookies – cookies set by the website displayed in the browser window – identified by the domain name in the address bar of the browser window.\n- Session cookies – cookies that expire at the end of a browser session, starting with the time when a user opens the browser window, and finishing when the user exits the browser.\n- Persistent cookies – cookies that ‘persist’ (are stored) in the device after the end of a browser session and therefore can allow the preferences or actions of the user to be remembered when they return to the website.\nWe use cookies on this website to:\n- direct users to the relevant sections on the website;\n- make sure the website has a consistent look across different browsers and devices;\n- enable complex areas of the website to function; and\n- track aggregated statistics about visits to the website to help us improve website performance.\nWe do not allow other websites or third parties to use our cookies for their own purposes on your computer when you visit our website.\nInternet tags\nOccasionally, we may use Internet tags (also known as web beacons, action tags, single-pixel GIFs, clear GIFs, invisible GIFs and 1-by-1 GIFs) on this website. We may deploy these tags and cookies through a web analytical service partner, which may locate and store the respective information, including your IP address, in a foreign country that may protect the protection of personal data differently than the country where such information is collected. These tags are placed on different pages of this website and we use this technology to measure the registered user’s responses to our websites, including how many times a page is opened and which information is consulted, as well as to measure the use of this page.\nGoogle Analytics\nThis website uses Google Analytics, a web analytics service provided by Google, Inc. (\"Google\"). Google Analytics uses cookies. The information generated by the cookie about your use of this website is generally transferred to a Google server in the United States and stored there. Because we have activated “internet protocol anonymization” on this website, Google shortens your IP address at a point within the European Economic Area before transfer to the United States. This means that the full IP address will be transferred to Google in the United States only in exceptional circumstances for shortening there.\nGoogle will use the received information to evaluate your use of this website for Biogen, to compile reports on website activity, and to provide other services related to website usage and internet usage. The IP address provided by your browser as part of Google Analytics will not be merged with any other Google data.\nHow can I control the cookies that you use on this website?\nMost web browsers allow control of cookies through the browser settings. You can set your browser to notify you when you receive a cookie, which will enable you to decide if you want to accept it or not. However, if you do not accept a particular cookie, certain elements of the website may not function correctly or completely.\nYou can prevent Google from collecting and processing your data (including your IP address) related to your use of this website, by downloading and installing the browser plug-in available at the following link: http://tools.google.com/dlpage/gaoptout?hl=en.\nIf you do not allow any cookies from our website, some functionalities and content may be affected and may not work properly.\nTo find out more about cookies, including how to see what cookies have been set and how to the delete them, visit www.allaboutcookies.org.\nChanges to the Cookies Policy\nWe may update the Cookies Policy for our website. We therefore recommend that you re-read this policy every time you access our website so that you are adequately informed about how and why we use cookies.\nThese are the specific cookies we use on this website, with information on how they function:"
    },
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/company/mission-culture.html",
        "Content_Type": "Website Content",
        "Raw_Text": "About\nCookies and Other Technology Policy\nWe collect information about your use of this website through cookies and similar technology. Cookies are small text files that are placed on your computer or other web-accessing device by this website that allow us to recognize you and maintain your preferences when you return to our website. Cookie technology collects “clickstream” data, which does not include direct personal identifiers, but which reflects your activities on the website and helps us to customize our website experience and anticipate what may be of interest to our users, by monitoring traffic in popular areas and modifying the services and information to meet customer demand.\nWe use the following types of cookies:\n- First-party cookies – cookies set by the website displayed in the browser window – identified by the domain name in the address bar of the browser window.\n- Session cookies – cookies that expire at the end of a browser session, starting with the time when a user opens the browser window, and finishing when the user exits the browser.\n- Persistent cookies – cookies that ‘persist’ (are stored) in the device after the end of a browser session and therefore can allow the preferences or actions of the user to be remembered when they return to the website.\nWe use cookies on this website to:\n- direct users to the relevant sections on the website;\n- make sure the website has a consistent look across different browsers and devices;\n- enable complex areas of the website to function; and\n- track aggregated statistics about visits to the website to help us improve website performance.\nWe do not allow other websites or third parties to use our cookies for their own purposes on your computer when you visit our website.\nInternet tags\nOccasionally, we may use Internet tags (also known as web beacons, action tags, single-pixel GIFs, clear GIFs, invisible GIFs and 1-by-1 GIFs) on this website. We may deploy these tags and cookies through a web analytical service partner, which may locate and store the respective information, including your IP address, in a foreign country that may protect the protection of personal data differently than the country where such information is collected. These tags are placed on different pages of this website and we use this technology to measure the registered user’s responses to our websites, including how many times a page is opened and which information is consulted, as well as to measure the use of this page.\nGoogle Analytics\nThis website uses Google Analytics, a web analytics service provided by Google, Inc. (\"Google\"). Google Analytics uses cookies. The information generated by the cookie about your use of this website is generally transferred to a Google server in the United States and stored there. Because we have activated “internet protocol anonymization” on this website, Google shortens your IP address at a point within the European Economic Area before transfer to the United States. This means that the full IP address will be transferred to Google in the United States only in exceptional circumstances for shortening there.\nGoogle will use the received information to evaluate your use of this website for Biogen, to compile reports on website activity, and to provide other services related to website usage and internet usage. The IP address provided by your browser as part of Google Analytics will not be merged with any other Google data.\nHow can I control the cookies that you use on this website?\nMost web browsers allow control of cookies through the browser settings. You can set your browser to notify you when you receive a cookie, which will enable you to decide if you want to accept it or not. However, if you do not accept a particular cookie, certain elements of the website may not function correctly or completely.\nYou can prevent Google from collecting and processing your data (including your IP address) related to your use of this website, by downloading and installing the browser plug-in available at the following link: http://tools.google.com/dlpage/gaoptout?hl=en.\nIf you do not allow any cookies from our website, some functionalities and content may be affected and may not work properly.\nTo find out more about cookies, including how to see what cookies have been set and how to the delete them, visit www.allaboutcookies.org.\nChanges to the Cookies Policy\nWe may update the Cookies Policy for our website. We therefore recommend that you re-read this policy every time you access our website so that you are adequately informed about how and why we use cookies.\nThese are the specific cookies we use on this website, with information on how they function:"
    },
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/company/biogen-us-legacy.html",
        "Content_Type": "Website Content",
        "Raw_Text": "About\nCookies and Other Technology Policy\nWe collect information about your use of this website through cookies and similar technology. Cookies are small text files that are placed on your computer or other web-accessing device by this website that allow us to recognize you and maintain your preferences when you return to our website. Cookie technology collects “clickstream” data, which does not include direct personal identifiers, but which reflects your activities on the website and helps us to customize our website experience and anticipate what may be of interest to our users, by monitoring traffic in popular areas and modifying the services and information to meet customer demand.\nWe use the following types of cookies:\n- First-party cookies – cookies set by the website displayed in the browser window – identified by the domain name in the address bar of the browser window.\n- Session cookies – cookies that expire at the end of a browser session, starting with the time when a user opens the browser window, and finishing when the user exits the browser.\n- Persistent cookies – cookies that ‘persist’ (are stored) in the device after the end of a browser session and therefore can allow the preferences or actions of the user to be remembered when they return to the website.\nWe use cookies on this website to:\n- direct users to the relevant sections on the website;\n- make sure the website has a consistent look across different browsers and devices;\n- enable complex areas of the website to function; and\n- track aggregated statistics about visits to the website to help us improve website performance.\nWe do not allow other websites or third parties to use our cookies for their own purposes on your computer when you visit our website.\nInternet tags\nOccasionally, we may use Internet tags (also known as web beacons, action tags, single-pixel GIFs, clear GIFs, invisible GIFs and 1-by-1 GIFs) on this website. We may deploy these tags and cookies through a web analytical service partner, which may locate and store the respective information, including your IP address, in a foreign country that may protect the protection of personal data differently than the country where such information is collected. These tags are placed on different pages of this website and we use this technology to measure the registered user’s responses to our websites, including how many times a page is opened and which information is consulted, as well as to measure the use of this page.\nGoogle Analytics\nThis website uses Google Analytics, a web analytics service provided by Google, Inc. (\"Google\"). Google Analytics uses cookies. The information generated by the cookie about your use of this website is generally transferred to a Google server in the United States and stored there. Because we have activated “internet protocol anonymization” on this website, Google shortens your IP address at a point within the European Economic Area before transfer to the United States. This means that the full IP address will be transferred to Google in the United States only in exceptional circumstances for shortening there.\nGoogle will use the received information to evaluate your use of this website for Biogen, to compile reports on website activity, and to provide other services related to website usage and internet usage. The IP address provided by your browser as part of Google Analytics will not be merged with any other Google data.\nHow can I control the cookies that you use on this website?\nMost web browsers allow control of cookies through the browser settings. You can set your browser to notify you when you receive a cookie, which will enable you to decide if you want to accept it or not. However, if you do not accept a particular cookie, certain elements of the website may not function correctly or completely.\nYou can prevent Google from collecting and processing your data (including your IP address) related to your use of this website, by downloading and installing the browser plug-in available at the following link: http://tools.google.com/dlpage/gaoptout?hl=en.\nIf you do not allow any cookies from our website, some functionalities and content may be affected and may not work properly.\nTo find out more about cookies, including how to see what cookies have been set and how to the delete them, visit www.allaboutcookies.org.\nChanges to the Cookies Policy\nWe may update the Cookies Policy for our website. We therefore recommend that you re-read this policy every time you access our website so that you are adequately informed about how and why we use cookies.\nThese are the specific cookies we use on this website, with information on how they function:"
    },
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/company/leadership.html",
        "Content_Type": "Website Content",
        "Raw_Text": "This website uses cookies to improve the site and your experience. By continuing to browse the site, you are agreeing to accept our use of cookies. If you require further information and/or do not wish to have cookies placed when using the site, you can modify your browser settings appropriately, or you may visit our cookies page.\nWe do not use cookies of this type.\nSome of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness.\nWe collect information about your use of this website through cookies and similar technology. Cookies are small text files that are placed on your computer or other web-accessing device by this website that allow us to recognize you and maintain your preferences when you return to our website. Cookie technology collects “clickstream” data, which does not include direct personal identifiers, but which reflects your activities on the website and helps us to customize our website experience and anticipate what may be of interest to our users, by monitoring traffic in popular areas and modifying the services and information to meet customer demand.\nWe use the following types of cookies:\nWe use cookies on this website to:\nWe do not allow other websites or third parties to use our cookies for their own purposes on your computer when you visit our website.\nOccasionally, we may use Internet tags (also known as web beacons, action tags, single-pixel GIFs, clear GIFs, invisible GIFs and 1-by-1 GIFs) on this website. We may deploy these tags and cookies through a web analytical service partner, which may locate and store the respective information, including your IP address, in a foreign country that may protect the protection of personal data differently than the country where such information is collected. These tags are placed on different pages of this website and we use this technology to measure the registered user’s responses to our websites, including how many times a page is opened and which information is consulted, as well as to measure the use of this page.\nThis website uses Google Analytics, a web analytics service provided by Google, Inc. (\"Google\"). Google Analytics uses cookies. The information generated by the cookie about your use of this website is generally transferred to a Google server in the United States and stored there. Because we have activated “internet protocol anonymization” on this website, Google shortens your IP address at a point within the European Economic Area before transfer to the United States. This means that the full IP address will be transferred to Google in the United States only in exceptional circumstances for shortening there.\nGoogle will use the received information to evaluate your use of this website for Biogen, to compile reports on website activity, and to provide other services related to website usage and internet usage. The IP address provided by your browser as part of Google Analytics will not be merged with any other Google data.\nMost web browsers allow control of cookies through the browser settings. You can set your browser to notify you when you receive a cookie, which will enable you to decide if you want to accept it or not. However, if you do not accept a particular cookie, certain elements of the website may not function correctly or completely.\nYou can prevent Google from collecting and processing your data (including your IP address) related to your use of this website, by downloading and installing the browser plug-in available at the following link: http://tools.google.com/dlpage/gaoptout?hl=en.\nIf you do not allow any cookies from our website, some functionalities and content may be affected and may not work properly.\nTo find out more about cookies, including how to see what cookies have been set and how to the delete them, visit www.allaboutcookies.org.\nWe may update the Cookies Policy for our website. We therefore recommend that you re-read this policy every time you access our website so that you are adequately informed about how and why we use cookies.\nThese are the specific cookies we use on this website, with information on how they function:\nCompany"
    },
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/company/biogen-foundation.html",
        "Content_Type": "Website Content",
        "Raw_Text": "About\nCookies and Other Technology Policy\nWe collect information about your use of this website through cookies and similar technology. Cookies are small text files that are placed on your computer or other web-accessing device by this website that allow us to recognize you and maintain your preferences when you return to our website. Cookie technology collects “clickstream” data, which does not include direct personal identifiers, but which reflects your activities on the website and helps us to customize our website experience and anticipate what may be of interest to our users, by monitoring traffic in popular areas and modifying the services and information to meet customer demand.\nWe use the following types of cookies:\n- First-party cookies – cookies set by the website displayed in the browser window – identified by the domain name in the address bar of the browser window.\n- Session cookies – cookies that expire at the end of a browser session, starting with the time when a user opens the browser window, and finishing when the user exits the browser.\n- Persistent cookies – cookies that ‘persist’ (are stored) in the device after the end of a browser session and therefore can allow the preferences or actions of the user to be remembered when they return to the website.\nWe use cookies on this website to:\n- direct users to the relevant sections on the website;\n- make sure the website has a consistent look across different browsers and devices;\n- enable complex areas of the website to function; and\n- track aggregated statistics about visits to the website to help us improve website performance.\nWe do not allow other websites or third parties to use our cookies for their own purposes on your computer when you visit our website.\nInternet tags\nOccasionally, we may use Internet tags (also known as web beacons, action tags, single-pixel GIFs, clear GIFs, invisible GIFs and 1-by-1 GIFs) on this website. We may deploy these tags and cookies through a web analytical service partner, which may locate and store the respective information, including your IP address, in a foreign country that may protect the protection of personal data differently than the country where such information is collected. These tags are placed on different pages of this website and we use this technology to measure the registered user’s responses to our websites, including how many times a page is opened and which information is consulted, as well as to measure the use of this page.\nGoogle Analytics\nThis website uses Google Analytics, a web analytics service provided by Google, Inc. (\"Google\"). Google Analytics uses cookies. The information generated by the cookie about your use of this website is generally transferred to a Google server in the United States and stored there. Because we have activated “internet protocol anonymization” on this website, Google shortens your IP address at a point within the European Economic Area before transfer to the United States. This means that the full IP address will be transferred to Google in the United States only in exceptional circumstances for shortening there.\nGoogle will use the received information to evaluate your use of this website for Biogen, to compile reports on website activity, and to provide other services related to website usage and internet usage. The IP address provided by your browser as part of Google Analytics will not be merged with any other Google data.\nHow can I control the cookies that you use on this website?\nMost web browsers allow control of cookies through the browser settings. You can set your browser to notify you when you receive a cookie, which will enable you to decide if you want to accept it or not. However, if you do not accept a particular cookie, certain elements of the website may not function correctly or completely.\nYou can prevent Google from collecting and processing your data (including your IP address) related to your use of this website, by downloading and installing the browser plug-in available at the following link: http://tools.google.com/dlpage/gaoptout?hl=en.\nIf you do not allow any cookies from our website, some functionalities and content may be affected and may not work properly.\nTo find out more about cookies, including how to see what cookies have been set and how to the delete them, visit www.allaboutcookies.org.\nChanges to the Cookies Policy\nWe may update the Cookies Policy for our website. We therefore recommend that you re-read this policy every time you access our website so that you are adequately informed about how and why we use cookies.\nThese are the specific cookies we use on this website, with information on how they function:"
    },
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/company/contact-us.html",
        "Content_Type": "Website Content",
        "Raw_Text": "This website uses cookies to improve the site and your experience. By continuing to browse the site, you are agreeing to accept our use of cookies. If you require further information and/or do not wish to have cookies placed when using the site, you can modify your browser settings appropriately, or you may visit our cookies page.\nWe do not use cookies of this type.\nSome of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness.\nWe collect information about your use of this website through cookies and similar technology. Cookies are small text files that are placed on your computer or other web-accessing device by this website that allow us to recognize you and maintain your preferences when you return to our website. Cookie technology collects “clickstream” data, which does not include direct personal identifiers, but which reflects your activities on the website and helps us to customize our website experience and anticipate what may be of interest to our users, by monitoring traffic in popular areas and modifying the services and information to meet customer demand.\nWe use the following types of cookies:\nWe use cookies on this website to:\nWe do not allow other websites or third parties to use our cookies for their own purposes on your computer when you visit our website.\nOccasionally, we may use Internet tags (also known as web beacons, action tags, single-pixel GIFs, clear GIFs, invisible GIFs and 1-by-1 GIFs) on this website. We may deploy these tags and cookies through a web analytical service partner, which may locate and store the respective information, including your IP address, in a foreign country that may protect the protection of personal data differently than the country where such information is collected. These tags are placed on different pages of this website and we use this technology to measure the registered user’s responses to our websites, including how many times a page is opened and which information is consulted, as well as to measure the use of this page.\nThis website uses Google Analytics, a web analytics service provided by Google, Inc. (\"Google\"). Google Analytics uses cookies. The information generated by the cookie about your use of this website is generally transferred to a Google server in the United States and stored there. Because we have activated “internet protocol anonymization” on this website, Google shortens your IP address at a point within the European Economic Area before transfer to the United States. This means that the full IP address will be transferred to Google in the United States only in exceptional circumstances for shortening there.\nGoogle will use the received information to evaluate your use of this website for Biogen, to compile reports on website activity, and to provide other services related to website usage and internet usage. The IP address provided by your browser as part of Google Analytics will not be merged with any other Google data.\nMost web browsers allow control of cookies through the browser settings. You can set your browser to notify you when you receive a cookie, which will enable you to decide if you want to accept it or not. However, if you do not accept a particular cookie, certain elements of the website may not function correctly or completely.\nYou can prevent Google from collecting and processing your data (including your IP address) related to your use of this website, by downloading and installing the browser plug-in available at the following link: http://tools.google.com/dlpage/gaoptout?hl=en.\nIf you do not allow any cookies from our website, some functionalities and content may be affected and may not work properly.\nTo find out more about cookies, including how to see what cookies have been set and how to the delete them, visit www.allaboutcookies.org.\nWe may update the Cookies Policy for our website. We therefore recommend that you re-read this policy every time you access our website so that you are adequately informed about how and why we use cookies.\nThese are the specific cookies we use on this website, with information on how they function:\nContact Us\nPostpartum Depression Support\n1-844-987-9882\n(U.S. residents only)\nMultiple Sclerosis Support\nBiogen Support Services\n1-800-456-2255\n(U.S. residents only)\nSMA Support\nSMA360°™\n1-844-477-4672\n(U.S. residents only)\nFriedreich Ataxia Support\n1-844-987-3224\n(U.S. residents only)\nThis product support information is applicable to patients who have been prescribed Biogen therapies in the United States only.\nFor product support in countries outside of the U.S., please contact the Biogen affiliate in your country or email patientcenter@biogen.com if your country is not represented.\nLearn more about our clinical trials\nLearn more about access to investigational therapies or expanded access programs (EAPs)\nSafety Information\nYour doctor should always be the primary resource regarding treatment options.\nCall your doctor for medical advice about side effects. You may report side effects to the FDA at 1-800-FDA-1088.\nMedia Contacts\nU.S. Corporate Affairs or Media Inquiries\n+1 781-464-3260\nPublic.affairs@biogen.com\nEU Corporate Affairs or Media Inquiries\nPublicAffairs.EU@biogen.com\nInvestor Contact\nInvestor Relations\n+1 781-464-2442\nIR@biogen.com\nVisit our Investors page for financial information, reporting and news releases\nSign up for alerts\nPartnerships and collaborations are critical to building our neuroscience innovation ecosystem. We welcome the opportunity to explore working with other innovators.\nIf your company or institution would like to share a potential asset or platform technology for collaboration, please submit your opportunity through our Partnering Portal.\nPlease visit our Careers section to explore current job openings, or stay connected to relevant upcoming job postings by joining our talent community.\nTo obtain employment verification information for a current or former Biogen employee, see verification instructions (U.S. only).\nIf you wish to report any compliance concerns regarding Biogen or any of its employees or contractors, you may do so in writing at the address provided below or confidentially and anonymously, where permitted by local law, by using the Compliance Helpline. Complaints submitted in this manner will be forwarded directly to the Chair of the Audit Committee.\nTo submit a report in the U.S. and Canada through the Compliance Helpline, call us toll-free at 1-866-418-2859 (click here for international Compliance Helpline dial-in numbers). Please note BIOGEN® does not make and is not associated in any way with the product “BIOGEN Keto ACV Gummies” and will not be able to answer questions about this product. BIOGEN® is a registered trademark of Biogen MA Inc.\nClick here to submit a report online or write to us at:\nCorporate Compliance\nBiogen Inc.\n225 Binney Street\nCambridge, MA 02142\nUSA"
    },
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/stories/meet-priya-singhal.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Priya Singhal, M.D., M.P.H., was named Head of Development at Biogen in January 2023, after serving as interim Head of Research and Development. Priya joined Biogen twice, first in 2012 as Vice President Clinical Trials and Benefit-Risk Management and again in 2020 as Senior Vice President of Global Safety & Regulatory Sciences as well as Research & Development for China and Japan. Both times she came for the opportunity to make an impact.\nWhen Priya was first contacted by a recruiter in 2012 for a position at Biogen, she said she was not interested in making a move but agreed to meet with Carmen Bozic, M.D., who, at the time, was Biogen’s Global Head of Safety, and Benefit-Risk Management.\n“Carmen told me that if all of Biogen’s plans moved forward, I would have the opportunity to contribute to five programs for people with diseases of high unmet need.”\nShe recalls leaving that meeting excited by the opportunity but thought to herself, ‘best-case scenario, three of these products will be approved.’ In the end, all five were approved, and Priya has been involved in the approval of three more products since then.\n“Biogen has the legacy of making the impossible possible,” she says, “and it all comes down to the dedication and deep expertise of the people who work here.” In 2020, when she returned to the company, she was excited to work directly with Alfred (Al) Sandrock, M.D., Ph.D. Both Al and Carmen have left Biogen but continue to be mentors to Priya.\nStepping into Al’s shoes as interim Head of R&D and then being named Head of Development by Chris Viehbacher, CEO, within months of his taking the reins at Biogen has been a tremendous honor, she says. “The responsibilities are enormous, but I know that we have strong science and strong teams moving our portfolio forward and focused on tackling some of the biggest medical and scientific challenges that humanity is facing today.”\nPriya grew up in Mumbai, India and trained there in medicine. In 1995, she came to the United States to accompany her husband Aneesh who was pursuing a Neurology residency at Massachusetts General Hospital. She describes her journey to biotechnology and drug development as “completely serendipitous.” After conversations with mentors and people she admired, she decided to “give it a shot.” And she has not looked back since.\nHer career, however, did not follow a linear path. Like many women trying to balance the responsibilities of a career and family, she found herself at a crossroads early in her career. When she came to the United States, her husband was busy doing his residency, so she made the decision to take a break to be home with their 2-year-old son. She spent almost ten years at home raising her son and then later, a daughter. During this time, she completed her U.S. Medical Licensing Exams and received a Master of Public Health in International Health at Harvard’s School of Public Health. On graduation day with her children in tow, she accepted her diploma with one hand while holding her young children with her other hand.\n“I have no regrets about taking the time off. I cherished the moments with my son and daughter, and I was able to witness the milestones that I had missed before.”\nHer advice to anyone facing a fork in the road is to “go where the heart takes you, because usually that's the right way.”\nWhen Priya re-entered the workforce, she initially took a job in data entry and quickly rose through the ranks. She learned early to never say “no” to an opportunity or challenge – which she considers interchangeable. From individual contributor early on in her career, to a leader of a large organization, she believes that caring is non-negotiable: caring for the people she works with but also about the mission of the work. She describes herself as a team player who is data driven, objective and fair. “The business of drug development is a team sport, so having the right people around you really matters. It takes a village,” she says.\nAnd part of that village includes the “amazing mentors” who have guided her at key inflection points in her career. Their advice and encouragement led her to explore different opportunities and do things that she would never have considered on her own. She now pays this forward by speaking to students and team members whenever she can because she knows that sometimes just a 15-minute conversation can make a difference in someone’s career.\nFrom clinician to partner and parent, to biotechnology leader, three words Priya says describe her both personally and professionally are: committed, bold and fun. And as for bucket lists, she doesn’t believe in waiting for the ‘right’ time: \"I’ve had many friends and family members who never had the chance to check things off their bucket lists,” she says. “If you have something you want to do, whether personal or professional, do it now.”"
    },
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/stories/inspired-by-science-mother-daughter-years-at-biogen.html",
        "Content_Type": "Website Content",
        "Raw_Text": "To say Jana Dolnikova and her daughter Jana Dolnikova-Smith are committed to their work at Biogen is an understatement. Combined, their careers total more than 50 years with the company. Dolnikova is a scientist who started at Biogen in 1992, when there were only 200 employees. She currently works on developing platforms for processes and cell line development in Biotherapeutics and Medicinal Sciences.\nHer daughter, Dolnikova-Smith, is currently a Business Operations Lead (chief of staff) to Wolfram Schmidt, President, Europe, Canada & Partner Markets. Prior to this, she worked for 20 years on the commercial side of Biogen’s business bringing drugs to patients.\n“My mom touched everything in the pipeline by working on the science, and I was on the commercial side, supporting patients and bringing treatments to market, which is pretty amazing. We have this Yin and Yang,” Dolnikova-Smith said.\nAll told, they have worked on almost every drug therapy that has come through Biogen's pipeline, impacting millions of people worldwide.\nScience is in her DNA\nDolnikova-Smith was 11 years old when her mom started working at Biogen. “I grew up watching and listening to my mom discuss science with her colleagues and having fun at Biogen family outings,” she said. Both mother and daughter agree that “Biogen was like a second family.”\nDolnikova-Smith’s dad is also a scientist and associate professor of chemistry at Brandeis University, so “science was part of my DNA,” she said. “I always enjoyed it; I loved learning about the brain and the science of the body and having my mom and dad there to talk to me about how to apply it into practice helped.”\nDolnikova-Smith graduated from Brandeis University in 2002 with a B.S. in neuroscience and a B.A. in biology and psychology. Although she knew she would work in the science field, she wasn’t exactly sure how she would use her degrees. “At one point, I thought about being a forensic scientist because I was intrigued by some of the popular crime-scene shows on TV,” she said.\nInstead, for her first job after college, she sorted cells through large coffin-like flow cytometers in a small room in the basement of Beth Israel Medical Center.\n“I did that for 6 months, and then I realized this is not where I want to be. I wanted to be with people… talking to cells was not for me… maybe for my mom, but not me,” she laughed.\nIn 2003, she took a position in Biogen’s Patient Services answering calls from patients, then in 2006 she left her full-time job to finish her MBA but continued to work at Biogen on an interim basis as a training consultant. “While I wasn’t a full-time employee, it was fantastic to stay connected with Biogen and the teams.”\nJana Dolnikova-Smith at her desk in Baar Switzerland.\nWhen she finished her MBA, she returned to Biogen to work in the global commercial function on launches for three drugs, before moving to Europe as the ECP Regional brand lead. “One door closed and another one opened for me,” she said.\n“I always knew I would come back to Biogen. I never wanted to work for a large company. I really liked Biogen’s culture, the science and the people.” – Jana Dolnikova-Smith\nIn her current role, she has a birds-eye view of the organization as a whole and sees how decisions are made in the region. “It’s a very unique experience… I love it, as it gives me a completely new perspective, while working closely with many exceptional leaders.”\nTalking the CHO language\nFor Dolnikova, it is the science, the innovation and her lab that are at the heart of her work. “I love everything about it…I am the one who talks to the cells, and I am extremely happy about it,” she laughed.\nFor more than 30 years, Dolnikova has worked with Chinese hamster ovary (CHO) cells, which are the vehicles, or factories, that make our products. These cells live in a medium (liquid cell environment), and we must ensure an optimal environment for the cells to survive and produce our drugs, she explains.\n“There are so many aspects of this process to get the cells to do what we want them to do… people joke that I talk the CHO language to the cells, like they are my babies.” – Jana Dolnikova\nDolnikova’s love for science began at a young age, after participating in a science competition in her home country of Czechoslovakia (now the Czech Republic). After receiving her degree in chemical engineering, she worked at the Institute of Molecular Genetics, which was part of Czech Academy of Sciences, in Prague. There, she was introduced to what was then a revolutionary process for developing protein-free medium and growing cells and producing monoclonal antibodies, knowledge that would be very important to her career at Biogen. Dolnikova and her family moved to the United States in 1991.\nJana Dolnikova in her lab in Cambridge, Mass.\nHer first job at Biogen was to adapt the medium and screen cell lines to develop the best possible cell line to manufacture one of Biogen’s therapies for the treatment of multiple sclerosis. Over the years, she and her colleagues have made several improvements to the cell line processes, including transitioning to serum-free/protein-free mediums, which reduced cost, removed contaminates from mediums, and ultimately made products safer for patients.\nDolnikova and her team’s extensive work improving cell line development resulted in a patent for Biogen granted in 2015, and these solutions have been implemented in many other company projects.\n“I love innovation. I start something then something else takes over, and I move on to the next challenge,” she says.\nFocused on science and patients\nAfter 30 years, Dolnikova is still amazed by the support, collaboration among colleagues and level of science Biogen offers.\n“I always valued the collaboration at Biogen. Working on teams with really good scientists; it's a pleasure actually, it's so enjoyable.” – Jana Dolnikova\nBoth mother and daughter continue to be inspired by the science and bringing therapies to patients. “We have been innovative across different disease areas, so being part of Biogen’s journey has always been an incredibly fantastic and humbling experience,\" Dolnikova-Smith said."
    },
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/stories/kidney-disease-living-with-transplant.html",
        "Content_Type": "Website Content",
        "Raw_Text": "This website uses cookies to improve the site and your experience. By continuing to browse the site, you are agreeing to accept our use of cookies. If you require further information and/or do not wish to have cookies placed when using the site, you can modify your browser settings appropriately, or you may visit our cookies page.\nWe do not use cookies of this type.\nSome of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness.\nWe collect information about your use of this website through cookies and similar technology. Cookies are small text files that are placed on your computer or other web-accessing device by this website that allow us to recognize you and maintain your preferences when you return to our website. Cookie technology collects “clickstream” data, which does not include direct personal identifiers, but which reflects your activities on the website and helps us to customize our website experience and anticipate what may be of interest to our users, by monitoring traffic in popular areas and modifying the services and information to meet customer demand.\nWe use the following types of cookies:\nWe use cookies on this website to:\nWe do not allow other websites or third parties to use our cookies for their own purposes on your computer when you visit our website.\nOccasionally, we may use Internet tags (also known as web beacons, action tags, single-pixel GIFs, clear GIFs, invisible GIFs and 1-by-1 GIFs) on this website. We may deploy these tags and cookies through a web analytical service partner, which may locate and store the respective information, including your IP address, in a foreign country that may protect the protection of personal data differently than the country where such information is collected. These tags are placed on different pages of this website and we use this technology to measure the registered user’s responses to our websites, including how many times a page is opened and which information is consulted, as well as to measure the use of this page.\nThis website uses Google Analytics, a web analytics service provided by Google, Inc. (\"Google\"). Google Analytics uses cookies. The information generated by the cookie about your use of this website is generally transferred to a Google server in the United States and stored there. Because we have activated “internet protocol anonymization” on this website, Google shortens your IP address at a point within the European Economic Area before transfer to the United States. This means that the full IP address will be transferred to Google in the United States only in exceptional circumstances for shortening there.\nGoogle will use the received information to evaluate your use of this website for Biogen, to compile reports on website activity, and to provide other services related to website usage and internet usage. The IP address provided by your browser as part of Google Analytics will not be merged with any other Google data.\nMost web browsers allow control of cookies through the browser settings. You can set your browser to notify you when you receive a cookie, which will enable you to decide if you want to accept it or not. However, if you do not accept a particular cookie, certain elements of the website may not function correctly or completely.\nYou can prevent Google from collecting and processing your data (including your IP address) related to your use of this website, by downloading and installing the browser plug-in available at the following link: http://tools.google.com/dlpage/gaoptout?hl=en.\nIf you do not allow any cookies from our website, some functionalities and content may be affected and may not work properly.\nTo find out more about cookies, including how to see what cookies have been set and how to the delete them, visit www.allaboutcookies.org.\nWe may update the Cookies Policy for our website. We therefore recommend that you re-read this policy every time you access our website so that you are adequately informed about how and why we use cookies.\nThese are the specific cookies we use on this website, with information on how they function:\nOctober 27, 2025\nIn 2003, Nichole was very sick and couldn’t seem to shake it. She was exhausted, had gained 40 pounds, and couldn’t see out of one eye. A trip to the emergency room revealed end-stage kidney disease, requiring immediate dialysis. Shocked by this news, she asked her doctors how this could have happened. They speculated undiagnosed high blood pressure was one possible cause, but they weren’t certain.\nTwenty years later, Nichole finally learned the cause of her kidney failure — immunoglobulin A nephropathy (IgAN), a kidney disease that leads to inflammation and progressive kidney damage. “It took for me to finally say ‘what can I do to find out what I have?’ and a doctor flipped through my chart and saw that a biopsy I had in 2003 revealed IgAN. I was upset with so many people because I’d been asking for 20 years, ‘How did I get this?’”\nThis revelation came after years of dialysis and two kidney transplants. Nichole was both taken aback by the news, but also relieved. “Finally, I understood it was nothing I did that caused kidney failure,” she said.\nComing to Terms with Her Diagnosis\nNichole’s diagnosis came at a time in her life when she felt she was thriving. “My life was really just kind of getting started. I started a very good career in the IT field. My daughter was a teenager and very active in sports, so I had a lot of things going on.”\nThe news hit her hard, and her mental outlook deteriorated. “I didn’t understand what was going on, I had a lot of ‘why me’ moments,” she said. At her lowest, she considered giving up dialysis until her daughter walked into her hospital room. “I knew I couldn't do that.” She immediately went into transplant mode.\nNichole spent four and a half years on the kidney transplant wait list, managing her kidney disease with at-home dialysis she completed every night so that she could get up and work the next day and care for her daughter. “The waiting game for a kidney match was nerve wracking,” she said. “Every time I heard someone was transplanted, I wondered, when is my time?”\nManaging Life Through Two Transplants\nFinally, in 2008, she had her first kidney transplant, but recovery was tough. “You think you're going to go back to normal life; however, that doesn't necessarily happen,” she explained. Nichole experienced anti-body mediated rejection (AMR), a condition that causes the body’s immune system to attack the transplanted kidney. She also struggled to find the energy and will to do things she used to do.\nEight years later, she suspected her transplanted kidney was failing again. Despite her doctor’s reassurances that her lab numbers were where they should be, she trusted her instincts. Empowered by a new support system in her kidney disease community and a new-found confidence to self-advocate, she refused to take ‘no’ for an answer. After six months of begging her doctor for a biopsy, he finally relented and agreed to do it. This led to confirmation of what she had thought; her kidney was failing again.\nNichole immediately rejoined the transplant list, but this time she took control, calling the best hospitals in the country for kidney transplants and handling the paperwork. In 2020, she had her second kidney transplant.\nToday, Nichole says she feels good. “I’m very pleased with this kidney. I've been able to do things that I haven't been able to do for 20 years.”\nSelf-Advocacy Leads to Community Advocacy\nComing to terms with her kidney disease diagnosis, navigating life, and confronting misconceptions have been difficult for Nichole. “People think once we get a transplant, we're cured, so when I had to get another transplant, people were shocked.” Motivated by her experience, she turned her frustration into action and started advocating for kidney disease awareness, particularly within the Black community, which faces disproportionately high rates of kidney failure.\n“I advocate because I don't want anyone to go through what I've gone through,” she explains. Her efforts have inspired those closest to her, including her daughter, to begin prioritizing regular testing and proactive health conversations with their doctors.\nWhile Nichole credits her family for providing comfort through her most difficult years, it was her kidney disease community who truly got her through it. Being able to share information, ask questions, and form real relationships that go beyond a diagnosis gave Nichole a sense of relief. \"If I didn’t have my support circle of people with kidney disease, I don’t know where I would be.\"\n“Living Life More”\nFor years, her life felt like a constant battle, but after her second transplant she proudly declares, “I started living life more.”\nToday, Nichole travels to visit family and shares her experiences living with kidney disease nationally through lectures, speaking engagements and meetings with lawmakers. “Some people say I do too much, family members say I’m always doing something, well yeah because now I can finally go.”\nNichole sees the many clinical trials underway for kidney diseases as a reason to be hopeful for the future. “So many people are working together trying to find treatments. That gives me hope…and makes me think, that future generations; my nieces, my nephews, their children, won't have to go through it the way that I have.”\nHer message to those facing similar challenges: speak up and have an active voice in your own health. Her message to doctors, “Listen to your patients… be open to what they are saying.”\nWatch Nichole’s story:"
    },
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/stories.html",
        "Content_Type": "Website Content",
        "Raw_Text": "This website uses cookies to improve the site and your experience. By continuing to browse the site, you are agreeing to accept our use of cookies. If you require further information and/or do not wish to have cookies placed when using the site, you can modify your browser settings appropriately, or you may visit our cookies page.\nWe do not use cookies of this type.\nSome of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness.\nWe collect information about your use of this website through cookies and similar technology. Cookies are small text files that are placed on your computer or other web-accessing device by this website that allow us to recognize you and maintain your preferences when you return to our website. Cookie technology collects “clickstream” data, which does not include direct personal identifiers, but which reflects your activities on the website and helps us to customize our website experience and anticipate what may be of interest to our users, by monitoring traffic in popular areas and modifying the services and information to meet customer demand.\nWe use the following types of cookies:\nWe use cookies on this website to:\nWe do not allow other websites or third parties to use our cookies for their own purposes on your computer when you visit our website.\nOccasionally, we may use Internet tags (also known as web beacons, action tags, single-pixel GIFs, clear GIFs, invisible GIFs and 1-by-1 GIFs) on this website. We may deploy these tags and cookies through a web analytical service partner, which may locate and store the respective information, including your IP address, in a foreign country that may protect the protection of personal data differently than the country where such information is collected. These tags are placed on different pages of this website and we use this technology to measure the registered user’s responses to our websites, including how many times a page is opened and which information is consulted, as well as to measure the use of this page.\nThis website uses Google Analytics, a web analytics service provided by Google, Inc. (\"Google\"). Google Analytics uses cookies. The information generated by the cookie about your use of this website is generally transferred to a Google server in the United States and stored there. Because we have activated “internet protocol anonymization” on this website, Google shortens your IP address at a point within the European Economic Area before transfer to the United States. This means that the full IP address will be transferred to Google in the United States only in exceptional circumstances for shortening there.\nGoogle will use the received information to evaluate your use of this website for Biogen, to compile reports on website activity, and to provide other services related to website usage and internet usage. The IP address provided by your browser as part of Google Analytics will not be merged with any other Google data.\nMost web browsers allow control of cookies through the browser settings. You can set your browser to notify you when you receive a cookie, which will enable you to decide if you want to accept it or not. However, if you do not accept a particular cookie, certain elements of the website may not function correctly or completely.\nYou can prevent Google from collecting and processing your data (including your IP address) related to your use of this website, by downloading and installing the browser plug-in available at the following link: http://tools.google.com/dlpage/gaoptout?hl=en.\nIf you do not allow any cookies from our website, some functionalities and content may be affected and may not work properly.\nTo find out more about cookies, including how to see what cookies have been set and how to the delete them, visit www.allaboutcookies.org.\nWe may update the Cookies Policy for our website. We therefore recommend that you re-read this policy every time you access our website so that you are adequately informed about how and why we use cookies.\nThese are the specific cookies we use on this website, with information on how they function:"
    },
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/stories/savine-story-inclusion-advocacy-leadership.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Savine DaCosta’s journey is one of resilience, purpose, and passion. Born and raised in New York City, she then pursued her education in Pennsylvania and Boston, earning undergraduate and graduate degrees in business. Today, through Biogen’s tuition reimbursement program, she’s pursuing a PhD in Leadership from Trevecca Nazarene University. Savine pursues this goal to deepen research on cross-functional collaboration and inclusive leadership. “My PhD is about understanding true leadership in all forms,” she shares. “I want to find ways to work together with different types of leaders toward an amicable end.”\nSavine’s professional path began in pharmaceutical sales, followed by roles in marketing, medical affairs, and patient engagement. At Biogen, she leads efforts to ensure inclusion and representation in clinical research. Her work involves setting inclusion goals based on disease epidemiology, selecting clinical sites, and developing strategies to engage communities early in the research process. “The first time someone hears about a clinical trial shouldn’t be when they’re asked to join. We build awareness and educate early so participants feel empowered and informed.”\nAn ornament painted by Savine's son.\nHer passion for advocacy is deeply personal. As a self-called “forever caregiver” to her son, who was born a micro-preemie and lives with multiple disabilities, Savine volunteers in her community to support families navigating the healthcare system. With this work, she focuses on supporting people living with disabilities as well as individuals with premature babies.\nOutside of work, Savine finds joy in photography and crafting, hobbies that began as therapeutic activities for her son. “We started painting acrylic-pour Christmas bulbs and making beaded bracelets to help him use his hands more,” she says.\nSavine’s impact at Biogen extends beyond her role. She’s participated in several of Biogen’s leadership development programs, including one currently where she acts as a peer leader, mentoring colleagues, and fostering personalized guidance. Over the years, she’s also mentored several interns from historically black colleges and universities (HBCUs), a highlight of her time at Biogen explained Savine.\n“I started as a contractor over four years ago, and from day one, the culture was collaborative and welcoming,” she recalls. “When my son had major surgery, the team was like a warm hug. Everyone reached out. They truly care about people here.”\nHer advice to future team members? “Be authentic, collaborative, and open to innovation. Own your development and don’t be afraid to ask questions. At the end of the day, all the work we do is for the patients we serve.”"
    },
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/stories/building-the-new-biogen.html",
        "Content_Type": "Website Content",
        "Raw_Text": "About\nCookies and Other Technology Policy\nWe collect information about your use of this website through cookies and similar technology. Cookies are small text files that are placed on your computer or other web-accessing device by this website that allow us to recognize you and maintain your preferences when you return to our website. Cookie technology collects “clickstream” data, which does not include direct personal identifiers, but which reflects your activities on the website and helps us to customize our website experience and anticipate what may be of interest to our users, by monitoring traffic in popular areas and modifying the services and information to meet customer demand.\nWe use the following types of cookies:\n- First-party cookies – cookies set by the website displayed in the browser window – identified by the domain name in the address bar of the browser window.\n- Session cookies – cookies that expire at the end of a browser session, starting with the time when a user opens the browser window, and finishing when the user exits the browser.\n- Persistent cookies – cookies that ‘persist’ (are stored) in the device after the end of a browser session and therefore can allow the preferences or actions of the user to be remembered when they return to the website.\nWe use cookies on this website to:\n- direct users to the relevant sections on the website;\n- make sure the website has a consistent look across different browsers and devices;\n- enable complex areas of the website to function; and\n- track aggregated statistics about visits to the website to help us improve website performance.\nWe do not allow other websites or third parties to use our cookies for their own purposes on your computer when you visit our website.\nInternet tags\nOccasionally, we may use Internet tags (also known as web beacons, action tags, single-pixel GIFs, clear GIFs, invisible GIFs and 1-by-1 GIFs) on this website. We may deploy these tags and cookies through a web analytical service partner, which may locate and store the respective information, including your IP address, in a foreign country that may protect the protection of personal data differently than the country where such information is collected. These tags are placed on different pages of this website and we use this technology to measure the registered user’s responses to our websites, including how many times a page is opened and which information is consulted, as well as to measure the use of this page.\nGoogle Analytics\nThis website uses Google Analytics, a web analytics service provided by Google, Inc. (\"Google\"). Google Analytics uses cookies. The information generated by the cookie about your use of this website is generally transferred to a Google server in the United States and stored there. Because we have activated “internet protocol anonymization” on this website, Google shortens your IP address at a point within the European Economic Area before transfer to the United States. This means that the full IP address will be transferred to Google in the United States only in exceptional circumstances for shortening there.\nGoogle will use the received information to evaluate your use of this website for Biogen, to compile reports on website activity, and to provide other services related to website usage and internet usage. The IP address provided by your browser as part of Google Analytics will not be merged with any other Google data.\nHow can I control the cookies that you use on this website?\nMost web browsers allow control of cookies through the browser settings. You can set your browser to notify you when you receive a cookie, which will enable you to decide if you want to accept it or not. However, if you do not accept a particular cookie, certain elements of the website may not function correctly or completely.\nYou can prevent Google from collecting and processing your data (including your IP address) related to your use of this website, by downloading and installing the browser plug-in available at the following link: http://tools.google.com/dlpage/gaoptout?hl=en.\nIf you do not allow any cookies from our website, some functionalities and content may be affected and may not work properly.\nTo find out more about cookies, including how to see what cookies have been set and how to the delete them, visit www.allaboutcookies.org.\nChanges to the Cookies Policy\nWe may update the Cookies Policy for our website. We therefore recommend that you re-read this policy every time you access our website so that you are adequately informed about how and why we use cookies.\nThese are the specific cookies we use on this website, with information on how they function:"
    },
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/stories/living-with-alzheimers-disease-normajo-cleo-story.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Normajo and Cleo\nHighschool sweethearts, Normajo and Cleo were born and raised in Mississippi and happily attended college in Indiana together, where they now still live. They were avid travelers and enjoyed many adventures together, with Normajo fondly recalling time spent sailing on the water as her favorite.\nTen years ago, with Cleo newly retired, Normajo began to notice that Cleo’s memory was not as sharp as it once was. She doubted her instincts at first but went so far as to write down things she specifically told Cleo in conversation, only to confirm that he did not recall. Their lives were about to change dramatically.\nIn it together\nNormajo intended to work through what came next side by side with Cleo and quickly scheduled a doctor’s appointment. To her great surprise, doctors told her that Cleo had already gone through a series of tests and evaluations months before and had diagnosed Cleo with Alzheimer’s disease. Normajo was at a further disadvantage, since Cleo did not share the paperwork that would allow doctors to share his medical information with her.\nThe signs were there\nDoctors were able to tell Normajo that Cleo had been told of his Alzheimer’s diagnosis months before and they had already commenced a treatment plan. Suddenly, decisions like Cleo’s relatively abrupt retirement from work started to make sense.\n“I should have known something was wrong. When Cleo retired, he did it so quickly, and he loved his job. It didn’t make sense at the time.”\nNormajo is not alone in mistaking the early signs of Alzheimer’s for the normal effects of aging, as subtle symptoms can often be unrecognized signs for mild cognitive impairment. It is often hard to distinguish the difference, and it can be a complex and emotionally charged situation that millions of people face every day.\nAlzheimer's disease is a progressive neurological illness that impairs thinking and the independence of those affected. Worldwide, dementia affects 55 million people, with 60-70% of cases being Alzheimer’s disease.1\nNot alone\nAt first, Normajo tried to support Cleo by herself. \"I gave up everything, all my social activities, everything, when I found out about Cleo.” But taking on caregiving responsibilities on top of household tasks that used to be Cleo’s proved to be too much to handle alone. Normajo gratefully turned to her family, church and various community support groups. Once she got the support she needed and the answers to her many questions, Normajo became a proponent for caregivers seeking the help they need.\nNormajo is truly not alone, as there are 11 million unpaid caregivers in the US who help those with Alzheimer's or other types of dementia.2\nHear more of Normajo and Cleo’s story below."
    },
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/stories/kamaria-story.html",
        "Content_Type": "Website Content",
        "Raw_Text": "About\nCookies and Other Technology Policy\nWe collect information about your use of this website through cookies and similar technology. Cookies are small text files that are placed on your computer or other web-accessing device by this website that allow us to recognize you and maintain your preferences when you return to our website. Cookie technology collects “clickstream” data, which does not include direct personal identifiers, but which reflects your activities on the website and helps us to customize our website experience and anticipate what may be of interest to our users, by monitoring traffic in popular areas and modifying the services and information to meet customer demand.\nWe use the following types of cookies:\n- First-party cookies – cookies set by the website displayed in the browser window – identified by the domain name in the address bar of the browser window.\n- Session cookies – cookies that expire at the end of a browser session, starting with the time when a user opens the browser window, and finishing when the user exits the browser.\n- Persistent cookies – cookies that ‘persist’ (are stored) in the device after the end of a browser session and therefore can allow the preferences or actions of the user to be remembered when they return to the website.\nWe use cookies on this website to:\n- direct users to the relevant sections on the website;\n- make sure the website has a consistent look across different browsers and devices;\n- enable complex areas of the website to function; and\n- track aggregated statistics about visits to the website to help us improve website performance.\nWe do not allow other websites or third parties to use our cookies for their own purposes on your computer when you visit our website.\nInternet tags\nOccasionally, we may use Internet tags (also known as web beacons, action tags, single-pixel GIFs, clear GIFs, invisible GIFs and 1-by-1 GIFs) on this website. We may deploy these tags and cookies through a web analytical service partner, which may locate and store the respective information, including your IP address, in a foreign country that may protect the protection of personal data differently than the country where such information is collected. These tags are placed on different pages of this website and we use this technology to measure the registered user’s responses to our websites, including how many times a page is opened and which information is consulted, as well as to measure the use of this page.\nGoogle Analytics\nThis website uses Google Analytics, a web analytics service provided by Google, Inc. (\"Google\"). Google Analytics uses cookies. The information generated by the cookie about your use of this website is generally transferred to a Google server in the United States and stored there. Because we have activated “internet protocol anonymization” on this website, Google shortens your IP address at a point within the European Economic Area before transfer to the United States. This means that the full IP address will be transferred to Google in the United States only in exceptional circumstances for shortening there.\nGoogle will use the received information to evaluate your use of this website for Biogen, to compile reports on website activity, and to provide other services related to website usage and internet usage. The IP address provided by your browser as part of Google Analytics will not be merged with any other Google data.\nHow can I control the cookies that you use on this website?\nMost web browsers allow control of cookies through the browser settings. You can set your browser to notify you when you receive a cookie, which will enable you to decide if you want to accept it or not. However, if you do not accept a particular cookie, certain elements of the website may not function correctly or completely.\nYou can prevent Google from collecting and processing your data (including your IP address) related to your use of this website, by downloading and installing the browser plug-in available at the following link: http://tools.google.com/dlpage/gaoptout?hl=en.\nIf you do not allow any cookies from our website, some functionalities and content may be affected and may not work properly.\nTo find out more about cookies, including how to see what cookies have been set and how to the delete them, visit www.allaboutcookies.org.\nChanges to the Cookies Policy\nWe may update the Cookies Policy for our website. We therefore recommend that you re-read this policy every time you access our website so that you are adequately informed about how and why we use cookies.\nThese are the specific cookies we use on this website, with information on how they function:"
    },
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/stories/michael-story.html",
        "Content_Type": "Website Content",
        "Raw_Text": "About\nCookies and Other Technology Policy\nWe collect information about your use of this website through cookies and similar technology. Cookies are small text files that are placed on your computer or other web-accessing device by this website that allow us to recognize you and maintain your preferences when you return to our website. Cookie technology collects “clickstream” data, which does not include direct personal identifiers, but which reflects your activities on the website and helps us to customize our website experience and anticipate what may be of interest to our users, by monitoring traffic in popular areas and modifying the services and information to meet customer demand.\nWe use the following types of cookies:\n- First-party cookies – cookies set by the website displayed in the browser window – identified by the domain name in the address bar of the browser window.\n- Session cookies – cookies that expire at the end of a browser session, starting with the time when a user opens the browser window, and finishing when the user exits the browser.\n- Persistent cookies – cookies that ‘persist’ (are stored) in the device after the end of a browser session and therefore can allow the preferences or actions of the user to be remembered when they return to the website.\nWe use cookies on this website to:\n- direct users to the relevant sections on the website;\n- make sure the website has a consistent look across different browsers and devices;\n- enable complex areas of the website to function; and\n- track aggregated statistics about visits to the website to help us improve website performance.\nWe do not allow other websites or third parties to use our cookies for their own purposes on your computer when you visit our website.\nInternet tags\nOccasionally, we may use Internet tags (also known as web beacons, action tags, single-pixel GIFs, clear GIFs, invisible GIFs and 1-by-1 GIFs) on this website. We may deploy these tags and cookies through a web analytical service partner, which may locate and store the respective information, including your IP address, in a foreign country that may protect the protection of personal data differently than the country where such information is collected. These tags are placed on different pages of this website and we use this technology to measure the registered user’s responses to our websites, including how many times a page is opened and which information is consulted, as well as to measure the use of this page.\nGoogle Analytics\nThis website uses Google Analytics, a web analytics service provided by Google, Inc. (\"Google\"). Google Analytics uses cookies. The information generated by the cookie about your use of this website is generally transferred to a Google server in the United States and stored there. Because we have activated “internet protocol anonymization” on this website, Google shortens your IP address at a point within the European Economic Area before transfer to the United States. This means that the full IP address will be transferred to Google in the United States only in exceptional circumstances for shortening there.\nGoogle will use the received information to evaluate your use of this website for Biogen, to compile reports on website activity, and to provide other services related to website usage and internet usage. The IP address provided by your browser as part of Google Analytics will not be merged with any other Google data.\nHow can I control the cookies that you use on this website?\nMost web browsers allow control of cookies through the browser settings. You can set your browser to notify you when you receive a cookie, which will enable you to decide if you want to accept it or not. However, if you do not accept a particular cookie, certain elements of the website may not function correctly or completely.\nYou can prevent Google from collecting and processing your data (including your IP address) related to your use of this website, by downloading and installing the browser plug-in available at the following link: http://tools.google.com/dlpage/gaoptout?hl=en.\nIf you do not allow any cookies from our website, some functionalities and content may be affected and may not work properly.\nTo find out more about cookies, including how to see what cookies have been set and how to the delete them, visit www.allaboutcookies.org.\nChanges to the Cookies Policy\nWe may update the Cookies Policy for our website. We therefore recommend that you re-read this policy every time you access our website so that you are adequately informed about how and why we use cookies.\nThese are the specific cookies we use on this website, with information on how they function:"
    },
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/company/leadership/christopher-viehbacher.html",
        "Content_Type": "Website Content",
        "Raw_Text": "About\nCookies and Other Technology Policy\nWe collect information about your use of this website through cookies and similar technology. Cookies are small text files that are placed on your computer or other web-accessing device by this website that allow us to recognize you and maintain your preferences when you return to our website. Cookie technology collects “clickstream” data, which does not include direct personal identifiers, but which reflects your activities on the website and helps us to customize our website experience and anticipate what may be of interest to our users, by monitoring traffic in popular areas and modifying the services and information to meet customer demand.\nWe use the following types of cookies:\n- First-party cookies – cookies set by the website displayed in the browser window – identified by the domain name in the address bar of the browser window.\n- Session cookies – cookies that expire at the end of a browser session, starting with the time when a user opens the browser window, and finishing when the user exits the browser.\n- Persistent cookies – cookies that ‘persist’ (are stored) in the device after the end of a browser session and therefore can allow the preferences or actions of the user to be remembered when they return to the website.\nWe use cookies on this website to:\n- direct users to the relevant sections on the website;\n- make sure the website has a consistent look across different browsers and devices;\n- enable complex areas of the website to function; and\n- track aggregated statistics about visits to the website to help us improve website performance.\nWe do not allow other websites or third parties to use our cookies for their own purposes on your computer when you visit our website.\nInternet tags\nOccasionally, we may use Internet tags (also known as web beacons, action tags, single-pixel GIFs, clear GIFs, invisible GIFs and 1-by-1 GIFs) on this website. We may deploy these tags and cookies through a web analytical service partner, which may locate and store the respective information, including your IP address, in a foreign country that may protect the protection of personal data differently than the country where such information is collected. These tags are placed on different pages of this website and we use this technology to measure the registered user’s responses to our websites, including how many times a page is opened and which information is consulted, as well as to measure the use of this page.\nGoogle Analytics\nThis website uses Google Analytics, a web analytics service provided by Google, Inc. (\"Google\"). Google Analytics uses cookies. The information generated by the cookie about your use of this website is generally transferred to a Google server in the United States and stored there. Because we have activated “internet protocol anonymization” on this website, Google shortens your IP address at a point within the European Economic Area before transfer to the United States. This means that the full IP address will be transferred to Google in the United States only in exceptional circumstances for shortening there.\nGoogle will use the received information to evaluate your use of this website for Biogen, to compile reports on website activity, and to provide other services related to website usage and internet usage. The IP address provided by your browser as part of Google Analytics will not be merged with any other Google data.\nHow can I control the cookies that you use on this website?\nMost web browsers allow control of cookies through the browser settings. You can set your browser to notify you when you receive a cookie, which will enable you to decide if you want to accept it or not. However, if you do not accept a particular cookie, certain elements of the website may not function correctly or completely.\nYou can prevent Google from collecting and processing your data (including your IP address) related to your use of this website, by downloading and installing the browser plug-in available at the following link: http://tools.google.com/dlpage/gaoptout?hl=en.\nIf you do not allow any cookies from our website, some functionalities and content may be affected and may not work properly.\nTo find out more about cookies, including how to see what cookies have been set and how to the delete them, visit www.allaboutcookies.org.\nChanges to the Cookies Policy\nWe may update the Cookies Policy for our website. We therefore recommend that you re-read this policy every time you access our website so that you are adequately informed about how and why we use cookies.\nThese are the specific cookies we use on this website, with information on how they function:"
    },
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/company/leadership/alexander-susan.html",
        "Content_Type": "Website Content",
        "Raw_Text": "About\nCookies and Other Technology Policy\nWe collect information about your use of this website through cookies and similar technology. Cookies are small text files that are placed on your computer or other web-accessing device by this website that allow us to recognize you and maintain your preferences when you return to our website. Cookie technology collects “clickstream” data, which does not include direct personal identifiers, but which reflects your activities on the website and helps us to customize our website experience and anticipate what may be of interest to our users, by monitoring traffic in popular areas and modifying the services and information to meet customer demand.\nWe use the following types of cookies:\n- First-party cookies – cookies set by the website displayed in the browser window – identified by the domain name in the address bar of the browser window.\n- Session cookies – cookies that expire at the end of a browser session, starting with the time when a user opens the browser window, and finishing when the user exits the browser.\n- Persistent cookies – cookies that ‘persist’ (are stored) in the device after the end of a browser session and therefore can allow the preferences or actions of the user to be remembered when they return to the website.\nWe use cookies on this website to:\n- direct users to the relevant sections on the website;\n- make sure the website has a consistent look across different browsers and devices;\n- enable complex areas of the website to function; and\n- track aggregated statistics about visits to the website to help us improve website performance.\nWe do not allow other websites or third parties to use our cookies for their own purposes on your computer when you visit our website.\nInternet tags\nOccasionally, we may use Internet tags (also known as web beacons, action tags, single-pixel GIFs, clear GIFs, invisible GIFs and 1-by-1 GIFs) on this website. We may deploy these tags and cookies through a web analytical service partner, which may locate and store the respective information, including your IP address, in a foreign country that may protect the protection of personal data differently than the country where such information is collected. These tags are placed on different pages of this website and we use this technology to measure the registered user’s responses to our websites, including how many times a page is opened and which information is consulted, as well as to measure the use of this page.\nGoogle Analytics\nThis website uses Google Analytics, a web analytics service provided by Google, Inc. (\"Google\"). Google Analytics uses cookies. The information generated by the cookie about your use of this website is generally transferred to a Google server in the United States and stored there. Because we have activated “internet protocol anonymization” on this website, Google shortens your IP address at a point within the European Economic Area before transfer to the United States. This means that the full IP address will be transferred to Google in the United States only in exceptional circumstances for shortening there.\nGoogle will use the received information to evaluate your use of this website for Biogen, to compile reports on website activity, and to provide other services related to website usage and internet usage. The IP address provided by your browser as part of Google Analytics will not be merged with any other Google data.\nHow can I control the cookies that you use on this website?\nMost web browsers allow control of cookies through the browser settings. You can set your browser to notify you when you receive a cookie, which will enable you to decide if you want to accept it or not. However, if you do not accept a particular cookie, certain elements of the website may not function correctly or completely.\nYou can prevent Google from collecting and processing your data (including your IP address) related to your use of this website, by downloading and installing the browser plug-in available at the following link: http://tools.google.com/dlpage/gaoptout?hl=en.\nIf you do not allow any cookies from our website, some functionalities and content may be affected and may not work properly.\nTo find out more about cookies, including how to see what cookies have been set and how to the delete them, visit www.allaboutcookies.org.\nChanges to the Cookies Policy\nWe may update the Cookies Policy for our website. We therefore recommend that you re-read this policy every time you access our website so that you are adequately informed about how and why we use cookies.\nThese are the specific cookies we use on this website, with information on how they function:"
    },
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/company/leadership/gregory-ginger.html",
        "Content_Type": "Website Content",
        "Raw_Text": "About\nCookies and Other Technology Policy\nWe collect information about your use of this website through cookies and similar technology. Cookies are small text files that are placed on your computer or other web-accessing device by this website that allow us to recognize you and maintain your preferences when you return to our website. Cookie technology collects “clickstream” data, which does not include direct personal identifiers, but which reflects your activities on the website and helps us to customize our website experience and anticipate what may be of interest to our users, by monitoring traffic in popular areas and modifying the services and information to meet customer demand.\nWe use the following types of cookies:\n- First-party cookies – cookies set by the website displayed in the browser window – identified by the domain name in the address bar of the browser window.\n- Session cookies – cookies that expire at the end of a browser session, starting with the time when a user opens the browser window, and finishing when the user exits the browser.\n- Persistent cookies – cookies that ‘persist’ (are stored) in the device after the end of a browser session and therefore can allow the preferences or actions of the user to be remembered when they return to the website.\nWe use cookies on this website to:\n- direct users to the relevant sections on the website;\n- make sure the website has a consistent look across different browsers and devices;\n- enable complex areas of the website to function; and\n- track aggregated statistics about visits to the website to help us improve website performance.\nWe do not allow other websites or third parties to use our cookies for their own purposes on your computer when you visit our website.\nInternet tags\nOccasionally, we may use Internet tags (also known as web beacons, action tags, single-pixel GIFs, clear GIFs, invisible GIFs and 1-by-1 GIFs) on this website. We may deploy these tags and cookies through a web analytical service partner, which may locate and store the respective information, including your IP address, in a foreign country that may protect the protection of personal data differently than the country where such information is collected. These tags are placed on different pages of this website and we use this technology to measure the registered user’s responses to our websites, including how many times a page is opened and which information is consulted, as well as to measure the use of this page.\nGoogle Analytics\nThis website uses Google Analytics, a web analytics service provided by Google, Inc. (\"Google\"). Google Analytics uses cookies. The information generated by the cookie about your use of this website is generally transferred to a Google server in the United States and stored there. Because we have activated “internet protocol anonymization” on this website, Google shortens your IP address at a point within the European Economic Area before transfer to the United States. This means that the full IP address will be transferred to Google in the United States only in exceptional circumstances for shortening there.\nGoogle will use the received information to evaluate your use of this website for Biogen, to compile reports on website activity, and to provide other services related to website usage and internet usage. The IP address provided by your browser as part of Google Analytics will not be merged with any other Google data.\nHow can I control the cookies that you use on this website?\nMost web browsers allow control of cookies through the browser settings. You can set your browser to notify you when you receive a cookie, which will enable you to decide if you want to accept it or not. However, if you do not accept a particular cookie, certain elements of the website may not function correctly or completely.\nYou can prevent Google from collecting and processing your data (including your IP address) related to your use of this website, by downloading and installing the browser plug-in available at the following link: http://tools.google.com/dlpage/gaoptout?hl=en.\nIf you do not allow any cookies from our website, some functionalities and content may be affected and may not work properly.\nTo find out more about cookies, including how to see what cookies have been set and how to the delete them, visit www.allaboutcookies.org.\nChanges to the Cookies Policy\nWe may update the Cookies Policy for our website. We therefore recommend that you re-read this policy every time you access our website so that you are adequately informed about how and why we use cookies.\nThese are the specific cookies we use on this website, with information on how they function:"
    },
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/company/leadership/izzar-rachid.html",
        "Content_Type": "Website Content",
        "Raw_Text": "About\nCookies and Other Technology Policy\nWe collect information about your use of this website through cookies and similar technology. Cookies are small text files that are placed on your computer or other web-accessing device by this website that allow us to recognize you and maintain your preferences when you return to our website. Cookie technology collects “clickstream” data, which does not include direct personal identifiers, but which reflects your activities on the website and helps us to customize our website experience and anticipate what may be of interest to our users, by monitoring traffic in popular areas and modifying the services and information to meet customer demand.\nWe use the following types of cookies:\n- First-party cookies – cookies set by the website displayed in the browser window – identified by the domain name in the address bar of the browser window.\n- Session cookies – cookies that expire at the end of a browser session, starting with the time when a user opens the browser window, and finishing when the user exits the browser.\n- Persistent cookies – cookies that ‘persist’ (are stored) in the device after the end of a browser session and therefore can allow the preferences or actions of the user to be remembered when they return to the website.\nWe use cookies on this website to:\n- direct users to the relevant sections on the website;\n- make sure the website has a consistent look across different browsers and devices;\n- enable complex areas of the website to function; and\n- track aggregated statistics about visits to the website to help us improve website performance.\nWe do not allow other websites or third parties to use our cookies for their own purposes on your computer when you visit our website.\nInternet tags\nOccasionally, we may use Internet tags (also known as web beacons, action tags, single-pixel GIFs, clear GIFs, invisible GIFs and 1-by-1 GIFs) on this website. We may deploy these tags and cookies through a web analytical service partner, which may locate and store the respective information, including your IP address, in a foreign country that may protect the protection of personal data differently than the country where such information is collected. These tags are placed on different pages of this website and we use this technology to measure the registered user’s responses to our websites, including how many times a page is opened and which information is consulted, as well as to measure the use of this page.\nGoogle Analytics\nThis website uses Google Analytics, a web analytics service provided by Google, Inc. (\"Google\"). Google Analytics uses cookies. The information generated by the cookie about your use of this website is generally transferred to a Google server in the United States and stored there. Because we have activated “internet protocol anonymization” on this website, Google shortens your IP address at a point within the European Economic Area before transfer to the United States. This means that the full IP address will be transferred to Google in the United States only in exceptional circumstances for shortening there.\nGoogle will use the received information to evaluate your use of this website for Biogen, to compile reports on website activity, and to provide other services related to website usage and internet usage. The IP address provided by your browser as part of Google Analytics will not be merged with any other Google data.\nHow can I control the cookies that you use on this website?\nMost web browsers allow control of cookies through the browser settings. You can set your browser to notify you when you receive a cookie, which will enable you to decide if you want to accept it or not. However, if you do not accept a particular cookie, certain elements of the website may not function correctly or completely.\nYou can prevent Google from collecting and processing your data (including your IP address) related to your use of this website, by downloading and installing the browser plug-in available at the following link: http://tools.google.com/dlpage/gaoptout?hl=en.\nIf you do not allow any cookies from our website, some functionalities and content may be affected and may not work properly.\nTo find out more about cookies, including how to see what cookies have been set and how to the delete them, visit www.allaboutcookies.org.\nChanges to the Cookies Policy\nWe may update the Cookies Policy for our website. We therefore recommend that you re-read this policy every time you access our website so that you are adequately informed about how and why we use cookies.\nThese are the specific cookies we use on this website, with information on how they function:"
    },
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/company/leadership/murphy-nicole.html",
        "Content_Type": "Website Content",
        "Raw_Text": "About\nCookies and Other Technology Policy\nWe collect information about your use of this website through cookies and similar technology. Cookies are small text files that are placed on your computer or other web-accessing device by this website that allow us to recognize you and maintain your preferences when you return to our website. Cookie technology collects “clickstream” data, which does not include direct personal identifiers, but which reflects your activities on the website and helps us to customize our website experience and anticipate what may be of interest to our users, by monitoring traffic in popular areas and modifying the services and information to meet customer demand.\nWe use the following types of cookies:\n- First-party cookies – cookies set by the website displayed in the browser window – identified by the domain name in the address bar of the browser window.\n- Session cookies – cookies that expire at the end of a browser session, starting with the time when a user opens the browser window, and finishing when the user exits the browser.\n- Persistent cookies – cookies that ‘persist’ (are stored) in the device after the end of a browser session and therefore can allow the preferences or actions of the user to be remembered when they return to the website.\nWe use cookies on this website to:\n- direct users to the relevant sections on the website;\n- make sure the website has a consistent look across different browsers and devices;\n- enable complex areas of the website to function; and\n- track aggregated statistics about visits to the website to help us improve website performance.\nWe do not allow other websites or third parties to use our cookies for their own purposes on your computer when you visit our website.\nInternet tags\nOccasionally, we may use Internet tags (also known as web beacons, action tags, single-pixel GIFs, clear GIFs, invisible GIFs and 1-by-1 GIFs) on this website. We may deploy these tags and cookies through a web analytical service partner, which may locate and store the respective information, including your IP address, in a foreign country that may protect the protection of personal data differently than the country where such information is collected. These tags are placed on different pages of this website and we use this technology to measure the registered user’s responses to our websites, including how many times a page is opened and which information is consulted, as well as to measure the use of this page.\nGoogle Analytics\nThis website uses Google Analytics, a web analytics service provided by Google, Inc. (\"Google\"). Google Analytics uses cookies. The information generated by the cookie about your use of this website is generally transferred to a Google server in the United States and stored there. Because we have activated “internet protocol anonymization” on this website, Google shortens your IP address at a point within the European Economic Area before transfer to the United States. This means that the full IP address will be transferred to Google in the United States only in exceptional circumstances for shortening there.\nGoogle will use the received information to evaluate your use of this website for Biogen, to compile reports on website activity, and to provide other services related to website usage and internet usage. The IP address provided by your browser as part of Google Analytics will not be merged with any other Google data.\nHow can I control the cookies that you use on this website?\nMost web browsers allow control of cookies through the browser settings. You can set your browser to notify you when you receive a cookie, which will enable you to decide if you want to accept it or not. However, if you do not accept a particular cookie, certain elements of the website may not function correctly or completely.\nYou can prevent Google from collecting and processing your data (including your IP address) related to your use of this website, by downloading and installing the browser plug-in available at the following link: http://tools.google.com/dlpage/gaoptout?hl=en.\nIf you do not allow any cookies from our website, some functionalities and content may be affected and may not work properly.\nTo find out more about cookies, including how to see what cookies have been set and how to the delete them, visit www.allaboutcookies.org.\nChanges to the Cookies Policy\nWe may update the Cookies Policy for our website. We therefore recommend that you re-read this policy every time you access our website so that you are adequately informed about how and why we use cookies.\nThese are the specific cookies we use on this website, with information on how they function:"
    },
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/company/leadership/grogan-jane.html",
        "Content_Type": "Website Content",
        "Raw_Text": "About\nCookies and Other Technology Policy\nWe collect information about your use of this website through cookies and similar technology. Cookies are small text files that are placed on your computer or other web-accessing device by this website that allow us to recognize you and maintain your preferences when you return to our website. Cookie technology collects “clickstream” data, which does not include direct personal identifiers, but which reflects your activities on the website and helps us to customize our website experience and anticipate what may be of interest to our users, by monitoring traffic in popular areas and modifying the services and information to meet customer demand.\nWe use the following types of cookies:\n- First-party cookies – cookies set by the website displayed in the browser window – identified by the domain name in the address bar of the browser window.\n- Session cookies – cookies that expire at the end of a browser session, starting with the time when a user opens the browser window, and finishing when the user exits the browser.\n- Persistent cookies – cookies that ‘persist’ (are stored) in the device after the end of a browser session and therefore can allow the preferences or actions of the user to be remembered when they return to the website.\nWe use cookies on this website to:\n- direct users to the relevant sections on the website;\n- make sure the website has a consistent look across different browsers and devices;\n- enable complex areas of the website to function; and\n- track aggregated statistics about visits to the website to help us improve website performance.\nWe do not allow other websites or third parties to use our cookies for their own purposes on your computer when you visit our website.\nInternet tags\nOccasionally, we may use Internet tags (also known as web beacons, action tags, single-pixel GIFs, clear GIFs, invisible GIFs and 1-by-1 GIFs) on this website. We may deploy these tags and cookies through a web analytical service partner, which may locate and store the respective information, including your IP address, in a foreign country that may protect the protection of personal data differently than the country where such information is collected. These tags are placed on different pages of this website and we use this technology to measure the registered user’s responses to our websites, including how many times a page is opened and which information is consulted, as well as to measure the use of this page.\nGoogle Analytics\nThis website uses Google Analytics, a web analytics service provided by Google, Inc. (\"Google\"). Google Analytics uses cookies. The information generated by the cookie about your use of this website is generally transferred to a Google server in the United States and stored there. Because we have activated “internet protocol anonymization” on this website, Google shortens your IP address at a point within the European Economic Area before transfer to the United States. This means that the full IP address will be transferred to Google in the United States only in exceptional circumstances for shortening there.\nGoogle will use the received information to evaluate your use of this website for Biogen, to compile reports on website activity, and to provide other services related to website usage and internet usage. The IP address provided by your browser as part of Google Analytics will not be merged with any other Google data.\nHow can I control the cookies that you use on this website?\nMost web browsers allow control of cookies through the browser settings. You can set your browser to notify you when you receive a cookie, which will enable you to decide if you want to accept it or not. However, if you do not accept a particular cookie, certain elements of the website may not function correctly or completely.\nYou can prevent Google from collecting and processing your data (including your IP address) related to your use of this website, by downloading and installing the browser plug-in available at the following link: http://tools.google.com/dlpage/gaoptout?hl=en.\nIf you do not allow any cookies from our website, some functionalities and content may be affected and may not work properly.\nTo find out more about cookies, including how to see what cookies have been set and how to the delete them, visit www.allaboutcookies.org.\nChanges to the Cookies Policy\nWe may update the Cookies Policy for our website. We therefore recommend that you re-read this policy every time you access our website so that you are adequately informed about how and why we use cookies.\nThese are the specific cookies we use on this website, with information on how they function:"
    },
    {
        "Ticker": "BIIB",
        "Company": "Biogen",
        "Source_URL": "https://www.biogen.com/company/leadership/keeney-adam.html",
        "Content_Type": "Website Content",
        "Raw_Text": "About\nCookies and Other Technology Policy\nWe collect information about your use of this website through cookies and similar technology. Cookies are small text files that are placed on your computer or other web-accessing device by this website that allow us to recognize you and maintain your preferences when you return to our website. Cookie technology collects “clickstream” data, which does not include direct personal identifiers, but which reflects your activities on the website and helps us to customize our website experience and anticipate what may be of interest to our users, by monitoring traffic in popular areas and modifying the services and information to meet customer demand.\nWe use the following types of cookies:\n- First-party cookies – cookies set by the website displayed in the browser window – identified by the domain name in the address bar of the browser window.\n- Session cookies – cookies that expire at the end of a browser session, starting with the time when a user opens the browser window, and finishing when the user exits the browser.\n- Persistent cookies – cookies that ‘persist’ (are stored) in the device after the end of a browser session and therefore can allow the preferences or actions of the user to be remembered when they return to the website.\nWe use cookies on this website to:\n- direct users to the relevant sections on the website;\n- make sure the website has a consistent look across different browsers and devices;\n- enable complex areas of the website to function; and\n- track aggregated statistics about visits to the website to help us improve website performance.\nWe do not allow other websites or third parties to use our cookies for their own purposes on your computer when you visit our website.\nInternet tags\nOccasionally, we may use Internet tags (also known as web beacons, action tags, single-pixel GIFs, clear GIFs, invisible GIFs and 1-by-1 GIFs) on this website. We may deploy these tags and cookies through a web analytical service partner, which may locate and store the respective information, including your IP address, in a foreign country that may protect the protection of personal data differently than the country where such information is collected. These tags are placed on different pages of this website and we use this technology to measure the registered user’s responses to our websites, including how many times a page is opened and which information is consulted, as well as to measure the use of this page.\nGoogle Analytics\nThis website uses Google Analytics, a web analytics service provided by Google, Inc. (\"Google\"). Google Analytics uses cookies. The information generated by the cookie about your use of this website is generally transferred to a Google server in the United States and stored there. Because we have activated “internet protocol anonymization” on this website, Google shortens your IP address at a point within the European Economic Area before transfer to the United States. This means that the full IP address will be transferred to Google in the United States only in exceptional circumstances for shortening there.\nGoogle will use the received information to evaluate your use of this website for Biogen, to compile reports on website activity, and to provide other services related to website usage and internet usage. The IP address provided by your browser as part of Google Analytics will not be merged with any other Google data.\nHow can I control the cookies that you use on this website?\nMost web browsers allow control of cookies through the browser settings. You can set your browser to notify you when you receive a cookie, which will enable you to decide if you want to accept it or not. However, if you do not accept a particular cookie, certain elements of the website may not function correctly or completely.\nYou can prevent Google from collecting and processing your data (including your IP address) related to your use of this website, by downloading and installing the browser plug-in available at the following link: http://tools.google.com/dlpage/gaoptout?hl=en.\nIf you do not allow any cookies from our website, some functionalities and content may be affected and may not work properly.\nTo find out more about cookies, including how to see what cookies have been set and how to the delete them, visit www.allaboutcookies.org.\nChanges to the Cookies Policy\nWe may update the Cookies Policy for our website. We therefore recommend that you re-read this policy every time you access our website so that you are adequately informed about how and why we use cookies.\nThese are the specific cookies we use on this website, with information on how they function:"
    }
]