[
    {
        "Ticker": "CEG",
        "Company": "Constellation Energy",
        "Source_URL": "https://www.constellation.com/",
        "Content_Type": "Website Content",
        "Raw_Text": "It's Time to Make a Power Move\nSign Up for a Residential Plan Today\nAs described in our Privacy Policy, we use cookies and other tracking technologies when you visit our website. When these cookies are set by our partners, they may result in the collection of information about your use of our website by those partners. We offer all individuals the ability to make choices regarding our use of cookies when we use cookies to provide you with a more personalized experience, analyze performance and traffic, and for advertising. You can review your options by clicking on “Optional Cookies” below. Please note you cannot opt out of Strictly Necessary Cookies as they are deployed in order to ensure proper functioning of our website.Privacy Policy\nThese Cookies are necessary for the websites to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in, or filling in forms. You can set your browser to block or alert you about these Cookies, but some parts of the websites will then not then work. These Cookies do not store any personally identifiable information.\nUnder the CPRA and CTDPA, you have the right to opt-out of the sale or sharing of your personal information to third parties. These cookies collect information for analytics and to personalize your experience with targeted ads. You may exercise your right to opt out of the sale or sharing of personal information by using this toggle switch. If you opt out we will not be able to offer you personalized ads and will not hand over your personal information to any third parties. Additionally, you may contact our legal department for further clarification about your rights as a California or Connecticut consumer by using this Exercise My Rights link.If you have enabled privacy controls on your browser (such as a plugin), we have to take that as a valid request to opt-out. Therefore we would not be able to track your activity through the web. This may affect our ability to personalize ads according to your preferences.\nThese Cookies allow us to count visits and traffic sources so we can measure and improve the performance of our websites. They help us to know which pages are the most and least popular and see how visitors move around the websites. If you do not allow these Cookies we will not know when you have visited our website and will not be able to monitor its performance.\nWe allow our advertising partners to set Cookies on our website to assist us with advertising our services to you on other websites and platforms. These partners may be used by those companies to build a profile of your interests in order to show you relevant ads. If you opt out of these Cookies, our partners will not be able to collect information about your activity on our website, but may continue to collect information on other sites.\nThese Cookies enable the website to provide enhanced functionality and personalization. They may be set by us or by third-party providers whose services we have added to our pages. If you do not allow these Cookies then some or all of these services may not function properly.\nThese Cookies are set by a range of social media services that we have added to the website to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these Cookies, you may not be able to use or see these sharing tools."
    },
    {
        "Ticker": "CEG",
        "Company": "Constellation Energy",
        "Source_URL": "https://www.constellation.com/about-constellation.html",
        "Content_Type": "Website Content",
        "Raw_Text": "A leading competitive energy supplier, Constellation and its affiliates, Constellation NewEnergy®, Inc. and Constellation NewEnergy®-Gas Division, LLC, serve over 2 million homes and businesses including 75% of the Fortune 100, with electricity, natural gas and a comprehensive suite of customizable energy products and services. Constellation NewEnergy® procures and purchases electricity for customers and provides brokerage of electricity and natural gas to industrial, commercial and residential end users, consumers and customers.\nBy developing a robust, sustainable product portfolio, we help our customers reach their energy and sustainability goals. We are committed to advancing our sustainability products and services, including hourly carbon-free energy matching, Constellation Offsite Renewables (CORe) and Constellation Navigator, with innovative solutions that help address customers’ evolving needs."
    },
    {
        "Ticker": "CEG",
        "Company": "Constellation Energy",
        "Source_URL": "https://www.constellation.com/about-us/contact-us.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Contact Us\nResidential Customers\nLive Chat\nWe suggest using our online Live Chat feature to speak with a customer care representative, who will be happy to answer your questions and help resolve your issues as quickly as possible.\nTexas Customers:\nM-F 7am-8pm CST\nGeorgia Customers:\nM-F 8am-6pm EST\nOther Areas:\nM-F 8am-5pm EST\nPhone\nSocial Media\nYou can also contact Constellation through Facebook and Twitter. Our social media accounts are monitored from 9 am to 4 pm CST Monday through Friday.\nHome Services - Schedule a Service Online\nYou can schedule a service for your A/C system, water heater and more by using our online sign-up form. You’ll receive an email confirming your appointment, and a certified Constellation technician, electrician or plumber will arrive at the time and date you select.\nReporting an Ethics Concern\nAs the nation's leading competitive energy provider, Exelon believes our work is essential, and we are privileged to power our communities' homes, businesses, and economies. That's why our ethics, integrity, and business conduct matter. Learn More\nThe Audit Committee of the Exelon board of directors has adopted and oversees a process for the receipt, retention, investigation, and resolution of concerns of improper business conduct, including potential violation of law or the Code of Business Conduct. The process, administered by the Ethics and Compliance Office, provides employees, shareholders, customers, contractors, suppliers, and others with multiple avenues for reporting concerns, including options that allow anonymity.\nThose who wish to report a concern online may use the Exelon Ethics Help Line Website. Or, to report a concern or ask a question by phone, please call 1-800-23ETHIC (1-800-233-8442)*.\n*For the most efficient response to customer service concerns please contact our Customer Support team using one of the numbers listed above."
    },
    {
        "Ticker": "CEG",
        "Company": "Constellation Energy",
        "Source_URL": "https://www.constellation.com/solutions/for-your-home/residential-renewal.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Thanks for renewing with Constellation\nRenewal Received For:\n,\nAccount number:\nYour Plan Selection:\nRenewal Questions? Call 866-711-6250\n*Wind Power Plan Notice. The electricity supply service includes renewable energy certificates sourced from wind power generators within the United States in an amount equal to 100% of the accounts’ usage, in addition to the mandatory renewable portfolio standard requirements for the state in which the accounts are located, during the term of this agreement. Applies to Wind Power plans only.\nThe prices for the plans provided are updated regularly in accordance with market changes. The price you see now may not be available after today. Renew your energy supply plan to keep your low energy rate and protection against rate volatility."
    },
    {
        "Ticker": "CEG",
        "Company": "Constellation Energy",
        "Source_URL": "https://www.constellation.com/solutions/for-your-commercial-business/emerging-technology.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Emerging Tech: Powering the Energy Evolution\nTechnology is constantly evolving, and Constellation is committed to providing the analytics and advanced products that help customers build, measure, implement and report on their energy and sustainability strategies. To meet this commitment, we stay on the cutting edge of technology and offer a variety of solutions that customers may not find elsewhere.\nConstellation Technology Ventures (CTV) serves as a vehicle for innovative solutions that meet the needs of customers. By investing in emerging energy technology companies, CTV identifies potential new solutions and develops strategic partnerships and investments for Constellation and its stakeholders.\nData centers have become critical to our digital world as technology continues to evolve. With electricity accounting for nearly 80% of data centers’ cost of goods, Constellation offers a comprehensive approach to energy strategy, carbon-free solutions, optimization and reporting to meet this growing demand."
    },
    {
        "Ticker": "CEG",
        "Company": "Constellation Energy",
        "Source_URL": "https://www.constellation.com/solutions/for-your-commercial-business/emerging-technology/technology-ventures.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Investing in Our Future\nConstellation Technology Ventures (CTV) is the venture investing organization within Constellation, the nation’s leading clean energy generator and competitive energy provider. CTV invests in companies exploring innovative energy technologies and business models, building a portfolio that represents a broad range of development stages and technology types. CTV catalyzes growth for these companies by providing equity capital, management expertise, and access to the broad and diverse Constellation commercial enterprise.\nOur Mission\nThe mission of Constellation Technology Ventures is to drive innovation by investing in venture-stage energy technology companies that can provide new solutions to Constellation and its customers. CTV seeks to:\n- Be a leader among diversified energy companies in funding innovative energy solutions\n- Engage with technology companies that have the potential to complement or disrupt Constellation’s core businesses, leading to commercial growth opportunities for innovative startups while positioning Constellation as a technology-forward energy partner to its customers\n- Create future business opportunities in emerging energy markets\nCTV goes beyond capital investment by actively working with company leadership to deploy the company’s products via Constellation’s commercial platform. CTV invests across the energy technology landscape and in companies at various stages of development. Initial investment size generally ranges between $1M and $10M."
    },
    {
        "Ticker": "CEG",
        "Company": "Constellation Energy",
        "Source_URL": "https://www.constellation.com/solutions/for-your-commercial-business/emerging-technology/data-centers.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Addressing the Energy Challenges of Today and Tomorrow\nData centers are the backbone of the digital economy, powering everything from cloud computing and e-commerce to AI. Constellation understands the unique challenges and opportunities facing data centers and has extensive experience providing customized solutions that fit the specific needs and objectives of data center customers.\nAs an industry leader in both wholesale and retail markets, Constellation has a unique advantage. Our commitment is to empower data centers and provide sustainable and cost-effective energy solutions.\nEnergy Supply\nThere are two ways to power data centers – grid supplied or co-located at an existing power plant.\nFor those seeking grid-supplied solutions, Constellation is the leading retail energy supplier, providing a robust set of solutions, including budget forecasting, risk management and a variety of flexible pricing and products.\nAdditionally, Constellation offers the backup power generation expertise, reliability and value that are critical for grid-supplied data centers with initial onsite generation needs.\nClean Energy Strategy\nFor grid-supplied data centers, Constellation offers renewable project sourcing and retail integration, including more than 2,500 MW for customers since 2015. With strong developer relationships, integration of risk management, fixed and flexible pricing options, management of third party PPAs, and RECs tracking and retirement, Constellation ensures a comprehensive clean energy strategy.\nEnergy Optimization\nConstellation can help customers leverage the flexibility of any existing behind-the-meter assets at customer sites to optimize energy costs without impacting operations and integrate offsite carbon-free energy purchasing strategies (e.g. hourly carbon-free energy).\nData & Reporting\nView, or connect, to data in a digital platform that provides a convenient, single access point. This includes facilities real-time budget forecasting and comprehensive, hourly GHG reporting.\nBy delivering comprehensive energy strategies, our robust supply, clean energy and advanced energy optimization work together to enhance efficiency and reduce risk. With unparalleled market access and industry-leading expertise, we'll work with you to drive innovation and sustainability in the digital economy. Let us help you harness the power of energy to propel your data center into a more efficient future."
    },
    {
        "Ticker": "CEG",
        "Company": "Constellation Energy",
        "Source_URL": "https://www.constellation.com/solutions/for-your-commercial-business/emerging-technology/energy-optimization.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Managing Energy Demand with Load Response Programs\nBusinesses face increasing pressure to manage energy consumption as energy costs rise, demand grows and new challenges emerge across the energy landscape. As businesses look for ways to optimize their energy strategies and reduce costs, implementing advanced solutions is key to meeting operational, financial and sustainability goals.\nMany businesses operate mission-critical systems that require uninterrupted performance, making it difficult to implement energy-saving strategies that require curtailment or infrastructure changes. Smarter, more adaptive strategies can help businesses overcome these barriers while addressing rising demand from AI data centers and electrification, aging infrastructure and limited capital for upgrades.\nLeveraging Load Response Strategies\nAs the demand for energy grows, businesses need flexible solutions that reduce strain on the grid while delivering financial and operational value. Constellation’s Energy Optimization services, powered by GridBeyond’s intelligent energy platform, can help businesses reduce costs, earn revenue and support grid resiliency through strategic load response programs.\nConstellation, through its relationship with GridBeyond, has a variety of tailored strategies that use machine learning to analyze equipment and market data, identifying the optimal times to curtail. These strategies provide cost-effective ways to reduce peak demand, avoid new generation costs and improve grid efficiency:\n- Peak Response: Reduces demand-based charges by curtailing your load when Constellation notifies of peak demand hours on the grid.\n- Price Response: Provides revenue through on-bill credits for curtailing load when Constellation notifies of peak energy market prices.\n- Demand Response: GridBeyond’s Demand Response program generates revenue opportunities through participation in load response programs offered by grid operators.\nBacked by predictive analytics and automation, each program is designed to maximize value and efficiency. This allows businesses to tailor their energy strategies to meet their unique operational needs and sustainability goals without compromising performance.\nImplementing Demand Response Solutions\nAs part of our Energy Optimization services, GridBeyond's demand response solutions offer an efficient and cost-effective way to earn revenues, support grid reliability and align sustainability goals. Both demand response options deliver measurable benefits through grid-focused participation and customer-first program design, so businesses can eliminate the challenges and focus on their operations.\nStrengthening Grid Reliability and Efficiency\nCurtailing load during high-demand periods helps businesses strengthen grid reliability while avoiding the need for costly infrastructure expansion. By making smarter use of existing capacity, organizations can maintain operational continuity and contribute to a more stable energy system.\nThis demand-side flexibility also helps reduce reliance on carbon-intensive peaking plants, aligning with both economic and environmental goals. Through targeting load curtailment during critical hours, these programs help businesses lower electricity costs, avoid the need for new power plant construction and enable sustainable growth – all while advancing a more efficient and reliable energy future.\nDesigning Smarter Curtailment Strategies\nTailored curtailment strategies help commercial and industrial businesses reduce costs and minimize operational impact while supporting long-term sustainability and resiliency goals – all without compromising performance.\nAdvancing Sustainability Planning\nConstellation empowers businesses to confidently plan and invest in sustainability initiatives. From energy efficiency upgrades to automation and renewable energy certificates, our programs provide the financial certainty needed to support long-term ESG goals.\nComparing Your Demand Response Options\nTo help you evaluate which demand response solution best fits your energy strategy, the table below outlines key differences between our offerings to support informed decision-making:\nStandard Demand Response |\nEnhanced Demand Response |\n|\n|\n*100% revenue share applies for the first two years. If the agreement is extended, 100% applies up to $250/MWD; revenues above $250/MWD are shared at 95%.\nDelivering Results with Energy Optimization Services\nConstellation has a proven history of helping businesses navigate the demands of a changing energy landscape. Our Energy Optimization services turn challenges into opportunities by empowering businesses to manage energy more strategically to achieve their financial, sustainability and operational needs."
    },
    {
        "Ticker": "CEG",
        "Company": "Constellation Energy",
        "Source_URL": "https://www.constellation.com/energy-101/blog/blog-policy.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Constellation Blog Rules, Terms and Policy\nBy using this blog, you agree to the terms of this Blog Policy as well as the Privacy Policy, the Legal Disclaimer and the Linking Policy. In addition to these terms and policies, here are specific rules that apply to this blog:\n- We will listen to you and join in the conversations. We will engage in the conversations on this blog. Therefore, some of the individuals posting to this site, including the moderators, will be employees of Constellation. However, the comments and opinions of any Constellation employees appearing on this blog are their personal opinions only and may not necessarily be those of Constellation, its management, or other employees. Note also that the content on this blog is provided for informational purposes only and is not meant to be an endorsement or representation by Constellation or any other party.\n- We moderate this blog. We have the right to review all submissions to this blog before they are posted. We may not post comments that violate this Policy and we may remove comments on the blog if they are off-topic or disrespectful. Because of this process, submissions to this blog may not immediately be visible. Please allow us some time to review submissions, and avoid sending us multiple copies of the same submission if you don’t see it posted right away.\n- We want conversations to be polite, on-topic, and respectful. Keep all submissions focused on the topic being discussed. Do not include any content that is, or could reasonably be considered, defamatory, obscene or sexually explicit, illegal or unlawful, inflammatory, threatening, infringing the privacy rights of any person, or infringing the intellectual property rights of any person or entity. If you have any complaints about content on the blog, contact us directly at WebAgent@constellation.com.\n- We want this blog to be a safe place to have conversations. We welcome submissions that comply with the policies and terms that apply to this blog, but will protect the blog from abuse or other similar activities. For example, we will decline to post submissions from those who submit spam or other unwanted communications by refusing to post submissions from specific Internet protocol (IP) addresses or e-mail addresses. We also will not post comments if they contain certain content in submissions. For example, we may not post some HTML code, links to websites, or e-mail addresses.\n- We respect your privacy. We will ask you to provide a valid e-mail address in order to register to make submissions to this blog. We won’t publish your e-mail address, but we may use it to contact you directly if we need to communicate with you.\n- We want you to remember that published submissions are public. Please don’t submit any information to us that you don’t want to be publicly available. For example, we recommend against posting your full name, address, telephone number, e-mail address, or any other information that can be used to identify you directly. You understand that blog submissions are not confidential and are outside of the scope of the Privacy Policy.\n- We ask you to be responsible for your blog content. By posting on this blog, you agree to be solely responsible for the content of all information you contribute, link to, or otherwise upload to the blog and release Constellation from any liability related to your use of the blog. You also grant to Constellation a worldwide, perpetual, irrevocable, royalty-free and fully-paid, transferable (including rights to sublicense) right to exercise all copyright, publicity, and moral rights with respect to any content you provide, and you represent that all content submitted is either original or that you have the right to grant these stated rights to Constellation.\n- We ask you to address personal customer service and support questions to our customer support team. If you want to talk about customer service issues, feel free to do so on the blog, but there are more direct ways of solving individual customer service and support issues. You can find the answers to many questions about Constellation’s products and services on our website located at www.constellation.com. You can also learn how to contact Constellation in many different ways including by phone, or by e-mail at our Contact Us page.\n- Constellation Entities. Constellation NewEnergy, Inc., Constellation NewEnergy–Gas Division, LLC, Inc. and their respective affiliates (referred to as the “Constellation Entities”) are separate legal entities that use the “Constellation NewEnergy” and “Constellation” names as well as “Constellation” trademark and associated logo for marketing and advertising purposes. No obligation on the part of any Constellation Entity should be deemed to arise through the use of such names or marks and nothing in this material is intended to override the legal separateness of each of the Constellation Entities. Statements made may reflect the combined experience or offerings of one or more of the Constellation Entities and not necessarily each or any specific Constellation Entity. Nothing in these materials constitutes an offer to sell or purchase regulated products or services by any Constellation Entity in any jurisdiction in which the purchase or sale of such regulated products or services by such entity is prohibited. Not all services on our website are available in all jurisdictions. No claim is made that the electricity supplied in any transaction described or proposed was generated from a specific generation facility or renewable resource.\n- New Jersey. Constellation NewEnergy, Inc. provides electric generation service to residential customers in the ACE, PSEG and JCPL service territories of New Jersey. For more information regarding price and environmental characteristics of our New Jersey residential service, click here and for our commercial and industrial service in New Jersey and throughout other markets, click here."
    },
    {
        "Ticker": "CEG",
        "Company": "Constellation Energy",
        "Source_URL": "https://www.constellation.com/content/constellationenergy/en/our-company/our-story/about-constellation",
        "Content_Type": "Website Content",
        "Raw_Text": "Constellation Signs Hourly Carbon-Free Energy Matching Agreement with Microsoft to Support Clean-Powered Data Center in Boydton, VA....\nRead More\nConstellation Starts Production at Nation’s First One Megawatt Demonstration Scale Nuclear-Powered Clean Hydrogen Facility at the Nine Mile Point Nuclear Plant in Oswego, NY....\nRead More\nConstellation joins the Midwest Alliance for Clean Hydrogen (MachH2) to pursue federal funding for development of a Midwest hydrogen hub....\nRead More\nConstellation announnces 100/100/100 climate commitment. Committing that our owned electricity generation will be 95 percent carbon-free by 2030 and 100 percent carbon-free by 2040, planning to reduce operations-driven emissions by 100 percent by 2040 and providing 100 percent of our C&I customers with customer-specific information on their GHG impact for their facilities. ...\nRead More\nConstellation Energy Corporation is formed by the successful separation of Constellation and Exelon Generation from their former parent company, Exelon Corporation, creating largest provider of clean energy and sustainable solutions to homes, business, and public sector customers across the United States. ...\nRead More"
    },
    {
        "Ticker": "CEG",
        "Company": "Constellation Energy",
        "Source_URL": "https://www.constellation.com/about-us.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Constellation Signs Hourly Carbon-Free Energy Matching Agreement with Microsoft to Support Clean-Powered Data Center in Boydton, VA....\nRead More\nConstellation Starts Production at Nation’s First One Megawatt Demonstration Scale Nuclear-Powered Clean Hydrogen Facility at the Nine Mile Point Nuclear Plant in Oswego, NY....\nRead More\nConstellation joins the Midwest Alliance for Clean Hydrogen (MachH2) to pursue federal funding for development of a Midwest hydrogen hub....\nRead More\nConstellation announnces 100/100/100 climate commitment. Committing that our owned electricity generation will be 95 percent carbon-free by 2030 and 100 percent carbon-free by 2040, planning to reduce operations-driven emissions by 100 percent by 2040 and providing 100 percent of our C&I customers with customer-specific information on their GHG impact for their facilities. ...\nRead More\nConstellation Energy Corporation is formed by the successful separation of Constellation and Exelon Generation from their former parent company, Exelon Corporation, creating largest provider of clean energy and sustainable solutions to homes, business, and public sector customers across the United States. ...\nRead More"
    },
    {
        "Ticker": "CEG",
        "Company": "Constellation Energy",
        "Source_URL": "https://www.constellation.com/solutions/for-your-home/residential-signup.html",
        "Content_Type": "Website Content",
        "Raw_Text": "We are sorry, this enrollment has been submitted.\nThank you for your interest in Constellation. At this time we are unable to complete your enrollment.\nWe are sorry but we cannot proceed with your previous enrollment attempt at this time. If you still want to Enroll with us, please start a new application.\nWe are sorry but your last credit check was completed more than a month ago. If you still want to Enroll with us, please start a new application.\nWe are sorry but we cannot find previous enrollment attempt at this time.\nWe're sorry. The plan you selected is unavailable. Please confirm your current utility provider below to see all plans available in your area.\nWe are sorry but plan you selected is no longer available. Please select a new plan before completing your enrollment.\nAttention: If you received 2 emails inviting you to complete your enrollment, please use the link in the first email received. We apologize for the inconvenience.\nThanks For Signing Up With Constellation!\nYour order number is\nWe've received your order. When your order is complete we'll send a detailed confirmation email to 24 hours, please contact us at:\nGA - CustomerCareGA@constellation.com\nAll Other Markets - home@constellation.com.\nAdditional Fees:\nEnrollment Received For:\n,\nSpecial Code Used:\nOffer Code: Referral Code:\nThanks For Signing Up With Constellation!\nYour order number is\nWe've received your order. When your order is complete we'll send a detailed confirmation email to 24 hours, please contact us at:\nGA - CustomerCareGA@constellation.com\nAll Other Markets - home@constellation.com.\nAdditional Fees:\nEnrollment Received For:\n,\nSpecial Code Used:\nOffer Code: Referral Code:\nOffers for residential customers only. Looking for small business plans?\nConstellation Renewable Product: For those products described as “renewable” or “green,” the electricity supply service includes renewable energy certificates sourced from wind and/or solar power generators within the United States (\"RECs\") in an amount equal to 100% of the Accounts' usage, over and above any mandatory renewable portfolio or clean standard requirements for the state in which the Accounts are located, during the term of this Agreement. Constellation pairs 100% of electricity usage with RECs, over and above any RPS requirements.\n† 90-Day Guarantee Period. You may terminate your Contract without incurring an early termination fee within 90 days after entering into it (the \"Guarantee Period\") by notifying us in writing or by calling our customer care center: Texas 1-888-900-7052, Georgia 1-877-677-4355, All other markets 1-855-465-1244. Upon your termination during the Guarantee Period we will return you to being supplied by the Utility at your next available meter read date, or if you are a customer in the Atlanta Gas Light area your service will continue with Constellation until you complete a switch to your selected marketer, and you will remain responsible for payment for any energy related costs and charges incurred under this Contract through such meter read or termination date. Not applicable in Texas. Not applicable in Connecticut or Illinois where residential customers are never charged an early termination fee.\nOhio Residents: To download our Environmental Disclosure, please click here.\nIllinois Residents: Illinois Residents (Renewable Product Offerings): For Illinois renewable product offers, at the time of offering on this website, Constellation has not committed to a particular location or locations for the Renewable Energy Certificates used to fulfill its REC obligations under the terms of the product offer. Subject to change, Constellation does not anticipate pairing any of a customer’s energy usage with RECs from renewable energy resources located within the State of Illinois."
    },
    {
        "Ticker": "CEG",
        "Company": "Constellation Energy",
        "Source_URL": "https://www.constellation.com/solutions/for-your-home/solutions-by-state/connecticut-energy/ct-sign-up-faqs.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Signing Up for Service in Connecticut: Your FAQ’s Answered\n- Home Page\n- Constellation’s Energy Solutions\n- For Your Home\n- Solutions by State\n- Connecticut Energy\n- Signing Up for Service in Connecticut: Your FAQ’s Answered\nWhether this is your first time signing up with an electricity provider or you're switching suppliers, you may have questions about the enrollment process in Connecticut. We've created some FAQs to help you better understand what happens when you choose Constellation to be your electricity provider.\n- Should I receive a confirmation email from Constellation? Yes, you should receive a confirmation email from Constellation within 48 hours of signing up for service with us. This email will provide the details of the plan you selected, along with an explanation of the switch process in Connecticut.\n- How long does the switch process in Connecticut take? Switching from your utility to a supplier, like Constellation, can take up to 2 billing cycles. Once we receive your request to switch, a notification is then sent to your current utility company to accept or reject the request. Once we are notified that your request to switch has been accepted, you will receive a Welcome Packet from us, and you’ll see Constellation as a line item for your supply costs on your next utility bill.\n- How do I know if my switch request was rejected? If you are enrolling with Constellation for the first time and we receive an enrollment rejection from your utility, we will notify you via email.\n- What should I do if my request to switch is rejected? In most cases, if you receive a rejection email it will ask you to Contact Us to determine the reason and if the issue can be remediated. Connecticut residents who are rejected for a hardship block are specifically asked to contact their local utility, not Constellation, to have the block removed.\nIf you received a notification asking you to contact your utility about a hardship block on your account, we will automatically resubmit your request to switch in 3 weeks.\nIf you receive any other type of rejection notice from us, you will need to Contact Us.\n- Why does it take so long for the switch process to happen? Switching processes vary from state to state and utility to utility. Like all suppliers, Constellation submits your enrollment request to the local utility, and we receive a date for your start date to go into effect based on the switching processing guidelines in your area.\n- Why does the utility need to approve my switch? Each party in your service area has a part to play. Part of the utility’s responsibility in deregulation is to review enrollment requests and approve or reject based on established guidelines set up by the state and/or utility.\n- My bill is still showing my utility as my supplier, and I signed up months ago. What is going on? If you signed up to switch to Constellation, and it has been more than 2 billing cycles, we suggest you Contact Us so that our Customer Care team can research your request."
    },
    {
        "Ticker": "CEG",
        "Company": "Constellation Energy",
        "Source_URL": "https://www.constellation.com/solutions/for-your-home/solutions-by-state/illinois-energy/IL-variable-rates.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Illinois Current & Historical Month to Month Variable Rates\nThis rate is a variable rate that may be adjusted either upward or downward. Rates under the Variable Month-to-Month plan are as follows:\nYour rate is based on the monthly rate in effect at the time your invoice is generated."
    },
    {
        "Ticker": "CEG",
        "Company": "Constellation Energy",
        "Source_URL": "https://www.constellation.com/energy-101/blog.html",
        "Content_Type": "Website Content",
        "Raw_Text": "For Residential and Small Business:\nStay up to date with recent energy news and information that can help you make informed decisions, reduce energy consumption, save money and more.\nVisit the Residential and Small Business Blog\nFor Commercial & Industrial:\nJoin discussions that are shaping the future of energy, including news, tips and market updates from experts on a variety of timely topics.\nVisit The Commercial & Industrial Blog\nFrom Our Satellite Brands:\nConstellation Clearsight provides safer, more effective inspections of critical infrastructure by using cutting-edge drone, robot, sensor, and software technologies.\nVisit the Constellation Clearsight Blog"
    },
    {
        "Ticker": "CEG",
        "Company": "Constellation Energy",
        "Source_URL": "https://www.constellation.com/solutions/for-your-commercial-business/emerging-technology/data-centers/data-centers-contact-us.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Thank you for your interest in data centers with Constellation.\nPlease fill out as much information as possible and we’ll get back to you within 7 days.\nThank you for your interest in data centers with Constellation.\nPlease fill out as much information as possible and we’ll get back to you within 7 days.\nThese Cookies are necessary for the websites to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in, or filling in forms. You can set your browser to block or alert you about these Cookies, but some parts of the websites will then not then work. These Cookies do not store any personally identifiable information.\nUnder the CPRA and CTDPA, you have the right to opt-out of the sale or sharing of your personal information to third parties. These cookies collect information for analytics and to personalize your experience with targeted ads. You may exercise your right to opt out of the sale or sharing of personal information by using this toggle switch. If you opt out we will not be able to offer you personalized ads and will not hand over your personal information to any third parties. Additionally, you may contact our legal department for further clarification about your rights as a California or Connecticut consumer by using this Exercise My Rights link.If you have enabled privacy controls on your browser (such as a plugin), we have to take that as a valid request to opt-out. Therefore we would not be able to track your activity through the web. This may affect our ability to personalize ads according to your preferences.\nThese Cookies allow us to count visits and traffic sources so we can measure and improve the performance of our websites. They help us to know which pages are the most and least popular and see how visitors move around the websites. If you do not allow these Cookies we will not know when you have visited our website and will not be able to monitor its performance.\nWe allow our advertising partners to set Cookies on our website to assist us with advertising our services to you on other websites and platforms. These partners may be used by those companies to build a profile of your interests in order to show you relevant ads. If you opt out of these Cookies, our partners will not be able to collect information about your activity on our website, but may continue to collect information on other sites.\nThese Cookies enable the website to provide enhanced functionality and personalization. They may be set by us or by third-party providers whose services we have added to our pages. If you do not allow these Cookies then some or all of these services may not function properly.\nThese Cookies are set by a range of social media services that we have added to the website to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these Cookies, you may not be able to use or see these sharing tools."
    },
    {
        "Ticker": "CEG",
        "Company": "Constellation Energy",
        "Source_URL": "https://www.constellation.com/content/constellationenergy/en/our-work/innovation-and-advancement/applied-technology",
        "Content_Type": "Website Content",
        "Raw_Text": "Lower-Cost, Zero Emission Power / NET Power\nNET Power, LLC is a strategic venture between Constellation, 8 Rivers, McDermott, and Occidental Petroleum. The mission of NET Power is to provide advanced clean energy to consumers worldwide by generating lower-cost power with zero emissions. NET Power is a clean energy technology company that promotes, develops, and licenses a proprietary process for efficiently generating electricity from natural gas while capturing all CO₂ emissions. NET Power’s revolutionary technology promises to enable the world to meet its climate goals without paying more for electricity. Learn more.\nStorage / Volta Energy Technologies\nConstellation engages in energy storage technology development through a strategic relationship with Volta Energy Technologies. Through this relationship, Constellation has invested in four storage companies with transformational solutions relevant to the grid. Constellation and Albemarle Corporation, the leading lithium supplier for energy storage and other applications, were the founding investors in Volta in 2017. Learn more.\nTotal Carbon Accounting / Kevala\nConstellation collaborated with Kevala, Inc., a nationwide leader in energy data and grid analytics, and leading energy and utility providers National Grid and ComEd, an Exelon company, on groundbreaking new carbon accounting research in 2021. The companies released a joint whitepaper, \"Total Carbon Accounting: A Framework to Deliver Localized Carbon Intensity Data,\" which explores advanced analytic methods designed to better compute the carbon intensity of grid electricity with higher degrees of geographic and temporal granularity. These methods can help ensure the energy sector is best equipped to evaluate, prioritize, and measure decarbonization activities in the future. In leveraging TCA's comprehensive methodology, key energy stakeholders can more accurately match carbon-free power supplies to load forecasts. Click here to download the whitepaper.\nU.K. Small Modular Reactors / Rolls-Royce\nRolls-Royce Holdings plc and Constellation signed a Memorandum of Understanding in 2020 to pursue the potential for Constellation to operate compact nuclear power stations both in the United Kingdom and internationally. Constellation will be using its operational experience to assist Rolls-Royce in the development and deployment of the UKSMR. Learn more.\nConstellation is more than just a leading energy supplier. It is also a pioneer in creating and commercializing cutting-edge technologies and integrating new solutions throughout its business, Constellation delivers value to its customers, communities, and shareholders. Here are some examples of how Constellation is shaping the future of energy.\nPowering Data Centers Cleanly, Reliably\nNearly every business transaction, internet search, scientific breakthrough, or healthcare innovation that powers our economy and improves our way of life at some point passes through one or more data centers, which house the technology that makes up the backbone of our nation’s digital economy. Data centers are also considered critical infrastructure, essential to national security and the nation’s financial, healthcare, communications and transportation systems.\nBecause of the central role they play in our daily lives, data centers need energy that is reliable in every hour of every day, and it has to be clean. That’s why Constellation is working with technology companies to power the next generation of data centers with nuclear energy, which is the only source of carbon-free energy that can operate reliably in any kind of weather, every day.\nThe nation’s dependence on data centers is only growing as ever more powerful computers and artificial intelligence combine to accelerate the pace of innovation, leading to technological advancements that will transform our lives as much – if not considerably more -- as the printing press, steam engine and Internet did in past generations.\nMajor technology companies are in a global race to develop new, hyperscale data centers to power innovations in artificial intelligence, which has the potential to transform entire industries and lead to technological breakthroughs in everything from medicine to climate change solutions.\nThe U.S. and other countries are competing to lead development of this transformational technology and capture the jobs and economic growth that it will deliver. That’s why nuclear energy and data centers go together like peanut butter and jelly. By co-locating data centers next to a nuclear plant, we can quickly deliver clean energy directly to the facility and reduce the need to build new transmission lines to serve this critical infrastructure, while also ensuring that our nation’s nuclear fleet continues to operate well into the future. That saves consumers money, benefits grid reliability and makes more efficient use of clean, carbon-free energy.\nCo-location can be a more affordable, efficient and expedient way to build our nation’s growing data center economy while creating thousands of jobs and minimizing costs for utility customers. Pairing nuclear plants with data centers will allow us to extend the life of these clean, safe and reliable facilities and deliver a win for the environment, large load customers and utility customers alike. Learn more about data centers\nDirect Air Capture / Department of Energy\nIn April 2022, the U.S. Department of Energy (DOE) awarded a $2.5 million grant to Constellation and its project partners to explore the benefits of constructing direct air capture (DAC) technology at the company’s Byron nuclear energy plant. While nuclear plants do not produce any carbon emissions, direct air capture would remove carbon dioxide directly from the atmosphere, a possible next-generation technology to help our nation combat the climate crisis.\nThe DAC project at Byron Generating Station could capture 250,000 tons of CO2 each year, reducing global carbon emissions and helping to decarbonize energy intensive sectors of the economy. The study will also focus on the potential for a nuclear plant to become the center of a direct air carbon capture hub, partnering the DAC technology with storage of CO2. Learn more.\nHourly Carbon-Free Energy Matching\nAchieving 100% carbon-free power is a key sustainability goal for many organizations. As customers make the transition to 100% carbon-free, many are looking to bridge the gap between their real-time electricity demand and available sources of carbon-free power. Currently, energy markets have limited options for tracking and matching carbon-free supply with demand on an hour-by-hour basis, and most organizations pursuing zero emissions power match their electricity use with renewable energy certificates, or RECs, on an annual basis. Learn more.\nHydrogen / Department of Energy\nConstellation was the recipient of a Department of Energy (DOE) grant in 2021 to explore the potential benefits of on-site hydrogen production at Nine Mile Point Nuclear Station in Oswego, NY. Constellation will partner with Nel Hydrogen, Argonne National Laboratory, Idaho National Laboratory, and the National Renewable Energy Laboratory to demonstrate integrated production, storage, and normal usage at the station. The project will generate an economical supply of hydrogen, a natural byproduct of nuclear energy, to be safely captured, stored, and potentially taken to market as a 100 percent carbon-free source of power.\nLearn more about this project and, more broadly, how clean hydrogen, produced by emissions-free power, holds the key to solving the climate crisis."
    }
]