[
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/",
        "Content_Type": "Website Content",
        "Raw_Text": "The Agentic Security Platform.\nUnified and built to secure the AI revolution.\nRecognition by trusted analysts\nFalcon platform bundles\nTry for 15 days\nFalcon\nFree Trial\n-\nNext-gen antivirusProtects against all types of threats, from malware and ransomware to sophisticated attacks, and deploys in minutes, immediately protecting your endpoints.\n-\nDevice controlProvides the visibility and precise control required to enable safe usage of removable media devices such as USB, SD card, and Thunderbolt devices across your organization.\n-\nMobile device protectionSafeguards your business from mobile threats with advanced protection that detects malicious activity and prevents unauthorized access on Android and iOS devices.\n-\nFirewall management\n-\nEndpoint detection and response\n-\nThreat intelligence & hunting\n-\nIdentity protection\n-\nIT hygiene\n-\nNext-gen SIEM\n-\nExpress supportAvailable to assist small and medium businesses with installation and operational concerns.\nSecurity essentials\nFalcon\nGo\n-\nNext-gen antivirusProtects against all types of threats, from malware and ransomware to sophisticated attacks, and deploys in minutes, immediately protecting your endpoints.\n-\nDevice controlProvides the visibility and precise control required to enable safe usage of removable media devices such as USB, SD card, and Thunderbolt devices across your organization.\n-\nMobile device protectionSafeguards your business from mobile threats with advanced protection that detects malicious activity and prevents unauthorized access on Android and iOS devices.\n-\nFirewall management\n-\nEndpoint detection and response\n-\nThreat intelligence & hunting\n-\nIdentity protection\n-\nIT hygiene\n-\nNext-gen SIEM\n-\nExpress supportAvailable to assist small and medium businesses with installation and operational concerns.\nEnhanced protection\nFalcon\nPro\n-\nNext-gen antivirusProtects against all types of threats, from malware and ransomware to sophisticated attacks, and deploys in minutes, immediately protecting your endpoints.\n-\nDevice controlProvides the visibility and precise control required to enable safe usage of removable media devices such as USB, SD card, and Thunderbolt devices across your organization.\n-\nMobile device protectionSafeguards your business from mobile threats with advanced protection that detects malicious activity and prevents unauthorized access on Android and iOS devices.\n-\nFirewall managementDelivers simple, centralized host firewall management, making it easy to manage and control host firewall policies.\n-\nEndpoint detection and response\n-\nThreat intelligence & hunting\n-\nIdentity protection\n-\nIT hygiene\n-\nNext-gen SIEM\n-\nExpress supportAvailable to assist small and medium businesses with installation and operational concerns.\nAdvanced protection\nFalcon\nEnterprise\n-\nNext-gen antivirusProtects against all types of threats, from malware and ransomware to sophisticated attacks, and deploys in minutes, immediately protecting your endpoints.\n-\nDevice controlProvides the visibility and precise control required to enable safe usage of removable media devices such as USB, SD card, and Thunderbolt devices across your organization.\n-\nMobile device protectionSafeguards your business from mobile threats with advanced protection that detects malicious activity and prevents unauthorized access on Android and iOS devices.\n-\nFirewall managementDelivers simple, centralized host firewall management, making it easy to manage and control host firewall policies.\n-\nEndpoint detection and responseDelivers continuous, comprehensive endpoint visibility and automatically detects and intelligently prioritizes malicious activity to ensure nothing is missed and potential breaches are stopped.\n-\nThreat intelligence & huntingPartners you with a team of elite cybersecurity experts to hunt continuously within the Falcon platform for faint signs of sophisticated intrusions, leaving attackers nowhere to hide.\n-\nIdentity protection\n-\nIT hygiene\n-\nNext-gen SIEM\n-\nExpress supportAvailable to assist small and medium businesses with installation and operational concerns.\nCustomers trust CrowdStrike to protect what matters most\n- 01\n- 02\n- 03\nExperience industry-leading solutions from one powerful platform\n1Purchases of Falcon Go are limited to a maximum of 100 devices.\nGartner, 2025 Gartner® Magic Quadrant™ for Endpoint Protection Platforms (EPP), Evgeny Mirolyubov, Franz Hinner, Deepak Mishra, July 14, 2025\nGartner, Voice of the Customer for Endpoint Protection Platforms, Peer Editors, May 23, 2025\nGARTNER is a registered trademark and service mark of Gartner and Magic Quadrant is a registered trademark of Gartner, Inc. and/or its affiliates in the U.S. and internationally and are used herein with permission. All rights reserved. Gartner does not endorse any vendor, product or service depicted in its research publications, and does not advise technology users to select only those vendors with the highest ratings or other designation. Gartner research publications consist of the opinions of Gartner’s research organization and should not be construed as statements of fact. Gartner disclaims all warranties, expressed or implied, with respect to this research, including any warranties of merchantability or fitness for a particular purpose.\nThis graphic was published by Gartner, Inc. as part of a larger research document and should be evaluated in the context of the entire document. The Gartner document is available upon request from CrowdStrike."
    },
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/en-us/blog/",
        "Content_Type": "Website Content",
        "Raw_Text": "FEATURED ARTICLES\nCategories\n-\nArtificial Intelligence43\n-\nCloud & Application Security136\n-\nData Protection17\n-\nEndpoint Security & XDR331\n-\nEngineering & Tech84\n-\nExecutive Viewpoint176\n-\nExposure Management110\n-\nFrom The Front Lines197\n-\nNext-Gen Identity Security61\n-\nNext-Gen SIEM & Log Management107\n-\nPublic Sector40\n-\nSmall Business11\n-\nThreat Hunting & Intel204\nAI SPOTLIGHT\nRecent Articles\nCategories\nArtificial Intelligence\nCloud & Application Security\nThreat Hunting & Intel\n-\nCrowdStrike 2025 European Threat Landscape Report: Extortion Rises, Nation-State Activity Intensifies\nNov 03, 2025\n-\nCrowdStrike 2025 APJ eCrime Landscape Report: A New Era of Threats Emerges\nOct 20, 2025\n-\nCrowdStrike Identifies Campaign Targeting Oracle E-Business Suite via Zero-Day Vulnerability (now tracked as CVE-2025-61882)\nOct 06, 2025\nEndpoint Security & XDR\nEngineering & Tech\nExecutive Viewpoint\nFrom The Front Lines\nNext-Gen Identity Security\n-\nCrowdStrike Named Overall Leader in 2025 KuppingerCole ITDR Leadership Compass\nNov 10, 2025\n-\nCrowdStrike Named the Leader in 2025 Frost Radar for SaaS Security Posture Management\nOct 27, 2025\n-\nFrom Domain User to SYSTEM: Analyzing the NTLM LDAP Authentication Bypass Vulnerability (CVE-2025-54918)\nOct 22, 2025\nNext-Gen SIEM & Log Management\n-\nCrowdStrike Leads New Evolution of Security Automation with Charlotte Agentic SOAR\nNov 05, 2025\n-\nCrowdStrike Named a Visionary in 2025 Gartner® Magic Quadrant™ for Security Information and Event Management\nOct 10, 2025\n-\nCrowdStrike Boosts SOC Detection Content with Correlation Rule Template Discovery Dashboard\nSep 29, 2025\nPublic Sector\nExposure Management\nSmall Business\nData Protection\nResource Center\nDive into topics ranging from endpoint security and threat intelligence, to incident response and forensic services."
    },
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/en-us/platform/quarterly-falcon-platform-release-highlights/",
        "Content_Type": "Website Content",
        "Raw_Text": "Fall 2025 Release:\nAgentic. Unified. Secure.\nSee the latest innovations defining the future of protection — powered by AI, unified data, and the CrowdStrike Falcon® platform.\nIntroducing Charlotte Agentic SOAR\nPlatform Innovation Highlights\nReal-time data powering the agentic SOC\nFalcon Onum delivers clean, high-quality data pipelines that route, enrich, and stream telemetry at machine speed. Fuel the agentic SOC and respond up to 70% faster1 with the right data, in the right place, at the right time.\nSecure AI from cloud to code with AIDR\nCrowdStrike’s acquisition of Pangea expands our AI security capabilities to protect every layer of enterprise AI — from development to workforce use — with visibility, access control, and protection against prompt injection, malicious content, and data leakage to LLMs.\nUnleash your agentic security workforce\nCrowdStrike’s mission-ready agents automate repetitive security workflows and time-intensive tasks with elite judgment at machine speed, including malware analysis, threat hunting, vulnerability triage, and more. Accelerate investigations and free analysts to do more."
    },
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/en-us/platform/",
        "Content_Type": "Website Content",
        "Raw_Text": "The Agentic Security Platform.\nUnified and built to secure the AI revolution.\nLatest from\nSpeed up investigations, lower costs, stronger protection — powered by agentic security.\nExplore the Agentic Security Platform\nEnterprise Graph: The AI-Ready Data Layer\nEnterprise Graph unifies CrowdStrike’s pioneering graph technology with telemetry from across the enterprise to build a living, connected model of the enterprise – with one common query language built for AI.\nMission-Ready Agents: Automating Analyst Workflows\nCrowdStrike’s first fleet of agents are designed to handle critical security workflows and automate repetitive tasks better suited for machines, freeing analysts to focus on higher-value work and accelerating outcomes.\nCharlotte AI AgentWorks: Build and Deploy Agents at Scale\nCharlotte AI AgentWorks is the first no-code platform that lets any team quickly build, test, deploy, and manage trusted security agents. Using natural language, defenders can set goals, define data, and control agent behavior — without writing code.\nNew Dynamic User Experience\nNew persona-aware console delivers natural language querying, role-specific workspaces, and instant dashboards that let defenders see, visualize, and act across domains with a single click.\nOperating Center of the Agentic Ecosystem\nThe Agent Collaboration Framework makes Charlotte the SOC commander, securely connecting to systems, data, and agents for richer, more contextual investigations.\nSecure AI where AI happens\nSecure data, models, agents, identities, infrastructure, and interactions — from enterprise AI development through workforce AI usage.\nTrusted by organizations everywhere\nCrowdStrike recognized as a Leader\nCustomer Stories\n3Calculated by multiplying the average number of alerts triaged by Charlotte AI by a 5-minute triage time per alert as estimated by the Falcon Complete team. Individual results may vary based on factors such as total alert volume.\n5MITRE Engenuity ATT&CK®: Evaluations Enterprise Round 5 2023"
    },
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/platform/endpoint-security/",
        "Content_Type": "Website Content",
        "Raw_Text": "Detect the undetectable with CrowdStrike® Signal\nCrowdStrike Signal uses self-learning to build AI models for every host in your environment, looking beyond the benign to identify unknown threats. It pinpoints subtle, early-stage threat activity and takes action earlier in the attack chain to catch threats others miss.\nThe leader in endpoint security\nOnly CrowdStrike combines AI-powered detection, adversary intelligence, and pioneering indicators of attack to identify and stop modern attacks — catching ransomware, lateral movement, and stealthy intrusions alike.\nStop cross-domain attacks\nCrowdStrike extends protection beyond endpoints, unifying visibility across the CrowdStrike Falcon® platform to expose hidden threats that siloed tools miss. Expand protection with 10GB/day of third-party data ingest free via CrowdStrike Falcon® Next-Gen SIEM.\nPrecision detection meets autonomous response\nCrowdStrike pioneered EDR to quickly stop advanced attacks. Our adversary-driven approach delivers precise, context-rich detections, while agentic AI automates detection triage, investigations, and response — cutting MTTR from hours to minutes.\nOne agent. Zero complexity. Full coverage.\nSkip the complexity and tool sprawl. CrowdStrike’s single lightweight agent deploys in minutes and protects every major operating system, delivering instant security, fleet-wide visibility, and seamless scale.\nAI that transforms security operations\nCrowdStrike® Charlotte AI™ uses generative and agentic AI to act with the instincts of a seasoned analyst — crafting queries, building workflows, and responding autonomously with accuracy and speed. It’s like having your best security analyst on every alert, 24/7.\nCustomer Stories\nSee why organizations trust CrowdStrike Endpoint Security.\nWhat's new\n22024 SE Labs Enterprise Advanced Security (EDR) Ransomware Test\n3These numbers are projected estimates of average benefits based on recorded metrics provided by customers during pre-sale motions that compare the value of CrowdStrike with the customer’s incumbent solution. Actual realized value will depend on individual customer’s module deployment and environment.\n4Results are from IDC Business Value Report. Individual results may vary by customer.\n5CrowdStrike 2025 Threat Hunting Report"
    },
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/en-us/platform/charlotte-ai/",
        "Content_Type": "Website Content",
        "Raw_Text": "CrowdStrike® Charlotte AI\nThe brain of the\nagentic SOC\nUnify AI reasoning with human insight — accelerating outcomes across your entire security ecosystem.\nIntroducing Charlotte AI AgentWorks\nLatest from\nAdversaries are AI-accelerated\nThe gaps between attackers and defenders have never been wider — and they’re growing.\nClose the gaps with Charlotte AI\nAutomate repetitive tasks, accelerate outcomes, and free analysts to focus on high-value work.\nAI you can operationalize\nAutomate triage with battleground intelligence\nCharlotte AI gets smarter with every threat stopped. Trained on decisions of elite analysts, Charlotte AI triages detections, filters false positives, and surfaces only what matters.\nAccelerate investigations with human-agent collaboration\nCharlotte AI supercharges investigations, fusing analyst expertise with autonomous reasoning in a dynamic canvas. Guide investigations in real time — inject context, set priorities, and drive sharper, faster analysis.\nBuild and customize agents with Charlotte AI AgentWorks\nCharlotte AI AgentWorks is the first no-code platform that lets any team quickly build, test, deploy, and manage trusted security agents. Using natural language, defenders can set goals, define data, and control agent behavior — without writing code.\nOrchestrate your agentic security workforce\nCharlotte Agentic SOAR combines the precision of security automation with the adaptability of agentic reasoning. Building on Falcon Fusion SOAR, structured logic ensures consistency and control, while mission-ready agents think, decide and act in real time for agility when it matters most.\nDeploy AI safely and with full control\nCharlotte AI delivers speed without compromise, scaling agentic defense with accountability and control. With built-in controls, every answer is traceable, every action user-authorized, every decision grounded in validated data and aligned to your role.\nSee Charlotte AI in action\nReal-world stakes. Real-time scale. Real agentic defense.\nCustomer Stories\n4 Based on product telemetry of global customer triage volume performed by Charlotte AI, from February - August 2025.\n5 Accuracy rating is a measure of Charlotte AI triage decisions that match the expert decisions from the CrowdStrike Falcon Complete Next-Gen MDR team.\n6 Calculated by multiplying the average number of alerts triaged by Charlotte AI by a 5-minute triage time per alert as estimated by the Falcon Complete team. Individual results may vary based on factors such as total alert volume."
    },
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/platform/falcon-shield/",
        "Content_Type": "Website Content",
        "Raw_Text": "Monitor SaaS applications in minutes\nInstantly connect your SaaS apps to uncover misconfigurations, enforce governance, and gain actionable insights — all in minutes.\nProactive threat detection and response\nGet real-time alerts and automated responses to suspicious user behavior, login anomalies, and device issues — keeping your SaaS environment secured.\nSecure AI agents before they go rogue\nDiscover GPTs and Codex agents across SaaS platforms like Microsoft 365, Salesforce, and OpenAI. Map their system access, detect risky behavior, and contain threats — before automation turns into exploitation.\nHarden applications to prevent breaches\nUse over 5,000 built-in security checks and easily create custom Security Checks to detect misconfigurations and secure your entire SaaS stack.\nSecure identities and discover shadow apps\nFind and secure human and Non-Human Identities (NHI) that are over-permissioned, high risk, dormant, or partially deprovisioned. Detect and control all sanctioned and unsanctioned SaaS apps connected to your core SaaS stack, including malicious applications.\nSee Falcon Shield in action\nCustomer Stories\nSee why organizations trust Falcon Shield."
    },
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/en-us/platform/next-gen-identity-security/",
        "Content_Type": "Website Content",
        "Raw_Text": "Latest from\nAdversaries exploit identities to move fast\nand stay hidden\nSecure the full identity lifecycle across hybrid environments\nOne unified, AI-powered platform delivers complete visibility, proactive protection, and just-in-time privileged access — securing human, non-human, and AI identities across on-premises, cloud, and SaaS environments.\nSecure AI agents and the identities behind them\nAI agents and non-human identities now outnumber people — often deployed rapidly without security, creating critical blind spots attackers exploit. CrowdStrike secures them with real-time visibility and response.\nHow it works\nProtect every identity, everywhere\nGain comprehensive protection across every identity — human, non-human, AI, and SaaS — no matter where they live. With complete visibility and continuous risk assessment, CrowdStrike eliminates blind spots and proactively safeguards identities to stop breaches before they start.\nSecure the entire identity attack chain\nStop identity-based attacks at every stage. CrowdStrike enforces continuous, risk-based access, leverages AI-powered detection, and responds in real time with dynamic remediation — blocking adversaries before they can escalate privileges or move laterally.\nOne unified platform. Total security.\nEliminate silos and complexity with a unified platform that combines identity threat protection, secure privileged access, and SaaS security in one AI-native solution. Powered by a single sensor and console, CrowdStrike replaces fragmented tools with centralized visibility and response — stopping adversaries across endpoint, identity, cloud, and SaaS.\nJust-in-time privileged access\nMinimize risk with just-in-time access and eliminate standing privileges across on-premises, cloud, and SaaS environments. CrowdStrike dynamically provisions and revokes privileged access based on real-time risk — ensuring users and devices get exactly the access they need, only when they need it, and only under secure conditions.\nPhishing-Resistant MFA with FalconID\nEliminate identity threats like credential phishing, MFA fatigue, and session hijacking with FalconID’s phishing-resistant MFA. Integrated into CrowdStrike’s holistic Next-Gen Identity Security solution, FalconID leverages real-time telemetry across the platform to dynamically block threats in real time. Built on FIDO2 standards, FalconID ensures secure, frictionless authentication, providing stronger protection and greater control over your identities. [Early Access]\nSecure AI agents and the identities behind them\nCrowdStrike discovers AI agents and the powerful identities behind them — often created without security oversight. Gain deep visibility into usage across platforms like Microsoft 365, OpenAI, and Snowflake. Uncover unsanctioned access and risky behavior, and stop adversaries from hijacking automation to escalate privileges, modify code, or exfiltrate data.\n24/7 managed identity protection\nAugment your team with CrowdStrike experts who monitor, detect, and respond to identity threats around the clock. With threat intelligence and proactive hunting, CrowdStrike Falcon® Complete keeps your identities protected around the clock."
    },
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/platform/exposure-management/",
        "Content_Type": "Website Content",
        "Raw_Text": "Latest from\nComprehensive attack surface visibility\nGain broad visibility across external assets, endpoints, cloud, network, OT/IoT, and shadow AI. Falcon Exposure Management uses active, passive, and third-party discovery with internet scanning to surface real-time risks. Delivered through a single agent — with no complex scanning infrastructure required.\nReduce intrusion risk with real-time exposure insights\nFortify your security with real-time exposure insights. Assess vulnerabilities, misconfigurations, and attack path analysis across endpoints, hybrid, and multi-cloud environments. Our integrated Security Configuration Assessment strengthens your security posture, supporting compliance with industry standards or custom policies for Windows, MacOS, and Linux systems.\nDiscover and inventory AI across endpoints and cloud\nGain real-time visibility into AI components running across your environment — including LLMs, AI agents, IDE extensions, MCP servers, and AI-infused packages. Powered by the AI-Native Falcon platform, AI Discovery automatically identifies where AI is deployed, who installed it, and how it’s configured — empowering teams to spot unauthorized tools, reduce risk, and take action with zero added infrastructure.\nPrioritize what matters with Agentic AI\nThe Exposure Prioritization Agent turns vulnerability overload into clear, ranked remediations that show what to fix first—and why. By combining ExPRT.AI, exploitability analysis, asset criticality, and adversary intel, it validates vulnerabilities, quantifies impact, and provides plain-language context—so teams focus on real risk and stop breaches faster.\nStop breaches with precision\nSupercharge incident response and collaboration with CrowdStrike Falcon® Fusion SOAR. Automate playbooks, ticketing, and custom actions for efficient, effective remediation. Leverage single-agent technology to implement controls like network isolation and emergency patching, mitigating risks and fortifying your security posture.\nCustomer Stories\nSee why organizations trust Falcon Exposure Management.\nWhat's new\n2Help Net Security, 2024, CISA KEV, 2024\n3CrowdStrike 2025 Global Threat Report\n4Intermex Case Study\n5These numbers are projected estimates of average benefits based on recorded metrics provided by customers during pre-sale motions that compare the value of CrowdStrike with the customer’s incumbent solution. Actual realized value will depend on individual customer’s module deployment and environment."
    },
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/platform/falcon-for-it/",
        "Content_Type": "Website Content",
        "Raw_Text": "Latest from\nComing soon: Risk-based patching to stop breaches\nFalcon for IT redefines patching as breach prevention. Powered by ExPRT.AI and informed by adversary intelligence, it prioritizes real threats, generates pre-deployment Patch Safety Scores, and uses adaptive rollout controls to reduce risk and disruption—all from the Falcon platform.\nClose configuration gaps before they become risks\nConfiguration drift creates gaps adversaries exploit. Falcon for IT enforces your baseline standards continuously — keeping critical services, apps, and configurations compliant and secure across every device.\nAI-powered visibility. Real-time clarity.\nSkip the syntax. Just ask. Falcon for IT uses CrowdStrike® Charlotte AI to turn plain language into precise osquery queries — delivering real-time visibility across your entire endpoint fleet.\nRun your scripts at enterprise scale\nBring your own Python, PowerShell, Bash, or Zsh scripts and execute them across Windows, macOS, and Linux. Falcon for IT transforms your existing scripts into enterprise-grade automation, giving you control without extra tools or overhead.\nAccelerate operations with ready-to-run tools\nHit the ground running with out-of-the-box queries, actions, and dashboards. Get immediate insight into app health, compliance, and performance. No coding. No complexity. Just results.\nRemediate issues without the wait\nFrom restarting failed services to enforcing policy across your fleet, Falcon for IT empowers security teams to act fast—eliminating handoffs and resolving issues directly from the Falcon platform."
    },
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/en-us/platform/next-gen-siem/onum/",
        "Content_Type": "Website Content",
        "Raw_Text": "Supercharge your agentic SOC with high-quality, real-time data\nEliminate noise, cut costs, and stop breaches at machine speed.\nAdversaries hide in your data noise\nWith overwhelming data and latency, AI-powered attackers move faster than defenders can respond.\n1. 62% of alerts ignored amid overwhelming noise2\n2. More time spent managing data than analyzing it\n3. 51s fastest breakout time: adversaries outpace your data1\n4. Blind spots are exploited by adversaries at scale\nAccelerate your agentic SOC transformation with real-time data\nPower agentic security operations with seamless onboarding, autonomous detection, and faster response.\n70%\nFaster incident response with in-pipeline detection3\n50%\nLower storage costs with smart filtering3\n40%\nLess ingestion overhead, fueling better SOC outcomes3\nCut the noise. Keep the signal.\nTurn fragmented telemetry into structured, enriched data that matters. By cutting noise and amplifying context, Falcon Onum ensures CrowdStrike Falcon® Next-Gen SIEM and SOC teams act on high-fidelity insights, not clutter.\nSpeed for the agentic era\nFalcon Onum delivers up to 5x more events per second than its nearest competitor3, processing data in real-time versus legacy batch and store methods. SOCs detect and respond faster to outpace AI-powered adversaries.\nSpend less. Defend more.\nDon’t pay for data you don’t need. Falcon Onum intelligently filters and routes telemetry, cutting storage costs by up to 50%3 while freeing budget for what matters most: defending your business.\nStop threats in the data stream\nFalcon Onum moves detection upstream into the pipeline, autonomously spotting malicious activity as data flows. By surfacing high-value signals instantly, security teams gain the speed to outpace AI-powered adversaries instead of reacting after the breach.\nPipeline control made simple\nTraditional pipelines require heavy scripting and deep engineering. Falcon Onum’s intuitive drag-and-drop UI empowers SOC analysts at every level to shape, enrich, and route data themselves — unlocking agility without complexity.\nValidated by analysts. Trusted by customers.\nSee why organizations trust Falcon Next-Gen SIEM\nAdversary-informed intelligence. Delivered at scale. Trusted when it matters most.\nWhat's New\n3 These numbers are projected estimates of average benefit based on company’s own internal analysis and recorded metrics provided by customers during pre-sale motions that compare the value of CrowdStrike with the customer’s incumbent solution. Actual realized value will depend on the customer's module deployment and environment.\n4 Results are from a customer case study. Individual results may vary.\n*As of June 2, 2025, CrowdStrike has an Overall Rating of 4.7 out of 5 and the most reviews in a 12 month period in the Security Information and Event Management, based on 184 reviews on Gartner Peer Insights™"
    },
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/platform/threat-intelligence/",
        "Content_Type": "Website Content",
        "Raw_Text": "Latest from\nAdversaries strike quickly and adapt even faster\nAI has shifted the threat landscape, making sophisticated attacks easier to launch and scale.\n1. 51 seconds fastest breakout time1\n2. 81% of hands-on-keyboard intrusions were malware-free2\n3. 442% increase in voice phishing1\n4. 136% surge in cloud intrusions2\nThreat AI: Intelligence that reasons, hunts, and acts\nStay ahead of AI-driven adversaries with the industry’s first Agentic Threat Intelligence. Threat AI puts CrowdStrike Intelligence expertise inside your team, giving you AI agents that don’t just explain threats — they take action to stop them.\nDisrupt advanced threats across all domains\nStop breaches across the entire attack surface with CrowdStrike Falcon® Adversary OverWatch, our 24/7 managed threat hunting service. Only OverWatch hunts across endpoint, identity, cloud, and Next-Gen SIEM data, using AI to cut through the noise so expert hunters can focus on the most evasive threats.\nPower your SOC with Adversary Intelligence\nDetect and investigate threats faster with real-time indicators, dark web monitoring, and vulnerability intelligence — all integrated into analyst workflows. With Premium, Threat AI automates complex workflows, delivers intelligence reports and provides prebuilt defenses to stop today's AI-powered adversaries.\nProtect your brand from fraud\nUncover domain impersonations, exposed credentials, and data leaks with real-time intelligence. Continuous, automated monitoring of the criminal underground detects fraud, data breaches, and phishing campaigns targeting your organization.\nAdd a CrowdStrike expert to your team\nDon’t face adversaries alone. Partner with an assigned Counter Adversary Operations Elite analyst who works as an extension of your team, delivering custom threat briefs, targeted investigations, external risk monitoring, and guided threat hunting aligned to your organization.\nAccess intelligence everywhere\nQuickly access CrowdStrike's industry-leading threat intelligence directly in your Chrome browser. The CrowdStrike Threat Intelligence Browser Extension scans web pages to identify IOCs, adversaries, malware, and vulnerabilities, providing rich context and analysis without switching between tools.\nIndustry Validation\nCustomer Stories\nSee why organizations trust Falcon Counter Adversary Operations.\nWhat's new\n3BVA Analysis: These numbers are projected estimates of average benefit based on recorded metrics provided by customers during pre-sale motions that compare the value of CrowdStrike with the customer’s incumbent solution. Actual realized value will depend on individual customer’s module deployment and environment."
    },
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/platform/cloud-security/",
        "Content_Type": "Website Content",
        "Raw_Text": "Latest from\nComplete unified security posture\nFalcon Cloud Security unifies visibility and posture with AI-driven insights, empowering you to quickly investigate threats, prioritize risk with precision, and stop breaches before they happen.\nBuilt to stop cloud breaches\nStop cloud threats in real time with advanced runtime protection built on the same unified Falcon sensor powering our industry-leading EDR and Identity Protection. Gain deep visibility, detection, and response across workloads, containers, and Kubernetes.\nElite adversary threat hunting and intelligence\nProactively disrupt cloud adversaries like LABYRINTH CHOLLIMA and SCATTERED SPIDER in real time. Our advanced AI and world-class threat intelligence, backed by global experts track 257 adversaries, analyze 200,000 new IOCs daily, and manage over 300 million total IOCs, giving your cloud team a decisive advantage.\nCrowdStrike — the pioneer of CDR\nAccelerate response time by 89% with CrowdStrike’s industry-leading CDR. Powered by elite 24/7 managed services and threat intelligence, CrowdStrike’s CDR stops breaches with deep visibility into 257 adversaries and real-time attack insights.\nSecure your AI applications and models\nDiscover shadow AI and scan for misconfigurations, vulnerabilities, and risks in your AI applications and models.\nReduce noise with agentic AI\nNew Risk Prioritization Agent cuts through noise, pinpoints exploitable vulnerabilities, and focuses on risk that impacts the business.\nIndustry Validation\nCustomer Stories\nSee why organizations trust Falcon Cloud Security."
    },
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/platform/next-gen-siem/falcon-fusion/",
        "Content_Type": "Website Content",
        "Raw_Text": "Latest from\nIntelligent security automation to stop breaches faster\nUnlock efficiency, scale, and rapid response with Falcon Fusion SOAR.\n75hrs\nSaved per month by a healthcare organization automating 900 false positives.2\n70%\nCustomer efficiency improvement with workflow automation.3\n33M\nWeekly signals processed by Falcon Fusion SOAR to save time3\nCreate SOAR workflows in minutes with AI, no code required\nQuickly implement and scale automation across your SOC. Use pre-built playbooks, create your own with a no-code interface, or transform your ideas into workflows in seconds with Charlotte AI. Other agents, like the Data Transformation Agent, turn complex SOAR operations into simple AI-powered conversations that increase efficiency and productivity.\nUnleash the power of multi-agent orchestration\nFalcon Fusion SOAR unites workflow automation, AI reasoning, and human expertise to build agentic workflows that combine the precision of automation with the adaptability of intelligent agents, delivering faster, more confident responses.\nRespond rapidly with case management and automation in sync\nEnhance collaboration and centralize investigation and response with native case management. Seamless integration with workflow automation eliminates repetitive tasks, accelerates investigations, and gives security teams valuable time back.\nIntegrate your stack into one unified defense engine\nTransform disconnected tools into a unified defense engine. Orchestrate response with out-of-the-box integrations, pre-built actions, third-party agents and ready-to-run playbooks — all in one place.\nGet insights to refine and scale your SOAR workflows\nReduce response times and optimize operations by monitoring key metrics in a centralized dashboard that delivers actionable insights, highlights areas for improvements, and enables immediate action.\nCustomer Stories\nSee why organizations trust Falcon Fusion SOAR.\nWhat's new\n1 CrowdStrike 2025 Global Threat Report MTTR is Mean Time To Respond. TDIR is Threat Detection, Investigation, and Response.\n2 Results are from a healthcare organization. Individual results may vary by customer.\n3 Results are based on an aggregate assessment of CrowdStrike Falcon® Insight XDR customers."
    },
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/platform/next-gen-siem/",
        "Content_Type": "Website Content",
        "Raw_Text": "Latest from\nModern adversaries outpace legacy SIEMs\nToday’s stealthy, AI-powered adversaries routinely evade fragmented and noisy SOC tools.\n1. 48 min avg breakout time evades legacy detection1\n2. 79% of attacks malware-free, bypassing traditional alerts1\n3. 62% of alerts ignored amid overwhelming noise2\n4. Lagging scale and high complexity challenge ROI\nPowering the agentic SOC with AI-native intelligence\nand machine-speed response\nUnify cross-domain data, adversary-trained AI, and expert automation to outpace threats in the AI-era.\n80%\nCost savings over three years versus legacy SIEM3\n150x\nFaster search to supercharge investigations and hunting4\n95%\nFewer false positives to tune out the noise and respond faster5\nYour agentic SOC transformation starts here\nAs the engine at the center of the SOC, Falcon Next-Gen SIEM is AI-native at its core — accelerating every step of the analyst experience. With Falcon Onum and new agents for data onboarding, correlation rule generation and search analysis accelerate SIEM detection, while workflow and data transformation agents make every analyst a response expert.\nBuild your AI-ready data foundation with Falcon Onum\nFalcon Onum supercharges Falcon Next-Gen SIEM with clean, high-quality, real-time data, and AI-powered data pipelines — delivering 5x faster streaming, 50% lower storage costs, and 70% faster response.1 Cut noise, drive efficiencies and stop breaches at the speed of AI.\nFlexible search. Instant answers. Zero complexity.\nRapid, real-time search built for modern threats. Index-free architecture enables 150x faster search at petabyte scale.6 Quickly search, hunt, investigate, and build dashboards across diverse datasets. Customers see lower costs and less complexity with instant, flexible access to their critical security data.7\nStop breaches with unified detection and response\nExpose and neutralize cross-domain attacks with unified AI-driven detection, centralized case management, and intelligent workflow automation, powered by CrowdStrike Falcon® Fusion SOAR. Eliminate noise and guesswork with clarity, deep context, and adversary intel proven to stop breaches fast.\nCharlotte Agentic SOAR: multi-agent orchestration made simple\nPowered by Falcon Fusion SOAR, CrowdStrike® Charlotte AI™, and AgentWorks, Charlotte Agentic SOAR delivers adaptive, agentic workflows — bringing reasoning, automation, and human expertise together for a faster, smarter defense.\nAccelerate results. Maximize ROI. Transform with confidence.\nConfidently consolidate and realize results 3x faster than legacy SIEMs, leveraging native CrowdStrike Falcon® platform data and streamlined ingestion of third-party telemetry.8 Achieve superior ROI quickly, with tangible savings, consolidation, and measurable outcomes for your business.\nRecognized by analysts. Trusted by customers.\nCustomer Stories\nUnmatched real-time, adversary-informed intelligence at scale.\nWhat's new\n3 These numbers are projected estimates of average benefit based on recorded metrics provided by customers during pre-sale motions that compare the value of CrowdStrike with the customer’s incumbent solution. Actual realized value will depend on individual customer’s module deployment and environment.\n4 Results are from a customer case study. Individual results may vary.\n5 Results are from a customer case study. Individual results may vary.\n6 Accuracy rating is a measure of Charlotte AI triage decisions that match the expert decisions from the CrowdStrike Falcon Complete Next-Gen MDR team.\n7Results are from a customer case study. Individual results may vary.\n8Results are from a customer. Individual results may vary.\n*As of June 2, 2025, CrowdStrike has an Overall Rating of 4.7 out of 5 and the most reviews in a 12 month period in the Security Information and Event Management, based on 184 reviews on Gartner Peer Insights™"
    },
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/platform/data-protection/",
        "Content_Type": "Website Content",
        "Raw_Text": "Latest from\nAdvanced data protection for the modern enterprise\nThe industry’s only unified platform for data protection built on a unified agent and single console.\nOne sensor. Instant visibility. Full control.\nDeploy at scale with the CrowdStrike Falcon® platform’s unified sensor and instantly gain visibility into sensitive data movement. Experience minimal configuration, no added infrastructure, and see known and unknown egress paths the moment protection is turned on.\nResting or moving, your data’s always a target\nContinuously monitor sensitive data at rest and in motion across cloud infrastructure and endpoints. Detect unauthorized access and anomalies before data is exposed, and enforce security policies to stop adversaries and insiders before they succeed.\nGenAI is the new insider threat vector\nStop GenAI data leaks in real time across browsers, local apps, shadow AI, and cloud data flows. Falcon Data Protection delivers unified visibility and multi-channel enforcement with GenAI-specific detections and client network inspection so organizations can embrace AI with confidence without exposing sensitive data.\nWhere the insider sits, the threat begins\nPrevent malicious insider attempts with encryption detection and security policy enforcement. Falcon Data Protection for Endpoint ensures seamless protection across Windows and macOS endpoints without complex configurations or added overhead.\nCloud runs at runtime. So should your protection.\nMonitor data movement inside cloud infrastructure in real time. Falcon Data Protection for Cloud (beta) uses eBPF to monitor unauthorized data movement at runtime without added infrastructure and with minimal performance impact.\nInsider threats revealed, risks contained\nCorrelate identity and data movement in one insider threat dashboard to uncover risky users fast. Accelerate investigations with cross-domain context and stop negligent or malicious insider activity before data is lost.\nCustomer Stories\nSee why organizations trust Falcon Data Protection.\nFeatured Resources\n2Benefits of Falcon Data Protection as realized by the CISO of a top-tier business school in the US. Expected results and actual outcomes are not guaranteed and may vary for every customer."
    },
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/en-us/platform/falcon-for-xiot/",
        "Content_Type": "Website Content",
        "Raw_Text": "Latest from\nComplete XIoT asset visibility\nYou can’t secure what you can’t see. In 10 minutes or less, get complete XIoT visibility without scanning overhead or operational risk. Falcon for XIoT builds continuously updated inventories enriched with ICS-specific context, including hardware details, Purdue level, and device behavior — delivering full visibility across your entire environment without impacting asset or network performance.1\nFlexible deployment for OT/IoT systems\nDeploy in days, not months — no tuning, no extra hardware, and no manual scan configurations required. Install on existing Windows and Linux hosts — like engineering workstations, servers (historian, backup), supported HMIs, and SCADA systems — and use these managed assets to safely discover and monitor unmanaged OT/IoT devices across your network.\nSmarter asset context. Real-time insight.\nGain context into asset behavior and communication to move beyond static inventory. Accelerate detection of policy violations, improve segmentation decisions, and strengthen defense against lateral movement — without added complexity.\nComprehensive XIoT threat protection\nDefend critical operations against targeted malware and ransomware designed to disrupt industrial systems. Validated for leading ICS vendors like Rockwell Automation and Siemens, the CrowdStrike Falcon® agent helps protect XIoT environments without impacting system performance or operations.\nProtect against identity-based attacks\nStop lateral movement before it starts by enforcing dynamic, risk-based conditional access. Secure XIoT environments where credentials are often shared, weak, or unmanaged with CrowdStrike Falcon® Next-Gen Identity Security.\n24/7 expert MDR and threat hunting\nAugment your team with experts. Get round-the-clock detection, response, and threat hunting tailored to XIoT environments and assets with CrowdStrike Falcon® Complete Next-Gen MDR and CrowdStrike® Falcon Adversary OverWatch™.\nSee Falcon for XIoT in action\nCustomer Stories\nSee why organizations trust CrowdStrike.\nWhat's New\n1CrowdStrike Internal Testing Data\n4These numbers are projected estimates of average benefits based on recorded metrics provided by customers during pre-sale motions that compare the value of CrowdStrike with the customer’s incumbent solution. Actual realized value will depend on individual customer’s module deployment and environment."
    },
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/platform/cloud-security/cdr/",
        "Content_Type": "Website Content",
        "Raw_Text": "Smarter cloud defense with agentic AI\nCrowdStrike Charlotte AI™ brings autonomous triage, investigation, and response to cloud security operations, helping SOC teams stop breaches with speed and precision.\nDisrupt cloud threats with cloud context\nGain deep visibility into the cloud control plane to uncover adversary behavior unique to the cloud. Cloud IOAs live alongside endpoint and identity IOAs in one place, helping SOC teams detect and disrupt adversaries early.\nBuilt to stop cloud breaches\nStop cloud threats with advanced runtime protection built on the same unified CrowdStrike Falcon® sensor powering our industry-leading EDR and identity protection. Gain deep visibility, detection, and response across workloads, containers, and Kubernetes.\nHunt adversaries with industry-leading threat intel\nCrowdStrike Falcon® Adversary Intelligence provides you with detailed profiles of 250+ adversaries, including nation-states, eCrime groups, and hacktivists. Learn their methods, see their tactics mapped to the MITRE ATT&CK™ framework, and know the vulnerabilities they are actively exploiting.\nExpert eyes on your cloud 24/7\nCrowdStrike brings hands-on experience protecting cloud environments and delivers full-cycle remediation to eradicate threats. Get the deep expertise your team needs 24/7 with CrowdStrike Falcon Complete® Next-Gen MDR and CrowdStrike Falcon® Adversary Overwatch.\nSee Cloud Detection & Response in action\nIndustry Validation\nCustomer Stories\nSee why organizations trust Falcon Cloud Security.\nWhat's new\n2CrowdStrike 2025 Global Threat Report\n3CrowdStrike 2025 Threat Hunting Report\n4Results are from Mercury Financial and Intermex. Individual results may vary by customer.\n5These numbers are projected estimates of average benefits based on recorded metrics provided by customers during pre-sale motions that compare the value of CrowdStrike with the customer’s incumbent solution. Actual realized value will depend on the individual customer’s module deployment and environment."
    },
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/en-us/solutions/insurability/",
        "Content_Type": "Website Content",
        "Raw_Text": "World-class coverage from providers you can trust\nEngage with our ecosystem of leading cyber insurance providers.\nGo from uninsurable to cyber insurance ready\nBecome insurable. Optimize terms.\nReduce cyber risk, strengthen your security posture, and demonstrate security efficacy to cyber insurers with CrowdStrike."
    },
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/en-us/platform/next-gen-identity-security/nhi/",
        "Content_Type": "Website Content",
        "Raw_Text": "Comprehensive protection for all non-human identities\nSafeguard machine-to-machine interactions and cloud integrations.\nVisibility and control for non-human identities\nGain complete visibility into your traditional Active Directory and cloud identity providers, including Entra ID and Okta. This holistic view allows you to quickly identify, manage, and secure all non-human identities, reducing blind spots and enhancing your security posture.\nPrevent non-human threats in real time\nFalcon Identity Protection stops identity-based attacks in real time, leveraging AI to monitor and block suspicious activities as they happen. This includes non-human identities across all environments.\nEliminate service account abuse\nProactively monitor non-human accounts like service accounts with high privileges across AD and cloud identity providers like Entra ID to reduce identity attack surface."
    },
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/en-us/platform/ai/secure-your-ai/",
        "Content_Type": "Website Content",
        "Raw_Text": "Your AI attack surface is growing\nThe industry’s first complete\nAI Detection & Response solution\nSecuring data, models, agents, identities, infrastructure, and interactions — from enterprise AI development through workforce usage.\nSecure AI from applications to agents to identities to data\nStop risky AI use\nTake control of how employees engage with chatbots and generative AI. Get deep visibility into AI activity and enforce governance policies that instantly block unsafe topics, conversations, and behaviors.\nStop prompt injection attacks\nStop malicious and hidden prompts with up to 99% efficacy at sub-30ms latency1. Inspect every input and output, catch invisible attacks in text or images, and automatically redact sensitive data to keep AI interactions safe and compliant.\nSecure AI agent identities before they go rogue\nDiscover GPTs and Codex agents across SaaS platforms like Microsoft 365, Salesforce, and Open AI. Map every agent to its human curator and system access, detect risky behavior – before automation turns into exploitation.\nStop GenAI data leaks in real time\nKeep sensitive data safe and prevent leaks to generative AI tools. Falcon Data Protection tracks and blocks insider-driven data leaks to GenAI tools in real time, enforcing policies based on content type, source origin, and file type.\nExpose shadow AI across your enterprise\nFalcon Exposure Management and Falcon Cloud Security together detect unauthorized model integrations, agents, and packages running across endpoints and cloud. Instantly surface shadow AI, map it to critical assets, and take action — with zero setup or added infrastructure.\nSecure AI from code to container to cloud\nSecure AI cloud-based apps, LLMs, and services. The Falcon platform discovers AI assets, secures configurations, and blocks threats like model tampering and data leaks with full cloud visibility and protection.\nTest and prepare for evolving threats\nDiscover where AI is in use across your environment, assess the risks it creates, and get a prioritized plan to reduce exposure. Integrate AI into your SOC with clarity and control. We help you identify use cases, assess readiness, and build a roadmap for safe, effective AI adoption in detection and response.\nSee how customers are securing AI innovation\nwith the Falcon platform\nForward-Looking Statements\nThis page contains forward-looking statements, including statements regarding the closing and benefits of the proposed acquisition. These statements involve risks and uncertainties, and actual results may differ materially. There are a number of risks which could cause actual results to differ materially, including the satisfaction of the acquisition’s closing conditions, our ability to integrate Pangea, and other risks described in the filings we make with the Securities and Exchange Commission from time to time.\n1 Performance metrics are based on results from internal benchmark testing."
    },
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/en-us/platform/endpoint-security/ransomware-protection/",
        "Content_Type": "Website Content",
        "Raw_Text": "Your ransomware defense starts here\nProactive ransomware protection designed to keep bad actors at bay and safeguard your data.\nProactive threat hunting to disrupt the adversary\nAt CrowdStrike, we don’t wait for threats to emerge — we hunt them down. Our elite threat hunters leverage focused intelligence insights to detect and neutralize ransomware before it strikes. This proactive stance ensures your organization always stays one step ahead and that your digital estate stays safe.\nSharpen your ransomware defense\nComprehensive Tabletop, Red Team/Blue Team, and Adversary Emulation Exercises rigorously drill and sharpen your ransomware defenses. These hands-on training pinpoint vulnerabilities and strengthen your security posture, ensuring your security always stands ready.\nProven protection\nFor the third straight year, CrowdStrike delivered 100% ransomware protection in the SE Labs Enterprise Advanced Security (EDR) Ransomware test, simulating real-world scenarios, including both direct attacks and complex tactics used by cybercriminals."
    },
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/en-us/resources/customer-stories/",
        "Content_Type": "Website Content",
        "Raw_Text": "Bad people are out there every day, around the clock, trying to compromise our computers. It’s our job to provide protection that doesn’t ever compromise.\nPeople all over the world count on our customers to keep their businesses running, their communities safe, and their lives moving forward. Our customers count on CrowdStrike.\nWhen you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer.\nMore information\nStrictly Necessary Cookies\nAlways Active\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nFunctional Cookies\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nPerformance Cookies\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nTargeting Cookies\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising."
    },
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/tech-hub/",
        "Content_Type": "Website Content",
        "Raw_Text": "Endpoint Security\nCrowdStrike Tech Hub\nYour ultimate resource for the CrowdStrike Falcon® platform: In-depth videos, tutorials, and training.\nSelect a product category below to get started.\nLatest videos\nEndpoint Security - Real Time Response\nPlay Video\nEndpoint Security - Automated Remediation\nPlay Video\nEndpoint Security - Falcon Fusion with Real Time Response\nPlay Video\nEndpoint Security - Customized Dashboards\nPlay Video\nEndpoint Security - Context Enrichment\nPlay Video\nEndpoint Security - Falcon Go for Small and Medium Businesses\nPlay Video\nWant to learn even more?\nView all Endpoint Security content"
    },
    {
        "Ticker": "CRWD",
        "Company": "CrowdStrike",
        "Source_URL": "https://www.crowdstrike.com/en-us/blog/crowdstrike-leads-new-evolution-of-security-automation-with-charlotte-agentic-soar/",
        "Content_Type": "Website Content",
        "Raw_Text": "AI has transformed both how attackers operate and how defenders must respond. Today’s adversaries use AI to shift tactics in real time, forcing defenders to react at unprecedented speed. Many SOCs struggle to keep pace due to the limits of legacy automation. Even the most mature playbooks can’t anticipate every scenario or data variation, because playbooks are predictable — but adversaries aren’t.\nSOC teams need systems that can understand context, weigh options, and act at machine speed while staying within human judgment and organizational guardrails. That’s why CrowdStrike is leading the next evolution of security automation with Charlotte Agentic SOAR.\nCharlotte Agentic SOAR will build on the precision and consistency of structured automation to deliver the next evolution of security automation, with intelligent agents that can reason, decide, and act in real time. Agents bring flexibility and intelligence into security operations, helping teams stay ahead of modern threats. The result is a SOC that moves faster, adapts instantly, and responds with confidence.\nThe New Orchestration Layer of the Agentic SOC\nCrowdStrike already powers the agentic SOC with CrowdStrike Falcon® Next-Gen SIEM, CrowdStrike Falcon® Fusion SOAR, CrowdStrike’s mission-ready AI agents, and CrowdStrike® Charlotte AI™ AgentWorks. With the foundation of CrowdStrike Enterprise Graph®, the industry’s richest, AI-ready data layer, security teams have the complete context needed to ensure every signal is instantly actionable for both agents and analysts.\nSee how CrowdStrike’s agentic SOAR empowers SOCs to move faster, adapt instantly, and respond with confidence:"
    }
]