[
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/",
        "Content_Type": "Website Content",
        "Raw_Text": "WORKING AT CSX\nBe part of the team working to make CSX the best run railroad in North America. Learn more about available careers with CSX and take the first step to becoming a CSX railroader.\nCOMMUNITY INVESTMENT\nBy operating responsibly, generating economic opportunities, and giving back, CSX makes a positive impact in the communities where we operate.\nEach year, CSX contributes millions of dollars in grants and in-kind donations to nonprofit organizations. We also offer community service opportunities for employees and their families.\nCSX Pride in Service"
    },
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/index.cfm/about-us/company-overview/website-accessibility/",
        "Content_Type": "Website Content",
        "Raw_Text": "Accessibility\nCSX is committed to providing equal opportunity for applicants and for employees without regard to physical or mental disability.\nAs part of this commitment, we want to provide a website that is accessible to the widest possible audience, and we are actively working to improve its accessibility and usability. CSX will work to seek reasonable accommodations for applicants in the employment process as well as others who are experiencing difficulty navigating our site.\nShould you experience any difficulty in accessing the CSX website or would like to request an accommodation, please don’t hesitate to contact us at AccommodationRequest@csx.com.\nAssistive Technology\nFor those who have trouble typing, moving a mouse, or reading a screen, we provide the following links to download free accessibility tools if needed.\nVision Impaired\nIf you don't already have a screen reader, NVDA (Non-Visual Desktop Access) is a free and open tool for helping the blind and visually impaired use technology.\nDownload NVDA Screen Reader\nBuilt-in Accessibility Tools On Computers\nBuilt-in Accessibility Tools On Mobile"
    },
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/index.cfm/about-us/history-evolution/",
        "Content_Type": "Website Content",
        "Raw_Text": "Introduction\nExplore CSX's History\nFrom humble beginnings of horse-drawn rail cars to electric locomotives capable of moving hundreds of tons of cargo, CSX celebrates a rich history covering almost 190 years.\nScroll, using your mouse or keyboard, through time to explore our history and heritage. Through times of war and times of peace, see how railroad companies expanded and then consolidated to make up the CSX you know today.\nThe Birth of American Rail\n(Late 1820s)\nThe CSX story began with America’s first common carrier, The Baltimore and Ohio Railroad. Originally powered by horses, the B&O set in motion the events that would lead to America’s most efficient means of transporting goods.\nThe CSX family tree began on February 28, 1827, when the Baltimore & Ohio Railroad, America's first common carrier railroad, was chartered. Its original line covered one state and 13 miles; today CSX covers 23 states on our 21,000-mile network.\n1827\nBaltimore & Ohio began operations on May 24, 1830, as the first common-carrier railroad in the U.S.\nMAY 24\n1830"
    },
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/index.cfm/about-us/media/",
        "Content_Type": "Website Content",
        "Raw_Text": "/ ShipCSX / REPORT AN EMERGENCY: 1-800-232-0144 /\nCovering 23 states in the East, Midwest and South; the District of Columbia and 2 Canadian provinces, our skilled professionals bring a proven track record to our clients, our communities and your projects.\nVisit our Corporate Social Responsibility section to learn more about how our material and service suppliers can help make a positive impact on CSX corporate sustainability efforts."
    },
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/index.cfm/about-us",
        "Content_Type": "Website Content",
        "Raw_Text": "From horse-drawn rail cars to electric locomotives, CSX celebrates a rich history covering almost 190 years. Scroll through time to explore our history and heritage.\nAt CSX, we strive to effectively communicate our vision to our customers, partners, and communities. Read our press releases and view our ads and videos.\nCovering 23 states in the East, Midwest and South; the District of Columbia and 2 Canadian provinces, our skilled professionals bring a proven track record to our clients, our communities and your projects.\nVisit our Corporate Social Responsibility section to learn more about how our material and service suppliers can help make a positive impact on CSX corporate sustainability efforts.\nCSX is a leading supplier of rail-based freight transportation in North America. But there’s more to CSX than you might expect. Learn all about CSX and discover what we’re doing for our customers, environment and communities.\nPowered By Principles\nVision\nPurpose\nImprove Customer Service\nControl Costs\nOptimize Asset Utilization\nOperate Safely\nValue and Develop Employees\nVision\nVision | To be the best run railroad in North America.\nPurpose\nPurpose | To capitalize on the efficiency of rail transportation to serve America.\nImprove Customer Service\nImprove Customer Service | Do what we say we are going to do. Know your customer and understand how you can drive value. Proactively communicate at all times including when we cannot meet our commitments.\nControl Costs\nControl Costs | Eliminate unnecessary steps that add complexity and costs.\nOptimize Asset Utilization\nOptimize Asset Utilization | Do more with less by maximizing the value of our assets through increased transit speed and lower dwell.\nOperate Safely\nOperate Safely | Maintain 100% compliance with safety and operating rules 100% of the time to protect our employees, our customers’ freight, and the communities in which we operate.\nValue and Develop Employees\nValue and Develop Employees | Act with integrity, make sure employees know what is expected of them and reward them when they do the right things, and always strive to get better."
    },
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/index.cfm/about-us/sustainability",
        "Content_Type": "Website Content",
        "Raw_Text": "CSX seeks to conduct our business in a way that ties sustainability and social impact to our growth strategy from the inside, out – from our company to our communities. Service with Purpose is CSX’s unified sustainability and social impact platform, through which we are committed to running a sustainable business from the inside out by advancing the safety of our people and neighbors; serving our employees, customers and communities; delivering environmentally sustainable solutions across our operations and for our customers; and stewarding a responsible business that creates value for all stakeholders and society.\nService with Purpose reflects our belief that long-term value is created when we lead with intention. As an extension of our ONE CSX culture, our approach embeds responsibility and resilience across our operations, aligning our business goals with stakeholder expectations and societal needs around environmental, social, and governance (ESG) topics that are material to our business. Details on these activities are further outlined here.\nAt CSX, we see our suppliers as vital partners in building a more sustainable future—held to the same high standards we set for ourselves. Learn how we partner with suppliers to drive progress on shared sustainability goals and advance meaningful change together."
    },
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/index.cfm/about-us/company-overview",
        "Content_Type": "Website Content",
        "Raw_Text": "CSX Corporation, together with its subsidiaries based in Jacksonville, Fla., is one of the nation's leading transportation suppliers. The company’s rail and intermodal businesses provide rail-based transportation services including traditional rail service and the transport of intermodal containers and trailers.\nOverall, the CSX Transportation network encompasses about 20,000 route miles of track in 26 states, the District of Columbia and the Canadian provinces of Ontario and Quebec. Our transportation network serves some of the largest population centers in the nation. Nearly two-thirds of Americans live within CSX’s service territory.\nOur transportation network serves some of the largest population centers in the nation. Nearly two-thirds of Americans live within CSX’s service territory.\nCSX serves major markets in the eastern United States and has access to over 70 ocean, river and lake port terminals along the Atlantic and Gulf Coasts, the Mississippi River, the Great Lakes and the St. Lawrence Seaway. The company also has access to Pacific ports through alliances with western railroads.\nCSX moves a broad portfolio of products across the country in a way that minimizes the effect on the environment, takes traffic off an already congested highway system, and minimizes fuel consumption and transportation costs."
    },
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/index.cfm/about-us/projects-and-partnerships",
        "Content_Type": "Website Content",
        "Raw_Text": "/ ShipCSX / REPORT AN EMERGENCY: 1-800-232-0144 /\nCovering 23 states in the East, Midwest and South; the District of Columbia and 2 Canadian provinces, our skilled professionals bring a proven track record to our clients, our communities and your projects.\nVisit our Corporate Social Responsibility section to learn more about how our material and service suppliers can help make a positive impact on CSX corporate sustainability efforts."
    },
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/index.cfm/about-us/contact-us",
        "Content_Type": "Website Content",
        "Raw_Text": "/ ShipCSX / REPORT AN EMERGENCY: 1-800-232-0144 /\nCovering 23 states in the East, Midwest and South; the District of Columbia and 2 Canadian provinces, our skilled professionals bring a proven track record to our clients, our communities and your projects.\nVisit our Corporate Social Responsibility section to learn more about how our material and service suppliers can help make a positive impact on CSX corporate sustainability efforts.\nTo contact CSX for non-emergency issues, please select a category:\nSelect \"Contact us\" to submit a question or comment, or \"Learn more\" to read about the subject on our website.\nCorporate Headquarters\n500 Water Street, 15th Floor\nJacksonville, FL 32202\n904-359-3200\nCSX Transportation\n500 Water Street\nJacksonville, FL 32202\n904-359-3100\nCSX Ethics Helpline: 1-800-737-1663 or Log on here\nTo report suspected misconduct, raise concerns about ethics and compliance matters, or ask questions without fear of retaliation. The ethics helpline is available 24/7. Callers may remain anonymous.\nRailroad Ties\nCSX generally does not sell scrap materials directly to the general public. We have contracts with several companies that handle our scrap-removal services. If you wish to purchase scrap ties, contact National Salvage & Service Corporation at 1-800-769-8437.\nCSX Responsible Disclosure Policy\nFor matters related to technology security, please click here for CSX's Responsible Disclosure Policy."
    },
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/index.cfm/about-us/media",
        "Content_Type": "Website Content",
        "Raw_Text": "/ ShipCSX / REPORT AN EMERGENCY: 1-800-232-0144 /\nCovering 23 states in the East, Midwest and South; the District of Columbia and 2 Canadian provinces, our skilled professionals bring a proven track record to our clients, our communities and your projects.\nVisit our Corporate Social Responsibility section to learn more about how our material and service suppliers can help make a positive impact on CSX corporate sustainability efforts."
    },
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/index.cfm/about-us/property",
        "Content_Type": "Website Content",
        "Raw_Text": "Public projects such as highways and utilities often intersect with CSX property. If you have a construction project that involves railroad property, check out the Public Project Manual, a valuable resource for information on safely implementing projects from highway-rail grade crossings to railroad corridors. You also can find information regarding utility permitting, accessing CSX property for any purpose and property code enforcement below.\nPublic Project Manual (PDF)\nFor Construction and Improvement Projects That May Involve the Railroad\nThe Public Project Manual is intended to help communities plan and implement construction and improvement projects that may involve CSX rail property, including:\n- Highway-Rail Grade Crossings\n- Bridges Over CSX\n- Parallel Roads/Facilities\n- U.S. Army Corps of Engineers Projects\n- Other Projects Involving CSX Rail Corridors\nCSX places the highest priority on safety – for its employees and for the public. Furthermore, because CSX is a business, the company must give careful consideration to anything that could adversely affect rail service and increase risk to railroad operations.\nQuiet Zone Projects\nAs part of the Federal Train Horn Rule, 49 CFR Part 222, a municipality may apply for a Quiet Zone to reduce the horn noise at railroad crossings in their community. For more information on Quiet Zone Projects along CSX rail lines, please download or print the Quiet Zone Guide.\nConveyance of Property Rights for Department of Transportation Projects\nFor information, contact Public_ProjectsRPI@csx.com.\nUtility Installations and Rights of Entry\nGet information on how to permit a utility installation or obtain temporary access to CSX property. Learn more\nCSX Property Code Enforcement\nIf you are a city, municipality or local government official with property code compliance issues, contact us: Contacts by Territory (PDF)\nNational Gateway and Other Infrastructure Projects\nThe National Gateway, a multistate infrastructure project designed to improve the flow of freight between the Mid-Atlantic and the Midwest will improve American competitiveness in global markets, create more than 50,000 jobs, reduce transportation-related emissions by 20 million tons and alleviate congestion on roads and highways. Learn more"
    },
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/index.cfm/about-us/system-map",
        "Content_Type": "Website Content",
        "Raw_Text": "/ ShipCSX / REPORT AN EMERGENCY: 1-800-232-0144 /\nCovering 23 states in the East, Midwest and South; the District of Columbia and 2 Canadian provinces, our skilled professionals bring a proven track record to our clients, our communities and your projects.\nVisit our Corporate Social Responsibility section to learn more about how our material and service suppliers can help make a positive impact on CSX corporate sustainability efforts."
    },
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/index.cfm/about-us/safety",
        "Content_Type": "Website Content",
        "Raw_Text": "CSX’s commitment to safety defines who we are. Employee training allows us to provide the most reliable rail service to our customers while keeping our communities safe above all else. We work hard to instill safety awareness among our workforce through effective training programs, communication, continuous community engagement and collaboration with customers and peers across the railroad industry.\nAttentiveness to workplace safety begins with CSX leadership and extends to each employee regardless of title, job responsibilities or geographic location. We foster a culture of safety that encourages everyone to act in a safe manner and consider the welfare of others.\nThe passion and training of every employee allows us to provide the most reliable rail service to our customers while keeping our communities safe above all else.\nOur shareholders, customers, employees and communities expect CSX to maintain a safe and secure network. CSX has programs and training in place to protect infrastructure and cargo in collaboration with government and law enforcement agencies."
    },
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/index.cfm/about-us/faqs",
        "Content_Type": "Website Content",
        "Raw_Text": "/ ShipCSX / REPORT AN EMERGENCY: 1-800-232-0144 /\nCovering 23 states in the East, Midwest and South; the District of Columbia and 2 Canadian provinces, our skilled professionals bring a proven track record to our clients, our communities and your projects.\nVisit our Corporate Social Responsibility section to learn more about how our material and service suppliers can help make a positive impact on CSX corporate sustainability efforts.\nI'm new to rail. How do I get started?\nReview New to CSX or Rail. This will help start you off on the right track. Do you have questions about whether shipping by rail is right for you? Contact our New Business Development team at Merchandise@csx.com.\nWhat is ShipCSX?\nShipCSX is our secure web application suite that helps CSX customers plan, ship, trace and pay for shipments quickly and efficiently, with secure data that is customer and company specific. (ShipCSX provides essential tools for industry-leading electronic communications, data exchange operations and real-time reporting services in the transportation industry.) Learn more.\nHow do I get a User ID and Password for ShipCSX?\nHow do I go about conducting transactions with CSX?\nTo get information and manage the day-to-day business transactions necessary for shipping by rail, we recommend using electronic transaction tools. Read about transactions and the tools available at CSX.\nDo I have to apply for credit with CSX?\nCSX requires all customers who are responsible for freight bills to apply for credit. This policy applies to shippers, receivers and third parties. CSX's credit terms are 15 days, which begin with the date of the freight bill and end with the payment due date. Fill out the credit application and follow the instructions to submit.\nHow do I know if rail will work at my facility?\nOur Service Start-up team can help make sure that your facility is rail served and your track is serviceable, and that CSX serves your location and can meet your service needs. Contact the Service Start-up team member in your area.\nWhat if I am not located on rail? How can I take advantage of the economies of shipping by rail?\nIf you don't have direct access to tracks, then intermodal service, TRANSFLO or warehousing may be a solution.\nHow do I apply for a job or submit my resume?\nTo be considered for any position, you must create a profile through the CSX website. Mailed and emailed resumes will not be considered. To apply for a position at CSX, please follow the steps below.\nTo check your application status, log in to the CSX Jobs tool, and click on the \"MyJobpage\" tab\nDoes CSX offer internship opportunities?\nHow can I get a price quote from CSX?\nIf you are not a current CSX customer but would like pricing information, contact our New Business Development team at NBD@csx.com.\nIf you're already a customer, log in to the ShipCSX Price Lookup tool to get a price for a specific general merchandise move. You can search by origin, destination and commodity to find the price for your specific shipping requirements.\nCan I purchase property with rail access?\nDo you have any cabooses for sale?\nCSX uses a small number of cabooses as converted shoving platforms; however, we are continually re-evaluating our fleet and may consider selling some of the cabooses from time to time. Please email InvestmentRecovery@csx.com with your inquiry.\nCan I purchase scrap ties for landscaping?\nCSX generally does not sell scrap materials directly to the general public. We have contracts with several companies that handle our scrap-removal services. If you wish to purchase scrap ties, contact National Salvage and Service Corporation at 800-769-8437.\nHow do I buy or lease railroad land?\nHow can I buy an old railroad building or structure?\nThe railroad considers public safety and that of its employees to be paramount concerns and must consider the risks related to these concerns in any conveyance of a railroad building or structure. The railroad, therefore, requires that any building or structure situated within 50 feet of the centerline of an operating track be removed – at no cost to the railroad – from railroad land and relocated to non-railroad-owned land.\nHow do I obtain permission to go on to railroad land?\nHow can I obtain a copy of a railroad map?\nHow can I get a map of an old railroad right-of-way?\nHow would I be added as a contact?\nIn order to be added as an iSupplier portal contact, we need your CSX Business Partner to verify you are an approved contact for your company. Please send an email to your CSX Business Partner with your request.\nWhere do I find more information about suppliers?\nWhere can I find investment information in CSX and its subsidiaries?"
    },
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/index.cfm/about-us/history-evolution",
        "Content_Type": "Website Content",
        "Raw_Text": "Introduction\nExplore CSX's History\nFrom humble beginnings of horse-drawn rail cars to electric locomotives capable of moving hundreds of tons of cargo, CSX celebrates a rich history covering almost 190 years.\nScroll, using your mouse or keyboard, through time to explore our history and heritage. Through times of war and times of peace, see how railroad companies expanded and then consolidated to make up the CSX you know today.\nThe Birth of American Rail\n(Late 1820s)\nThe CSX story began with America’s first common carrier, The Baltimore and Ohio Railroad. Originally powered by horses, the B&O set in motion the events that would lead to America’s most efficient means of transporting goods.\nThe CSX family tree began on February 28, 1827, when the Baltimore & Ohio Railroad, America's first common carrier railroad, was chartered. Its original line covered one state and 13 miles; today CSX covers 23 states on our 21,000-mile network.\n1827\nBaltimore & Ohio began operations on May 24, 1830, as the first common-carrier railroad in the U.S.\nMAY 24\n1830"
    },
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/index.cfm/about-us/legacy-locomotives",
        "Content_Type": "Website Content",
        "Raw_Text": "CSX has a rich and storied past, spanning hundreds of years and multiple legacy rail lines. We are dedicated to honoring the railroaders and predecessor rail lines that have made CSX the company it is today.\nLineage locomotives are unique partnership projects between CSX, museums, historical societies and local communities. CSX partners with local organizations to return rolling pieces of history back to their original luster, then places the newly restored locomotives in their home communities for local citizens and rail fans from around the country to enjoy for years to come.\nThe CSX team supported the two projects below, the restoration of the 1865 Civil War-era Texas and the reviving of an iconic C&O Chessie Cat engine, to capture the essence of the past and preserve the passion of railroading for future generations.\nIn addition to the restoration projects, CSX has worked with non-profit partners to compile images and historical information on other rolling stock and engines from predecessor lines to document the rich history of the rail industry and CSX."
    },
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/index.cfm/about-us/state-information",
        "Content_Type": "Website Content",
        "Raw_Text": "CSX is a premier transportation company that provides rail, intermodal and rail-to-truck transload services and solutions to customers across a broad array of markets, including energy, industrial, construction, agricultural, and consumer products.\nFor nearly 200 years, CSX has played a critical role in the nation's economic expansion and industrial development. Our 20,000-mile network connects every major metropolitan area in the eastern United States, where nearly two-thirds of the nation's population resides. It also links more than 240 short-line railroads and regional railroads and over 70 ocean, river and lake ports.\nLearn more – view fast facts about our 2023 state operations:"
    },
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/index.cfm/community-investment/pride-in-service/",
        "Content_Type": "Website Content",
        "Raw_Text": "CSX Pride in Service is our signature community investment program, dedicated to honoring and serving our nation’s veterans, military, and first responders. Nearly one in every five employees has served, and many of the communities we touch have high concentrations of military families. Through Pride in Service, we collaborate with nonprofit partners to connect first responders, service members, and their families with the resources and support they need.\nOur programs focus on bridging community divides, workforce development, financial assistance and food insecurity. We fund programs that bring military and first responder communities closer to their civilian neighbors, support veterans transitioning into the civilian workforce, and provide critical financial assistance.\nCSX Pride in Service is recognized on a national stage for our innovative approach to community engagement and social impact. Our social responsibility efforts reflect our core values of service and positive community impact. Together with our signature Pride in Service partners we are dedicated to providing our nations heroes with the support and recognition they deserve.\nTo fulfill our commitment, we have partnered with leading organizations such as Blue Star Families, First Responder Children’s Foundation, Operation Gratitude, Operation Homefront, and Wounded Warrior Project. Through these partnerships, we deliver unique impact for military and first responder families at both national and local levels."
    },
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/index.cfm/community-investment/pride-in-service",
        "Content_Type": "Website Content",
        "Raw_Text": "CSX Pride in Service is our signature community investment program, dedicated to honoring and serving our nation’s veterans, military, and first responders. Nearly one in every five employees has served, and many of the communities we touch have high concentrations of military families. Through Pride in Service, we collaborate with nonprofit partners to connect first responders, service members, and their families with the resources and support they need.\nOur programs focus on bridging community divides, workforce development, financial assistance and food insecurity. We fund programs that bring military and first responder communities closer to their civilian neighbors, support veterans transitioning into the civilian workforce, and provide critical financial assistance.\nCSX Pride in Service is recognized on a national stage for our innovative approach to community engagement and social impact. Our social responsibility efforts reflect our core values of service and positive community impact. Together with our signature Pride in Service partners we are dedicated to providing our nations heroes with the support and recognition they deserve.\nTo fulfill our commitment, we have partnered with leading organizations such as Blue Star Families, First Responder Children’s Foundation, Operation Gratitude, Operation Homefront, and Wounded Warrior Project. Through these partnerships, we deliver unique impact for military and first responder families at both national and local levels."
    },
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/index.cfm/community-investment/volunteer-service",
        "Content_Type": "Website Content",
        "Raw_Text": "CSX employs more than 20,000 people who take pride in the work that they do in their jobs and in their communities. Employees are given the choice to support the charitable organizations that mean the most to them and their families. From helping kids learn to read, to rebuilding local parks and community centers, CSX volunteers really do make a difference.\nThe company has established several volunteer programs to recognize the positive difference employees make across the CSX network.\nDollars for Doers\nCSX encourages employees to share their valuable talents, tools and techniques with the nonprofit organizations they care about. That’s why CSX established Dollars for Doers. Through the CSX Foundation, employees are recognized for the positive difference they make by serving in their communities across the CSX network.\nThe process is simple. Once a CSX employee volunteers at least 15 hours with a qualifying nonprofit organization, the CSX Foundation will donate $10 for every hour volunteered, up to 40 hours, to an eligible organization of the employee’s choice.\nMatching Gifts\nCSX will match, dollar-for-dollar, up to a $1,000 donation a year made by a CSX employee to the federally registered charitable organization of their choice. Donations must be made through the CSX’s Pride in Service: Volunteer and Giving Center, and can be made either by credit card, by setting up an automatic payroll deduction, or by requesting a match to a previous donation made within 90 days. Donations can be one-time or recurring, and several charitable organizations can be supported at one time.\nBoard Service\nOffered through the CSX Foundation, the board service program is designed for directors and above to recognize and encourage their leadership on the board of directors of nonprofit organizations in the communities where employees live and work.\nEligible CSX employees who serve on the executive board for a registered 501(c)(3) organization may apply for a Board Service Grant on behalf of that organization. This is in no way part of the employee’s compensation; rather it is a CSX Foundation contribution to the organization for which they are serving as a board member.\nEnlisting CSX Volunteers\nFor an organization to officially request CSX employee volunteers, it must meet one of the following guidelines:\n- It qualifies by possessing tax-exempt status under Section 501(c)(3) of the Internal Revenue Code as listed in the IRS Master File of organizations conducting activities in the United States.\n- It qualifies as a state, county or municipal government entity, including law enforcement and fire rescue departments, and seeks funding to serve the needs of the community at large.\n- It qualifies as a pre-K–12 school, charter school, community/junior college, or college/university.\nClick here to submit a request for CSX employee volunteers."
    },
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/index.cfm/community-investment/service-partners",
        "Content_Type": "Website Content",
        "Raw_Text": "/ ShipCSX / REPORT AN EMERGENCY: 1-800-232-0144 /\nCovering 23 states in the East, Midwest and South; the District of Columbia and 2 Canadian provinces, our skilled professionals bring a proven track record to our clients, our communities and your projects.\nVisit our Corporate Social Responsibility section to learn more about how our material and service suppliers can help make a positive impact on CSX corporate sustainability efforts."
    },
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/index.cfm/community-investment/csx-in-service",
        "Content_Type": "Website Content",
        "Raw_Text": "/ ShipCSX / REPORT AN EMERGENCY: 1-800-232-0144 /\nCovering 23 states in the East, Midwest and South; the District of Columbia and 2 Canadian provinces, our skilled professionals bring a proven track record to our clients, our communities and your projects.\nVisit our Corporate Social Responsibility section to learn more about how our material and service suppliers can help make a positive impact on CSX corporate sustainability efforts."
    },
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/index.cfm/customers/customer-service",
        "Content_Type": "Website Content",
        "Raw_Text": "/ ShipCSX / REPORT AN EMERGENCY: 1-800-232-0144 /\nCovering 23 states in the East, Midwest and South; the District of Columbia and 2 Canadian provinces, our skilled professionals bring a proven track record to our clients, our communities and your projects.\nVisit our Corporate Social Responsibility section to learn more about how our material and service suppliers can help make a positive impact on CSX corporate sustainability efforts."
    },
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/index.cfm/customers/news",
        "Content_Type": "Website Content",
        "Raw_Text": "/ ShipCSX / REPORT AN EMERGENCY: 1-800-232-0144 /\nCovering 23 states in the East, Midwest and South; the District of Columbia and 2 Canadian provinces, our skilled professionals bring a proven track record to our clients, our communities and your projects.\nVisit our Corporate Social Responsibility section to learn more about how our material and service suppliers can help make a positive impact on CSX corporate sustainability efforts."
    },
    {
        "Ticker": "CSX",
        "Company": "CSX Corporation",
        "Source_URL": "https://www.csx.com/index.cfm/about-us/sustainability/service-with-purpose/",
        "Content_Type": "Website Content",
        "Raw_Text": "Our Platform and Issue Pillars\nService with Purpose is our sustainability and social impact platform encompassing four focus areas of Safety, Service, Sustainability, and Stewardship. CSX’s Sustainability Report provides an integrated, stakeholder-centered approach to annual reporting structured around this platform and pillars. The report captures how CSX creates value from the inside out, beginning with our workforce and extending across our customers, industry, shareholders, and broader communities. Our material environmental, social, and governance (ESG) issues are embedded within this framework, demonstrating clear links between our business performance and progress on business and societal priorities.\nWe report against and align our disclosures to leading standards such as GRI, SASB, TCFD, IFRS, and target-level UN SDGs to enhance transparency and comparability for all stakeholders."
    }
]