[
    {
        "Ticker": "DXCM",
        "Company": "DexCom",
        "Source_URL": "http://dexcom.com/",
        "Content_Type": "Website Content",
        "Raw_Text": "1 Dexcom, data on file. 2023. 2 Dexcom G7 User Guide. 2024.\nBRIEF SAFETY STATEMENT: Failure to use the Dexcom Continuous Glucose Monitoring System and its components according to the instructions for use provided with your device and available at https://www.dexcom.com/safety-information and to properly consider all indications, contraindications, warnings, precautions, and cautions in those instructions for use may result in you missing a severe hypoglycemia (low blood glucose) or hyperglycemia (high blood glucose) occurrence and/or making a treatment decision that may result in injury. If your glucose alerts and readings from the Dexcom CGM do not match symptoms, use a blood glucose meter to make diabetes treatment decisions. Seek medical advice and attention when appropriate, including for any medical emergency. STELO IMPORTANT INFORMATION: Consult your healthcare provider before making any medication adjustments based on your sensor readings and do not take any other medical action based on your sensor readings without consulting your healthcare provider. Do not use if you have problematic hypoglycemia. Failure to use Stelo and its components according to the instructions for use provided and to properly consider all indications, contraindications, warnings, and cautions in those instructions for use may result in you missing a severe hypoglycemia (low blood glucose) or hyperglycemia (high blood glucose) occurrence. If your sensor readings are not consistent with your symptoms, a blood glucose meter may be an option as needed and consult your healthcare provider. Seek medical advice and attention when appropriate, including before making any medication adjustments and/or for any medical emergency.\nINDICATIONS FOR USE: The Stelo Glucose Biosensor System is an over-the-counter (OTC) integrated Continuous Glucose Monitor (iCGM) intended to continuously measure, record, analyze, and display glucose values in people 18 years and older not on insulin. The Stelo Glucose Biosensor System helps to detect normal (euglycemic) and low or high (dysglycemic) glucose levels. The Stelo Glucose Biosensor System may also help the user better understand how lifestyle and behavior modification, including diet and exercise, impact glucose excursion. The user is not intended to take medical action based on the device output without consultation with a qualified healthcare professional.\nMAT-4823, LBL-1005906 REV001"
    },
    {
        "Ticker": "DXCM",
        "Company": "DexCom",
        "Source_URL": "http://dexcom.com/en-us/about-dexcom",
        "Content_Type": "Website Content",
        "Raw_Text": "Dexcom empowers people to take control of health through innovative glucose biosensing technology. For more than 25 years, our technology has transformed how people manage diabetes and track their glucose, helping them feel more in control and live more confidently.\nCorporate sustainability\nSustainability is at the heart of everything we do. From reducing our environmental impact to advancing access to our life-changing technology, there are so many initiatives that we’d like to share with you. Read our annual sustainability report to learn more.\nA career with Dexcom is an opportunity to do work that can change people’s lives while having the support to develop professionally. Learn more about our company, culture, and current openings.\nOur products give people the knowledge they need to gain control of their glucose and achieve better health. Explore our products and see what’s right for you.\nLance Bass spotlights Dexcom G7 in this interview with Yahoo news\nUsing the Dexcom G7 continuous glucose monitor has taken the guesswork out of that process as well. “Every five minutes, I get a new reading and see exactly where my glucose is,” he says.\nCNBC introduces Stelo—the first over-the-counter CGM\n“The idea is to help people, over time, learn about diet choices and habits, and how those are impacting glucose,” Jake Leach, chief operating officer at Dexcom, told CNBC in an interview.\nDexcom G7’s direct-to-watch feature explained by CNET\nIn a first, the direct-to-watch feature gives Dexcom users of continuous glucose monitors information and alerts without being in range of their phone.\nDexcom uses its own cookies as well as cookies from third parties and similar technologies for this website. We use them to provide the website and its functions, to continually improve our products and services, to display customized content on third party sites as well as for content management, traffic measurement, to create custom audiences and for analysis purposes. You can accept, decline or personalise the use of technically non-essential cookies by clicking on the appropriate button. If you click decline, certain essential cookies will be deployed in order for the website to function properly. Your consent is voluntary and not required for your use of this website. You can also withdraw your consent at any time. Please review our Cookie Policy for more information on the use of cookies and similar technologies.Click here for Cookie Policy.\nYour Opt Out Preference Signal is Honored.\nPrivacy Preference Center\nWhen you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer.\nMore Information\nManage Consent Preferences\nStrictly Necessary Cookies\nAlways Active\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work.\nFunctional Cookies\nThese cookies enable the website to provide enhanced functionality and personalization. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nPerformance Cookies\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nTargeting Cookies\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant ads on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising."
    },
    {
        "Ticker": "DXCM",
        "Company": "DexCom",
        "Source_URL": "http://dexcom.com/en-us/media-kit",
        "Content_Type": "Website Content",
        "Raw_Text": "About Dexcom\nTerms & Policies\nMAT-5161\n• MAT-3528\n© Dexcom, Inc. All rights reserved.\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work.\nThese cookies enable the website to provide enhanced functionality and personalization. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant ads on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising."
    }
]