[
    {
        "Ticker": "EXC",
        "Company": "Exelon",
        "Source_URL": "https://www.exeloncorp.com/",
        "Content_Type": "Website Content",
        "Raw_Text": "[{\"releaseDate\":{\"year\":2025,\"month\":8,\"dayOfMonth\":5,\"hourOfDay\":11,\"minute\":35,\"second\":0},\"title\":\"Exelon Inclusion Impact Report 2024\",\"topic\":[\"exelon:topics/diversity\"],\"documentType\":[\"exelon:document-types/annual-report\"],\"year\":[\"exelon:year/2025\"],\"assetPath\":\"/company/Documents/Exelon-Inclusion-Impact-Report.pdf\"},{\"releaseDate\":{\"year\":2025,\"month\":4,\"dayOfMonth\":8,\"hourOfDay\":12,\"minute\":53,\"second\":0},\"title\":\"2024 Philanthropy Report\",\"topic\":[\"exelon:topics/community\",\"exelon:topics/corporate-excellence\",\"exelon:topics/volunteerism\"],\"documentType\":[\"exelon:document-types/annual-report\"],\"year\":[\"exelon:year/2025\"],\"assetPath\":\"/company/Documents/2024 Philanthropy Report.pdf\"},{\"releaseDate\":{\"year\":2024,\"month\":6,\"dayOfMonth\":31,\"hourOfDay\":0,\"minute\":2,\"second\":0},\"title\":\"Exelon Sustainability Report 2023\",\"documentType\":[\"exelon:document-types/annual-report\"],\"assetPath\":\"/sustainability/interactive-csr/Documents/2023/esr-year-2023.pdf\"},{\"releaseDate\":{\"year\":2024,\"month\":6,\"dayOfMonth\":26,\"hourOfDay\":12,\"minute\":53,\"second\":0},\"title\":\"Exelon Diversity, Equity \\u0026 Inclusion Annal Report 2023\",\"topic\":[\"exelon:topics/diversity\"],\"documentType\":[\"exelon:document-types/annual-report\"],\"assetPath\":\"/company/Documents/2023 Exelon DEI Report.pdf\"},{\"releaseDate\":{\"year\":2024,\"month\":4,\"dayOfMonth\":24,\"hourOfDay\":11,\"minute\":7,\"second\":0},\"title\":\"2023 Exelon Philanthropy Report\",\"documentType\":[\"exelon:document-types/annual-report\"],\"assetPath\":\"/company/Documents/2023 Exelon Philanthropy Report.pdf\"}]"
    },
    {
        "Ticker": "EXC",
        "Company": "Exelon",
        "Source_URL": "https://www.exeloncorp.com/company/about-exelon",
        "Content_Type": "Website Content",
        "Raw_Text": "Working Across The Energy Spectrum\nExelon is recognized as an industry leader with best-in-class operations, with utilities achieving top quartile or better performance in customer satisfaction, reduced outage frequency, and faster service restoration. This strong record of reliability and customer satisfaction is reinforced by substantial infrastructure investments across the fleet.\nThe Exelon Family of Companies\nExelon (Nasdaq: EXC) is a Fortune 200 company and one of the nation’s largest utility companies, serving more than 10.7 million customers through six fully regulated transmission and distribution utilities — Atlantic City Electric, BGE, ComEd, Delmarva Power, PECO, and Pepco. Exelon’s 20,000 employees dedicate their time and expertise to supporting our communities through reliable, affordable and efficient energy delivery, workforce development, equity, economic development and volunteerism. Follow @Exelon on X and LinkedIn."
    },
    {
        "Ticker": "EXC",
        "Company": "Exelon",
        "Source_URL": "https://www.exeloncorp.com/company/our-vision-and-values",
        "Content_Type": "Website Content",
        "Raw_Text": "Performance That Drives Progress\nOUR PURPOSE\nPowering a cleaner and brighter future for our customers and communities.\nOUR VISION\nAt Exelon, we believe that reliable, clean, and affordable energy is essential to a brighter, more sustainable future. That's why we're committed to providing innovation, best-in-class performance and thought leadership to help drive progress for our customers and communities.\nWe Are Dedicated to Safety\nWe are committed to maintaining the highest standards of safety and reliability for our people, our customers and the communities in which we work. As a fundamental part of our culture and operations, every member of the Exelon team is dedicated to putting safety first.\nWe Actively Pursue Excellence\nWe are driven to excel. Recognizing the value of constant improvement, we reach beyond compliance to advance our processes and develop more efficient energy. In all we do, we passionately exceed the standards of our industry – and those we set for ourselves – creating value for our shareholders, customers and communities.\nWe Innovate to Better Serve Our Customers\nWe see every challenge as an opportunity to exercise our ingenuity and our competitive spirit. We encourage curiosity and exploration to develop better ways of delivering clean energy. We innovate with focus and intent, creating the solutions that matter most for our customers.\nWe Act With Integrity and Are Accountable to Our Communities and the Environment\nWe are committed to doing what’s right. A deep connection to the communities we serve compels us to take responsibility for our work, and we actively look for ways to engage and give back. We value the environment and work to reduce our impact with future generations in mind.\nWe Succeed as an Inclusive and Impactful Team\nWe foster an inclusive culture of trust, collaboration and performance. We welcome and respect people with different perspectives, backgrounds and traits because we know that diverse teams drive powerful outcomes."
    },
    {
        "Ticker": "EXC",
        "Company": "Exelon",
        "Source_URL": "https://www.exeloncorp.com/company/innovation-stories",
        "Content_Type": "Website Content",
        "Raw_Text": "Exelon has developed a culture of innovation, and here you’ll learn more about how it is advancing across the company. The energy industry is undergoing rapid, relentless transformation – and our environment encourages people to step forward with fresh new ideas."
    },
    {
        "Ticker": "EXC",
        "Company": "Exelon",
        "Source_URL": "https://www.exeloncorp.com/company/awards-and-recognition",
        "Content_Type": "Website Content",
        "Raw_Text": "Honored to serve. Focused on what matters.\nOur highest aspiration is providing energy that is reliable, clean and affordable. We're grateful when our efforts earn recognition for things that matter: the environment, the communities we serve, our operational and financial performance, and the way we advance inclusion and impact.\nTIME's list of World's Best Companies of 2025\nTIME named Exelon as one of the World’s Best Companies of 2025. The ranking measures employee satisfaction, revenue growth and sustainability transparency.\nForbes list of America's Best-In-State Employers 2025\nExelon has been ranked in Forbes America's Best-In-State Employers of 2025. The company ranked 4th in Delaware, 5th in New Jersey and 28th in Maryland.\nFortune's list of America's Most Innovative Companies of 2025\nExelon was ranked at 114 in Fortune's America’s Most Innovative Companies. The ranking is built on three pillars: product innovation, process innovation, and innovation culture.\nFast Company’s Best Workplaces for Innovators 2024\nExelon was named in Fast Company’s Best Workplaces for Innovators 2024, demonstrate a commitment to capturing great ideas, wherever they originate. Recognizing more than 150 companies that understand vitally important breakthroughs can occur on the loading dock, not just in a corner office.\nForbes America's Best Employers for Tech Workers 2024\nExelon was named in Forbes America's Best Employers for Tech Workers 2024. Tech workers were in defined in Forbes as professionals who identified themselves as having a job focused on “tech” or “IT functions,” including software development, cybersecurity, cloud computing, data project management, technical support and more.\nNewsweek's list of America's Greatest Workplaces of 2024\nExelon was named to Newsweek’s list of America’s Greatest Workplaces! This recognition is based on input from employees covering topics like compensation and benefits, training and career progression, work-life balance and company culture.\nForbes list of America’s Best Large Employers 2022\nExelon was named to Forbes list of America’s Best Large Employers! We’re proud of this recognition, especially with its input from our employees via surveys. Through their hard work we’re powering a cleaner and brighter future for our customers and communities.\nFortune Magazine \"World's Most Admired Companies\" 2006-2017, 2019-2020, 2022\nExelon has made Fortune's coveted list for 15 years. Companies are ranked on criteria that includes investment value, quality of management and products, commitment to social responsibility and ability to attract talent.\nCIO 100 Awards 2020\nFor the second year in a row, Exelon IT has received the CIO 100 Award for IT innovation and leadership. In 2019, Exelon IT partnered with PECO to transform customers' journeys for starting, stopping and moving service. The customer completion rate increased by 382% and has earned a 97% customer satisfaction rate.\nForbes The \"JUST 100\" List 2016-2022, 2024\nExelon has ranked 61st overall on JUST Capital and Forbes magazine’s inaugural “JUST 100” List, “Companies doing right by America.” The list ranks companies in the U.S. based on criteria cited as most important in a survey of 50,000 Americans, including fair pay, equal opportunity employment, job creation, workplace safety, compliance with laws and regulations, and respect for employees.\nCPA-Zicklin Index of Political Accountability and Disclosure 2011-2016\nExelon has consistently been one of the five best-performing companies, and the highest-scoring utility, on this annual index measuring the largest U.S. public companies for political transparency and accountability. The Index is a joint initiative of the Center for Political Spending and the Zicklin Center for Business Ethics at the Wharton School.\nMerger and Acquisition of the Year 2016\nExelon Corporation and Pepco Holdings Inc. were named Washington Business Journal’s Merger and Acquisition of the Year for its 2016 Best in Business Awards. The merger became effective on March 23rd, 2016, which brought together Exelon’s three electric and gas utilities, BGE, ComEd and PECO, with Pepco Holdings’ three electric and gas utilities, Atlantic City Electric, Delmarva Power and Pepco. Exelon’s six utilities deliver electricity and natural gas to approximately 10 million customers in Delaware, the District of Columbia, Illinois, Maryland, New Jersey and Pennsylvania.\nTop 3 website, 2017 All-America Executive Team\nExelon’s website ranked 3rd in the Best Website rankings for electric utilities in the 2017 All-America Executive Team. In total, 2,276 investors and 902 sell-side analysts voted across 45 sectors.\n#1 in Energy and Utilities sector for the Security 500 rankings (2012-2016)\nExelon ranked #1 in Security 500’s survey of companies within the Energy and Utilities sector for the fifth consecutive year.\nLegal Intelligencer's Legal Department of the Year 2015\nExelon's legal department was named one of Pennsylvania's Legal Departments of the Year as part of the Legal Intelligencer's 2015 Professional Excellence Awards. The award recognized Exelon's in-house legal department for their commitment to community service through pro bono work.\nSTEM Jobs Approved Employer 2015\nExelon was No. 2 on Victory Media's list of the \"Top 25 STEM Jobs Approved Employers for 2015.\" Victory Media is a workforce development company. The award recognizes companies for their STEM-skilled hiring practices and programs that attract and keep employees engaged in STEM careers.\nEdison Electric Institute Emergency Response Awards 2014\nThe Edison Electric Institute honored all three Exelon utilities - BGE, ComEd and PECO - for outstanding efforts in 2014 to restore power to customers following severe storms or natural disasters.\nPublic Utilities Fortnightly's \"40 Best Energy Companies\" 2006-2014\nExelon ranked among the top 40 U.S. energy companies measured by financial performance -- including profitability, dividend yield, free cash flow, return on equity and return on assets -- plus long-term sustainability over four years of results.\nILTA's Innovative Law Department of the Year 2014\nThe International Legal Technology Association named Exelon's legal department its \"Innovative Law Department of the Year\" for implementing a solution to enhance compliance performance. The award recognizes a corporate legal department that has delivered business value and transformational impact.\nNational Law Journal's Chicago In-House Legal Department of the Year 2014\nExelon's legal department was named Chicago's In-House Legal Department of the Year. The National Law Journal's special report highlights attorney teams that set the standard in outside counsel management, corporate compliance, diversity and pro bono service.\nAbout Exelon\nExelon (Nasdaq: EXC) is a Fortune 200 company and one of the nation’s largest utility companies, serving more than 10.7 million customers through six fully regulated transmission and distribution utilities — Atlantic City Electric, BGE, ComEd, Delmarva Power, PECO, and Pepco. Exelon’s 20,000 employees dedicate their time and expertise to supporting our communities through reliable, affordable and efficient energy delivery, workforce development, equity, economic development and volunteerism. Follow @Exelon on X and LinkedIn."
    },
    {
        "Ticker": "EXC",
        "Company": "Exelon",
        "Source_URL": "https://www.exeloncorp.com/Community-Impact-Capital-Fund",
        "Content_Type": "Website Content",
        "Raw_Text": "About the Fund\nThe Exelon funded RockCreek Group’s Community Impact Capital Fund was created to help businesses in Exelon communities grow and prosper by expanding access to capital.\nInterested businesses can access the application and instructions are listed below.\nPurpose of the CICF\nThe Community Impact Capital Fund was created to strengthen communities and help businesses grow by:\n- Providing affordable capital to businesses that have traditionally been challenged in accessing and securing funding.\n- Increasing business capacity and subsequent employment opportunities for diverse local communities.\n- Utilizing the expertise of the fund manager, RockCreek to make investment decisions.\n- With RockCreek, growing the capability of the capital fund through partnerships with community banks, other key local financial organizations and neighborhood organizations to source originations and provide additional investment and lending opportunities outside of the company-provided funding.\nThe capital fund is expected to invest in numerous businesses throughout Exelon’s service areas over the next three to five years with estimated loan amounts between $100,000 and $600,000 and equity investments of up to $2 million. To date, nearly $4 million in investments have been distributed.\n$36M\nExelon created a $36M fund to support businesses that have faced funding challenges.\n$2.9B\nIn 2022, Exelon spent $2.9B with diversity-certified suppliers.\n$48.1M\nIn 2022, Exelon and the Exelon Foundation, provided $48.1 million in funding to nonprofit organizations, with 90 percent of our total grants supporting organizations, programs or events that serve the needs of diverse populations.\n$16M\nIn 2022, Exelon’s utilities spent more than $16M on workforce development.\nFund Management\nHow the fund works\nExelon and the Exelon Foundation invested $36 million in a newly established Community Impact Capital Fund, managed by RockCreek, a leading global investment firm, to support businesses that have traditionally been challenged in accessing and securing funding. As the fund manager, RockCreek is responsible for selecting the small businesses (e.g. $500k - $10M EBITDA) with debt investments up to $600K and equity investments up to $2M that are located in and/or have a positive impact on historically disenfranchised or socio-economically disadvantaged communities in Exelon’s service areas.\nMeet RockCreek\nFounded in 2003, founder and CEO Afsaneh Mashayekhi Beschloss built an investment-management firm that nurtures a dynamic, diverse team with a global perspective to generate innovative solutions for institutional investors.\nRockCreek’s innovative team, manages more than $16 billion and has roots in leading investment, non-profit, academic, and technology firms, bringing a deep understand of global markets to investment decisions.\nInvesting across all asset classes, RockCreek believes that integrating inclusion and sustainability from the very beginning is the best way to generate long-term value.\nRockCreek will manage the originations and underwriting decisions to determine who gets financial investments from the Community Impact Capital Fund. RockCreek will evaluate potential fund co-investors that are aligned with the purpose of the fund.\nFunding Criteria\nThe Exelon funded RockCreek Group’s Community Impact Capital Fund was created to support equity and economic opportunity and to help businesses in Exelon communities grow and prosper by expanding access to capital for businesses that:\n- Face challenges in securing financing or getting access to capital; and\n- Are located in and/or have a positive impact on historically disenfranchised or socio-economically disadvantaged communities in Exelon’s service areas, including, without limitation, through growing local businesses, creating and retaining jobs, and creating opportunities in areas such as affordable housing, education and healthcare.\n- Preference will be given to businesses located in such communities.\nHow to Get Involved\nInterested businesses can access the application here or contact RockCreek for more information about the program at cicf@therockcreekgroup.com.\nFor media inquiries, contact Rockcreek at clientservices@therockcreekgroup.com\nRelated News\n-\nAugust 02, 2021\nPepco Proposes Energy Efficiency Programs to Help Residential and Business Customers Save Money and Support the District’s Leading Climate Goals -\nJune 09, 2021\nExelon Foundation and Exelon Corp. Name Selected Startups in Second Round of Climate Change Investment Initiative -\nJuly 16, 2019\nExelon Invests $5 Million to Bring Washington, D.C. Communities Together -\nOctober 27, 2021\nExelon Announces $36 Million Equity Fund to Support Minority-Owned Business Growth -\nMay 04, 2022\nExelon-Funded $36 Million Racial Equity Capital Fund, Administered By RockCreek, Accepting Applications From Minority-Owned Businesses In Service Areas"
    },
    {
        "Ticker": "EXC",
        "Company": "Exelon",
        "Source_URL": "https://www.exeloncorp.com/newsroom",
        "Content_Type": "Website Content",
        "Raw_Text": "Today, like never before, people are talking about clean energy, innovation and the environment we share. We welcome the conversation - and have a responsibility to lead it.\n*Exelon press releases are fully searchable. Press releases from our local energy companies are searchable by title only."
    },
    {
        "Ticker": "EXC",
        "Company": "Exelon",
        "Source_URL": "https://www.exeloncorp.com/newsroom/media-resources",
        "Content_Type": "Website Content",
        "Raw_Text": "Thank you for visiting the Newsroom.\nJournalists are invited to call our media hotline or contact individual communications professionals directly for immediate assistance. The numbers below are operational during business hours.\nNot a credentialed journalist? To reach the right Exelon person to help you, visit the Contact Us page. Thank you.\nUtility Company Media Hotline\nAtlantic City Electric\nMedia Hotline (24 hours)\n(609) 625-5860\nBGE\nMedia Hotline (24 hours)\n(410) 470-7433\nComEd\nMedia Hotline (24 hours)\n(312) 394-3500\nDelmarva Power\nMedia Hotline (24 hours)\n(302) 429-3060\nPECO\nMedia Hotline (24 hours)\n(215) 841-5555\nPepco\nMedia Hotline (24 hours)\n(202) 872-2680"
    },
    {
        "Ticker": "EXC",
        "Company": "Exelon",
        "Source_URL": "https://www.exeloncorp.com/sustainability",
        "Content_Type": "Website Content",
        "Raw_Text": "At Exelon, we believe that lower-carbon electricity and fuels, innovative customer programs, and reliable and affordable energy delivery systems are key to a brighter, more sustainable future. Our commitment to sustainability is at the heart of everything we do. Learn more about our practices by reviewing our Sustainability Report.\nSustainability is central to what we do.\nExelon provides reliable, clean, affordable and innovative energy products. And because operational excellence and environmental stewardship are among our values, we also conduct business in a way that is sustainable for our employees, customers and the communities in which they work and live.\nWe measure our own sustainability goals, performance and impacts - and report it transparently - using the Global Reporting Initiative Sustainability Reporting Framework. It’s the world’s most widely used, comprehensive and sustainability reporting standard.\nFor more, please read our Sustainability Report.\nCorporate Environment Policy\nExelon’s corporate environment policy drives Exelon’s environmental performance and is implemented through the company’s ISO 14001-certified Environmental Management System (EMS).\nStewardship\nHabitat and Biodiversity\nWe support efforts to restore and maintain 9,402 acres of ecosystems at certified Wildlife Habitat Council (WHC) or National Wildlife Federation (NWF) locations across company-owned lands.\nSafety\nOur Partners\nResources for the Future\nA nonprofit and nonpartisan organization, Resources for the Future has a mission to improve environmental and natural resource policymaking worldwide through objective social science research of the highest caliber.\nNational Wildlife Federation\nExelon works with the National Wildlife Federation to protect and restore our native wildlife and the habitats on which they depend through conservation initiatives and practices in and around our facilities and property.\nCampbell Institute\nIn October 2016, Exelon was accepted into the Campbell Institute as one of its first utility members. The Campbell Institute is a group of leading companies from the National Safety Council that are regarded as thought leaders.\nCERES\nSince 2008, Exelon has engaged with Ceres - a leading coalition of investors, environmental groups and public interest organizations - to help Exelon advance our sustainability performance, as well as inform our approaches to voluntary sustainability reporting and management of key issues such as climate change, energy efficiency, and water usage. Each year, a group of Ceres stakeholders meets with Exelon to provide the company with outside perspectives on issues relevant to the company’s sustainability reporting performance.\nHelpful Documents\n- 2024 CDP Climate Change Survey\n- 2023 CDP Climate Change Survey\n- Exelon Scope 1 and 2 GHG Verification\n- Exelon Scope 3 GHG Verification\n- Exelon Environmental Management System Certification\n- Exelon Utility Residual CO2 Emission Rates Verification\n- Exelon EEI/AGA ESG Quantitative Template (excel)\n- Exelon EEI/AGA ESG Quantitative Template (pdf)\nESG Resources for Investors\nEnvironmental, Social & Governance Resources for Investors"
    },
    {
        "Ticker": "EXC",
        "Company": "Exelon",
        "Source_URL": "https://www.exeloncorp.com/inclusion-and-impact",
        "Content_Type": "Website Content",
        "Raw_Text": "At Exelon, living by our core values is a business imperative – and more importantly, the right thing to do.\nInclusion and Impact Commitment\nExelon operates in a world rich in diversity—in race, ethnicity, gender, sexual orientation, gender identity, disability, religious affiliation, experience and thought. Inclusion and Impact at Exelon strengthen our company and communities by:\n- Attracting, developing, and retaining talent of all backgrounds that reflect the realities of our marketplace and communities, and the relevant labor market.\n- Creating a culture of inclusion through consistent and sustained execution of the Exelon Inclusion and Impact strategy, including progress measurement and accountability for results.\n- Achieving a diverse range of suppliers, vendors, and service providers.\n- Ensuring that Exelon leadership has a significant reach and visible presence in a strategic core group of diverse community-based organizations.\n- Seeking to be recognized as an inclusive leader by our employees, customers and communities.\nInclusive Culture\nWe are engaging with employees to drive an improved culture of accountability for Inclusion and Impact. All non-represented employees are assigned an annual Inclusion and Impact performance goal to help us achieve a more inclusive culture. We will continue to focus on these internal goals in the future, identifying and setting more specific goals while emphasizing both individual and organizational action in support of Inclusion and Impact.\nPowering Communities\nWe seek to bring economic equity and empowerment to underserved communities by helping create jobs and opportunities where too few exist today. We support an extensive array of STEM learning programs to educate the next generation workforce and advance meaningful change. For example, our annual Exelon Foundation STEM Academy and Boys to STEM Academy provides young people the opportunity to participate in mentor-guided, hands-on activities and experiments, preparing them for future careers in STEM.\nWith over 90 different workforce development programs across our six utilities, we are working to equip the unemployed and underemployed in our operating regions with valuable job skills. A highlight of our workforce development efforts — Infrastructure Academies at each of Exelon's utilities — create pathways into utility careers through training programs offered in partnership with other entities. Examples include the ComEd CONSTRUCT program, sponsored by a coalition of construction and related industry companies providing equal employment opportunities in Illinois, and Pepco's D.C. Infrastructure Academy that prepares participants for jobs with leading companies, helping to create a path to the middle class.\nTransforming Partnerships\nWe continued to increase our total diverse supply spend and set new records. We continue to enhance partnerships with regional chambers of commerce to provide grants and small business loans to help strengthen minority-owned small businesses and foster economic empowerment and entrepreneurship. Additionally, Exelon has launched a new pilot program with three regional affiliates of the National Minority Supplier Development Council to grow minority-owned businesses in the utility industry, focusing on Exelon's key markets.\n2024 Inclusion Impact Annual Report\nGuided by five central pillars—diverse workforce, inclusive workplace, community partnerships, diverse business empowerment, and thought leadership— this work plays a pivotal role in our mission to provide safe, reliable, and affordable energy to our customers.\nCommunity Impact Capital Fund (CICF)\nThe Exelon funded RockCreek Group’s Community Impact Capital Fund (CICF) aims to support equity and provide more economic opportunities to businesses in communities that Exelon serves.\nInclusive Workforce\nTo attract, develop, and retain talent of all backgrounds that reflects the realities of our marketplace and communities, and the relevant labor market"
    },
    {
        "Ticker": "EXC",
        "Company": "Exelon",
        "Source_URL": "https://www.exeloncorp.com/newsroom/exelon-funded-$36-million-racial-equity-capital-fund-administered-by-rockcreek",
        "Content_Type": "Website Content",
        "Raw_Text": "Chicago, IL – Exelon announced today that RockCreek, one of the world’s largest diverse-owned global investment firms, has opened applications for the $36 million Exelon-funded Racial Equity Capital Fund to support minority-owned businesses in Exelon’s service areas in Delaware, the District of Columbia, Maryland, Illinois, New Jersey and Pennsylvania.\nExelon, which serves more than 10 million customers through its six electric and gas utilities, announced last fall that it had partnered with the Exelon Foundation to create the Racial Equity Capital Fund. The fund will help minority businesses obtain capital to fuel growth and spur job opportunities in communities that have historically been underserved, under-resourced, and overlooked by investors and traditional funding sources. The fund will provide loans and equity investments for numerous minority businesses throughout Exelon’s service areas over the next three years, with estimated loan amounts between $100,000 and $300,000, and equity investments of nearly $1 million.\n“With this fund, we are empowering small, minority-owned businesses to grow their capacity, increase revenue and hire more employees,” said Calvin Butler, chief operating officer and senior executive vice president of Exelon. “We have identified financial partners who understand the unique challenges these businesses face, but who also share our vision and are eager to reinvigorate the communities we both serve.”\nRockCreek has forged partnerships with minority-owned lending institutions and community-based banks to increase the investment capacity of the Racial Equity Capital Fund. The fund will invest in minority-owned businesses who have historically lacked access to capital to sustain operations, grow revenues, create jobs, and increase wellbeing throughout underserved and under-resourced communities.\n“Capital is the fuel that allows businesses to grow, create jobs, and strengthen communities, and for too long, minority-owned businesses – and entire communities – have been neglected by financial markets,” said Afsaneh Beschloss, Founder and CEO of RockCreek. “The Racial Equity Capital Fund will bring this critical fuel directly to minority-owned businesses and will continue serving their communities in the years ahead.”\nInitial partners in this effort include Providence Bank & Trust; United Bank of Philadelphia; and City First Bank, National Association of Washington, DC. RockCreek continues to seek out and engage with other potential partners throughout Exelon’s service areas.\nThe partnerships are the next step in the launch of the $36 million initiative, which is funded by Exelon and managed by RockCreek. RockCreek will select businesses for financing and manage the fund to serve as a continuing resource to help grow businesses, create jobs, and strengthen the communities Exelon serves.\nInterested businesses can access the application here or contact RockCreek at RECFInquiries@therockcreekgroup.com for more information about the program.\nAbout Exelon\nExelon (Nasdaq: EXC) is a Fortune 200 company and the nation’s largest utility company, serving more than 10 million customers through six fully regulated transmission and distribution utilities — Atlantic City Electric (ACE), Baltimore Gas and Electric (BGE), Commonwealth Edison (ComEd), Delmarva Power & Light (DPL), PECO Energy Company (PECO), and Potomac Electric Power Company (Pepco). More than 18,000 Exelon employees dedicate their time and expertise to supporting our communities through reliable, affordable and efficient energy delivery, workforce development, equity, economic development and volunteerism. Follow Exelon on Twitter @Exelon.\nAbout RockCreek\nOne of the largest woman and diverse-owned global investment firms, RockCreek applies data-driven technology to invest sustainably and inclusively. Founded in 2003 by CEO Afsaneh Beschloss, former Treasurer and Chief Investment Officer of the World Bank, RockCreek has more than $16 billion in assets. RockCreek has invested more than $7.4 billion in diverse firms, including over $990 million in Black owned firms, and $6.3 billion in sustainable investments including climate, health, education, job creation, and affordable housing since its inception. Follow RockCreek on Twitter @RockCreekGroup and on LinkedIn.\nGet Instant updates when Exelon has news"
    },
    {
        "Ticker": "EXC",
        "Company": "Exelon",
        "Source_URL": "https://www.exeloncorp.com/newsroom/company-events",
        "Content_Type": "Website Content",
        "Raw_Text": "Here you’ll find upcoming and recent Exelon company events, conferences and executive speeches. The lists are easily filterable so you can find exactly what you want. Before you filter results or enter keywords in the search box, just make sure you’re on the right tab: Upcoming Events or Past Events.\nUpcoming Events\nUpcoming Events\nPast Events\nNo results found. Please change your filters or your search term."
    },
    {
        "Ticker": "EXC",
        "Company": "Exelon",
        "Source_URL": "https://www.exeloncorp.com/sustainability/strategy",
        "Content_Type": "Website Content",
        "Raw_Text": "Sustainability continues to be a fundamental element of our business strategy and a competitive advantage for Exelon. Advocacy for clean energy and a national policy on climate change continue to be top priorities. Exelon is effectively promoting energy efficiency programs and integration of customer renewables into our distribution systems and have set aggressive goals for fleet vehicle electrification..\nBuilding Value Through Technology\nExelon’s culture of embracing and empowering innovation and new technologies enables us to help shape new solutions and deliver sustainable value while building the integrated energy system of the future. We gather passionate employees and external experts to develop innovative solutions to address our biggest business challenges. Emerging technologies and business practices also drive operational excellence and accelerate the deployment of novel products and services for our customers. Our key programs for managing technology engagement across all maturity levels, ranging from early investigation of an emerging concept to full deployment across our operations.\nAt Exelon, we are powering a cleaner and brighter future for our customers and communities.\nWith the separation from Constellation Energy in February 2022, Exelon is now a pure-play T&D utility company that does not own power generation. This allows Exelon to focus on customer and community interest in cleaner, more reliable and affordable energy delivery systems. As one of the nation’s largest T&D companies, we have the size and scale to help steward the energy transition, power the economic health and well-being of the large and diverse metropolitan areas that we serve, while advocating for energy equity.\nAdvancing Clean Energy and Affordable Energy Choices\nWith today’s technologies, customers can access energy and energy services from a variety of sources. Exelon enables our customers to make choices and take advantage of the cleaner energy options that are available. Through a constant focus on operational excellence, efficiency and innovation, we strive for energy affordability and seek to ensure that all communities we serve can enjoy the economic and environmental benefits of clean energy.\nThe science is settled. Climate change is real.\nExelon is helping address climate change. We are on track to achieve our third corporate GHG reduction goal to reduce operational GHG emissions 50 percent by 2030 and achieve Net-Zero by 2050 while also supporting our customers and communities in achieving their clean energy goals.\nWhile we are focused on actions that Exelon can take to reduce greenhouse gas emissions and how we can enable customers and communities, the greater backdrop is that all nations must work to transform their energy use toward carbon neutrality to reduce the impacts of climate change for future generations. The physical changes to the climate and environment occurring as a result of past GHG emissions will continue for decades to come due to the long life of greenhouse gases in the atmosphere. Therefore, we need to focus on both eliminating future GHG emissions and preparing for the unavoidable physical impacts of climate change already occurring."
    }
]