[
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "http://www.gehealthcare.com",
        "Content_Type": "Website Content",
        "Raw_Text": "At GE HealthCare, we see possibilities through innovation. As a stand-alone company, GE HealthCare is a leader in precision care, infusing innovation with patient-focused technologies to enable better care. We’re dedicated to providing integrated solutions that make hospitals more efficient, clinicians more effective, therapies more precise, and patients healthier. Together, we’re living our purpose to create a world where healthcare has no limits.\nWe use cookies to personalize and enhance your experience on our site as well as the communications we send you. Visit our Privacy Policy to learn more or manage your personal preferences in our Cookie Consent Tool."
    },
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "http://www.gehealthcare.com/about/suppliers",
        "Content_Type": "Website Content",
        "Raw_Text": "GE HealthCare, in partnership with our Global Supplier Network, works to conduct business ethically, responsibly and with integrity to create a world where healthcare has no limits.\nOUR APPROACH\nTogether\nwith\nour\nSuppliers,\nwe\nwork\nto\ndeliver\nthe\nhighest\nquality\nand\ninnovative\nproducts\nfor\nour\npatients.\nWe\ncollectively\ntake\npride\nin\nproviding\nsafe\nworking\nconditions\nwhere\nemployees\nare\ntreated\nwith\nrespect\nwhile\nalso\nensuring\nthat\nan\nenvironmentally\nconscious\napproach\nis\ntaken\nin\nthe\nprocurement\nand\nmanufacturing\nof\nour\nproducts.\nSustainability Commitments\nA robust and fully integrated commitment to people and planet is an essential bond between a company and its employees, customers, external stakeholders, and the communities in which it operates. It is a bond between the present and the future.\nWe use cookies to personalize and enhance your experience on our site as well as the communications we send you. Visit our Privacy Policy to learn more or manage your personal preferences in our Cookie Consent Tool."
    },
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "http://www.gehealthcare.com/about/contact-us",
        "Content_Type": "Website Content",
        "Raw_Text": "We use cookies to personalize and enhance your experience on our site as well as the communications we send you. Visit our Privacy Policy to learn more or manage your personal preferences in our Cookie Consent Tool."
    },
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "http://www.gehealthcare.com/services/mtas",
        "Content_Type": "Website Content",
        "Raw_Text": "GE HealthCare is making that vision a reality with Medical Technology Advanced Services(MTAS) — a comprehensive, vendor-agnostic approach designed to help healthcare facilities plan, secure, optimize and advance healthcare technology with greater confidence and efficiency.\nThe MTAS Playbook provides a structured guide helping health systems align technology investments with both operational needs and clinical priorities."
    },
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "http://www.gehealthcare.com/about/about-ge-healthcare-systems",
        "Content_Type": "Website Content",
        "Raw_Text": "01 / 04\nCare that can turn your challenges to opportunities\nThis Care doesn’t need a map to find the way forward; across distance, scant resources, or complexity. With tailored solutions and a problem-solving approach, we helped providers in Greenland deliver confident care that’s finally close to home. Because when care is built to go further, it can meet you where you are."
    },
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "https://www.gehealthcare.com/about/our-economic-impact",
        "Content_Type": "Website Content",
        "Raw_Text": "Wisconsin\nFor more than 75 years, GE HealthCare has been a leader in the development and production of advanced medical technologies in Wisconsin, many of which are exported globally. These operations drive substantial economic output and reinforce Wisconsin’s leadership in medical device innovation and life sciences manufacturing."
    },
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "https://www.gehealthcare.com/about/ehs",
        "Content_Type": "Website Content",
        "Raw_Text": "GE HealthCare believes protecting our people includes contractors & channel partners. We partner through our Contractors Management Program to meet our minimum EHS expectations, share resources, learn from EHS events, and improve EHS Culture to better protect our third-party companies, GE HealthCare operations & people, and our customers.\nEHS: Channel Partners & Contractors\nLearn about EHS at GE HealthCare\nThe EHS Brochure shares GE HealthCare’s EHS commitment, introduces our EHS management system, and gives an overview of how we drive ownership and performance to better protect our people, the environment, and the communities we serve.\nChannel partners are expected to comply with local EHS laws and regulations, create and maintain a safe work environment to protect employees, sub-contractors, and customers from being injured, and protect GE HealthCare’s reputation. The Channel Partner EHS Handbook outline’s our EHS requirements & expectations to support approval.\nLife Saving Principles are a set of work practices that focus on critical safe working practices to reduce the likelihood of fatal and serious injuries.\nWe use cookies to personalize and enhance your experience on our site as well as the communications we send you. Visit our Privacy Policy to learn more or manage your personal preferences in our Cookie Consent Tool."
    },
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "http://www.gehealthcare.com/about/latest-innovations",
        "Content_Type": "Website Content",
        "Raw_Text": "At GE HealthCare, we see possibilities through innovation. We’re partnering with our customers to fulfill healthcare’s greatest potential through groundbreaking medical technology, intelligent devices, and care solutions. Just like we have for over 125 years.\nHighlights\nLatest innovations\n01 / 04\nCareIntellect for Perinatal\nCareIntellect for Perinatal is designed with clinical input and helps simplify complexity, enhance awareness, and streamline coordination-enabling care teams to focus on care-not on managing technology.\nCarestation™ 850 is GE HealthCare’s next-generation, FDA 510(k) pending anesthesia delivery system that is designed to help care teams adapt to evolving clinical and operational needs. Carestation 850 has the potential to advance anesthesia care through tools, customizable applications, and a sleek, space conscious footprint. The FDA 510(k) submission for Carestation 850 follows the recent CE mark in Europe and Australian Therapeutic Goods approval in Australia and New Zealand.\nVivid™ Pioneer is GE HealthCare’s most advanced, ultra-premium and adaptive cardiovascular ultrasound system yet, completely redesigned to support clinicians with extraordinary imaging in 2D, 4D and color flow, streamlined workflow, and enhanced diagnostic confidence. The ultrasound system recently received CE Mark and U.S. FDA 510(k) clearance.\n*Flyrcado™ (flurpiridaz F 18) is an FDA approved F 18 PET myocardial perfusion imaging agent for adults with known or suspected CAD that delivers higher diagnostic efficacy than SPECT MPI. With a 109 minute half life and unit dose distribution, it helps broaden access to advanced cardiac PET across more sites of care.\n* For US audiences only. This content is not intended for healthcare providers or patients outside the US. Important Safety Information\nGE HealthCare launches Vscan Air SL with Caption AI™ for rapid cardiac assessments at point of care, providing real-time guidance and automated ejection fraction estimation for informed clinical decisions.\n02 / 04\n2023\nGE HealthCare launches Sonic DL: a deep learning-based technology that helps accelerate MRI image acquisition, enhancing GE HealthCare’s AI solutions portfolio.\n03 / 04\n2023\nGE HealthCare spun-off from GE and began trading as an independent company on the Nasdaq exchange under the ticker symbol “GEHC” serving 1B+ patients annually, with 4M+ equipment installations.\n04 / 04\n2022\nGE HealthCare launches the SIGNA Experience: four synergistic technologies for MRI scans. SIGNA One, the MR imaging platform, enables intuitive workflow, efficiency, and intelligent automation.\nHighlights\n2010s: innovation resilience\n01 / 06\n2019\nThe first deep learning-based CT image reconstruction technology gains FDA clearance. Deep learning image reconstruction uses a deep neural network to produce high quality CT images.\n02 / 06\n2017\nGE HealthCare acquires Asymptote Limited, strengthening its cell therapy portfolio with a suite of technologies for the cryopreservation of cellular materials.\n03 / 06\n2017\nGE HealthCare introduces a mammography system featuring the world’s first patient-assisted compression remote control, allowing patients to control the level of compression during mammograms, easing procedure-related fears and anxiety.\n04 / 06\n2015\nGE HealthCare launches its clinical hospital “command center.” This digital solution utilizes analytics and AI to improve efficiency and care delivery.\nHighlights\n2000s: expanding horizons\n01 / 02\n2009\nGE HealthCare introduces Vscan, a handheld, pocket-sized ultrasound device that helps doctors deliver care to more people by enabling imaging at the point of care.\n02 / 02\n2002\nGE HealthCare launches Voluson 730, the first 4D ultrasound for women's health, offering clearer images of babies in utero. The same year, GE HealthCare introduces the first integrated hybrid infant incubator and warmer system known as the Giraffe OmniBed.\nHighlights\n1900s: electrifying progress\n01 / 10\n1999\nGE HealthCare introduces the first commercial SPECT/CT combo unit, enhancing diagnostic precision in disease localization.\n02 / 10\n1986\nGE HealthCare and Fanuc form GE Fanuc Automation Corporation, manufacturing programmable logic controllers, one of the fundamental building blocks of what becomes known as the Industrial Internet of Things.\n03 / 10\n1983\nGE HealthCare launches SIGNA 1.0, the first 1.5 T MR system, producing cross-sectional images of \"soft\" tissues difficult to obtain by x-ray. SIGNA remains a symbol of innovation and quality after 40+ years.\n04 / 10\n1982\nDr. Schenck and Howard Hughes obtain first human head images at 1.5 T (64 MHz). By 1985, 1.5 T becomes the dominant field strength for advanced MRI.\nHighlights\nGE HealthCare's early years\n01 / 02\n1896\nGE’s Elihu Thomson builds electrical equipment for the production of X-rays. He also demonstrates the use of stereoscopic pictures for diagnosing bone fractures.\n02 / 02\n1892\nThe General Electric Company is formed by merging the Edison General Electric Company and the Thomson-Houston Company, another prominent manufacturer of dynamos and electric lights.\nWe use cookies to personalize and enhance your experience on our site as well as the communications we send you. Visit our Privacy Policy to learn more or manage your personal preferences in our Cookie Consent Tool."
    },
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "http://www.gehealthcare.com/about/sustainability",
        "Content_Type": "Website Content",
        "Raw_Text": "Open reporting is a cornerstone of our commitment to integrity.\nOur promise\nWith\nthe\ncontinuing\nimpact\nfrom\nchanging\nclimates\nand\nglobal\nhealth\ndisparities\nthat\ncreate\nunmet\npatient\nneed,\nwe\nrecognize\nthat\nfollowing\nthrough\non\nour\nsustainability\ngoals\nhas\nnever\nbeen\nmore\nessential.\nWe\nwant\nto\nenable\nearlier,\nbetter,\nand\nfaster\ndiagnosis\nand\ntreatment\nfor\nmore\npeople\nin\nneed,\nwhile\nreducing\nour\nimpact\non\nthe\nenvironment.\n\"Sustainability considerations are central to the GE HealthCare vision. With more than one billion patients around the world touched by one of our product or care solutions annually, we recognize the important role we play in contributing toward a more sustainable world.\"\nGE HealthCare recognizes the significance of fulfilling our purpose and delivering on our ESG commitments. Since becoming an independent, publicly listed company, we have built on our historical ESG strengths to drive our sustainability initiatives and incorporate them into how we deliver for stakeholders.\nKelvin Sanborn\nHead of ESG, GE HealthCare\nLearn more about our progress in our Sustainability Report\nWe use cookies to personalize and enhance your experience on our site as well as the communications we send you. Visit our Privacy Policy to learn more or manage your personal preferences in our Cookie Consent Tool."
    },
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "http://www.gehealthcare.com/about/newsroom",
        "Content_Type": "Website Content",
        "Raw_Text": "We use cookies to personalize and enhance your experience on our site as well as the communications we send you. Visit our Privacy Policy to learn more or manage your personal preferences in our Cookie Consent Tool."
    },
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "http://www.gehealthcare.com/about/community-engagement",
        "Content_Type": "Website Content",
        "Raw_Text": "Building Healthier Outcomes Through Stronger Communities\nGE HealthCare is creating a world where healthcare has no limits by addressing health inequities at a community level with purpose and care.\nOur Vision\nGE\nHealthCare\nis\nintentionally\naddressing\nthe\nconditions\nin\nour\ncommunities\ncreating\nbarriers\nto\ncare\n–\nsupporting\nindividuals\nfacing\nthe\ngreatest\ndisparities\n–\nthrough\na\ncollaborative,\ncommunity-driven\napproach.\nOur Approach\nLead with Collaboration\nGain insight and engage with local stakeholders who know their community best.\nFocus on Impact\nNurture community programs that address the root causes of health disparities.\nEmpower our Colleagues\nEncourage colleagues to play a critical role in responding to their communities’ needs.\nOur Focus\nCreating pathways for health equity in the communities we call home\nGE HealthCare recognizes that building healthier communities begins with building stronger communities. By prioritizing tailored interventions that address social determinants of health (safe/affordable housing, healthy food, community physical environment and education), we can help reduce health disparities for vulnerable families in communities where we live and work. In our first year as an independent company, GE HealthCare is focusing its efforts on the City of Milwaukee, a community where we have significant colleague presence and a rich legacy.\nAs one of the leading global healthcare providers, GE HealthCare will continue to scale these efforts in additional communities to create a world where healthcare has no limits.\nAt this time, grants are by invitation only.\nReach out to learn more about the projects we fund.\nWe use cookies to personalize and enhance your experience on our site as well as the communications we send you. Visit our Privacy Policy to learn more or manage your personal preferences in our Cookie Consent Tool."
    },
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "http://www.gehealthcare.com/services/services/product-cybersecurity",
        "Content_Type": "Website Content",
        "Raw_Text": "We embed cybersecurity practices across every phase of our business operations, including product development, maintenance and support. Our dedicated programs are thoughtfully designed, precisely measured, and consistently applied throughout the product lifecycle — resulting in an approach that is suitable, effective, and focused on managing risks."
    },
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "http://www.gehealthcare.com/security",
        "Content_Type": "Website Content",
        "Raw_Text": "Welcome to GE HealthCare’s centralized repository to access security updates, the status and required action for our products potentially impacted by critical vulnerabilities, and historical patch product view for released non-critical patches. Cybersecurity is embedded within the GE HealthCare culture, and we are committed to protecting our business and customers. Learn more about\nGE HealthCare's Cybersecurity Risk Management System"
    },
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "http://www.gehealthcare.com/insights",
        "Content_Type": "Website Content",
        "Raw_Text": "Healthcare forward: Powered by people and possibility\nFrom breakthrough innovations to resilient stories, we explore what’s possible when opportunity meets determination.\nBreakthroughs\nWe are motivated by the trends reshaping healthcare – not just for the potential they hold but for their ability to reshape the future of healthcare and help improve the patient, clinician and provider experience.\nIt took decades for scientists to come up with treatments that could slow Alzheimer’s Disease progression. With the introduction of amyloid-targeting treatments, disease prognosis is changing.\nWe use cookies to personalize and enhance your experience on our site as well as the communications we send you. Visit our Privacy Policy to learn more or manage your personal preferences in our Cookie Consent Tool."
    },
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "http://www.gehealthcare.com/insights/leading-perspectives",
        "Content_Type": "Website Content",
        "Raw_Text": "We use cookies to personalize and enhance your experience on our site as well as the communications we send you. Visit our Privacy Policy to learn more or manage your personal preferences in our Cookie Consent Tool."
    },
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "http://www.gehealthcare.com/insights/inspiring-stories",
        "Content_Type": "Website Content",
        "Raw_Text": "We use cookies to personalize and enhance your experience on our site as well as the communications we send you. Visit our Privacy Policy to learn more or manage your personal preferences in our Cookie Consent Tool."
    },
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "https://www.gehealthcare.com/insights/articles",
        "Content_Type": "Website Content",
        "Raw_Text": "We use cookies to personalize and enhance your experience on our site as well as the communications we send you. Visit our Privacy Policy to learn more or manage your personal preferences in our Cookie Consent Tool."
    },
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "http://www.gehealthcare.com/about/suppliers/coupa",
        "Content_Type": "Website Content",
        "Raw_Text": "Advantages of using Coupa\n- It’s free! No added costs for suppliers\n- No software or hardware to download.\n- Easily accessible via your e-mail or internet browser.\n- Self-serve tool for suppliers provided – easily update profiles and contact information.\n- Easy-to-use – receive all Purchase Orders and track payment status in real time.\n- Decreased paperwork – no longer need to print, mail or fax invoices.\n- One stop shop – easily create and submit invoices online.\n- Greater visibility across the PO, invoicing, and billing/payment process.\nRequire further assistance? Reach out to us.\nWhen contacting us, please clearly state your company name, your GSL* # (if known) or any reference PO# so we can easily find you in the system along with a detailed description of the issue.\n*GSL is a unique 6-digit number that is used to identify your company record in our system\nContact us at:\nSupplierEnable.Coupa@gehealthcare.com"
    },
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "https://www.gehealthcare.com/insights/article/healthier-planet-healthier-people-transforming-healthcare-systems-with-sustainability",
        "Content_Type": "Website Content",
        "Raw_Text": "by Kelvin Sanborn, Head of ESG, GE HealthCare\nClimate change is no longer a distant threat — it is a present and accelerating crisis that profoundly impacts global public health. The World Health Organization estimates that climate change will cause 250,000 additional deaths annually over the next quarter century from malnutrition, malaria, diarrhea and heat stress. Extreme weather events — such as hurricanes, wildfires and floods — disrupt healthcare services, destroy medical infrastructure and limit access to essential treatments. Additionally, air pollution exacerbates respiratory diseases and cardiovascular conditions, increasing the demand for medical interventions.\nAs the healthcare industry works to address these challenges, medical technology companies can play a critical role in developing resilient healthcare solutions that reduce environmental impact and are able to provide accessible, effective and sustainable patient care. By integrating environmentally conscious design, reducing emissions and embracing circular economy principles, we can help build healthcare systems that are climate-resilient and deliver effective patient care.\nEnvironmentally conscious product design\nSustainable product innovation is essential to minimizing healthcare’s environmental footprint. By understanding our customers’ needs and industry challenges, we identify opportunities to bridge these gaps through innovative product design. For example, GE HealthCare’s End-tidal Control[1] software automatically adjusts and maintains exhaled oxygen and exhaled anesthetic concentrations. One study has shown a potential 44% decline in the rate of greenhouse gas (GHG) emissions when employing it.\nPrioritizing energy efficiency and emissions reductions, our engineers embed sustainability principles in the design process — striving to minimize energy consumption and enhance overall operational performance. The Omni Legend PET/CT system’s standby power mode — when idle — reduces energy consumption by up to 50%, while the SIGNA™ Champion MRI scanner’s shorter scan times reduce power demands, improve patient experience and expand imaging access. Through simple energy efficiency features, healthcare systems could significantly reduce carbon emissions and resource use, benefiting the environment and patients.\nEmbracing circular economy principles\nShifting to a circular economy approach, where products are designed for reuse, refurbishment and recycling, allows for continuous upgrades that balance environmental and business sustainability. We offer MR upgrades that preserve the existing MRI magnet, resulting in an avoidance of approximately 100 tons of CO2 emissions as compared with installation of a new system[2], while keeping our customers at the forefront of rapid technological advancement.\nThrough our GoldSeal program, we extend equipment life by accepting trade-in equipment from our customers. The equipment undergoes an extensive inspection and testing process, and if machines are found to still be viable, they are refurbished to their original specifications and resold, often to hospitals in emerging markets that need exceptionally high-quality equipment at a lower cost. Valuable components and recyclable parts are harvested from retired equipment. We want to continue to build on our long history of innovation to transform patient care, with environmentally conscious innovations.\nEnabling broader access to quality care\nMarginalized and low-income communities often bear the brunt of climate change’s health impacts. These populations frequently have limited access to healthcare and are more vulnerable to environmental hazards. Medical technology companies can support these communities by developing mobile health solutions and portable diagnostic tools — as well as support with technical training — that bring essential care to those in need.\nOur investment in the development of innovative technologies with fewer infrastructure requirements expands care to patients in difficult-to-reach areas. Vscan Air, for example, is designed to be refurbished, reused or recycled at the end of its product life. This portable, pocket-size wireless ultrasound device provides crystal-clear image quality to healthcare professionals’ fingertips and assists them wherever they need to go to bring care to their patients, whether it is on a remote island in Japan or Greece. Through these innovations, we can enable better patient care to an even broader population, helping health systems remain resilient in the face of challenges like extreme weather events.\nIn 2024 we launched the GE HealthCare Foundation, incorporated separately from GE HealthCare, focusing initially on global maternal health. The foundation is working to address critical gaps in healthcare access and delivery by funding innovative social impact initiatives aimed at making healthcare more accessible, personal, human and flexible, with initial grants going to projects in Kenya, Indonesia and the United States, in regions impacted by large disparities in maternal healthcare.\nAddressing our environmental footprint\nThe medical sector contributes about 5% of global greenhouse gas (GHG) emissions. GE HealthCare has a goal of achieving net zero by 2050. Our net zero roadmap includes reducing operational GHG emissions by 42% by 2030 from a 2022 baseline. Our Scope 1 and 2 emissions reduction strategy includes: driving energy efficiency across our operations, investing in renewable energy sources and transitioning our fleet vehicles to hybrid electric. In 2024, our facility in Zipf, Austria, achieved 100% on-site solar power generation, and our Hino, Japan, facility operates with 100% purchased off-site renewable energy. In addition, we have made notable progress in transitioning our European fleet, with 46% electric vehicles now in our Northern European fleet.\nThe future of sustainable healthcare\nThe evolving climate crisis presents significant challenges for the healthcare industry, but it also offers a critical opportunity to drive positive change. We recognize that sustainability is not just good business — it is a necessary investment to support strategies to combat climate change, reduce disease burden and strengthen healthcare systems.\nCollaboration across the industry is essential to addressing climate change’s impact on public health. Medical technology companies, healthcare providers, policymakers and environmental organizations must work together to develop sustainable healthcare solutions. Strategic partnerships enable the sharing of resources, expertise and innovative technologies to drive meaningful change. Strong customer relationships, co-designed for maximum impact, help tailor solutions to the unique needs of healthcare systems and enhance global health resilience.\nThe intersection of climate change and public health presents one of the most pressing challenges of our time. We have a responsibility — and an opportunity — to come together and help lead the charge toward a more sustainable future.\n[2] Based on internal estimates. This includes the system carbon footprint and its transportation. Carbon footprint is the reduction of carbon emission that would have happened if the client exchanged the system instead of upgrading it. The transportation CO2 emission is estimated according to the weight of the items not replaced, the mode of the shipment, the distance of the shipment and SimaPro. SimaPro estimates sustainability KPIs. The magnet/system carbon footprint are based on screening life cycle assessment (SLCA) estimated with SimaPro. The CO2 emission is estimated using the weight and material type of the system components, energy consumption and mix of energy source in manufacturing, assumptions related to recyclability of raw materials, and transportation mode for shipping the system from the factory to the customer."
    },
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "https://www.gehealthcare.com/insights/article/responsible-ai-in-healthcare-from-theory-to-practice",
        "Content_Type": "Website Content",
        "Raw_Text": "At GE HealthCare, we understand that AI systems should be used as tools to serve people, respect human dignity, and uphold personal autonomy while functioning in ways that can be appropriately controlled and overseen by humans. This calls for a multifaceted approach, because AI is not a single technology but rather a collection of diverse technologies, each with specific capabilities. For this reason, we are committed to helping enable that proper human oversight mechanisms are in place, tailored to the specific context of use and in compliance with applicable laws.\nTrust is at the heart of everything we do at GE HealthCare. For more than 125 years, we have developed leading medical devices, patient care solutions, and pharmaceutical services, earning the confidence of healthcare providers and patients worldwide. With an installed base of over 5 million units, spanning X-ray, PET, Ultrasound, and ECG, our technologies support more than 1 billion patients annually, providing critical data and insights that drive quality care and life-saving decisions.\nThat is why we developed our Responsible AI Principles. These principles inform every stage of our product development, helping AI serve as a trusted partner in healthcare.\nIn this article, I will first outline our Principles for Responsible AI. Then, I will demonstrate how we bring these principles to life in tangible and impactful ways in the real world.\nOur 7 Principles for Responsible AI\nOur Responsible AI Principles are designed so that every AI system we engage or develop meets the highest standards of performance, safety, and accountability. These principles include the following key areas:\n-\nSafety: GE HealthCare seeks to protect against harm to human life, health, property, or the environment associated with unintended applications or access to AI Systems at the organization. GE HealthCare is also committed to developing and using AI Systems in a sustainable and environmental manner that embraces opportunities to promote socially conscious use of AI in alignment with the GE HealthCare ESG goals.\n-\nValidity and Reliability: We develop and deploy AI systems to consistently provide accurate outputs or behave within a defined range of acceptability when subject to expected conditions of use, helping provide reliability.\n-\nSecurity and Resiliency: We design AI systems to help withstand unexpected adverse events or unexpected changes in their environment or use, maintaining confidentiality, integrity, and availability in the event of adversarial or unauthorized actions.\n-\nAccountability and Transparency: We help facilitate the delivery of meaningful and timely information about every AI system to relevant stakeholders, tailored to the expected knowledge and accessibility needs of each audience. An accountability structure governs each decision made related to an AI system.\n-\nExplainability and Interpretability: We design and document AI systems to allow for traceability and explainability so that they are able to answer, when needed, how and why a decision was made.\n-\nPrivacy-Enhanced: We develop AI systems that safeguard privacy, with an objective of using best practices to maintain human autonomy, identity, and dignity.\n-\nFairness with Harmful Bias Managed: GE HealthCare aims to develop and use AI Systems in a way that encourages fairness and increases access to care, while avoiding unlawful discrimination and appropriately mitigating unfair biases.\nFrom Theory to Action\nLet’s cover a few ways these principles can be put into action.\nHallucinations\nHallucinations in AI occur when a model generates false or misleading information that seems plausible but is not based on reality. These errors can be dangerous in healthcare, where inaccurate outputs may lead to incorrect diagnoses or treatments.\nPrompt engineering helps mitigate hallucinations by refining how models generate responses. Clear prompts with sufficient context help improve accuracy. For example, structured inputs like medical history, symptoms, and imaging data guide the model’s output more effectively than open-ended prompts.\nRetrieve-Augment-Generate (RAG) techniques reduce hallucinations by grounding responses in retrieved factual data. Visual grounding can further enhance accuracy by linking language descriptions to specific regions in medical images. For instance, a Medical Report Grounding (MRG) system can highlight areas of concern, such as lung consolidation in an X-ray, aiding radiologists confirm the diagnosis based on the relevant region in the scan.\nExplainability techniques and ontology-based reasoning can also enhance reliability. Ontology frameworks cross-check symptoms with known disease classifications to help prevent errors, while LLM temperature control mechanisms help control for output stability and reproducibility.\nResponsible AI in Design\nOur Responsible AI principles drive the design of tools with an aim of enhancing safety, transparency, and clinical efficacy. The Real-Time Ejection Fraction (EF) tool currently in development exemplifies this approach, streamlining left ventricular (LV) function assessment using point-of-care ultrasound (POCUS). LV function is vital for evaluating heart health. The tool provides rapid, semi-automated EF measurements with a multicolor Quality Indicator (green, yellow, red) to assess scan quality and consistency in real-time.\nReal-time Ejection Fraction tool in action\nTraditionally, EF calculation required manual imaging and measurements, taking 10–15 minutes and relying on specialized expertise. Our testing shows that this tool delivers faster results which can help improve speed and accuracy.\nThe tool demonstrates Responsible AI by helping facilitate transparency through a color-coded quality system and allowing users to review and select optimal data. It is designed to enhance safety with guidance during suboptimal scans and maintains accountability through manual confirmation and traceability of selected frames.\nBy improving accessibility and reducing variability in results, the tool is designed to promote accuracy. Validated against expert measurements, it helps facilitate reliability, supporting timely diagnoses and increased access to advanced cardiac care.\nDefining Intended Use Cases\nIntended use cases define the specific applications for which an AI system is designed, helping it meet safety, performance, and regulatory requirements. This is particularly important for generalized technologies like foundation models, which have broad capabilities but must be tailored to specific tasks for reliable deployment.\nBy clearly defining intended use cases, we help maintain control over performance, support compliance, and mitigate risks. This approach is meant to help us unlock the full potential of foundation models.\nI'll cover other ways we can help facilitate the responsible rollout of AI in future discussions. For now, I hope the examples provided illustrate how Responsible AI is not just a principle at GE HealthCare— it is embedded into our product development processes, guiding our approach to innovation and patient care."
    },
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "https://www.gehealthcare.com/insights/article/changing-the-game-future-ready-healthcare-systems-adopt-enterprise-partnerships",
        "Content_Type": "Website Content",
        "Raw_Text": "When Sutter Health, one of the United States’ leading not-for-profit health systems, faced the challenge of how to increase patient access to high-caliber, fully integrated care, it used the opportunity to think differently about its approach, including moving from a transactional relationship to a transformational collaboration.\nWith 14,000 clinicians and continued expansion in primary and specialty care throughout California, the company serves 3.6 million unique patients in more than 300 inpatient and outpatient facilities. Bringing the latest in imaging and healthcare technologies to all the locations in its footprint and integrating those technologies across facilities and clinical teams would speed access to care while reducing clinical variation and improving imaging utilization. It also supports the training, education, and development of their clinicians. This strategy goes hand in hand with the cultural and mission-driven transformation underway: “Caring for our Patients first and our People always.”\nReconfiguring technology for all those sites and teams in order to achieve this expansion wouldn’t be easy, though.\nEnter GE HealthCare and its programmatic long-term enterprise partnership approach to helping health systems deliver care tailored to specific needs. This effort with Sutter Health yielded a multi-year strategic agreement that will help increase capacity, allowing it to expand patient access and deliver a consistent patient experience. It will leverage dedicated experts and advisory services and place advanced GE HealthCare technology and AI offerings throughout their system. The alliance will ultimately deliver on the goal of helping clinicians meet changing patient needs more efficiently and quickly than ever before.\n“We keep coming back to purpose all the time and the impact we have. This is also true in our relationship with GE HealthCare. It’s about taking better care of patients, providing better equipment and technology and doing this so we can boost our capacity and have better access for patients. You have to ground everything in the purpose and what we’re trying to accomplish,” says Warner Thomas, president and CEO of Sutter Health.\nThese enterprise partnerships feature creative and collaborative problem-solving for health-systems- that builds on GE HealthCare’s innovative suite of medical technology and care solutions. The long-term relationships are customized for the unique needs and vision of the healthcare system, co-designed with impact in mind.\n“We see more and more customers seeking to evolve beyond a transactional relationship. We offer a partnership where we’re working alongside them, arm in arm, to help solve some of their biggest challenges,” says Peter Arduini, president and CEO of GE HealthCare. “We make lots of critical equipment that’s used for diagnosis, services and training. The additional value we are able to deliver through these partnerships is solving for ‘How do you integrate people, processes and technology to efficiently deliver precision care and unlock the greatest impact for our customers?’”\nGE HealthCare’s collaboration with Sutter Health, one of the company’s largest strategic alliances to date, reflects GE HealthCare’s strategy evolution from a critical care equipment provider to a healthcare solutions provider, working as a holistic partner delivering transformative strategy and service solutions.\nAI and consistent, connected healthcare\nThe goal of these enterprise partnerships is to work together with clinicians and health systems to understand and address obstacles they may have to delivering care in a changing healthcare environment.\nOne of the alliance’s focus areas is helping Sutter Health increase capacity, thereby improving patient access and delivering a consistent patient experience. This is achieved through the integration of people (dedicated expert resources and advisory services), process (workflow optimization throughout the entire patient journey) and technology (the adoption of AIR™ Recon DL, a deep-learning-enabled algorithm that removes noise from raw images, completes scans up to 50% faster and produces significantly sharper images, smoothing workflow and enhancing the patient experience).\nOne obstacle care providers encounter is aging equipment, and the need to access the latest innovations and keep current over time; this enterprise partnership effectively addresses that challenge. A key aspect of agreements such as Sutter Health’s is that it integrates and standardizes technology across their facilities, including — in Sutter Health’s case — its more than 200 outpatient care sites. Now they can more seamlessly unite on their approach and reduce the risk of operating in silos.\n“The whole idea is really to be closer to patients, to be more outpatient-oriented, to be more connected at home,” Thomas says. The nearly two-thirds of Sutter Health’s patients who digitally engage with the health system are already six times more likely to seek care through digital channels, he notes. “This collaboration helps patients experience more seamless and coordinated care, no matter where they enter the Sutter Health system.”\nThe healthcare industry’s move toward more connected, integrated care enabled by digital tools and AI is also a factor driving enterprise partnerships like Sutter Health’s. Technology is giving patients more control over their care and making them more active participants with their care providers. Recognizing that, Sutter Health aims to transition more care to outpatient settings, blending new and existing technologies to best meet a patient’s unique needs.\nGE HealthCare is focused on enabling these shifts in how care is delivered. The company’s D3 strategy — using smart devices across disease states enabled by digital tools— is aimed at enabling precision care, tailored to the patient, as well as addressing systemic problems like provider burnout and patient backlogs. With more than a century of innovation heritage, GE HealthCare invests approximately $1 billion annually into research and development and intends to embed AI into every device it launches in the next eight years.\nExpanding access to enable precision care\nGE HealthCare’s enterprise partnerships are customized to address what matters most to each healthcare system. The technology standardization that Sutter Health’s alliance brings, for example, enables patients to receive higher-quality imaging closer to where they live, in an outpatient center, rather than traveling to a hospital setting. The approach gives clinicians throughout the Sutter Health system access to more consistent solutions so they can address patient needs more efficiently and closer to the patient.\n“The point for us is faster, better diagnostics, which in the end is great for our patients,” Thomas says. “That is what our clinicians want — they want to have these better capabilities. This allows us to take care of more patients and do so in a more effective and faster way. All of those things really align.”\nGE HealthCare will also oversee maintenance of Sutter Health’s new equipment, ensuring that downtime for maintenance is minimized. In addition, GE HealthCare will assist Sutter Health’s workforce development programs, which include ongoing training and education for technologists, nurses and physicians. The two organizations will work together to design workforce and talent development programs aimed at attraction and retention to help address the critical shortage of clinicians.\nStrategic enterprise partnerships: A global trend\nOn the heels of the Sutter Health announcement, Nuffield Health, the United Kingdom’s largest healthcare charity, agreed to a 20-year, £200 million ($250 million) collaboration under which GE HealthCare will manage technology acquisition, installation, maintenance and training — delivering more than 800 pieces of equipment over the life of the agreement. Gaining increased access to GE HealthCare’s cutting-edge diagnostic capabilities will help address the long wait times facing Britain’s National Health Service, according to Nuffield Health CEO Alex Perry.\nThese collaborations help drive healthcare innovation and address challenges like access to quality care and workforce shortages.\nSutter Health’s Thomas says his organization chose to partner with GE HealthCare because of the 20-year relationship between the two organizations and GE HealthCare’s history of success with strategic partnerships. “They can point us to the best practices that they see in other places and bring those to Sutter Health,” he says. “That’s a win for us. It’s a win for our patients and a win for our communities.”"
    },
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "https://www.gehealthcare.com/insights/article/leading-the-charge-how-ge-healthcares-global-fleet-team-is-transitioning-to-electric-vehicles",
        "Content_Type": "Website Content",
        "Raw_Text": "In a bold step toward a more sustainable future, Damion Bennett, GE HealthCare’s global fleet operations & sourcing manager, and his team, spearheaded an ambitious transformation: converting the company’s fleet of 12,000 vehicles from internal combustion engines (ICE) vehicles to electric vehicles (EVs), starting across Europe. This strategic shift is an essential step towards reducing the company’s overall environmental footprint.\nIdentifying solutions that make a meaningful impact in addressing global environmental challenges is a shared focus area for the healthcare industry. “Particularly in Europe, we find that in the bid process, customers use a company’s sustainability initiatives as part of their criteria for considering purchasing our products,” Bennett said. “Introducing EVs into our fleet demonstrates our commitment to climate solutions and strengthens customer partnerships.\nAccelerating emissions reduction\nTransportation remains one of the largest contributors to greenhouse gas (GHG) emissions, and fleet vehicles play a significant role. In fact, GE HealthCare’s global fleet represents approximately 25% of the company’s operational emissions. With a 2030 goal of 42% operational emissions reduction from a 2022 baseline year, the Bennett’s team recognized the potential impact and added several EVs to the European fleet over the past year.\n“EVs require only 30% to 40% of the energy that gas-powered vehicles need to travel the same distance. They are more energy efficient and produce less pollution than ICE vehicles. With electricity generally being cheaper than fossil fuels, GE HealthCare also benefits from a cost perspective,” said Marie Drouot, Leader Environment & Sustainability.\nThe significant reduction in energy consumption is where EVs lead. Multiplying these savings over thousands of miles means EVs are delivering not just emissions savings but cost savings, too.\nSecuring colleague endorsement\nThe program’s success is also attributed to the support from colleagues across the European Union (EU). Transitioning to EVs is a significant change, and colleague acceptance has been crucial to their adoption. Bennett and his team placed carbon emissions caps on ICE vehicles that the company could purchase in the EU, promoting the adoption of hybrid vehicles that do not require a charging station. Gradually, with a focus on education and engagement through interactive workshops, test drives and information sessions, colleagues gained experience driving a lower-emissions vehicle. Now the team is moving colleagues from hybrids and plug-in hybrids to 100% EVs.\n“What we found is that colleagues, when they come to renew their car, they’re confident in their ability to handle a plug-in. So, they’re quite keen to then order a fully electric vehicle,” Bennett says.\nIn observance of World EV Day in September 2024, GE HealthCare’s fleet team organized an on-site event in Budapest, Hungary, featuring a range of electric vehicles from Kia, Tesla and Volvo. The event provided an opportunity to demystify EVs and experience the latest technology with test drives and individual Q&As with manufacturer representatives.\n“This event was designed to educate and inspire,” said Dora Krisztina Tobias, Regional Sourcing Leader. “Seeing such enthusiasm and engagement from our colleagues affirms we’re on the right path, and their suggestions also show us where we can grow.”\nTailoring regional approaches\nConverting a global fleet comes with unique challenges–one solution doesn’t fit all. Working directly with manufacturers to source the right vehicles in the region, Bennett and his team were able to address local needs, infrastructure, and regulatory landscapes.\nEmployees in the Netherlands, for example, can now only order 100% electric vehicles. To date, EVs represent 14% of the vehicle fleet across Europe led by Northern European countries, with 46% electric vehicles in the fleet. Many more are planned to be deployed in 2025.\n“The key is flexibility,” said Bennett. “We don’t impose a single solution but adapt to the specific realities of each market.”\nFor instance, they are also exploring innovative ways to redefine mobility for employees. Shifting from traditional vehicle ownership to flexible, sustainable mobility options could meet more diverse needs, reduce costs, and further environmental goals.\nDriving forward\nBeyond emissions reductions and potential cost savings, GE HealthCare’s EV transition underscores its commitment to meaningful climate action. By reducing the carbon footprint, GE HealthCare is not only contributing to the fight against climate change but also embodying its mission to improve outcomes for patients and healthcare providers around the world. This transition demonstrates that environmental stewardship and operational excellence can go hand in hand, benefiting both communities and the planet. Bennett and his team continue to build momentum, proving that innovation, collaboration, and an unwavering commitment to sustainability can transform the way business is done. Their efforts set a powerful example, showcasing how a forward-thinking approach can drive impactful change and pave the way for a more resilient and sustainable future."
    },
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "https://www.gehealthcare.com/insights",
        "Content_Type": "Website Content",
        "Raw_Text": "Healthcare forward: Powered by people and possibility\nFrom breakthrough innovations to resilient stories, we explore what’s possible when opportunity meets determination.\nBreakthroughs\nWe are motivated by the trends reshaping healthcare – not just for the potential they hold but for their ability to reshape the future of healthcare and help improve the patient, clinician and provider experience.\nIt took decades for scientists to come up with treatments that could slow Alzheimer’s Disease progression. With the introduction of amyloid-targeting treatments, disease prognosis is changing.\nWe use cookies to personalize and enhance your experience on our site as well as the communications we send you. Visit our Privacy Policy to learn more or manage your personal preferences in our Cookie Consent Tool."
    },
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "https://www.gehealthcare.com/about/about-ge-healthcare-systems",
        "Content_Type": "Website Content",
        "Raw_Text": "01 / 04\nCare that can turn your challenges to opportunities\nThis Care doesn’t need a map to find the way forward; across distance, scant resources, or complexity. With tailored solutions and a problem-solving approach, we helped providers in Greenland deliver confident care that’s finally close to home. Because when care is built to go further, it can meet you where you are."
    },
    {
        "Ticker": "GEHC",
        "Company": "GE HealthCare",
        "Source_URL": "https://www.gehealthcare.com/about/spin-off",
        "Content_Type": "Website Content",
        "Raw_Text": "At GE HealthCare, we see possibilities through innovation. As a stand-alone company, GE HealthCare is a leader in precision care, infusing innovation with patient-focused technologies to enable better care. We’re dedicated to providing integrated solutions that make hospitals more efficient, clinicians more effective, therapies more precise, and patients healthier. Together, we’re living our purpose to create a world where healthcare has no limits.\nOver 100 years of heritage. An optimistic outlook for the future.\nMore precise, connected, and compassionate care\nFor more than 100 years, GE HealthCare equipment has been at the forefront of provider and patient care.\nToday's healthcare requires simplifying the patient's journey and accelerating more accurate diagnoses and paths to treatment, so they can achieve a healthy, well-lived life.\nIt's why we have spun-off into an independent healthcare technology and diagnostics company in pursuit of precision care.\nTo succeed in our mission of helping providers and patients live with greater dignity, we must enable care that is simpler, connected, and more precise. Operating independently puts our people and our resources closer to those that need them most.\nThe color of change\nRetaining the GE name and monogram because they are enduring, global symbols of quality, safety, and trust.\nCurved and fluid letterforms demonstrate our focus on patients throughout a seamless and connected journey.\nEmbracing our new visual identity and signature brand color, Compassion Purple, signals change and creates instant distinction.\nIts warmth expresses our confidence and empathy towards better and brighter patient outcomes, and underscores our commitment to our people, providers, and patients.\nLiving our purpose\nWith more than 50,000 colleagues worldwide, we are not only building a healthier future but living our purpose to create a world where healthcare has no limits.\nOur new purpose is grounded in our heritage of innovation while pushing us to think bigger and bolder. We’re working to solve the greatest challenges in healthcare that patients and clinicians face today, and in the future.\nWe use cookies to personalize and enhance your experience on our site as well as the communications we send you. Visit our Privacy Policy to learn more or manage your personal preferences in our Cookie Consent Tool."
    }
]