[
    {
        "Ticker": "IDXX",
        "Company": "Idexx Laboratories",
        "Source_URL": "http://www.idexx.com",
        "Content_Type": "Website Content",
        "Raw_Text": "- Online Test Directory\n- IDEXX Online Orders\n- IDEXX Learning Center\nFrom our innovations to our people.\nFrom our innovations to our people—here are some of the ways we’re proud to have a positive impact on our industry, community, and planet.\nFrom our innovations to our people—here are some of the ways we’re proud to have a positive impact on our industry, community, and planet."
    },
    {
        "Ticker": "IDXX",
        "Company": "Idexx Laboratories",
        "Source_URL": "http://www.idexx.com/en/about-idexx/customer-support/",
        "Content_Type": "Website Content",
        "Raw_Text": "When you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer.\nMore information\nManage Consent Preferences\nStrictly Necessary Cookies\nAlways Active\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nFunctional Cookies\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nPerformance Cookies\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nTargeting Cookies\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising.\nSocial Media Cookies\nThese cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
    },
    {
        "Ticker": "IDXX",
        "Company": "Idexx Laboratories",
        "Source_URL": "http://www.idexx.com/en/about-idexx/investors/",
        "Content_Type": "Website Content",
        "Raw_Text": "Investor relations\nListed on NASDAQ since 1991 and a member of the S&P 500®, IDEXX Laboratories, Inc. (IDXX) is a global leader in veterinary diagnostics, software, and water microbiology testing.\nQ3 2025 Results – November 3, 2025\nInvestor resources\nUpcoming earnings dates\nQ4 2025: February 2, 2026\nLatest news\nEvents and presentations\nThird Quarter 2025 Earnings Conference Call\nMonday, November 3, 2025, 8:30 am EDT\nMorgan Stanley 23rd Annual Global Healthcare Conference\nTuesday, September 9, 2025, 1:50 – 2:25 pm EDT\nIDEXX Investor Day 2025\nThursday, August 14, 2025, 8:00 am EDT\nSecond Quarter 2025 Earnings Conference Call\nMonday, August 4, 2025, 8:30 am EDT\nFirst Quarter 2025 Earnings Conference Call\nThursday, May 1, 2025, 8:30 am EDT\nRaymond James 46th Annual Institutional Investors Conference\nMarch 3, 2025, 11:35 am – 12:05 pm\nFourth Quarter and Full Year 2024 Earnings Conference Call\nMonday, February 3, 2025, 8:30 am EST\nThird Quarter 2024 Earnings Conference Call\nOctober 31, 2024, 8:30 am EDT\nIDEXX Investor & Analyst Session at VMX\nMonday, January 15, 2024, 1:00 pm EST\nEvent video\nIntroducing the IDEXX inVue Dx Cellular Analyzer"
    },
    {
        "Ticker": "IDXX",
        "Company": "Idexx Laboratories",
        "Source_URL": "http://www.idexx.com/en/about-idexx/contact-idexx/",
        "Content_Type": "Website Content",
        "Raw_Text": "Contact Us\nCorporate Headquarters\nIDEXX Laboratories, Inc.\nOne IDEXX Drive\nWestbrook, Maine 04092\nUnited States\n1-207-556-0300\n1-800-548-6733\nFax: 1-207-556-4346\nEuropean Headquarters\nIDEXX B.V.\nScorpius 60 Building F\nHoofddorp, 2132 LR\nThe Netherlands\n+31-23-558-70-00\nFax: +31-23-558-72-33"
    },
    {
        "Ticker": "IDXX",
        "Company": "Idexx Laboratories",
        "Source_URL": "http://www.idexx.com/en/veterinary/snap-tests/snap-tests-technology/",
        "Content_Type": "Website Content",
        "Raw_Text": "SNAP tests\nReference-laboratory quality, continued innovation, and endless support come standard with every test.\nFind the SNAP tests you need.\nChoose from a broad menu of highly accurate pet-side assays.\nSNAP 4Dx Plus\nDogs\nThe most accurate solution available for detecting vector-borne disease.\nSNAP Heartworm RT\nDogs and cats\nProven sensitivity for even low worm-burden infections.\nSNAP Feline Triple\nCats\nDetect three underdiagnosed diseases with one blood draw.\nSNAP FIV/FeLV Combo\nCats\nScreen for two infectious diseases with one sample in just 10 minutes.\nSNAP Giardia\nDogs and cats\nFind and treat more Giardia cases.\nSNAP Parvo\nDogs\nQuickly detect canine parvovirus.\nSNAP cPL\nDogs\nAssess canine pancreatic health in minutes.\nSNAP fPL\nCats\nAssess feline pancreatic health in minutes.\nSNAP Feline proBNP\nCats\nQuickly assess cats with cardiac risk factors.\nSNAP Lepto\nDogs\nPet-side detection of antibodies to canine Leptospira spp.\nSNAP FeLV\nCats\nScreen for FeLV in just 10 minutes.\nSNAP Pro does the work for you.\n- Automates testing by automatically activating the SNAP test, timing it, and interpreting results, allowing you to focus on other priorities.\n- Allows you to view quick and accurate health assessments with easy-to-read results, eliminating guesswork and improving efficiency.\n- Updates results to patient records and supports charge capture for complete invoices, reducing missed charges.\nELISA technology sets SNAP tests apart.\nThe entire range of in-house SNAP tests is based on ELISA technology (enzyme-linked immunosorbent assay). This technology is considered the gold standard for in-house diagnostics, with high specificity and sensitivity, along with bidirectional flow and signal amplification. So you can get the most information from every sample."
    },
    {
        "Ticker": "IDXX",
        "Company": "Idexx Laboratories",
        "Source_URL": "http://www.idexx.com/en/livestock/testing-solutions/idexx-realpcr-modular-platform/",
        "Content_Type": "Website Content",
        "Raw_Text": "The IDEXX modular RealPCR platform\nStandardized. Streamlined. Efficient.\nRealPCR platform with single components standardized to work together. Run multiple targets on a single plate and purchase individual components only when you need them.\nWatch how you can start benefitting from running the RealPCR modular platform today\nTake a tour in the IDEXX RealPCR production facilities and reference laboratory\nChallenges of traditional PCR\nPurchasing separate test kits increases inventory and decreases flexibility in ordering.\n| DNA test kit 1 | DNA test kit 2 | RNA test kit1 | RNA test kit 2 |\n|\n|\n|\nRunning individual targets on separate plates increases time to results.\nRunning separate real-time PCR cycling programs increases the investment in real-time instruments.\nBenefits of the modular RealPCR platform\nPurchasing individual components as needed improves inventory and provides flexibilty in ordering.\n| Target mixes | Master mixes | Negative control | Positive control |\n|\n|\nRunning RNA and DNA targets side by side rather than on separate plates is cost-effective and reduces waste.\nUsing a single cycling protocol ( <70 minutes) for all reactions and analyzing results at the same time is faster.\nEco-friendly real-time PCR\n- Electronic inserts easily accessible with a QR code\n- Lyophilized reagents to eliminate the need of dry-ice shipments\n- Reagents in small pouches to minimize packaging material\nTarget mixes\nQuality control starts with each component\n- Pooled positive control includes all RealPCR targets\n- Internal control included in all target mixes, many of which include a host-specific and nucleic acid-specific internal sample control for complete control of the PCR workflow\n- Laboratory monitoring tools and guidelines available to check for laboratory contaminations\nStandardization streamlines workflow\n- RealPCR extraction kits for spin column-based and magnetic bead-based extraction of both DNA and RNA from a wide range of sample types\n- RealPCR modular reagents for maximum flexibility and standardization in workflow\nIDEXX RealPCR extraction kits\n- Demonstrated performance versus other commercially available extraction kits\n- Extensively validated on all common sample types, including feces\n- Uses familiar extraction methods and aligns with current workflows\n- Supported by world-class IDEXX Technical Service\n- Single source for testing supplies simplifies ordering\nRealPCR DNA/RNA Magnetic Bead Kit\nIdeal for high-throughput laboratories using full automation\nRealPCR DNA/RNA Spin Column Kit\nIdeal for low-throughput laboratories without needing to invest in instruments\nMic qPCR instrument\n- Small-sized 4-channel qPCR instrument for 48 samples\n- Easily scalable for larger sample volumes by connecting multiple instruments to one computer\n- Validated on all IDEXX RealPCR reagents\n- Minimum installation and service requirements\n- Complete thermal uniformity due to circular platform and magnetic induction\n- No reference dyes, calibration, or cross-talk compensation"
    },
    {
        "Ticker": "IDXX",
        "Company": "Idexx Laboratories",
        "Source_URL": "http://www.idexx.com/en/livestock/testing-solutions/idexx-realpcr-modular-platform/realpcr-resources/",
        "Content_Type": "Website Content",
        "Raw_Text": "RealPCR resources\nAccess and download RealPCR related software files and materials.\nAssay files for IDEXX Mic qPCR System\nSelect and download your assay (.zip file, which contains an encrypted XML file).\nSelect and download your assay (.zip file, which contains an encrypted XML file)."
    },
    {
        "Ticker": "IDXX",
        "Company": "Idexx Laboratories",
        "Source_URL": "http://www.idexx.com/en/livestock/resources-support/product-inserts/",
        "Content_Type": "Website Content",
        "Raw_Text": "IDEXX Livestock, Dairy and RealPCR Product Inserts\nThis is an online resource for IDEXX product inserts. Now you can select, download, display, or print product inserts in multiple languages.*\nCheck back for new product inserts or additional insert revisions. Confirm you are selecting the correct insert revision by checking current packaging or the Certificate of Analysis available online.\n*Inserts for products currently in the field are provided. IDEXX RealPCR Target Mixes are labeled with the approved product insert version number at the time of manufacture. Inserts for expired products are not provided, as expired products should not be used. Regulations may vary by region. Please check with your local regulatory authority for appropriate procedures."
    },
    {
        "Ticker": "IDXX",
        "Company": "Idexx Laboratories",
        "Source_URL": "http://www.idexx.com/en/about-idexx/msds/",
        "Content_Type": "Website Content",
        "Raw_Text": "(Material) Safety Data Sheets ([M]SDS)\nA tool to search for product safety information\nIDEXX (Material) Safety Data Sheets ([M]SDS) provide information about chemical substances in our products. This information facilitates training, emergency planning and hazard evaluation. You can access the (M)SDS for any product by using the search tool below.\nIf you have questions related to an (M)SDS or cannot find the (M)SDS for an IDEXX product, send us an email."
    },
    {
        "Ticker": "IDXX",
        "Company": "Idexx Laboratories",
        "Source_URL": "http://www.idexx.com/en/about-idexx/livestock-dairy-billing-support/",
        "Content_Type": "Website Content",
        "Raw_Text": "Billing support\nManage and pay invoices your way\nMyIDEXX Billing offers a streamlined digital experience designed for Business Administrators and users with Billing Permissions. Key features include:\n- Real-time account visibility: Instantly view your current account balance.\n- Comprehensive payment history: (Business Administrators only): Access full records of past and recent payments.\n- Advanced invoice management: Search, sort, and filter invoice transactions with ease.\n- Statement access: Retrieve both current and historical billing statements.\n- Data export capabilities: Export invoice activity to a CSV (Excel-compatible) file for deeper analysis.\nIDEXX offers a variety of payment methods for you to choose from with no enrollment or processing fees.\nInvoice Gateway- Online customer billing portal\n- Make payments online with credit card (Master Card, Visa or American Express) or with your checking account (Canada and US bank accounts only).\n- View, download and print statements and invoices.\n- Secure access available 24/7.\nNeed an account? Set up your new sign in today using your IDEXX billing account number and enrollment token found on your statement:\nUS Enrollment or Sign In OR Canadian Enrollment or Sign In\nAutomatic Payment Options\nIDEXX can make automatic payments on your behalf using the following options:\n- Autopay Program from your Credit Card (Master Card, Visa or American Express)\n- You can expect your enrolled credit card to be charged for the previous month charges in full on the 2nd business day of the month. For example, total charges from September 1st thru the 30th would be charged on the 2nd business day of October.\nTo enroll, complete this form and email back to the contact on the form: IDEXX Autopay Program Form\nTo Cancel or update your credit card information for your enrolled account: Call customer support: 1-800-814-1147, M-F 9am-6pm EST.\n- Direct Debit from a Checking or Savings Account (Canada and US bank accounts only)\n- Enrolled accounts are debited for the previous month statement balance in full by the 25th of the month. For example, total charges from September 1st thru the 30th would be charged on the 25th day of October (or next business day if the 25th falls on a holiday).\nTo Enroll or Update your currently enrolled bank information, complete the appropriate DocuSign link below:\nFor US customers US Direct Debit Enrollment\nFor Canadian customers Canadian Direct Debit Enrollment\nFor French Canadian customers French Canadian Direct debit Enrollment\nTo Cancel Direct Debit:\nTo cancel an existing direct debit enrollment (English version) Direct Debit Cancellation Form\nFor French Canadian customers to cancel French Canadian Cancellation Form\nPay by Check. Include your remittance stub from your monthly statement to ensure prompt processing. Allow additional time for delivery.\nSend your payment to the following payment address:\nUS Customers:\nIDEXX Distribution, Inc\nPO Box 101327\nAtlanta, GA 30392-1327\nCanadian Customers:\nIDEXX Laboratories Canada Corporation\nC/O Lockbox# 917900\nPO Box 4090 STN A\nToronto, ON M5W 0E9\nCanada\nPay via credit card or Checking account over the phone:\n1-800-814-1147\nUSD and CAD Wire/ACH direct bank transfer information\nBilling questions\nIf you have questions about your invoices or monthly billing statements, please contact the applicable division below either by email or phone and a customer service representative will be happy to assist you:\n| In-House Diagnostics, Rapid Assay, Digital | 1-800-814-1147 CagBillingTeam@idexx.com |\n| Veterinary Software and Services | SoftwareBilling@idexx.com |\n| Water | 1-800-321-0207 IdexxWater@idexx.com |\n| Livestock/Poultry/Dairy | 1-800-548-9997 LPDCS@idexx.com |\n| BioAnalytics | 1-800-669-0825 IBA-NAInvoicing@idexx.com |\n| OPTI Medical | 1-770-510-4444 Customerservice@optimedical.com |\n| Canada- French | 1-800-667-3411 CustomerSupportCanada-French@idexx.com |\n| IDEXX Reference Laboratories | 1-888-433-9987 |\n| Telemedicine | 1-800-726-1212 option 4 |"
    },
    {
        "Ticker": "IDXX",
        "Company": "Idexx Laboratories",
        "Source_URL": "http://www.idexx.com/en/about-idexx/locations/locations-and-iso-certificates/",
        "Content_Type": "Website Content",
        "Raw_Text": "Locations and ISO Certificates\nAustralia\nIDEXX Laboratories Pty. Ltd.\nMetro Centre\nUnit 6, 38-46 South Street\nRydalmere, New South Wales 2116\nAustralia\n1300 44 33 99\nIDEXX Laboratories Pty. Ltd.\nUnit 124 45 Gilby Road\nMount Waverley, Victoria 3149\nAustralia\n1300 44 33 99\nAustria\nBrazil\nIDEXX Brasil Laboratórios Ltda.\nAvenida Brigadeiro Faria Lima, 4300\n1º Andar - Ed. FL Corporate\nItaim Bibi\nSão Paulo, SP, Brazil\nCEP 04538-133\n+55 11 3095-5632\nFax: +55 11 3095-5641\nCanada\nIDEXX Laboratories Canada Corporation d/b/a IDEXX Reference Laboratories\nC/O UPS SCS\n4071 North Service Road\nBurlington, ON L7L 4X4\n1-207-556-4852\nIDEXX Laboratories Canada Corporation d/b/a IDEXX Reference Laboratories\nUnit #19, 5080 12A Street SE\nCalgary, Alberta T2G 5K9\n1-403-214-1506\nFax: 1-403-214-1562\nIDEXX Laboratories Canada Corporation d/b/a IDEXX Reference Laboratories\n8131 Roper Road\nEdmonton, Alberta T6E 6S4\n1-780-437-8808\nFax: 1-780-437-8822\nIDEXX Laboratories Canada Corporation d/b/a IDEXX Reference Laboratories\n1595 Cliveden Avenue, Units 10 & 11\nDelta, BC V3M 6M2\n1-604-525-1700\nFax: 1-604-525-1700\nIDEXX Laboratories Canada Corporation d/b/a IDEXX Reference Laboratories\n2300 54th Avenue #220\nLachine, Quebec H8T 3R2\n1-514-633-9694\nFax: 1-514-633-8820\nChina\nBeijing IDEXX Laboratories Co., Ltd.\n1F, No.10 Building\nNo.28 Yuhua Road\nBeijing Airport Economic Core Zone\n101318 Beijing China\n86-10-8045-1300\nFax: 86-10-8045-1301\nChina IDEXX Laboratories (Shanghai) Company Limited\n2F, Room C/D\nHongQiao Business Center\nNo. 2272, HongQiao Road, Shanghai 200336, China\n86-21-6127-9528\nFax: 86-21-6127-9526\nFinland\nIDEXX Laboratories Oy\nPeltokatu 16 C\n33100 Tampere, Finland\n010 387 4455\nFax: (03)2533 609\nFrance\nIDEXX SARL and Laboratoire IDEXX SARL\n84 rue Charles Michels\nBâtiment A\n93200 Saint-Denis\nFrance\n33-1-49-21- 83-21\nFax: 33-1-49-21-83-25\nGermany\nIDEXX GmbH\nHumboldtstrasse 2\n70806 Kornwestheim, Germany\n+49-69-153-253-290\nVet Med Labor GmbH\nDruckereistr. 4\nD-04159 Leipzig, Germany\n+49-0-7141-6483-0\nIndia\nIDEXX Laboratories Private Limited\nUnit No. 2239/2241, 22nd floor, WTC Bangalore\nBrigade Gateway, Rajajinager Extension\nMalleswaram, Bangalore, 560055, Karnataka, India\nMain Telephone: 91 80679 35424\nItaly\nIDEXX Laboratories Italia S.r.l.\nVia Guglielmo Silva\n36-20149 Milano (MI), Italy\n39-02-319-203-1\nN. Verde - 800917940\nFax: 39-02-319-203-47\nJapan\nIDEXX Laboratories, KK\n2F Asahi Seimei Daitabashi Building\n1-22-19 Izumi, Suginami-ku\nTokyo Japan 168-0063\n81-35-301-6700\nFax: 81-35-301-6703\nIDEXX Laboratories, KK\n(Reference Laboratories)\n5-8-18 Kajino-cho, Koganei-shi, Tokyo\n184-8515 Japan\n81-35-301-6700\nFax: 81-42-303-9011\nNew Zealand\nIDEXX Laboratories (NZ) ULC\nd/b/a New Zealand Veterinary Pathology\nIVABS Building\nMassey University\nTennant Drive\nPalmerston North 4440, New Zealand\n64-6-353-3983\nor Toll-free 0800-838-522\nFax: 64-6-353-3986\nIDEXX Laboratories (NZ) ULC\nd/b/a New Zealand Veterinary Pathology\n20A Maui Street,\nPukete, Hamilton 3200\nNew Zealand\n64-7-839-1470\nor Toll-free 0800-838-522\nFax: 64-7-839-1471\nPoland\nIDEXX Laboratories sp. z o.o.\nDivision of IDEXX Laboratories\nUl.Dominikanska 5\n02-736 Warszawa, Poland\n48-22-853-40-01\nFax: 48-22-853-40-02\nSingapore\nIDEXX Laboratories Singapore Pte Ltd\n21 Biopolis Road\nNucleos (North Tower)\nUnit 03-06\nSingapore 138567\n+65 3158 1330\nFax: +65 6397 5279\nSouth Africa\nIDEXX Laboratories (Pty) Ltd.\nUniversity of Pretoria\nFaculty of Veterinary Sciences\nOld Soutpan Road\nOnderstepoort, Pretoria\n27-12-529-8345-6\nIDEXX Laboratories (Pty) Ltd.\nUnit 7 & 8\n57 Forssman Close\nBarbeque Downs\nKyalami\nJohannesburg, South Africa\n27-11-691-8200\nSouth Korea\nIDEXX Reference Laboratories, Inc.\nNo. 520 Gangnam Ace Tower, 174-10\nJagok-ro, Gangnam-gu\nSeoul, 06373, South Korea\n+82-2-6150-3300\nFax: +82-2-6211-5015\nSpain\nIDEXX Laboratorios, S.L.\nc/ Plom nº 2-8, 3º\n08038 Barcelona, Spain\n34-93-26-72-660\nFax: 34-93-26-72-688\nIDEXX Laboratorios, S.L.\nSantander, 5. Local 37.\n28230 Las Rozas, Madrid, Spain\n34-916-377-038\nFax: 34-916-377-038\nSwitzerland\nIDEXX Switzerland GmbH\nStationsstrasse 12\nLiebefeld-Bern, CH-3097\nSwitzerland\n41-31-970-62-60\nFax: 41-31-970-62-79\nTaiwan\nIDEXX Laboratories Inc.\n6F-1 No. 88, Ruihu Street\nNeihu District, 11494 Taipei Taiwan\n886-2-6603-9728\nFax: 886-2-2658-8242\nThe Netherlands\nIDEXX B.V.\n(European Headquarters)\nScorpius 60 Building F\nHoofddorp, 2132 LR\nThe Netherlands\n31-23-558-70-00\nFax: 31-23-558-72-33\nIDEXX B.V.\n(Distribution Center)\nWillem Brocadesdreef 17-19\nHoofddorp, 2132 PV\nThe Netherlands\n31-23-558-70-00\nFax: 31-23-558-72-33\nUnited Kingdom\nIDEXX Laboratories Limited\nRegistered Office:\nGrange House, Sandbeck Way\nWetherby, West Yorkshire\nLS22 7DN\nUnited Kingdom\nRegistered in England - No. 02454226\n44-1937-544000\nFax: 44-1937-544001\nIDEXX Laboratories Limited\nRiverside House, Riverside Walk\nWindsor, Berkshire\nSL4 1NA\nUnited Kingdom\n44-0800-1234-3399\nFax: 44-1753-838901\nIDEXX Laboratories Limited\n84 New Wanstead\nWanstead, London E11 2SY\nUnited Kingdom\n44-1937-544190\nUnited States\nIDEXX Distribution, Inc.\n2536 Alpine Road\nEau Claire, Wisconsin 54703\nUnited States\n1-715-855-5800\nFax: 1-715-855-5820\nIDEXX Distribution, Inc.\nOne IDEXX Drive\nWestbrook, Maine 04092\nUnited States\n1-207-556-0300\nFax: 1-207-556-4346\nIDEXX Laboratories, Inc.\nOne Thomas Drive\nWestbrook, Maine 04092\nUnited States\n1-207-556-0300\nIDEXX Laboratories, Inc.\n(Corporate Headquarters)\nOne IDEXX Drive\nWestbrook, Maine 04092\nUnited States\n1-207-556-0300\nor 1-800-548-6733\nFax: 1-207-556-4346\nIDEXX Pharmaceuticals, Inc.\nOne IDEXX Drive\nWestbrook, Maine 04092\nUnited States\n1-207-556-0300\nFax: 1-207-556-4346\nIDEXX Telemedicine Consultants\nOne IDEXX Drive\nWestbrook, Maine 04092\nUnited States\n1-800-726-1212"
    },
    {
        "Ticker": "IDXX",
        "Company": "Idexx Laboratories",
        "Source_URL": "http://www.idexx.com/en/water/resources/product-inserts/",
        "Content_Type": "Website Content",
        "Raw_Text": "IDEXX Water Product Inserts\nThis is an online resource for IDEXX product inserts. Select, download, display, or print product inserts in multiple languages.\nThis is an online resource for IDEXX product inserts. Select, download, display, or print product inserts in multiple languages."
    },
    {
        "Ticker": "IDXX",
        "Company": "Idexx Laboratories",
        "Source_URL": "http://www.idexx.com/en/about-idexx/",
        "Content_Type": "Website Content",
        "Raw_Text": "We're IDEXX. Nice to meet you.\nHelping pets lead longer, fuller lives is at the heart of everything we do. Our diagnostic and software products and services create clarity in a complex and evolving world. Our innovations also help ensure the safety of milk and water around the world and maintain the health and well-being of livestock, poultry, and horses.\nEnhancing the health and well-being of pets, people, and livestock.\nBetter than we found it\nWe are driven by a desire to contribute to something bigger than ourselves and to make a positive social impact on a global scale.\n|\nCorporate Responsibility It's fundamental to how we operate as a business, employer, supplier, customer, and a member of the community. |\nIDEXX Foundation Creating a positive impact for people, animals, and the planet. |\n| Read our report | Learn about our foundation |\nIDEXX by the numbers\nHow our innovations and impact add up"
    },
    {
        "Ticker": "IDXX",
        "Company": "Idexx Laboratories",
        "Source_URL": "http://www.idexx.com/en/about-idexx/our-purpose/",
        "Content_Type": "Website Content",
        "Raw_Text": "Our Purpose\nTo be a great company that creates exceptional long-term value for our customers, employees, and shareholders by enhancing the health and well-being of pets, people, and livestock.\n- Over 10,000 employees\n- More than 175 countries worldwide\nGuiding principles\nAchieve and sustain market leadership\nWe combine an intense desire to succeed with the passion and skill to be the leader in our markets\nWe achieve exceptional and sustained financial success by creating superior value for our customers and employees worldwide.\nExceed the expectations of customers\nWe put the needs of our customers at the center of all our activities and offer unsurpassed customer service and education.\nWe actively listen to and engage with our customers to build lasting and mutually profitable partnerships.\nEmpower and reward our employees\nWe treat each other with trust, respect, and honesty, placing a high value on accessibility, collaboration, open communication, clear decision making, and individual accountability.\nWe provide our employees with diverse opportunities to learn, contribute, and benefit, based on merit, results, and values.\nInnovate with intelligence\nWe anticipate and discover the unmet needs of our customers, and we provide simple, intuitive products and services with the highest quality and the greatest customer benefit.\nWe seek inspiration internally and externally, and we have the flexibility and the vision to incorporate the best ideas and technologies from any source.\nCultivate entrepreneurial spirit\nWe succeed through a shared sense of urgency and our ability to recognize and capitalize on new opportunities in our markets.\nWe encourage initiative, creativity and informed risk taking, combined with a commitment to careful planning and disciplined execution.\nContribute to our communities\nWe conduct our business with the highest ethical standards, strict compliance with laws and regulations, and an understanding of our environmental responsibilities.\nWe are a citizen of the communities in which we do business, and we contribute to the health and quality of life of those communities.\nOur work and whom we serve\nSmall animal diagnostics\nIDEXX Small Animal Health provides diagnostic products and services to veterinary practices, including state-of-the-art pet-side tests and bench-top laboratory systems, and more.\nIDEXX Reference Laboratories\nIDEXX 24/7 diagnostic reference laboratory and consulting services enable practice integration and complete reporting including digital radiography and practice management systems.\nPractice management\nPractice management software includes IDEXX Pet Health Network Pro, VetConnect PLUS, Cornerstone, and other veterinarian practice informatics solutions.\nWater quality\nIDEXX Water is the global leader in water microbiology, providing tests that ensure the safety of drinking water and other water supplies for over two billion people in 100 countries around the world.\nLivestock, poultry and dairy\nIDEXX Livestock and Poultry provides diagnostic tests and software monitoring systems for managing herd and flock health and productivity. IDEXX Dairy offers tests that detect antibiotic residue and other contaminants in milk.\nResearch and human health\nIDEXX BioAnalytics offers biological materials testing, laboratory animal diagnostic services, and analyzers.\nOPTI Medical Systems provides blood gas and electrolyte analyzers and reagents for veterinary and human health."
    },
    {
        "Ticker": "IDXX",
        "Company": "Idexx Laboratories",
        "Source_URL": "http://www.idexx.com/en/about-idexx/our-difference/",
        "Content_Type": "Website Content",
        "Raw_Text": "Helping you advance pet health. It’s in our DNA.\nIt sets us apart, drives our innovation, inspires us to advance veterinary medicine, and above all, helps you and your team improve the lives of pets.\nReferences\n- Data on file at IDEXX Laboratories, Inc. Westbrook, Maine USA: Data based on testing performed at IDEXX Reference Laboratories in North America between November 1, 2024, and December 6, 2024. Analysis Report: IDEXX Cancer Dx Validation, 100282 [008_CancerDx-Validation-Report-2.Rmd].\n- Elsemore D, Bezold T, Geng J, Hanna R, Tyrrell P, Beall M. Immunoassay for detection of Dipylidium caninum coproantigen in dogs and cats. J Vet Diagn Invest. 2023;35(6):671–678. doi:10.1177/10406387231189193\n- Elsemore DA, Geng J, Flynn L, Cruthers L, Lucio-Forster A, Bowman DD. Enzyme-linked immunosorbent assay for coproantigen detection of Trichuris vulpis in dogs. J Vet Diagn Invest. 2014;26(3):404–411.\n- Elsemore DA, Geng J, Cote J, Hanna R, Lucio-Forster A, Bowman DD. Enzyme-linked immunosorbent assays for coproantigen detection of Ancylostoma caninum and Toxocara canis in dogs and Toxocara cati in cats. J Vet Diagn Invest. 2017;29(5):645–653. doi:10.1177/1040638717706098\n- Burton KW, Michael H, Drake C. The utility of coproantigen testing in screening populations. Vet Parasitol. Published online April 4, 2025. doi:10.1016/j.vetpar.2025.110459\n- Data on file at IDEXX Laboratories, Inc. Westbrook, Maine USA: Results based on measurement of time and number of inputs (e.g., clicks or screen taps) required to complete common tasks and workflows when using the updated IDEXX VetLab Station compared to the prior version."
    },
    {
        "Ticker": "IDXX",
        "Company": "Idexx Laboratories",
        "Source_URL": "http://www.idexx.com/en/about-idexx/corporate-responsibility/",
        "Content_Type": "Website Content",
        "Raw_Text": "Our Purpose\nEverything we do is guided by our commitment to create exceptional long-term value\nby enhancing the health and well-being of pets, people, and livestock\nOur corporate responsibility efforts are an integral part of our business strategy and commitment to advancing our Purpose. Through our innovations, we enhance global health and well-being of people, pets and livestock. We believe that fostering an inclusive, collaborative culture that provides equal opportunities for all is key to our success and ability to innovate. By leading responsibly and sustainably, we aim to create long-term value and a healthier future for all.\nOur corporate responsibility framework\nIDEXX's corporate responsibility framework aligns our goals and initiatives with our long-term business strategy and Purpose. The framework’s three key pillars are focused on the environmental and social topics most material to our stakeholders and business, underpinned by strong governance, policies, and systems infrastructure.\nThe care we advance\nWe focus on scientific innovation to ensure longer, fuller lives for pets and drive meaningful improvements in animal, human, and environmental health. We foster thriving communities where the human-animal bond can flourish.\nThe people we support\nIDEXX strives to foster a collaborative and inclusive workplace that empowers employees to develop and grow and find purpose and fulfillment in all they do. We build our culture by respecting people and communities across our value chain.\nThe planet we share\nThrough innovation and continuous improvement, we are laying the groundwork for long-term impact reduction and remain committed to reducing our environmental footprint.\nGovernance, policies, and systems infrastructure\nAligned with our long-term business strategy, Purpose, and Guiding Principles, we aim to lead responsibly and ethically: ensuring transparency, integrity, and accountability are at the center of everything we do at IDEXX.\nStrong governance, policies, and systems infrastructure are foundational elements of our corporate responsibility program.\nThe IDEXX Foundation\nIDEXX Foundation initiatives are integrated across our corporate responsibility framework and demonstrate our commitment to creating a positive and lasting impact for people, animals, and the environment.\nCorporate responsibility reporting\nCorporate responsibility reports\nFramework indexes\nSEC filings\nEEO data\nGender pay gap reports\nAustralia Workplace Gender Equality ReportSelect IDEXX in Employer Results\nConflict minerals\nModern slavery\nGovernance policies and resources\nCode of Ethics\nCommitment to Inclusion and Equal Opportunity for All\nConflict Minerals Policy\nCorporate Governance Guidelines\nEqual Employment Opportunity Statement\nEthics Hotline\nGlobal Anti-Bribery and Corruption Policy\nGlobal Whistleblower Policy\nGlobal Privacy Policy\nLocations and ISO Certificates\nPay Equity Statement\nPolicy on Political Contributions and Public Policy Engagement\nQuality and Management System Response\nSupplier Code of Conduct\nSupplier Resource Center\nTransparency in Coverage—MRF\nUK Tax Strategy"
    },
    {
        "Ticker": "IDXX",
        "Company": "Idexx Laboratories",
        "Source_URL": "http://www.idexx.com/en/about-idexx/idexx-foundation/",
        "Content_Type": "Website Content",
        "Raw_Text": "The IDEXX Foundation\nCommitted to creating a positive and lasting impact for people, animals, and the environment\nOur areas of focus\nThe interconnectedness of human, animal, and environmental health drives the IDEXX Foundation to take a solutions-oriented approach to our global work. Through our initiatives, we strive to make positive and lasting impacts in three priority areas:\nCreating opportunities for the diverse leaders of tomorrow\nAdvance inclusion in veterinary and STEM (science, technology, engineering, and math) professions by providing access to opportunities for learners of all ages and supporting their well-being.\nAdvance equal opportunity for all in veterinary and STEM (science, technology, engineering, and math) professions by providing access to opportunites for learners.\nCaring for our companions\nImprove access to veterinary care for underserved communities, provide support to animals at risk, disaster relief for animals impacted by extreme climate events, and connect people with animals that give comfort, mobility, and greater access to work and play.\nFostering water access, climate adaptation, and food sustainability solutions\nCultivate community-focused solutions to the global challenges of access to safe water, impacts of climate change, and food sustainability.\nOur initiatives\nThe IDEXX Foundation is a donor-advised fund administered by a national donor-advised fund sponsoring program. Its mission is to create positive, lasting impacts for people, animals, and the environment through inclusive and outcomes-focused initiatives in communities around the world.\nFeatured initiatives\ncharity : water\nAfrica\nIDEXX Foundation area of focus: Fostering water access, climate adaptation, and food sustainability\nKey impacts:\n- Sustainable access to clean water for improved health and livelihoods for underserved and marginalized communities\n- Adaptative solutions to support climate resilience\nSince 2006, charity : water has been on a mission to end the water crisis and help reach the more than 770 million people who lack access to clean water. A nonprofit organization bringing clean and safe drinking water to people in developing countries, charity : water partners with experienced local organizations to fund sustainable, community-owned water projects in areas of greatest need.\nIDEXX Foundation initiated a 3-year collaboration with charity : water to advance projects in water-stressed regions. In the first year, efforts will be focused on communities in Africa. Each project will help provide access to clean water, hygiene, and improved sanitation. These projects are intended to improve community health, increase education rates, and spark economic growth by improving farming and livestock health and production capacity.\nPhoto credit: charity : water\nBanfield Foundation—Hurricane Ida Disaster Relief\nLouisiana\nIDEXX Foundation area of focus: Caring for our companions\nKey impacts:\n- Accessible care and disaster relief for animals impacted by extreme climate events in underserved communities\n- Capacity building for disaster response and preparedness\nAt the core of the Banfield Foundation is the belief that all pets deserve access to veterinary care. Banfield Foundation's Disaster Relief Grants program provides financial support to nonprofit animal organizations and state and local government agencies whose communities have suffered the impact of natural or other disasters. In response to Hurricane Ida, the Banfield Foundation and its nonprofit partners mobilized resources to provide both shelter and owned pets in Louisiana immediate access to veterinary care, medication and supplies, and temporary shelter.\nThe IDEXX Foundation's ongoing support of the Banfield Foundation's disaster relief efforts helps organizations providing frontline response services in Louisiana communities in the aftermath of Hurricane Ida. This grant will also fund a new Louisiana State Animal Response Team (LSART) Disaster Response Vehicle to increase transportation for animals requiring relocation before, during, and after disaster, directly impacting hundreds of pets in need.\nPhoto credit: The Louisiana SPCA, a nonprofit and shelter partner of the Banfield Foundation.\nSAE International—A World in Motion Program\nUnited States and Canada\nIDEXX Foundation area of focus: Creating opportunities for the diverse leaders of tomorrow\nKey impacts:\n- Access to STEM (science, technology, engineering, and math) education to advance science literacy of students in preschool through 8th grade\n- Capacity building for STEM education through critical teacher training\nSAE International’s A World In Motion (AWIM) program is an inquiry-based learning experience that brings STEM concepts to life, setting students on a path of lifelong learning and discovery. Starting with the youngest learners, from preschool through 8th grade, AWIM combines practical, experiential learning with mentorship from industry volunteers and university students as well as ongoing training and support for educators to provide equitable access to STEM.\nThe IDEXX Foundation will support AWIM’s hands-on STEM programming during the 2022–2023 school year to more than 1,400 students in preschool through 8th grade and provide critical STEM education training to nearly 30 teachers in multiple communities. In longitudinal studies and in more than 30 years of program evaluations, AWIM increases teachers' confidence and competence in teaching STEM and increases student achievement in science and math, with an ongoing impact to thousands of students.\nPhoto credit: SAE International\nIDEXX TUCVM Initiative\nIDEXX Foundation area of focus: Creating opportunities for the diverse leaders of tomorrow\nKey impacts:\n- Nine full scholarships\n- Mental health support for veterinary students\n- Emergency funding for students in need\nThis is the most impactful contribution that our beloved college has received in our 75 years of existence and recognizes our legacy of work training and educating students of color. This meaningful investment by the IDEXX Foundation will help our students realize their dreams of becoming veterinarians.\"\n—Ruby L. Perry, DVM, MS, PhD, Diplomate-ACVR, Dean of the Tuskegee University College of Veterinary Medicine\nInitiative details\nThe foundation’s long-term, outcomes-focused investment includes $3.6M in the TUCVM as part of a larger effort to make progress in advancing diversity, equity, and inclusion in veterinary medicine. This initiative is designed to drive comprehensive and positive outcomes for diversifying the veterinary field in the future. The investment includes nine full scholarships, mental health support for veterinary students, emergency funding for students in need, and monies for important capital improvements at the TUCVM facilities. Each of these elements was identified through engagement with the TUCVM leadership to maximize the positive impacts of this meaningful collaboration.\nThe TUCVM is the only veterinary medical professional program located on the campus of a historically Black college or university (HBCU) in the United States. A pioneer in veterinary medical education, the TUCVM has a proven track record of increasing access to veterinary medical education, educating 70% of African American veterinarians in the U.S.\nThe IDEXX Foundation granting window is currently closed.\nThe IDEXX Foundation granting program is by-invitation-only with ongoing multi-year initiatives around the world. We are not accepting unsolicited grant requests at this time.\nIDEXX reviews corporate sponsorship requests for $5,000 or less throughout the year. If you are requesting event sponsorship, a minimum 60-day advance notice is required."
    },
    {
        "Ticker": "IDXX",
        "Company": "Idexx Laboratories",
        "Source_URL": "http://www.idexx.com/en/about-idexx/news/",
        "Content_Type": "Website Content",
        "Raw_Text": "Newsroom\nIDEXX Schedules Two Institutional Investor Events\nRead more\nIDEXX Expands SNAP Platform with Leish 4Dx Test to Support Veterinarians Globally in Diagnosing Vector-borne Diseases\nRead more\nIDEXX to Release 2023 Third Quarter Financial Results\nRead more\nJuly 25—IDEXX Releases 2022 Corporate Responsibility Report, Providing Environmental, Social, and Governance Updates\nRead more\nJuly 12—IDEXX Elects Irene Chang Britt to Board of Directors\nRead more\nJune 29—IDEXX to Release 2023 Second Quarter Financial Results\nRead more\nJune 15—IDEXX Announces Novel Diagnostic Test for Kidney Injury, Expanding the Veterinary Industry’s Most Comprehensive Renal Testing Portfolio\nRead more\nMay 10—IDEXX to Present at Stifel Conference and Announces 2023 Investor Day\nRead more\nApril 13—IDEXX to Release 2023 First Quarter Financial Results\nRead more\nFebruary 21—IDEXX to Present at Two Upcoming Institutional Investor Conferences\nRead more\nFebruary 20—Groundbreaking IDEXX Study Reveals Opportunities to Increase Veterinary Practice Productivity\nRead more\nJanuary 26—IDEXX to Release 2022 Fourth Quarter and Full Year Financial Results\nRead more\nJanuary 12—Deeper Clinical Insights from IDEXX Preventive Care Offerings Help Veterinarians Detect Issues Sooner So Pets Can Live Their Best Lives\nRead more\nDecember 22—IDEXX Laboratories to Present at the Goldman Sachs Healthcare CEOs Unscripted Conference\nRead more\nOctober 11—IDEXX Laboratories to Release 2022 Third Quarter Financial Results\nRead more\nJuly 19—IDEXX Announces New Goals in Its 2021 Corporate Responsibility Report and Advances Progress on Environmental, Social, and Governance Initiatives\nRead more\nJuly 8—IDEXX to Release 2022 Second Quarter Financial Results\nRead more\nJune 21—IDEXX Empowers Veterinarians with New Testing Insights that Support Earlier Diagnosis and Intervention for Preventive Care and Critical Cases\nRead more\nMay 18—IDEXX Laboratories to Present at Stifel Conference and Announces 2022 Investor Day\nRead more\nApril 11—IDEXX to Release 2022 First Quarter Financial Results\nRead more\nFebruary 17—IDEXX to Present at Two Upcoming Institutional Investor Conferences\nRead more\nJanuary 13—IDEXX Innovative Diagnostic and Software Solutions Provide Workflow Efficiency and Faster, More Confident Clinical Decisions\nRead more\nJanuary 13—IDEXX Enables Improved Cancer Diagnosis and Personalized Care through Expanded Oncology Offering\nRead more\nJanuary 11—IDEXX to Release 2021 Fourth Quarter and Full Year Financial Results\nRead more\nOctober 8—IDEXX to Release 2021 Third Quarter Financial Results\nRead more\nSeptember 28—IDEXX Laboratories Deepens Connections to Maine-Based Community Partners to Drive Greater Home-State Impact\nRead more\nAugust 9—IDEXX to Host Virtual Investor Day\nRead more\nJune 30—IDEXX to Release 2021 Second Quarter Financial Results\nRead more\nJune 2—IDEXX Acquires ezyVet\nRead more\nMay 26—IDEXX to Present at Stifel Conference and Announces 2021 Virtual Investor Day\nRead more\nApril 8—IDEXX to Release 2021 First Quarter Financial Results\nRead more\nFebruary 16—IDEXX to Present at Two Upcoming Institutional Investor Conferences\nRead more\nJanuary 28—IDEXX and the Tuskegee University College of Veterinary Medicine Announce Landmark Initiative\nRead more\nJanuary 11—IDEXX to Release 2020 Fourth Quarter and Full-Year Financial Results\nRead more\nNovember 12—IDEXX Elects Dr. Asha S. Collins to Board of Directors\nOctober 5—IDEXX to Release 2020 Third Quarter Financial Results\nAugust 13—IDEXX Provides U.S. Companion Animal Market Trends Update\nAugust 10—IDEXX to Host Virtual Investor Day\nMay 26—IDEXX Provides U.S. Companion Animal Market Trends Update\nMay 18—IDEXX to Present at Stifel Conference\nApril 20—IDEXX Makes Pet Test for COVID-19 Virus Available to Veterinarians\nApril 14—IDEXX to Release 2020 First Quarter Financial Results\nMarch 13—Leading Veterinary Diagnostic Company Sees No COVID-19 Cases in Pets\nFebruary 14—IDEXX to Present at Two Upcoming Institutional Investor Conferences\nFebruary 12—IDEXX Announces Increase in Share Repurchase Program Authorization\nJanuary 17—Latest IDEXX Innovations Designed to Enhance Patient Care and Drive Veterinary Productivity\nJanuary 15—IDEXX Announces Senior Leadership Changes in Support of Global Companion Animal Group Growth\nJanuary 10—IDEXX to Release 2019 Fourth Quarter and Full-Year Financial Results\nOctober 24—IDEXX Announces Leadership Changes\nOctober 10—IDEXX to Release 2019 Third Quarter Financial Results\nOctober 2—IDEXX Breakthrough Kidney Function Test Now Key Component of IRIS Staging Guidelines\nAugust 5—IDEXX to Host 2019 Investor Day\nJuly 24—Statement from Jon Ayers\nJuly 18—IDEXX Elects Sam Samad to Board of Directors\nJuly 15—IDEXX to Release 2019 Second Quarter Financial Results\nApril 23—IDEXX CEO Establishes Wild Cat Conservation Foundation\nApril 2—IDEXX to Release 2019 First Quarter Financial Results\nMarch 3—IDEXX Names Sharon Underberg General Counsel\nFebruary 11—IDEXX to Present at Two Upcoming Institutional Investor Conferences\nJanuary 21—IDEXX Introduces Exclusive Point-of-Care Progesterone Test to Its Catalyst Platform\nJanuary 9—IDEXX to Release 2018 Fourth Quarter and Full-Year Financial Results\nSeptember 24—IDEXX to Release 2018 Third Quarter Financial Results\nSeptember 10—IDEXX Pseudalert Test Accepted as Global ISO Standard\nSeptember 5—IDEXX to Present at Bank of America Merrill Lynch Global Healthcare Conference\nAugust 6—IDEXX to Host 2018 Investor Day\nJuly 5—IDEXX to Release 2018 Second Quarter Financial Results\nJune 5—IDEXX to Present at William Blair Growth Stock Conference\nApril 12th—IDEXX to Release 2018 First Quarter Financial Results\nFebruary 15—IDEXX to Present at Two Conferences\nFebruary 5—IDEXX Advances Power of SediVue Dx with Latest Software Update\nJanuary 18—IDEXX to Release 2017 Fourth Quarter and Full-Year Financial Results\nJanuary 8—IDEXX Launches SDMA in the Point of Care with IDEXX Catalyst® SDMA Test\nJanuary 5—IDEXX Announces Estimated Impact of U.S. Tax Reform\nJanuary 2—IDEXX to Present at J.P. Morgan Healthcare Conference\nSeptember 6, 2017—IDEXX to Present at Bank of America Merrill Lynch Global Healthcare Conference\nAugust 8, 2017—IDEXX Laboratories to Host 2017 Investor Day\nJuly 17, 2017—IDEXX Elects Stuart M. Essig to Board of Directors\nJuly 10, 2017—IDEXX to Release 2017 Second Quarter Financial Results\nJune 15, 2017—IDEXX Expands Portfolio of Cloud Technology Offerings for Veterinary Industry\nJune 01, 2017—IDEXX to Present at William Blair Annual Growth Stock Conference\nMay 17, 2017—IDEXX to Present at Stifel 2017 Dental and Veterinary Conference\nMay 03, 2017—IDEXX Announces Increase in Share Repurchase Program\nApril 06, 2017—IDEXX to Release 2017 First Quarter Financial Results\nMarch 20, 2017—IDEXX Joins the NASDAQ-100 Index\nFebruary 27, 2017—IDEXX to Present at Raymond James Institutional Investors Conference\nJanuary 18, 2017—IDEXX to Release 2016 Fourth Quarter and Full-Year Financial Results\nJanuary 04, 2017—IDEXX to Join S&P 500 Index\nDecember 20, 2016—IDEXX Laboratories to Present at J.P. Morgan Healthcare Conference\nNovember 15, 2016—IDEXX Announces Departure of Executive Vice President Michael Williams\nNovember 14, 2016—IDEXX Welcomes Healthcare Technology Veteran Pat Venters as Chief Marketing Officer\nOctober 28, 2016—IDEXX to Present at Credit Suisse Healthcare Conference\nOctober 19, 2016—IDEXX Elects Lawrence D. Kingsley to Board of Directors\nOctober 11, 2016—IDEXX to Release 2016 Third Quarter Financial Results\nSeptember 06, 2016—IDEXX to Present at Raymond James North American Equities Conference\nAugust 08, 2016—IDEXX to Host 2016 Investor Day\nJuly 27, 2016—IDEXX Releases Water Test to Aid in Legionnaires’ Disease Fight\nJuly 11, 2016—IDEXX to Release 2016 Second Quarter Financial Results\nJune 21, 2016—IDEXX Announces First Low-Dose Radiography System for Veterinary Industry\nJune 07, 2016—IDEXX Launches New Rapid Pregnancy Test for Cattle\nJune 06, 2016—IDEXX to Present at William Blair 36th Annual Growth Stock Conference\nFebruary 29, 2016—IDEXX to Present at Raymond James Institutional Investors Conference\nFebruary 12, 2016—IDEXX Announces Executive Vice President Johnny Powers to Retire in May 2016\nJanuary 21, 2016—IDEXX to Release 2015 Fourth Quarter and Full-Year Financial Results\nJanuary 18, 2016—IDEXX Introduces Innovative Practice Management Software for Veterinary Professionals\nJanuary 05, 2016—IDEXX to Present at J.P. Morgan Healthcare Conference\nDecember 09, 2015—IDEXX to Present at Bank of America Merrill Lynch 2015 Animal Health Summit\nNovember 10, 2015—IDEXX to Present at Two Investor Conferences\nOctober 05, 2015—IDEXX Breakthrough Kidney Function Test SDMA Added to IRIS Staging Guidelines\nSeptember 23, 2015—IDEXX to Release 2015 Third Quarter Financial Results\nSeptember 09, 2015—IDEXX Releases New Web-Based Software for Radiology\nJuly 31, 2015—IDEXX to Host 2015 Analyst Day\nJuly 31, 2015—IRIS Napa Meeting announcement discusses role of SDMA in IRIS CKD Staging scheme\nJuly 27, 2015—Over 100,000 Pets Tested with New IDEXX SDMA Kidney Function Test Since Product Launch on July 13\nJuly 23, 2015—IDEXX Total T4 Thyroid Test Available on Catalyst Dx and Catalyst One Chemistry Analyzers in North America\nJuly 21, 2015—IDEXX Laboratories Introduces Innovative Point-of-Care Antibody Test for Canine Leptospirosis Called the SNAP Lepto Test\nJuly 14, 2015—IDEXX Elects Bruce L. Claflin to Board of Directors\nJuly 13, 2015—Breakthrough SDMA Kidney Function Test Now Available from IDEXX\nJuly 13, 2015—IDEXX to Release 2015 Second Quarter Financial Results\nJune 25, 2015—IDEXX Learning Center Leads Veterinary Industry in Continuing Education\nJune 16, 2015—IDEXX Water Division Launches Quanti-Tray Sealer PLUS\nJune 01, 2015—IDEXX to Present at William Blair 35th Annual Growth Stock Conference\nMay 07, 2015—IDEXX Launches Canine Influenza Test Targeting H3N2 in Response to Outbreak\nMay 06, 2015—IDEXX Announces Two-for-One Stock Split and Increase in Share Repurchase Program\nMay 04, 2015—IDEXX Introduces Exclusive New Intestinal Parasite Screening Tests to Protect Pets\nApril 08, 2015—IDEXX to Release 2015 First Quarter Financial Results\nApril 07, 2015—IDEXX Water Division Earns ISO/IEC-17025:2005 Accreditation\nFebruary 24, 2015—IDEXX to Present at Raymond James Institutional Investors Conference\nJanuary 23, 2015—IDEXX to Release 2014 Fourth Quarter and Full-Year Financial Results\nJanuary 19, 2015—IDEXX Announces SDMA as Important Expansion to Reference Lab Test Menu\nJanuary 19, 2015—New IDEXX Test Detects Kidney Disease in Cats and Dogs Months or Years Earlier than Standard Screening Technologies\nJanuary 14, 2015—IDEXX Instrument Placement Momentum Reinforces Strong Organic Revenue Growth Outlook\nJanuary 05, 2015—IDEXX to Present at J.P. Morgan Healthcare Conference\nDecember 16, 2014—IDEXX to Ring NASDAQ Closing Bell and Make History for Maine\nDecember 09, 2014—New IDEXX CardioPet ECG Device Streamlines Work Flow to Facilitate Cardiac Consultations\nDecember 02, 2014—IDEXX U.S. Companion Animal Group Now Offers Online Ordering via Industry-Leading E-commerce Platform\nNovember 19, 2014—IDEXX Announces the Release of IDEXX-PACS 4.0 Imaging Software\nNovember 04, 2014—IDEXX Now Shipping Catalyst One Chemistry Analyzer\nOctober 27, 2014—IDEXX Launches 100% Direct Ordering in the U.S. Two Months Early\nOctober 01, 2014—IDEXX Announces Several Milestones in its U.S. All-Direct CAG Distribution Strategy\nSeptember 25, 2014—IDEXX Laboratories Announces New App that Enables Real-time Results Notification for Android™ Users\nSeptember 18, 2014—IDEXX Laboratories Names Jacqueline L. Studer Corporate Vice President and General Counsel\nSeptember 17, 2014—IDEXX to Help Veterinary Community Strengthen the Bonds that Matter Most\nSeptember 08, 2014—IDEXX Laboratories Announces Two New Innovative Tests to Aid Veterinarians in the Diagnosis and Management of Itchy Pets\nSeptember 05, 2014—IDEXX Introduces New Name, Expanded Focus for Its 9th Annual Cornerstone User Conference\nAugust 26, 2014—IDEXX Laboratories Announces Agreement to Utilize Philips Digital Pathology Solution VET\nAugust 05, 2014—IDEXX RealPCR BVDV RNA Test Introduces Standardization and Flexibility to Real-Time PCR Testing\nJuly 31, 2014—IDEXX Laboratories to Host 2014 Analyst Day\nJuly 16, 2014—IDEXX Laboratories to Release 2014 Second Quarter Financial Results\nJuly 08, 2014—IDEXX Laboratories Introduces Industry’s First Whipworm Antigen Test Capable of Detecting Adult Parasite\nJune 30, 2014—IDEXX Completes $35 Million Expansion of World Campus to Accommodate Hundreds of New Jobs\nJune 13, 2014—IDEXX launches USDA-approved Swine Influenza Virus Ab Test, helping laboratories screen more confidently and conveniently\nMay 28, 2014—IDEXX Laboratories to Present at William Blair 34th Annual Growth Stock Conference\nMay 07, 2014—IDEXX Laboratories to Present at Bank of America Merrill Lynch 2014 Healthcare Conference\nApril 15, 2014—IDEXX Laboratories to Release 2014 First Quarter Financial Results\nApril 01, 2014—IDEXX Laboratories Congratulates AAHA “Practice of the Year” Award Winners\nMarch 27, 2014—IDEXX Introduces New RealPCR Diagnostics for Safeguarding Equine Health\nMarch 19, 2014—IDEXX Laboratories Introduces the IDEXX VetConnect PLUS App for Immediate Results Notification\nMarch 14, 2014—IDEXX Announces New Program to Help Advance Care for Cats\nMarch 11, 2014—IDEXX Laboratories Elects Daniel Junius to Board of Directors\nFebruary 25, 2014—IDEXX Laboratories to Present at Raymond James 35th Annual Institutional Investors Conference\nFebruary 14, 2014—IDEXX Laboratories Introduces the Catalyst One Chemistry Analyzer, Making Laboratory-Quality In-house Chemistry Simple and Accessible For All Veterinary Practices\nJanuary 23, 2014—IDEXX Laboratories to Release 2013 Fourth Quarter and Full-Year Financial Results\nJanuary 13, 2014—IDEXX Laboratories Introduces the Catalyst One Chemistry Analyzer\nJanuary 06, 2014—IDEXX Laboratories to Present at J.P. Morgan Healthcare Conference\nAbout IDEXX\nIDEXX is a global leader in pet healthcare innovation. Our diagnostic and software products and services create clarity in the complex, constantly evolving world of veterinary medicine. We support longer, fuller lives for pets by delivering insights and solutions that help the veterinary community around the world make confident decisions—to advance medical care, improve efficiency, and build thriving practices. Our innovations also help ensure the safety of milk and water across the world and maintain the health and well-being of people and livestock. IDEXX Laboratories, Inc. is a member of the S&P 500® Index. Headquartered in Maine, IDEXX employs approximately 11,000 people and offers solutions and products to customers in more than 175 countries and territories. For more information about IDEXX, visit www.idexx.com.\nOur purpose\nTo be a great company that creates exceptional long-term value for our customers, employees, and shareholders by enhancing the health and well-being of pets, people, and livestock.\nContacts\nMedia relations\nEmail\nInvestor relations\nJohn Ravis\n1-207-556-8155\nEmail"
    },
    {
        "Ticker": "IDXX",
        "Company": "Idexx Laboratories",
        "Source_URL": "http://www.idexx.com/en/about-idexx/corporate-governance/",
        "Content_Type": "Website Content",
        "Raw_Text": "Corporate Governance\nThe IDEXX board of directors and leadership team is committed to sound corporate governance. We seek to set and maintain the highest standards of ethics, while building exceptional long-term value for our customers, employees, and shareholders.\nAccess board committee information and our governance documents on this page. And report concerns or complaints regarding IDEXX Laboratories accounting, internal accounting control, auditing matters or suspected violations of our Code of Ethics via the IDEXX Ethics Hotline.\nLeadership\nExecutive Vice President and General Manager, Global Reference Laboratories, Diagnostic Solutions and Information Technology\nBoard of Directors\nChairman, IDEXX Laboratories, Inc. Former Chairman and Chief Executive Officer, Pall Corporation\nBoard Committees"
    },
    {
        "Ticker": "IDXX",
        "Company": "Idexx Laboratories",
        "Source_URL": "http://www.idexx.com/en/about-idexx/locations",
        "Content_Type": "Website Content",
        "Raw_Text": "Corporate Headquarters\nIDEXX Laboratories, Inc.\nOne IDEXX Drive, Westbrook, Maine 04092\nPhone: 1-207-556-0300 | 1-800-548-6733 | Fax: 1-715-855-5820\nIDEXX Distribution, Inc.\n2536 Alpine Road, Eau Claire, Wisconsin 54703\nPhone: 1-715-855-5800 | Fax: 1-715-855-5820\nIDEXX Europe B.V. - European Headquarters\nScorpius 60 Building F, Hoofddorp, 2132 LR\nPhone: 31-23-558-70-00 | Fax: 31-23-558-72-33\nIDEXX Laboratories Pty. Ltd.\nMetro Centre, Unit 6, 38-46 South Street, Rydalmere, New South Wales 2116\nPhone: 1300 44 33 99\nIDEXX Laboratories Pty. Ltd.\nUnit 124 45 Gilby Road, Mount Waverley, Victoria 3149\nPhone: 1300 44 33 99\nIDEXX Laboratories Pty. Ltd.\n117 Greenhill Road, Unley, South Australia 5061\nPhone: 1300 44 33 99\nIDEXX Laboratories Pty. Ltd.\n10 Brandl St, Eight Mile Plains, Queensland 4113.\nPhone: 1300 44 33 99\nIDEXX Laboratories Pty. Ltd.\n31 Cedric St, F4 Level 1, Stirling, WA 6021\nPhone: 1300 44 33 99\nIDEXX Vienna Daylab\nViehmarktgasse 2, 1030 Wien\nPhone: +49 7141 133 5983\nIDEXX Brasil Laboratórios Ltda.\nAvenida Brigadeiro Faria Lima, 4300, 1º Andar - Ed. FL Corporate, Itaim Bibi, São Paulo, CEP 04538-133\nPhone: +55 11 3095-5632 | Fax: +55 11 3095-5641\nIDEXX Laboratories Canada Corporation d/b/a IDEXX Reference Laboratories\nC/O UPS SCS, 4071 North Service Road, Burlington, ON L7L 4X4\n1-207-556-4852\nIDEXX Laboratories Canada Corporation d/b/a IDEXX Reference Laboratories\nUnit #19, 5080 12A Street SE, Calgary, Alberta T2G 5K9\n1-403-214-1506\nFax: 1-403-214-1562\nIDEXX Laboratories Canada Corporation d/b/a IDEXX Reference Laboratories\n8131 Roper Road, Edmonton, Alberta T6E 6S4\n1-780-437-8808\nFax: 1-780-437-8822\nIDEXX Laboratories Canada Corporation d/b/a IDEXX Reference Laboratories\n1595 Cliveden Avenue, Units 10 & 11, Delta, BC V3M 6M2\n1-604-525-1700\nFax: 1-604-525-1700\nIDEXX Laboratories Canada Corporation d/b/a IDEXX Reference Laboratories\n2300 54th Avenue #220, Lachine, Quebec H8T 3R2\nPhone: 1-514-633-9694 | Fax: 61-7-3456-6001\nIDEXX Laboratories Canada Corporation d/b/a IDEXX Reference Laboratories\n1345 Denison Street, Markham, Ontario L3R 5V2\n1-416-798-4988\nFax: 1-905-475-7309\nBeijing IDEXX-Yuanheng Laboratories Company Limited\n1F, No.10 Building, No.28 Yuhua Road, Beijing Airport Economic Core Zone,101318 Beijing\nPhone: 86-10-8045-1300 | Fax: 86-10-8045-1301\nChina IDEXX Laboratories (Shanghai) Company Limited\n2F, Room C/D, HongQiao Business Center, No. 2272, HongQiao Road, Shanghai 200336,\nPhone: 86-21-6127-9528 | Fax: 86-21-6127-9526\nVetlab Oy\nPeltokatu 16 C, 33100 Tampere\nPhone: 010 387 4455 | Fax: (03)2533 609\nIDEXX SARL and Laboratoire IDEXX SARL\n84 rue Charles Michels, Bâtiment A, 93200 Saint-Denis\nPhone: 33-1-49-21-83-21 | Fax: 33-1-49-21-83-25\nIDEXX Montpellier SAS\nParc Euromédecine, 34090 Montpellier\nPhone: 33-4-99-23-24-25 | Fax: 33-4-67-04-20-25\nIDEXX GmbH\nDruckereistr. 4, D-04159 Leipzig\nPhone: +49-69-153-253-290\nIDEXX GmbH\nHumboldtstr. 2, 70806 Kornwestheim, Germany\nPhone: +49-69-153-253-290\nIDEXX Laboratories Private Limited\nUnit No. 2239/2241, 22nd floor, WTC Bangalore, Brigade Gateway, Rajajinager Extension, Malleswaram, Bangalore, 560055, Karnataka\nPhone: 91 80679 35424\nIDEXX Laboratories Italia S.r.l.\nVia Guglielmo Silva, 36-20149 Milano, N. Verde - 800917940\nPhone: 39-02-319-203-1 | Fax: 39-02-319-203-47\nIDEXX Laboratories, KK\n2F Asahi Seimei Daitabashi Building\n1-22-19 Izumi, Suginami-ku, Tokyo, 168-0063\nPhone: 81-35-301-6700 | Fax: 81-35-301-6703\nIDEXX Laboratories, KK\n5-8-18 Kajino-cho, Koganei-shi, Tokyo, 184-8515\nPhone: 81-35-301-6700 | Fax: 81-42-303-9011\nIDEXX Laboratories Pty. Ltd.\n20A Maui Street, Pukete, Hamilton 3204\nPhone: 64-7-839-1470 or 0800-838-522 | Fax: 64-7-839-1471\nIDEXX Laboratories Pty. Ltd.\nSchool of Veterinary Science Complex, Massey University, Tennent Drive Palmerston North NZ 4440\nPhone: 64-6-353-3983 or 0800-838-522 | Fax: 64-6-353-3986\nIDEXX Laboratories sp. z o.o.\nUl.Dominikanska 5, 02-736 Warszawa\nPhone: 48-22-853-40-01 | Fax: 48-22-853-40-02\nIDEXX Laboratories Singapore Pte Ltd\n21 Biopolis Road, Nucleos (North Tower), Unit 03-06, 138567\nPhone: 65 3158 1330 | Fax: 65 6397 5279\nIDEXX Laboratories Ltd.\n516~521, Gangnam ACE Tower, 174-10, Jagok-ro,\nGangnam-gu, Seoul, Republic of Korea\nPhone: 82-80-7979-133 | Fax: 82-2-6211-5014\nIDEXX Laboratorios, S.L.\nc/ Plom nº 2-8, 3º, 08038 Barcelona\nPhone: 34-93-26-72-660 | Fax: 34-93-26-72-688\nIDEXX Laboratorios, S.L.\nCalle Santander, 5, 28231 Las Rozas, Madrid\nPhone: 34-916-377-038 | Fax: 34-916-377-038\nIDEXX Switzerland GmbH\nStationsstrasse 12, Liebefeld-Bern, CH-3097\nPhone: 41-31-970-62-60 | Fax: 41-31-970-62-79\nIDEXX Diavet AG\nSchlyffistrasse 10, Bäch SZ, 8806\nPhone: 41-44-786-90-20 | Fax: 41-44-786-90-30\nIDEXX Laboratories Inc.\n6F-1 No. 88, Rei Hu Street, Nei Hu District, 11494 Taipei\nPhone: 886-2-6603-9728 | Fax: 886-2-2658-8242\nIDEXX Europe B.V. - Distribution Center\nWillem Brocadesdreef 17-19, Hoofddorp, 2132 PV\nPhone: 31-23-558-70-00 | Fax: 31-23-558-72-33\nIDEXX Laboratories Limited\nGrange House, Sandbeck Way, Wetherby, West Yorkshire, LS22 7DN\nPhone: 44-1937-544000 | Fax: 44-1937-544001\nIDEXX Technologies Limited\nNewmarket Business Park, Studlands Park Avenue, Newmarket, Suffolk CB8 7ER\nPhone: 44-1638-676800 | Fax: 44-1638-676801\nIDEXX Laboratories Limited\nUnit 4 Oakhurst Business Park, Wilberforce Way, Southwater, Horsham, West Sussex RH13 9RT\nPhone: 44-1403-730176 | Fax: 44-1403-732784\nIDEXX Laboratories Limited\n84 New Wanstead, Wanstead, London E11 2SY\nPhone: +44 (0)2037887508\nIDEXX Laboratories, Inc.\nOne Thomas Drive, Westbrook, Maine 04092\nPhone: 1-207-556-0300\nIDEXX Operations, Inc.\n6100 East Shelby Drive, Memphis, Tennessee 38141\nPhone: 1-901-565-2100 | Fax: 1-901-565-2101\nOPTI Medical Systems, Inc.\nHembree Park Drive, Suite 200, Roswell, Georgia 30076\nPhone: 1-770-510-4444 | Fax: 1-770-510-4445\nIDEXX Laboratories (Pty) Ltd.\nWoodmead Office Park, 19b Morris Street East, Woodmead Extension 1, 2146 Sandton, Johannesburg, South Africa\nPhone: +27-11-803-3001-2-3\nCorporate Headquarters\nIDEXX Laboratories, Inc.\nOne IDEXX Drive\nWestbrook, Maine 04092\nUnited States\n1-207-556-0300\n1-800-548-6733\nFax: 1-207-556-4346\nEuropean Headquarters\nIDEXX B.V.\nScorpius 60 Building F\nHoofddorp, 2132 LR\nThe Netherlands\n+31-23-558-70-00\nFax: +31-23-558-72-33"
    },
    {
        "Ticker": "IDXX",
        "Company": "Idexx Laboratories",
        "Source_URL": "http://www.idexx.com/en/about-idexx/idexx-stories/uncovering-the-driving-force-behind-idexx-s-innovation/",
        "Content_Type": "Website Content",
        "Raw_Text": "IDEXX Stories\nUncovering the driving force behind IDEXX's innovation\nAt IDEXX, innovation is in our DNA. But innovation is meaningless without purpose. Why do we focus so relentlessly on continuous improvement, answering the question, “What’s next?”, and investing in a better future for pets? We turned to leaders Tina Hunt, EVP, Strategy, Sector Development, and Global Operations, Michael Schreck, EVP, General Manager, Veterinary Software and Services, Corporate Accounts, and Customer Experience, and Martin Smith, EVP and Chief Technology Officer, for their perspectives on why we innovate – and what we strive to achieve for pets, people, and the planet."
    },
    {
        "Ticker": "IDXX",
        "Company": "Idexx Laboratories",
        "Source_URL": "http://www.idexx.com/en/about-idexx/idexx-stories/idexx-global-pathology-services-delivers-expertise-within-a-powerful-and-collaborative-diagnostic-ecosystem/",
        "Content_Type": "Website Content",
        "Raw_Text": "IDEXX Stories\nIDEXX Global Pathology Services delivers expertise within a powerful and collaborative diagnostic ecosystem\nThere’s an entire ecosystem at work behind every IDEXX Pathology result—whether biopsy, aspirate, or fluid. A carefully orchestrated set of rigorous steps and highly trained experts, all equipped with advanced technology designed to smooth workflows, reduce turnaround time, and ensure quality results. Exceptional talent within a culture focused on collaboration, input, and continuous learning. And a shared dedication to delivering the insights and guidance veterinarians need to make the best decisions for the pets in their care. This is the vast network of resources veterinary professionals tap into when they partner with IDEXX pathologists around the world.\n“Part of what drew me to IDEXX nearly two decades ago was the strong customer lens and the focus on employees,” says Jeremy Johnson, DVM, PhD, DAVCP, Vice President and General Manager, IDEXX Global Pathology. “Those things, and the notion that we could bring innovation to what some may think of as the ‘oldest and stodgiest’ specialty in veterinary medicine.”\nDr. Johnson found he was in the right place for innovation. Pathology leaders at IDEXX were at the forefront of developing digital capabilities for anatomic and clinical pathology samples, opening up a new world of possibilities in veterinary pathology—both for turnaround time to get results and for collaboration and access to specialized expertise. “When I started out as a pathologist, traditional samples were prepared on glass slides, making them very difficult to transfer around or to transfer from the source to the pathologist best equipped to read the sample,” says Dr. Johnson. “Digitalization enabled the transportability of the sample itself, as digital samples can be read almost anywhere. Customers suddenly had access to deeper expertise because, behind the scenes, pathology teams are empowered to consult with colleagues anywhere in the world—colleagues with very specific expertise.” Federico Sacchini, MPhil, DipRCPath, DipECVCP, MRCVS, IDEXX Associate Director and Head of Pathology in the Asia-Pacific region, couldn’t agree more. “Digitalization was revolutionary because before, all the pathologists used to work on-site in the lab. You had to ship glass slides—it was a nightmare! The development of digitalized pathology slides allowed us to recruit pathologists working remotely outside the lab. We were able to break free from location-specific barriers and attract and hire exceptional talent from around the world.”\nMany of the veterinary pathologists that make up IDEXX’s global network have a specialized focus in particular areas such as cancer, ocular, dermatopathology, liver, reproductive pathology, avian and exotics, and many more.\n“It also enables our pathologists to build their networks and continue to learn and grow, to become more specialized,” adds Dr. Johnson. The IDEXX Pathology network makes up the largest segment of IDEXX’s more than 700 medical specialists. Many of the veterinary pathologists that make up IDEXX’s global network have a specialized focus in particular areas such as cancer, ocular, dermatopathology, liver, reproductive pathology, avian and exotics, and many more. This globally distributed network has also allowed the team to begin to implement a “follow the sun” service model. With this method, pathologists can be assigned cases to read during their working day—cases that may have originated from a part of the world where it’s the middle of the night—a significant benefit to customers, particularly when dealing with critical cases.\nBut it’s not only about the pathologists who put their names and email addresses on IDEXX Pathology reports—this team of experts is supported by lab technicians dedicated to expertly preparing slides for digitalization and reading. “There are so many people involved who execute really specialized steps with an incredibly high level of excellence,” notes Carrie Flint, DVM, DACVP, IDEXX Pathology Manager in North America. “There's expertise required to ensure excellent sample preparation. A lot of work goes into that—unseen work that makes it possible for the pathologist to read the case.”\n“I love being able to bring customers into the lab,” says Thelma Meiring, BA(SW), BVSc, MMedVet (Path), MVM, DACVP, MRCVS, IDEXX Head of Anatomic Pathology in Australia and New Zealand, “because they develop a new appreciation for the degree of rigor involved behind the scenes. Your most complicated cases and most challenging samples will be handled by a technician with the experience for the job.”\nThe ecosystem IDEXX pathologists can count on doesn’t end with the depth of expertise and support from the lab operations team. Pathologists contribute to and operate within IDEXX’s rich diagnostic ecosystem. “The value that a pathologist can offer across the breadth of IDEXX is legion,” points out David Maguire, MVB, BSc (Hons), MVetMed, FRCPath, DipACVP, MRCVS, IDEXX Director of Pathology in Europe and South Africa. “It’s everything from helping to validate assays to working with internal medicine and other partners to determine the best answer we can provide to a customer. We offer excellent in-house instruments like ProCyte One® and ProCyte Dx® hematology analyzers. Those results tie into VetConnect® PLUS, providing visibility to our pathologists and internal medicine specialists. We can discuss the results as a team and consult with experts in oncology and dermatology or whatever the case requires. The wider ecosystem is greater than the sum of the parts.”\n“We love our customers—we enjoy communicating with them and helping them. We come to work every day to help the pet, the owner, and the veterinary team.”\nIn North America, customers can create a highly personalized IDEXX Pathology experience. “Customers can set up a ‘preferred pathologist’ list,” shares Dr. Flint. “They can pick six to eight IDEXX pathologists they prefer and can be assured that most of their samples will go to those team members. We can help choose pathologists based on report style or which ones are from certain institutions—and customers can change this list at any time. We love our customers—we enjoy communicating with them and helping them. We come to work every day to help the pet, the owner, and the veterinary team.”\n“We enjoy being an essential part of the clinical decision-making process,” says Matt Feirer, DVM, DACVP, IDEXX Pathology Manager in North America. “I see our role as being part of the extended veterinary care team. We use our knowledge to provide direction and guidance and to be part of the solution.”\nIDEXX pathologists are not only devoted to customer success—they’re also devoted to the success of the veterinary pathology profession. “Not only do we want to advance what we deliver to customers, but we also want to advance the veterinary pathology community. We contribute to residency training programs in Europe and Asia Pacific, making IDEXX one of the largest training institutions for veterinary pathologists,” says Dr. Johnson. Additionally, IDEXX pathologists deliver dozens of educational sessions to colleagues each year, extending their expertise across the profession.\nFor more information about IDEXX Pathology Services, visit www.idexx.com/pathology."
    },
    {
        "Ticker": "IDXX",
        "Company": "Idexx Laboratories",
        "Source_URL": "http://www.idexx.com/en/about-idexx/idexx-stories/idexx-education-supports-continuous-learning-at-every-stage-of-a-veterinary-career/",
        "Content_Type": "Website Content",
        "Raw_Text": "IDEXX Stories\nIDEXX education supports continuous learning at every stage of a veterinary career\nNew advancements in veterinary medicine. Emerging tools and resources. Pursuing advanced career paths. Maintaining credentials. There are so many reasons for veterinary team members to look for a range of options to meet their educational interests – and requirements. Well-trained, high-performing veterinary teams are essential to delivering the best care for pets and operating practices at a high level of efficiency, ensuring access to care for furry family members. That’s why IDEXX is dedicated to contributing to educational opportunities throughout a veterinary team member’s career, whether your journey takes you to general practice or a specialty focus.\n“Access is everything,” says Casey Etter, Managing Director of Global Education Strategy at IDEXX. “Our long-term goal is to ensure that anyone in the veterinary field who needs education resources can access what they need – anytime, anywhere, on any device – at no charge.”\nStudent life\nIDEXX’s engagement in the veterinary learning journey begins with university connections. Established in 2017, IDEXX’s University Education Programs augment and complement veterinary program curricula at more than 20 universities in North America. “Our focus is to provide hands-on experience with diagnostics and software tools to prepare students for Day One Competencies,” says Stephanie Thompson, DVM, IDEXX Regional Medical Affairs and Outreach Manager for the Americas. Students learn from IDEXX DVMs and specialists through symposia sessions on topics including preventive care and renal health. They gain firsthand experience with the latest IDEXX innovations by running samples on in-house diagnostic analyzers and SNAP Tests, along with viewing diagnostic results with support from tools like IDEXX’s VetConnect PLUS and IDEXX DecisionIQ. “Students begin to understand the value industry partners bring into practice as educational resources, not only as sales organizations. Our educational offerings truly deliver an experience they wouldn't have otherwise. We are relentlessly focused on ensuring that veterinary students who engage with our programming are prepared for life in practice from the very start,” says Thompson.\nFaculty also benefit from IDEXX University Education programming. Faculty at participating universities can take advantage of IDEXX diagnostics on campus for case management and the development of teaching cases, and they have access to faculty rounds with IDEXX experts.\nIn 2022, more than 20,000 students at 45 veterinary schools engaged in the IDEXX University Program.\nPursuing a specialty\nSpecialists deliver dedicated expertise to support the work of veterinarians in general practice. Much like the capacity challenges faced in general practice, specialty fields are also constrained by growing caseloads and a decline in specialists to address them. A traditional specialist education track includes completing a veterinary degree, an internship, and a three-year residency program. “Residents pursuing a specialty are experiencing declining program opportunities. As caseload demands continue to increase, training opportunities are declining as the need to attend to patient care supersedes specialists’ ability to develop and provide required didactic study to residents,” shares Rebekah Mack, DVM, DACVIM-SAIM, Senior Manager, Global Medical Education Development and Delivery at IDEXX.\nInnovation infuses everything we do – not only our commercial offerings but also our educational offerings.\nWith this challenge in mind, Dr. Mack led the charge to develop a rigorous academic support program to aid busy house officers, residency coordinators, and the clinicians responsible for training and producing more residents in achieving their mission. Springboard, developed, delivered, and supported through a partnership between IDEXX and VetBloom, launched in June of 2023. This innovative program delivers the specific, advanced education residents require to be successful in pursuit of their chosen specialty, at no cost to the resident. The first educational unit, available now, delivers renal and urinary physiology content through self-directed, interactive online learning modules paired with live, case-based discussion opportunities and assessments to reinforce learning. Additional units on a range of topics continue to launch.\nAccording to Dr. Mack, “Springboard delivers on the IDEXX and VetBloom commitment to the professional careers of veterinarians. Innovation infuses everything we do – not only our commercial offerings but also our educational offerings.”\nContinuing Education\nOnce in practice, whether as a general practitioner or as a specialist, veterinarians are challenged to balance the demands of a busy work life – and a busy life in general! – with the need for ongoing educational opportunities. Veterinary team members at any career stage may be required to maintain their professional credentials through continuing education requirements. In addition to fulfilling requirements, ongoing education also offers the opportunity to learn about new clinical developments in the veterinary profession, new tools, and new ways of engaging with fellow team members and pet families. The IDEXX Learning Center provides access to education in all of these areas – anytime, anywhere, and on any device – at no cost. The IDEXX Learning Center online portal provides educational content to veterinary professionals in 135 countries around the globe through 20 unique portal sites by way of short video content, self-paced online courses, and live and recorded webinar presentations, and reaches more than 43,000 active users.\nHelping clinicians to have confidence in their diagnostic workups is really what we want to achieve through education.\nWebinars are a particularly popular learning option, drawing tens of thousands of webinar attendees globally each year. In addition to webinars delivered by IDEXX clinical experts, webinar series are offered in partnership with other veterinary professional organizations, such as the International Society of Feline Medicine or the British Small Animal Veterinary Association (BSAVA). Like all IDEXX Learning Center content, webinars are typically offered free of charge and are designed to appeal to a wide range of experience and education levels. The webinar format allows IDEXX to respond quickly to current issues practitioners are facing, such as a surge in infectious disease in a particular geographic region. “At IDEXX, we put a big emphasis on ensuring that our educational offerings can be used right away. What will help a vet in practice the very next day? What do they need to learn to implement it and enact change in their practice immediately? We focus on delivering clinically relevant, clinically actionable education in all we do,” says Sylvia Conway, MRCVS, Education Development and Content Delivery Leader, EMEA.\nProfessional conferences also serve as a common path to accessing continuing education. “One of the things we look at when developing content for our conference education is, ‘What are practitioners asking about right now?’ We get input from the most common questions asked of our Medical Consulting Service team and of our Professional Service Veterinarians who visit practices nearly every day,” says Conway. “Helping clinicians to have confidence in their diagnostic workups is really what we want to achieve through education.”\nIDEXX education offerings reach tens of thousands of veterinarians across the globe each year. In 2022, IDEXX provided the equivalent of $3.6 million in continuing education credit offerings through the IDEXX Learning Center.\nTo learn more about how IDEXX education supports achieving our Purpose, read our latest corporate responsibility report."
    },
    {
        "Ticker": "IDXX",
        "Company": "Idexx Laboratories",
        "Source_URL": "http://www.idexx.com/en/about-idexx/idexx-stories/idexx-global-medical-consulting-services-brings-expert-support-into-practice-when-you-need-it-most/",
        "Content_Type": "Website Content",
        "Raw_Text": "IDEXX Stories\nIDEXX Global Medical Consulting Services brings expert support into practice when you need it most\nDr. Myer hasn’t been able to get Lizzie, a three-year-old Airedale, out of her mind since she left the exam room without clear answers a few hours ago. This is the fourth time Lizzie’s family has brought her in for an unexpected visit in the past year, each time with difficult-to-pinpoint symptoms: intermittent diarrhea and decreased energy. Recently, she hasn’t been finishing all of her food, and her family has noticed that sometimes she paces at night. This time, Lizzie’s family brought her in because she’d thrown up while she was up pacing and panting. Dr. Myer completed a thorough physical exam, but everything with Lizzie was normal, just like in previous visits. Dr. Myer had performed lab work on the last two visits, looking for abnormalities and trends that could provide clues. She looked again, comparing the two CBCs and chemistry panels with electrolytes and urinalyses. A few things look a little off, but nothing that points to a conclusive answer. Sodium is normal, potassium is a bit high but still within the normal reference range. Lizzie’s renal values are trending a little higher on the more recent results, but they are still normal. Monocytes were low on the first round of blood work but normal on the second, along with everything else on her CBCs. Her urinalyses are also unremarkable. What could be causing Lizzie’s vague and intermittent clinical signs and symptoms? Could Lizzie have Addison’s disease? What about pancreatitis? Renal disease? Leptospirosis? Something else? What is the best next step?\nDr. Myer finds a quiet moment between appointments, pulls out her phone, and finds the number for IDEXX Global Medical Consulting Services in her saved contacts. In minutes, she’s connected with an expert small animal internal medicine specialist, and once she’s confirmed her IDEXX account and Lizzie’s name, the consulting specialist can view Lizzie’s IDEXX test results for both in-clinic analyzers and Reference Laboratory testing while listening to Dr. Myer’s description of Lizzie’s presentation. In just minutes, Dr. Myer found someone she can talk through this puzzling case with to make sure she’s considered all the options and will be equipped to recommend the best next steps to the pet owner. The consulting specialist agrees with Dr. Myer’s concerns and list of possible causes. Together, Dr. Myer and her IDEXX Global Medical Consulting Services colleague discuss the options for additional diagnostics and clarify next steps that make the most sense. Yes, Lizzie could very well have Addison’s disease, but there are a few other compelling possibilities. The anxiety leaves Dr. Myer’s voice as she ends the call, confident in the next steps she’ll take to obtain a diagnosis to focus treatment recommendations.\nThat’s what veterinarians placing more than 600,000 calls each year find when they contact IDEXX Global Medical Consulting Services for help and guidance specific to IDEXX products and services. Expert support. A judgment-free zone. And the added experience and perspective that a fellow veterinarian or technician member of the IDEXX Global Medical Consulting Services team can add to help make the day go a bit more smoothly. All at no additional cost.\n“Years ago, when practicing veterinarians faced a challenging or puzzling case, we didn’t have the internet or easy access to all of the information and support options we have today. We read and kept our paper journals, and we consulted our veterinary textbooks every day,” says Shannon Bray, DVM, DACVIM (small animal internal medicine), and senior manager on the Global Medical Consulting Services team at IDEXX. “And when we really needed help beyond those resources, we literally ‘phoned a friend,’ usually a friend or mentor from veterinary school, an internship, or residency, and hoped they had time to connect and talk through a case, amid everyone’s busy days. But that wasn’t always easy. Now, veterinary practitioners can ‘phone a friend’ at IDEXX and get connected with the expert consultation they need. We are an added resource for our veterinary colleagues in practice.”\nToday, IDEXX’s Global Medical Consulting Services team is more than 150 strong, serving customers in 25 countries and discussing cases in 14 languages. The group is part of the approximately 600 specialists and medical consultants at IDEXX across teams including pathology, radiology, and cardiology. Consultants have an average of 14 years of veterinary clinical experience and 20 percent of the team has more than 10 years of experience at IDEXX. About half of the team members still work in practice part-time or covering relief shifts. Forty-six percent of the team is composed of board-certified veterinary specialists with expertise in disciplines that include oncology, dermatology, small animal internal medicine, large animal internal medicine, and zoological medicine. Callers can also reach general practitioners, known as diagnostic support veterinarians, who receive additional training related to diagnostic medicine, and diagnostic support technicians with expertise in IDEXX test selection, common discrepant results, and test protocols.\n“I've always been an educator at heart,” says Andrea Munk, DVM, DACVIM (small animal internal medicine), veterinary specialist medical consultant based in the U.S. “I love the role of teacher and guide. It’s been really easy to incorporate that into my consultant role at IDEXX for the past seven years, and I think that’s true for many of us. It’s our calling. I like discussing the possible options. In the end, the customer makes the decision, but I appreciate playing a role in helping them feel confident they’re making the most informed decision they can.”\nIn the end, the customer makes the decision, but I appreciate playing a role in helping them feel confident they’re making the most informed decision they can.\nPaige Brock, DVM, DACZM, cVMA (zoological medicine), veterinary specialist medical consultant, echoes that idea. “I think the thing that I love the most is when I get to talk to those practitioners who are feeling a little bit of imposter syndrome, who are feeling that they don't have the tools or the knowledge to help their patient,” says Brock. “And I get to be that positive voice in the room that says, ‘You're doing great and we can come up with a plan and a solution together.’ I really love that opportunity.”\nVeterinary practitioners across the globe can access IDEXX Global Medical Consulting Services, and increasingly, team members are knowledge sharing with each other to ensure continuous learning and shared expertise. “It’s a really great team made up of a lot of people with very different backgrounds that are having exchanges with each other day by day,” says Stephanie Nather, DVM and small animal veterinary specialist medical consultant based in Germany. “We’re connected, we’re talking about cases. And I love that if I can't give the perfect answer right away, I can think out loud and confer with colleagues and call a customer back with a better answer.” Team members have been surprised to find that while there are certainly regional distinctions – in diseases of concern or in approach to medicine – there are more commonalities than there are differences from region to region.\nIDEXX Global Medical Consultants often think of themselves as a virtual extension of each practice they encounter over the phone. “Sometimes you can hear that the caller is very stressed – maybe the pet owner is in front of them, or I've even taken urgent calls from vets seeking advice about patients who are under sedation or general anesthesia,” Juliette Trempé, DVM and medical consulting manager, France, shared. “During COVID lockdowns, veterinarians were absolutely alone in the practice with no nurses. They had no one to talk to about clinical cases to get perspective or advice. Our role as a colleague and guide felt even more essential at that time. And I love knowing that I’ve helped not only the veterinarian but also the pet.”\nCallers to the IDEXX Global Medical Consulting Services team may be surprised to find that the veterinary specialists, veterinary general practitioners, and diagnostic support technicians they reach are not coached to push or promote further IDEXX diagnostics. “From the beginning, the direction from my leaders at IDEXX has always been that my job is to provide the best guidance for that client and that patient,” says Dr. Brock. “It’s my job to support and give the best recommendation for the patient and I think that builds so much credibility.”\nIDEXX Global Medical Consulting Services are available to all IDEXX customers in North America and Europe as well as Australia and New Zealand at no additional cost. To take advantage of this rich IDEXX resource, contact your local IDEXX customer support center for more information."
    }
]