[
    {
        "Ticker": "ISRG",
        "Company": "Intuitive Surgical",
        "Source_URL": "https://www.intuitive.com",
        "Content_Type": "Website Content",
        "Raw_Text": "Da Vinci Single Port\nEin vielseitiges1 und leistungsstarkes Single Port Operationssystem.\nIntuitive da Vinci 5 Operationssystem\nDa Vinci 5, so fortschrittlich und integriert wie niemals zuvor, wurde konzipiert, um die Chirurgie zu transformieren.\n8 mm SureForm 30 mit gebogener Spitze\nKleiner Stapler. Große Wirkung.\nOP-Teams\nBessere Teamarbeit im OP\nWarum da Vinci Operationssysteme\nMehrwert robotischer Programme\nIntuitive für die Thoraxchirurgie\nErweitern Sie Ihr Einsatzspektrum mit roboter-assistierten Eingriffen mit da Vinci\nA Future of Firsts\nPioniergeist – gestern, heute und morgen\nEine Serie über die Operateur:innen, die die Versorgung mit da Vinci Eingriffen transformieren.\nThis is a modal window.\nBeginning of dialog window. Escape will cancel and close the window.\nEnd of dialog window.\nThis is a modal window. This modal can be closed by pressing the Escape key or activating the close button.\nHinweise\nDie individuellen Ergebnisse können von einer Reihe von Faktoren abhängen, unter anderem von Patientenmerkmalen, Krankheitsmerkmalen und/oder der Erfahrung des Operateurs.\nEinige Produkte, Funktionen oder Technologien sind möglicherweise nicht in allen Ländern verfügbar. Bitte erkundigen Sie sich bei Ihrem zuständigen Intuitive-Ansprechpartner vor Ort nach der Verfügbarkeit der Produkte in Ihrer Region. Angaben zu Indikationen, Kontraindikationen, Warnhinweisen und anderen Produktinformationen finden Sie in der produktspezifischen Gebrauchsanweisung.\nDa Vinci 5 Chirurgiesystem\nDas da Vinci 5 Chirurgiesystem dient zur Unterstützung bei der präzisen Steuerung von da Vinci Endoskopen und Instrumenten während minimalinvasiven endoskopischen urologisch-chirurgischen Eingriffen, gynäkologisch-chirurgischen Eingriffen, allgemeinen laparoskopisch-chirurgischen Eingriffen und thorakoskopisch-chirurgischen Eingriffen.\nDas System kann sowohl für erwachsene Patienten als auch für Kinder verwendet werden. Es soll von erfahrenen Ärzten in einem Operationssaal verwendet werden.\nDas da Vinci 5 Chirurgiesystem ist ein Medizinprodukt der Klasse IIb mit CE-Kennzeichnung (CE 2460) gemäß der europäischen Medizinprodukteverordnung (EU 2017/745), hergestellt von Intuitive Surgical, Inc. Bitte beachten Sie die Gebrauchsanweisung vor der Anwendung.\nDa Vinci X & Xi Chirurgiesysteme\nDie Endoskopie-Instrumentensteuerungssysteme von Intuitive Surgical (da Vinci X und da Vinci Xi Chirurgiesysteme) dienen zur Unterstützung bei der präzisen Steuerung der endoskopischen Instrumente von Intuitive Surgical während urologisch-chirurgischer Eingriffe, allgemeiner laparoskopischer Eingriffe, gynäkologischer laparoskopisch-chirurgischer Eingriffe, allgemeiner thorakoskopischer Eingriffe und transoraler otolaryngologisch-chirurgischer Eingriffe, die auf gutartige Tumore und bösartige Tumore der Klasse T1 und T2 beschränkt sind, sowie gutartiger Zungengrundresektionseingriffe. Die Systeme können sowohl für erwachsene Patienten als auch für Kinder verwendet werden (sofern es sich nicht um transorale otolaryngologische chirurgische Verfahren handelt). Sie sollen von erfahrenen Ärzten in einem Operationssaal verwendet werden.\nDie da Vinci X und da Vinci Xi Chirurgiesysteme sind Medizinprodukte der Klasse IIb mit CE-Kennzeichnung (CE 2460) gemäß der europäischen Medizinprodukte-Richtlinie (93/42/EWG), hergestellt von Intuitive Surgical, Inc. Bitte beachten Sie die Gebrauchsanweisung vor der Anwendung.\nDa Vinci SP Chirurgiesystem\nDas da Vinci SP Chirurgiesystem dient der genauen Steuerung des zugehörigen Endoskops und der Instrumente bei minimal-invasiven endoskopischen abdominopelvinen, thoraskokopischen, transoralen otolaryngologischen und Brustchirurgieverfahren. Das System ist für den Einsatz bei Erwachsenen indiziert. Es soll von erfahrenen Ärzten in einem Operationssaal verwendet werden.\nDas da Vinci SP Chirurgiesystem ist ein Medizinprodukt der Klasse IIb mit CE-Kennzeichnung (CE 2460) gemäß der europäischen Medizinprodukte-Verordnung (EU 2017/745), hergestellt von Intuitive Surgical, Inc. Bitte beachten Sie die Gebrauchsanweisung vor der Anwendung.\nDiese Cookies sind zur Funktion der Website erforderlich und können in Ihren Systemen nicht deaktiviert werden. In der Regel werden diese Cookies nur als Reaktion auf von Ihnen getätigte Aktionen gesetzt, die einer Dienstanforderung entsprechen, wie etwa dem Festlegen Ihrer Datenschutzeinstellungen, dem Anmelden oder dem Ausfüllen von Formularen. Sie können Ihren Browser so einstellen, dass diese Cookies blockiert oder Sie über diese Cookies benachrichtigt werden. Einige Bereiche der Website funktionieren dann aber nicht. Diese Cookies speichern keine personenbezogenen Daten.\nDiese Cookies ermöglichen es uns, Besuche und Verkehrsquellen zu zählen, damit wir die Leistung unserer Website messen und verbessern können. Sie unterstützen uns bei der Beantwortung der Fragen, welche Seiten am beliebtesten sind, welche am wenigsten genutzt werden und wie sich Besucher auf der Website bewegen. Alle von diesen Cookies erfassten Informationen werden aggregiert und sind deshalb anonym. Wenn Sie diese Cookies nicht zulassen, können wir nicht wissen, wann Sie unsere Website besucht haben.\nMit diesen Cookies ist die Website in der Lage, erweiterte Funktionalität und Personalisierung bereitzustellen. Sie können von uns oder von Drittanbietern gesetzt werden, deren Dienste wir auf unseren Seiten verwenden. Wenn Sie diese Cookies nicht zulassen, funktionieren einige oder alle dieser Dienste möglicherweise nicht einwandfrei.\nDiese Cookies können über unsere Website von unseren Werbepartnern gesetzt werden. Sie können von diesen Unternehmen verwendet werden, um ein Profil Ihrer Interessen zu erstellen und Ihnen relevante Anzeigen auf anderen Websites zu zeigen. Sie speichern nicht direkt personenbezogene Daten, basieren jedoch auf einer einzigartigen Identifizierung Ihres Browsers und Internet-Geräts. Wenn Sie diese Cookies nicht zulassen, werden Sie weniger gezielte Werbung erleben."
    },
    {
        "Ticker": "ISRG",
        "Company": "Intuitive Surgical",
        "Source_URL": "https://www.intuitive.com/de-de/about-us/contact",
        "Content_Type": "Website Content",
        "Raw_Text": "Kontakt zu Intuitive\nUnser Hauptsitz mit Produktion, Forschung und Trainingskapazitäten befindet sich in Sunnyvale, Kalifornien, USA. Wir haben Niederlassungen auf der ganzen Welt und vertreiben unsere Produkte in den USA, Westeuropa und im asiatisch-pazifischen Raum direkt, sowie indirekt über Distributoren in einer Vielzahl anderer Regionen. Darüber hinaus sind wir in China über unser Joint Venture IntuFosun tätig.\nKontakt aufnehmen\nBei allgemeinen Anfragen unterstützen Sie gerne die Rezeptionen unserer Standorte Aubonne und Freiburg.\nUnterstützung für Kunden\nUnser technisches Team steht bei zeitkritischen und allgemeinen Fragen zur Verfügung. Rufen Sie uns an, wenn Sie Unterstützung zu unseren Produkten, Serviceleistungen oder zu Ihrem Kundenkonto benötigen. Technischer Notfallsupport auf Englisch ist 24/7, 365 Tage im Jahr verfügbar.\nDeutschland\n0800 1825 068 (gebührenfrei)\n+49 761 488 8962 (kostenpflichtig als Ortsgespräch) von 8-18 Uhr\nsupport.DE@intusurg.com\nÖsterreich\n0800 298 890 (gebührenfrei)\n+43 126 752 25 (kostenpflichtig als Ortsgespräch) von 8-18 Uhr\nsupport.AT@intusurg.com\nSchweiz\n0800 821 200 (gebührenfrei)\n+41 21 821 2020 (kostenpflichtig als Ortsgespräch) von 8-18 Uhr\nsupport.CH@intusurg.com\nUnterstützung für digitale Produkte\nUnterstützung bezüglich aller digitalen Produkte von Intuitive wie SimNow, Hub, Telepresence, My Intuitive, Case Insights, Intuitive Learning und das Kundenportal.\nDie Kontaktmöglichkeiten für weitere Euopäische Länder finden Sie hier.\nMedienanfragen\nIntuitive Futures Forum, Berlin\nDas Intuitive Futures Forum, zwischen Berliner Hauptbahnhof und Kanzleramt gelegen, bietet seit dem Jahr 2020 eine Plattform für gesundheitspolitische Diskussion und Dialog. Wissenschaft und Politik, Wirtschaft und Medizin treffen hier aufeinander, um Gedanken auszutauschen, Ideen zu testen und Themen des Gesundheitssystems zu diskutieren. In seiner Funktion als Showroom bietet das Intuitive Futures Forum, Berlin darüber hinaus die Möglichkeit, die roboter-assistierte Chirurgie auch außerhalb des Operationssaals zu erleben.\nIntuitive Futures Forum, Berlin\nKatharina-Paulus-Straße 2\n10557 Berlin\nDeutschland\n+49 761 8878 7700\nDas Intuitive Futures Forum, Berlin ist eine unselbstständige Betriebsstätte der Intuitive Surgical Deutschland GmbH.\nNiederlassungen\nÖsterreich\nIntuitive Surgical Österreich GmbH\nAusstellungsstr. 50 (Zugang C / 2. Stock)\n1020 Wien\nÖsterreich\nWeitere Unterstützung\nDiese Cookies sind zur Funktion der Website erforderlich und können in Ihren Systemen nicht deaktiviert werden. In der Regel werden diese Cookies nur als Reaktion auf von Ihnen getätigte Aktionen gesetzt, die einer Dienstanforderung entsprechen, wie etwa dem Festlegen Ihrer Datenschutzeinstellungen, dem Anmelden oder dem Ausfüllen von Formularen. Sie können Ihren Browser so einstellen, dass diese Cookies blockiert oder Sie über diese Cookies benachrichtigt werden. Einige Bereiche der Website funktionieren dann aber nicht. Diese Cookies speichern keine personenbezogenen Daten.\nDiese Cookies ermöglichen es uns, Besuche und Verkehrsquellen zu zählen, damit wir die Leistung unserer Website messen und verbessern können. Sie unterstützen uns bei der Beantwortung der Fragen, welche Seiten am beliebtesten sind, welche am wenigsten genutzt werden und wie sich Besucher auf der Website bewegen. Alle von diesen Cookies erfassten Informationen werden aggregiert und sind deshalb anonym. Wenn Sie diese Cookies nicht zulassen, können wir nicht wissen, wann Sie unsere Website besucht haben.\nMit diesen Cookies ist die Website in der Lage, erweiterte Funktionalität und Personalisierung bereitzustellen. Sie können von uns oder von Drittanbietern gesetzt werden, deren Dienste wir auf unseren Seiten verwenden. Wenn Sie diese Cookies nicht zulassen, funktionieren einige oder alle dieser Dienste möglicherweise nicht einwandfrei.\nDiese Cookies können über unsere Website von unseren Werbepartnern gesetzt werden. Sie können von diesen Unternehmen verwendet werden, um ein Profil Ihrer Interessen zu erstellen und Ihnen relevante Anzeigen auf anderen Websites zu zeigen. Sie speichern nicht direkt personenbezogene Daten, basieren jedoch auf einer einzigartigen Identifizierung Ihres Browsers und Internet-Geräts. Wenn Sie diese Cookies nicht zulassen, werden Sie weniger gezielte Werbung erleben."
    },
    {
        "Ticker": "ISRG",
        "Company": "Intuitive Surgical",
        "Source_URL": "https://www.intuitive.com/de-de/about-us/newsroom/da-vinci-sp-a-milestone",
        "Content_Type": "Website Content",
        "Raw_Text": "Dirk Barten\nSenior Vice President und General Manager Europe bei Intuitive\nDie Operateurin und der Operateur sowie das Team sind es, die im OP die Verantwortung tragen. Unsere Technik hat die Aufgabe, die chirurgischen Fertigkeiten ihres Anwenders oder ihrer Anwenderin zu erweitern.\nGeoffrey Lorthiois\nVice President für die DACH-Region bei Intuitive\nDas Ziel ist nicht nur die Einführung neuer Technologien, sondern Operateurinnen und Operateure eine Lösung zu bieten, damit sie neue Indikationen oder chirurgische Ansätze angehen können, um die Ergebnisse für die Patientinnen und Patienten zu verbessern.\nTim Heisterkamp\nRegional Director für die DACH-Region bei Intuitive\nGemeinsam mit dem hoch engagierten Team von Intuitive möchten wir unseren Kunden Innovationen für eine moderne, minimalinvasive Patientenversorgung bieten, um die Ergebnisse kontinuierlich zu verbessern – Tag für Tag.\nDr. Tilman Schlick\nVice President, Medical Affairs und Medical Officer bei Intuitive\nEs gibt ein vielstufiges Ausbildungsprogramm, in dem wir weltweit mittlerweile über 74.000 Operateurinnen und Operateure geschult haben. Wir haben also viel Erfahrung gewonnen und wissen, welche Details trainingsintensiv sind.\nProf. Dr. Alexander Haese\nLeitender Arzt für roboter-assistierte Urologie an der Martini-Klinik am UKE in Hamburg\nWir operieren mit einem roboter-assistierten OP-System, weil es eine Präzision und Genauigkeit der Operationen im sehr kleinen engen Raum ermöglicht, nämlich im Becken des Mannes, wo es kaum Platz gibt."
    },
    {
        "Ticker": "ISRG",
        "Company": "Intuitive Surgical",
        "Source_URL": "https://www.intuitive.com/de-de/about-us/newsroom/press-resources",
        "Content_Type": "Website Content",
        "Raw_Text": "Presseinformationen\nFinden Sie, was Sie brauchen, um Ihre Geschichte zu erzählen\nNehmen Sie Kontakt auf und erhalten Sie neueste Informationen\nHier sind verschiedene Ressourcen über das Unternehmen Intuitive und seine Produkte gelistet. Nehmen Sie Kontakt mit uns auf und lesen Sie unsere regionalen Pressemitteilungen durch. Sie finden zudem Erklärungen zum Unternehmen sowie Bild- und Videomaterial von Intuitive, das Sie für werbliche, redaktionelle und akademische Zwecke verwenden können.\nPressematerial von Intuitive\nFür Deutschland, Österreich und die deutschsprachige Schweiz finden Sie hier regionale Pressemitteilungen und medienrelevante Informationen.\nUnternehmensübersicht\nErfahren Sie mehr über die Unternehmensgeschichte und unsere Produkte im Factsheet.\nÜber Intuitive\nIntuitive (Nasdaq: ISRG) mit Hauptsitz in Sunnyvale, Kalifornien, ist ein weltweit führendes Unternehmen in der minimalinvasiven medizinischen Versorgung und Pionier der roboter-assistierten Chirurgie. Zu unseren Technologien gehören das da Vinci Operationssystem und das Ion Endoluminalsystem. Durch die Kombination hochentwickelter Systeme, fortschrittlicher Lernmethoden und wertsteigernder Services unterstützen wir Ärztinnen und Ärzten sowie ihre Teams, die Versorgung zu optimieren und die bestmöglichen Ergebnisse zu erzielen. Unsere Vision ist eine weniger invasive und nachhaltig bessere Versorgung, bei der Krankheiten frühzeitig erkannt und schnell behandelt werden, damit sich die Patientinnen und Patienten wieder auf das Wesentliche konzentrieren können.\nBild- und Videobibliothek\nDiese Materialien werden ausschließlich für Werbezwecke, redaktionelle und akademische Zwecke und/oder zur Verwendung in der Medienberichterstattung über Intuitive und seine Produkte bereitgestellt. Bitte laden Sie Zip-Dateien herunter, die so zusammengestellt wurden, dass sie eine Reihe von Produktbildern oder Logodateien enthalten, die Sie in Ihrer Publikation verwenden können.\nNutzungsbedingungen\nIntuitive stellt diese Materialien ohne Gewähr zur Verfügung. Bitte beachten Sie daher, dass die Erlaubnis zur Nutzung nur bei Beachtung der nachstehenden Richtlinien vorliegt.\nIntuitive gestattet Ihnen zwar die Verwendung dieser Materialien in geeigneter Weise, wir werben jedoch nur für Prozeduren, die von den zuständigen Behörden genehmigt wurden. Jegliche Nutzung dieser Materialien durch Dritte unterliegt der alleinigen Kontrolle und Verantwortung dieser Parteien für deren werbliche, redaktionelle und akademische Verwendung und/oder Medienberichterstattung. Intuitive berät Kunden nicht und gibt ihnen auch keine Anregungen für ihre Marketingmaßnahmen oder -materialien. Sie dürfen bei der Verwendung dieser Materialien keine Aussagen machen, die den Eindruck erwecken, dass Intuitive bei der Erstellung des Endprodukts, in dem Sie diese Materialien verwendet haben, mitgeholfen hat oder dieses unterstützt.\nKeines der in diesem Abschnitt enthaltenen Materialien darf dazu verwendet werden, eine Prozedur außerhalb der genehmigten/freigegebenen Indikationen für die Verwendung eines Systems oder Instruments zu bewerben.\nEine Beschreibung der klinischen Anwendungen, für die das da Vinci-Operationssystem genehmigt/freigegeben wurde, finden Sie auf dem Produktetikett.\nAlle abgebildeten Personen sind Modellpersonen, sofern nicht anders angegeben.\nZusätzliche Richtlinien:\nBilder: da Vinci Systeme und Simulation\nDieser Zip-Ordner enthält hoch- und niedrigauflösende Bilder zu folgenden Produkten (192 MB):\nBilder: da Vinci Instrumente\nDieser Zip-Ordner enthält hoch- und niedrigauflösende Bilder zu folgenden Produkten (72 MB):\nVideos: Produkte\nÜber diese Links können Sie Videodateien herunterladen. Nachfolgend finden Sie die Vorschau der einzelnen Videos, bitte schauen Sie sich die Videos in ihrer vollen Länge an.\nThis is a modal window.\nBeginning of dialog window. Escape will cancel and close the window.\nEnd of dialog window.\nThis is a modal window. This modal can be closed by pressing the Escape key or activating the close button.\nLogos von Intuitive\nIn dieser Zip-Datei sind hoch- und niedrigauflösende Bilder (2 MB) des Intuitive-Logos in schwarz und weiß mit transparentem Hintergrund enthalten. Sie sind dazu verpflichtet die Logo-Nutzungsrichtlinien zu befolgen, die in der heruntergeladenen Zip-Datei enthalten sind.\nBilder: Intuitive Bürogebäude und Produktion\nDieser Zip-Ordner enthält hoch- und niedrigauflösende Bilder der folgenden Bereiche (59 MB):\nDie individuellen Ergebnisse können von einer Reihe von Faktoren abhängen, unter anderem von Patientenmerkmalen, Krankheitsmerkmalen und/oder der Erfahrung des Operateurs.\nEinige Produkte, Funktionen oder Technologien sind möglicherweise nicht in allen Ländern verfügbar. Bitte erkundigen Sie sich bei Ihrem zuständigen Intuitive-Ansprechpartner vor Ort nach der Verfügbarkeit der Produkte in Ihrer Region. Angaben zu Indikationen, Kontraindikationen, Warnhinweisen und anderen Produktinformationen finden Sie in der produktspezifischen Gebrauchsanweisung.\nDiese Cookies sind zur Funktion der Website erforderlich und können in Ihren Systemen nicht deaktiviert werden. In der Regel werden diese Cookies nur als Reaktion auf von Ihnen getätigte Aktionen gesetzt, die einer Dienstanforderung entsprechen, wie etwa dem Festlegen Ihrer Datenschutzeinstellungen, dem Anmelden oder dem Ausfüllen von Formularen. Sie können Ihren Browser so einstellen, dass diese Cookies blockiert oder Sie über diese Cookies benachrichtigt werden. Einige Bereiche der Website funktionieren dann aber nicht. Diese Cookies speichern keine personenbezogenen Daten.\nDiese Cookies ermöglichen es uns, Besuche und Verkehrsquellen zu zählen, damit wir die Leistung unserer Website messen und verbessern können. Sie unterstützen uns bei der Beantwortung der Fragen, welche Seiten am beliebtesten sind, welche am wenigsten genutzt werden und wie sich Besucher auf der Website bewegen. Alle von diesen Cookies erfassten Informationen werden aggregiert und sind deshalb anonym. Wenn Sie diese Cookies nicht zulassen, können wir nicht wissen, wann Sie unsere Website besucht haben.\nMit diesen Cookies ist die Website in der Lage, erweiterte Funktionalität und Personalisierung bereitzustellen. Sie können von uns oder von Drittanbietern gesetzt werden, deren Dienste wir auf unseren Seiten verwenden. Wenn Sie diese Cookies nicht zulassen, funktionieren einige oder alle dieser Dienste möglicherweise nicht einwandfrei.\nDiese Cookies können über unsere Website von unseren Werbepartnern gesetzt werden. Sie können von diesen Unternehmen verwendet werden, um ein Profil Ihrer Interessen zu erstellen und Ihnen relevante Anzeigen auf anderen Websites zu zeigen. Sie speichern nicht direkt personenbezogene Daten, basieren jedoch auf einer einzigartigen Identifizierung Ihres Browsers und Internet-Geräts. Wenn Sie diese Cookies nicht zulassen, werden Sie weniger gezielte Werbung erleben."
    },
    {
        "Ticker": "ISRG",
        "Company": "Intuitive Surgical",
        "Source_URL": "https://www.intuitive.com/de-de/about-us/company",
        "Content_Type": "Website Content",
        "Raw_Text": "16,9 Mio\nda Vinci Eingriffe wurden weltweit bis 2024 durchgeführt\n410 Tsd+\nda Vinci Eingriffe wurden 2024 in Europa durchgeführt\n1.700+\nDa Vinci Operationssysteme in Europa und 9.900 weltweit\n1.400\nIntuitive-Mitarbeiter:innen in Europa und 15.000+ weltweit\nThis is a modal window.\nWerden Sie Teil unseres Teams\nDie neuesten Informationen über Karrieremöglichkeiten bei Intuitive. Hier haben Sie die Möglichkeit, sich einem Team von sehr engagierten und begeisterten Menschen anzuschließen.\nPresse-Ressourcen finden\nIhre Quelle für Presse- und Unternehmensmitteilungen sowie Medienkontakte und alles, was Sie brauchen, um Ihre Geschichte zu erzählen.\nInformationen für Investoren\nEine gesammelte Auswahl an Investorenpräsentationen, Finanznachrichten, Konferenzplänen und Echtzeit-Aktieninformationen."
    },
    {
        "Ticker": "ISRG",
        "Company": "Intuitive Surgical",
        "Source_URL": "https://www.intuitive.com/de-de/about-us/newsroom",
        "Content_Type": "Website Content",
        "Raw_Text": "Newsroom\nTeilen Sie unsere Neuigkeiten und aktuellen Beiträge. Für Pressemitteilungen und -materialien besuchen Sie unsere Presseinformationen. Für Medienanfragen können sich gerne an unser Media Relations Team unter Presse.DACH@intusurg.com wenden.\nThis is a modal window.\nBeginning of dialog window. Escape will cancel and close the window.\nEnd of dialog window.\nThis is a modal window. This modal can be closed by pressing the Escape key or activating the close button.\nHäufig gestellte Fragen\nWas sind da Vinci Operationssysteme?\nDie von Intuitive produzierten da Vinci Operationssysteme sind fortschrittliche roboter-assistierte Plattformen, die Operateur:innen dabei unterstützen, die eigenen operativen Möglichkeiten zu erweitern und Patient:innen eine weitere minimalinvasive Option zu bieten. Da Vinci Systeme bieten Operateur:innen eine verbesserte Bildgebung, Abwinkelbarkeit, Präzision und Ergonomie und unterstützen bei der Durchführung minimalinvasiver Eingriffe.\nWarum werden die Systeme da Vinci genannt?\nDer Name „da Vinci“ ist eine Hommage an Leonardo da Vinci, den Erfinder, Maler, Philosophen aus der Renaissance im 15. Jahrhundert. Leonardo da Vinci ist weithin dafür bekannt, das Studium der menschlichen Anatomie vorangetrieben zu haben. Er interessierte sich auch für Mechanik und Automatisierung, was schließlich zur Konstruktion des ersten bekannten Roboters, „Leonardos Roboter“, führte, der um das Jahr 1495 entwickelt wurde.\nBefindet sich der oder die Operierende im Raum?\nDer operierende Arzt bzw. die operierende Ärztin befindet sich an einer Konsole im Operationssaal in unmittelbarer Nähe der Patient:innen und des OP-Teams. Eingriffe aus der Ferne sowie die Telechirurgie sind kein Schwerpunkt der Produktentwicklung von Intuitive.\nWie werden Operateur:innen in RAC ausgebildet?\nIntuitive, Behörden, Krankenhäuser und medizinische Fachgesellschaften spielen eine Rolle im Training von Operateur:innen. Intuitive hat ein Programm entwickelt, das Operateur:innen bei der Entwicklung der Kenntnisse und Fertigkeiten unterstützt, die für den sicheren und effizienten Einsatz der da Vinci Technologie erforderlich sind. Die jeweiligen Krankenhäuser sind für die Festlegung der Trainingsanforderungen und die Zulassung der roboter-assistierten Operateur:innen verantwortlich.\nDie individuellen Ergebnisse können von einer Reihe von Faktoren abhängen, unter anderem von Patientenmerkmalen, Krankheitsmerkmalen und/oder der Erfahrung des Operateurs.\nEinige Produkte, Funktionen oder Technologien sind möglicherweise nicht in allen Ländern verfügbar. Bitte erkundigen Sie sich bei Ihrem zuständigen Intuitive-Ansprechpartner vor Ort nach der Verfügbarkeit der Produkte in Ihrer Region. Angaben zu Indikationen, Kontraindikationen, Warnhinweisen und anderen Produktinformationen finden Sie in der produktspezifischen Gebrauchsanweisung.\nDiese Cookies sind zur Funktion der Website erforderlich und können in Ihren Systemen nicht deaktiviert werden. In der Regel werden diese Cookies nur als Reaktion auf von Ihnen getätigte Aktionen gesetzt, die einer Dienstanforderung entsprechen, wie etwa dem Festlegen Ihrer Datenschutzeinstellungen, dem Anmelden oder dem Ausfüllen von Formularen. Sie können Ihren Browser so einstellen, dass diese Cookies blockiert oder Sie über diese Cookies benachrichtigt werden. Einige Bereiche der Website funktionieren dann aber nicht. Diese Cookies speichern keine personenbezogenen Daten.\nDiese Cookies ermöglichen es uns, Besuche und Verkehrsquellen zu zählen, damit wir die Leistung unserer Website messen und verbessern können. Sie unterstützen uns bei der Beantwortung der Fragen, welche Seiten am beliebtesten sind, welche am wenigsten genutzt werden und wie sich Besucher auf der Website bewegen. Alle von diesen Cookies erfassten Informationen werden aggregiert und sind deshalb anonym. Wenn Sie diese Cookies nicht zulassen, können wir nicht wissen, wann Sie unsere Website besucht haben.\nMit diesen Cookies ist die Website in der Lage, erweiterte Funktionalität und Personalisierung bereitzustellen. Sie können von uns oder von Drittanbietern gesetzt werden, deren Dienste wir auf unseren Seiten verwenden. Wenn Sie diese Cookies nicht zulassen, funktionieren einige oder alle dieser Dienste möglicherweise nicht einwandfrei.\nDiese Cookies können über unsere Website von unseren Werbepartnern gesetzt werden. Sie können von diesen Unternehmen verwendet werden, um ein Profil Ihrer Interessen zu erstellen und Ihnen relevante Anzeigen auf anderen Websites zu zeigen. Sie speichern nicht direkt personenbezogene Daten, basieren jedoch auf einer einzigartigen Identifizierung Ihres Browsers und Internet-Geräts. Wenn Sie diese Cookies nicht zulassen, werden Sie weniger gezielte Werbung erleben."
    },
    {
        "Ticker": "ISRG",
        "Company": "Intuitive Surgical",
        "Source_URL": "https://www.intuitive.com/en-gb/about-us/contact",
        "Content_Type": "Website Content",
        "Raw_Text": "Contact Intuitive\nOur headquarters are in Sunnyvale, California, USA, along with manufacturing, research, and training operations. We have principal offices around the world, marketing products directly in the U.S., Western Europe, and Asia Pacific, and indirectly through distributors in a range of other regions. Additionally, in China we operate through our joint venture, IntuFosun.\nFor general inquiries, call the office in your area and our front desk will direct you to the right contact.\nGet support now. Technicians are available for urgent and non-urgent support. Call for help with services and account management.\nUnited Kingdom\n0800 066 8902 (toll free)\n01865 521 820 (charged as a local call) from 8am to 6pm CET\nsupport.UK@intusurg.com\nEmergency technical support in English is available 365/24/7.\nIreland\n1800 851 011 (toll free)\n019 131 227 (charged as a local call) from 8am to 6pm CET\nsupport.IE@intusurg.com\nEmail European Public Affairs\ndl-europeanpublicaffairs@intusurg.com\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nThese cookies allow us to count visits and traffic sources, so we can measure and improve the performance of our site. They help us know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies, we will not know when you have visited our site.\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third-party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising."
    },
    {
        "Ticker": "ISRG",
        "Company": "Intuitive Surgical",
        "Source_URL": "https://www.intuitive.com/de-de/about-us/company/clinical-evidence",
        "Content_Type": "Website Content",
        "Raw_Text": "Klinische Evidenz\nUnser Engagement für aussagekräftige Evidenz\nDie Wissenschaft hinter evidenzbasierter Versorgung\nIntuitive unterstützt Forschung, die zu hochwertiger, klinischer Evidenz führt. Wir arbeiten mit Klinikern, Krankenhäusern und medizinischen Fachgesellschaften zusammen, um die Vorteile der da Vinci-Technologie aufzuzeigen, ohne dabei die Patient:innen aus den Augen zu verlieren. Die Untersuchungen tragen dazu bei, den Mehrwert der da Vinci-Technologie für Patient:innen, Operateur:innen, Fachgesellschaften und andere wichtige Interessengruppen darzustellen.\nErgebnisse klinischer Evidenz\nEin wichtiges Ziel von Intuitive ist die Durchführung systematischer Literaturübersichten. Die Ergebnisse basieren auf internen, nicht-publizierten Meta-Analysen peer-reviewter Literatur zu roboter-assistierten Eingriffen mit dem da Vinci-Operationssystem von Intuitive. Diese beschreiben den Mehrwert und unterstützen Mediziner:innen, Gesundheitsdienstleister, Kostenträger und politische Entscheidungsträger bei der Aufklärung und der evidenzbasierten Entscheidungsfindung. Eine umfassende Meta-Analyse ist nun verfügbar.\nEvidenz, die den Mehrwert aufzeigt\nWir führen traditionelle klinische Studien durch und nutzen Datenbanken zu Real World Evidence (RWE). Entdecken Sie die aktuelle Evidenz.\nProspektive Studie zum Thema Hernien\nVergleich der frühen Ergebnisse bei der Versorgung von Inguinalhernien (offen, konventionell-laparoskopisch oder roboter-assistiert).\nLobektomie: Analyse Premier-Datenbank\nPublikationen zur vergleichenden Ergebnisforschung für die Lobektomie unter Verwendung der Premier-Datenbank (roboter-assistiert, offen und VATS).\nSigmoidektomie bei Divertikelerkrankung\nPublikation zur vergleichenden Ergebnisforschung von Sigmoidektomien bei Divertikelerkrankungen unter Verwendung der Premier-Datenbank (roboter-assistiert, offen und konventionell-laparoskopisch).\nKollaborative Forschung\nIn Zusammenarbeit mit Operateur:innen, Institutionen und Fachgesellschaften tragen wir dazu bei, das Wissen über die minimalinvasive Versorgung zu erweitern. Die Forschung beinhaltet Studien und Partnerschaften mit Fachgesellschaften.\nANCOR-Studie zur Kolektomie rechts\nEin multizentrischer prospektiver Vergleich von intrakorporalen und extrakorporalen Anastomosen für die minimalinvasive Kolektomie rechts.\nPORTaL-Studie zu Lungenkarzinomen\nMultizentrische retrospektive Studie zur Bewertung der perioperativen Ergebnisse bei roboter-assistierter, VATS- und offener Lobektomie.\nSureForm Stapler-Studie für kolorektale Eingriffe\nEinzentrige Studie zur Bewertung der Leistung der SureForm Stapler (60 und 45) für die Transsektion und/oder Erstellung der Anastomose bei roboter-assistierten kolorektalen Eingriffen.\nKontinuierlich steigende Anzahl an Publikationen\nSeit 1998 sind mehr als 38.000 peer-reviewed Publikationen erschienen, in denen auf unsere Technologien Bezug genommen wird – und die Zahl steigt weiter. Dazu gehören: randomisierte Studien, systematische Übersichten, Real World Evidence Analysen, prospektive und retrospektive Vergleichsstudien sowie präklinische Studien.\nFörderprogramme von Intuitive\nZusätzlich zu unserem Programm für klinische Evidenz verfügt Intuitive über Programme zur Forschungs- und Bildungsunterstützung. Unsere Stipendien unterstützen klinische und technologische Entwicklungen sowie die weitere Forschung auf dem Gebiet der roboter-assistierten Chirurgie.\nErfahren Sie mehr über Förderungen für klinische Studien: Clinical.Affairs.Europe@intusurg.com\nErfahren Sie mehr über Fellowship Programme: https://www.intuitive-foundation.org/fellowships/\nDie individuellen Ergebnisse können von einer Reihe von Faktoren abhängen, unter anderem vonPatientenmerkmalen, Krankheitsmerkmalen und/oder der Erfahrung des Operateurs.\nEinige Produkte, Funktionen oder Technologien sind möglicherweise nicht in allen Ländern verfügbar. Bitte erkundigen Sie sich bei Ihrem zuständigen Intuitive-Ansprechpartner vor Ort nach der Verfügbarkeit der Produkte in Ihrer Region. Angaben zu Indikationen, Kontraindikationen, Warnhinweisen und anderen Produktinformationen finden Sie in der produktspezifischen Gebrauchsanweisung.\nDa Vinci X- & Xi-Operationssysteme, Klammernahtgeräte SureForm 45 und 60\nEs handelt sich um Medizinprodukte, CE 2460. Bitte beachten Sie die Gebrauchsanweisung vor der Anwendung.\nDiese Cookies sind zur Funktion der Website erforderlich und können in Ihren Systemen nicht deaktiviert werden. In der Regel werden diese Cookies nur als Reaktion auf von Ihnen getätigte Aktionen gesetzt, die einer Dienstanforderung entsprechen, wie etwa dem Festlegen Ihrer Datenschutzeinstellungen, dem Anmelden oder dem Ausfüllen von Formularen. Sie können Ihren Browser so einstellen, dass diese Cookies blockiert oder Sie über diese Cookies benachrichtigt werden. Einige Bereiche der Website funktionieren dann aber nicht. Diese Cookies speichern keine personenbezogenen Daten.\nDiese Cookies ermöglichen es uns, Besuche und Verkehrsquellen zu zählen, damit wir die Leistung unserer Website messen und verbessern können. Sie unterstützen uns bei der Beantwortung der Fragen, welche Seiten am beliebtesten sind, welche am wenigsten genutzt werden und wie sich Besucher auf der Website bewegen. Alle von diesen Cookies erfassten Informationen werden aggregiert und sind deshalb anonym. Wenn Sie diese Cookies nicht zulassen, können wir nicht wissen, wann Sie unsere Website besucht haben.\nMit diesen Cookies ist die Website in der Lage, erweiterte Funktionalität und Personalisierung bereitzustellen. Sie können von uns oder von Drittanbietern gesetzt werden, deren Dienste wir auf unseren Seiten verwenden. Wenn Sie diese Cookies nicht zulassen, funktionieren einige oder alle dieser Dienste möglicherweise nicht einwandfrei.\nDiese Cookies können über unsere Website von unseren Werbepartnern gesetzt werden. Sie können von diesen Unternehmen verwendet werden, um ein Profil Ihrer Interessen zu erstellen und Ihnen relevante Anzeigen auf anderen Websites zu zeigen. Sie speichern nicht direkt personenbezogene Daten, basieren jedoch auf einer einzigartigen Identifizierung Ihres Browsers und Internet-Geräts. Wenn Sie diese Cookies nicht zulassen, werden Sie weniger gezielte Werbung erleben."
    },
    {
        "Ticker": "ISRG",
        "Company": "Intuitive Surgical",
        "Source_URL": "https://www.intuitive.com/de-de/about-us/company/financing",
        "Content_Type": "Website Content",
        "Raw_Text": "Flexible Finanzierungsmodelle von Intuitive\nIntuitive bietet individuelle, kosteneffiziente Konzepte für den Erwerb und die Nutzung unserer Operationssysteme. Unsere Finanzierungsmodelle bieten die Individualität und Flexibilität, die Sie benötigen, um mehr Patientinnen und Patienten eine minimalinvasive Versorgung bieten zu können.\nHauseigene Finanzierung\nWir verstehen Ihre Überlegungen hinsichtlich der Kosten der Patientenversorgung. Wir teilen diese Überlegungen und bieten Ihnen durch Direktfinanzierungsoptionen Lösungen im Zusammenhang mit den System-Anschaffungskosten – von Full-Service-Miete über den Kauf bis hin zu nutzungsbasierten Modellen, die Ihre heutigen Anforderungen erfüllen und sich an das künftige Wachstum und die Veränderungen Ihrer Programme anpassen lassen. Dank unserer hauseigenen Finanzierung sind wir flexibel, sodass Sie Ihr da Vinci-Operationssystem ohne die Kosten und Unwägbarkeiten einer Fremdfinanzierung anschaffen können.\nRisikoteilung\nWir übernehmen einen Teil des Risikos, indem wir Möglichkeiten zum Erwerb und zur Nutzung unserer Technologie anbieten. Der am Patientennutzen orientierte Erwerb wird für Krankenhäuser immer wichtiger, weswegen wir unsere Finanzierungsmodelle in Bezug auf Zugang, Nutzung und Programmleistung ständig weiterentwickeln. Wir möchten Ihnen helfen, die Technologie von Intuitive optimal zu nutzen.\nTechnologie-Upgrade-Schutz\nDurch den Technologie-Upgrade-Schutz ermöglichen wir Ihnen den Erwerb unserer aktuellen Systemgeneration.1 Die meisten Kunden, die unsere Finanzierung nutzen, sind in der Lage, ihre Ausstattung mit unseren neuesten Modellen zu standardisieren und zu erweitern.\nFakten zur Finanzierung\n50 % der weltweiten Kunden bevorzugen eine Finanzierung durch Intuitive\nJeder zweite Kunde entscheidet sich für unsere individuelle Finanzierung, um unsere neuesten Technologien im Bereich der roboter-assistierten Chirurgie einsetzen zu können.2\n30 Jahre, 16,9 Millionen Eingriffe, 89.500 trainierte Operateure und Operateurinnen3\nWir wissen, wie wir unsere Kunden bei der Entwicklung von Programmen für die roboter-assistierte Chirurgie unterstützen können.\nUnser Ökosystem unterstützt Sie\nUnsere fachbereichsübergreifende Lösungen für alle Bereiche und Eingriffe werden durch publizierte Ergebnisse und Finanzierungsoptionen unterstützt, um bessere Patientenergebnisse und geringere Gesamtkosten zu ermöglichen.\nUnsere kosteneffizienten Finanzierungslösungen\nWir bieten individuelle, kosteneffiziente und flexible Akquisitionsmodelle, die Krankenhäuser dabei unterstützen, ihre Kapazitäten für die roboter-assistierte Chirurgie zu erweitern.\nFinden Sie heraus, wie die hauseigene Finanzierung von Intuitive Sie dabei unterstützen kann, Ihre Akquisitionsziele mit individuellen Konditionen und flexiblen, kosteneffizienten Optionen zu erreichen.\nHinweise\nDie individuellen Ergebnisse können von einer Reihe von Faktoren abhängen, unter anderem von Patientenmerkmalen, Krankheitsmerkmalen und/oder der Erfahrung des Operateurs.\nEinige Produkte, Funktionen oder Technologien sind möglicherweise nicht in allen Ländern verfügbar. Bitte erkundigen Sie sich bei Ihrem zuständigen Intuitive-Ansprechpartner vor Ort nach der Verfügbarkeit der Produkte in Ihrer Region. Angaben zu Indikationen, Kontraindikationen, Warnhinweisen und anderen Produktinformationen finden Sie in der produktspezifischen Gebrauchsanweisung.\nDa Vinci X & Xi Chirurgiesysteme\nDie Endoskopie-Instrumentensteuerungssysteme von Intuitive Surgical (da Vinci X und da Vinci Xi Chirurgiesysteme) dienen zur Unterstützung bei der präzisen Steuerung der endoskopischen Instrumente von Intuitive Surgical während urologisch-chirurgischer Eingriffe, allgemeiner laparoskopischer Eingriffe, gynäkologischer laparoskopisch-chirurgischer Eingriffe, allgemeiner thorakoskopischer Eingriffe und transoraler otolaryngologisch-chirurgischer Eingriffe, die auf gutartige Tumore und bösartige Tumore der Klasse T1 und T2 beschränkt sind, sowie gutartiger Zungengrundresektionseingriffe. Die Systeme können sowohl für erwachsene Patienten als auch für Kinder verwendet werden (sofern es sich nicht um transorale otolaryngologische chirurgische Verfahren handelt). Sie sollen von erfahrenen Ärzten in einem Operationssaal verwendet werden.\nDie da Vinci X und da Vinci Xi Chirurgiesysteme sind Medizinprodukte der Klasse IIb mit CE-Kennzeichnung (CE 2460) gemäß der europäischen Medizinprodukte-Richtlinie (93/42/EWG), hergestellt von Intuitive Surgical, Inc. Bitte beachten Sie die Gebrauchsanweisung vor der Anwendung.\nDa Vinci SP Chirurgiesystem\nDas da Vinci SP Chirurgiesystem dient der genauen Steuerung des zugehörigen Endoskops und der Instrumente bei minimal-invasiven endoskopischen abdominopelvinen, thoraskokopischen, transoralen otolaryngologischen und Brustchirurgieverfahren. Das System ist für den Einsatz bei Erwachsenen indiziert. Es soll von erfahrenen Ärzten in einemOperationssaal verwendet werden.\nDas da Vinci SP Chirurgiesystem ist ein Medizinprodukt der Klasse IIb mit CE-Kennzeichnung (CE 2460) gemäß der europäischen Medizinprodukte-Verordnung (EU 2017/745), hergestellt von Intuitive Surgical, Inc. Bitte beachten Sie die Gebrauchsanweisung vor der Anwendung.\nDiese Cookies sind zur Funktion der Website erforderlich und können in Ihren Systemen nicht deaktiviert werden. In der Regel werden diese Cookies nur als Reaktion auf von Ihnen getätigte Aktionen gesetzt, die einer Dienstanforderung entsprechen, wie etwa dem Festlegen Ihrer Datenschutzeinstellungen, dem Anmelden oder dem Ausfüllen von Formularen. Sie können Ihren Browser so einstellen, dass diese Cookies blockiert oder Sie über diese Cookies benachrichtigt werden. Einige Bereiche der Website funktionieren dann aber nicht. Diese Cookies speichern keine personenbezogenen Daten.\nDiese Cookies ermöglichen es uns, Besuche und Verkehrsquellen zu zählen, damit wir die Leistung unserer Website messen und verbessern können. Sie unterstützen uns bei der Beantwortung der Fragen, welche Seiten am beliebtesten sind, welche am wenigsten genutzt werden und wie sich Besucher auf der Website bewegen. Alle von diesen Cookies erfassten Informationen werden aggregiert und sind deshalb anonym. Wenn Sie diese Cookies nicht zulassen, können wir nicht wissen, wann Sie unsere Website besucht haben.\nMit diesen Cookies ist die Website in der Lage, erweiterte Funktionalität und Personalisierung bereitzustellen. Sie können von uns oder von Drittanbietern gesetzt werden, deren Dienste wir auf unseren Seiten verwenden. Wenn Sie diese Cookies nicht zulassen, funktionieren einige oder alle dieser Dienste möglicherweise nicht einwandfrei.\nDiese Cookies können über unsere Website von unseren Werbepartnern gesetzt werden. Sie können von diesen Unternehmen verwendet werden, um ein Profil Ihrer Interessen zu erstellen und Ihnen relevante Anzeigen auf anderen Websites zu zeigen. Sie speichern nicht direkt personenbezogene Daten, basieren jedoch auf einer einzigartigen Identifizierung Ihres Browsers und Internet-Geräts. Wenn Sie diese Cookies nicht zulassen, werden Sie weniger gezielte Werbung erleben."
    },
    {
        "Ticker": "ISRG",
        "Company": "Intuitive Surgical",
        "Source_URL": "https://www.intuitive.com/de-de/about-us/company/future-vision",
        "Content_Type": "Website Content",
        "Raw_Text": "Die Zukunft ist Intuitive\nFür Krankenhäuser, Versorgungsteams und ihre Patientinnen und Patienten stellen wir uns eine vernetztere, individuellere und intelligentere Zukunft vor. Sehen Sie sich an, wie diese Zukunft aussehen kann.\nThis is a modal window.\nBeginning of dialog window. Escape will cancel and close the window.\nEnd of dialog window.\nThis is a modal window. This modal can be closed by pressing the Escape key or activating the close button.\nInnovationen für heute und morgen\nDie meisten Gesundheitssysteme möchten erreichen, dass die Behandlungsergebnisse verbessert werden, gleichzeitig die Gesamtversorgungskosten gesenkt werden und die Patientinnen und Patienten, aber auch die Versorgungsteams, positive Erfahrungen machen. Unser Video zeigt, wie sich die Gesundheitsversorgung weiterentwickeln kann, um diesen Anforderungen gerecht zu werden. Wir bei Intuitive bieten auch heute schon Lösungen an, die die Versorgung verbessern - vom Operationssaal bis zur Verwaltungsetage.\nProduktinformation\nDa Vinci X- & Xi-Chirurgiesysteme\nDie Endoskopie-Instrumentensteuerungssysteme von Intuitive Surgical (da Vinci X- und da Vinci Xi-Chirurgiesysteme) dienen zur Unterstützung bei der präzisen Steuerung der endoskopischen Instrumente von Intuitive Surgical während urologisch-chirurgischer Eingriffe, allgemeiner laparoskopischer Eingriffe, gynäkologischer laparoskopisch-chirurgischer Eingriffe, allgemeiner thorakoskopischer Eingriffe und transoraler otolaryngologisch-chirurgischer Eingriffe, die auf gutartige Tumore und bösartige Tumore der Klasse T1 und T2 beschränkt sind, sowie gutartiger Zungengrundresektionseingriffe. Die Systeme können sowohl für erwachsene Patienten als auch für Kinder verwendet werden (sofern es sich nicht um transorale otolaryngologische chirurgische Verfahren handelt). Sie sollen von erfahrenen Ärzten in einem Operationssaal verwendet werden.\nDie da Vinci X- und da Vinci Xi-Chirurgiesysteme sind Medizinprodukte der Klasse IIb mit CE-Kennzeichnung (CE 2460) gemäß der europäischen Medizinprodukte-Richtlinie (93/42/EWG), hergestellt von Intuitive Surgical, Inc. Bitte beachten Sie die Gebrauchsanweisung vor der Anwendung.\nIon-Endoluminalsystem\nDas Ion Endoluminalsystem unterstützt den Anwender bei der Navigation eines Katheters und endoskopischer Instrumente im Lungentrakt unter Verwendung der endoskopischen Visualisierung des Tracheobronchialbaums für diagnostische und therapeutische Prozeduren. Das Ion-Endoluminalsystem ermöglicht die Platzierung von Fiducial Markern. Es stellt keine Diagnose und ist nicht für die Pädiatrie geeignet. Die Flexision Biopsienadel wird zusammen mit dem Ion Endoluminalsystem zur Biopsie von Gewebe aus einem Zielbereich in der Lunge verwendet. Die PlanPoint Software erstellt anhand von CT Scans des Patienten einen 3D Plan der Lunge und der Navigationswege für die Verwendung mit dem Ion-Endoluminalsystem.\nDas Ion-Endoluminalsystem, die Flexision Biopsienadel und die PlanPoint Software sind Medizinprodukte der Klasse IIa mit CE Kennzeichnung (CE 2460) gemäß der europäischen Medizinprodukteverordnung (EU 2017/745), hergestellt von Intuitive Surgical, Inc. Bitte beachten Sie die Gebrauchsanweisung vor der Anwendung.\nRechtliche Hinweise\nDie individuellen Ergebnisse können von einer Reihe von Faktoren abhängen, unter anderem von Patientenmerkmalen, Krankheitsmerkmalen und/oder der Erfahrung des Operateurs.\nEinige Produkte, Funktionen oder Technologien sind möglicherweise nicht in allen Ländern verfügbar. Bitte erkundigen Sie sich bei Ihrem zuständigen Intuitive-Ansprechpartner vor Ort nach der Verfügbarkeit der Produkte in Ihrer Region. Angaben zu Indikationen, Kontraindikationen, Warnhinweisen und anderen Produktinformationen finden Sie in der produktspezifischen Gebrauchsanweisung.\nDie in dieser Seite enthaltenen Informationen wurden mit größter Sorgfalt geprüft und zusammengestellt. Für deren Richtigkeit, Vollständigkeit und Aktualität wird jedoch keine Gewähr übernommen. Allein der Empfänger ist dafür verantwortlich, alle Informationen zu prüfen, bevor er diese im individuellen Fall anwendet.\nDiese Cookies sind zur Funktion der Website erforderlich und können in Ihren Systemen nicht deaktiviert werden. In der Regel werden diese Cookies nur als Reaktion auf von Ihnen getätigte Aktionen gesetzt, die einer Dienstanforderung entsprechen, wie etwa dem Festlegen Ihrer Datenschutzeinstellungen, dem Anmelden oder dem Ausfüllen von Formularen. Sie können Ihren Browser so einstellen, dass diese Cookies blockiert oder Sie über diese Cookies benachrichtigt werden. Einige Bereiche der Website funktionieren dann aber nicht. Diese Cookies speichern keine personenbezogenen Daten.\nDiese Cookies ermöglichen es uns, Besuche und Verkehrsquellen zu zählen, damit wir die Leistung unserer Website messen und verbessern können. Sie unterstützen uns bei der Beantwortung der Fragen, welche Seiten am beliebtesten sind, welche am wenigsten genutzt werden und wie sich Besucher auf der Website bewegen. Alle von diesen Cookies erfassten Informationen werden aggregiert und sind deshalb anonym. Wenn Sie diese Cookies nicht zulassen, können wir nicht wissen, wann Sie unsere Website besucht haben.\nMit diesen Cookies ist die Website in der Lage, erweiterte Funktionalität und Personalisierung bereitzustellen. Sie können von uns oder von Drittanbietern gesetzt werden, deren Dienste wir auf unseren Seiten verwenden. Wenn Sie diese Cookies nicht zulassen, funktionieren einige oder alle dieser Dienste möglicherweise nicht einwandfrei.\nDiese Cookies können über unsere Website von unseren Werbepartnern gesetzt werden. Sie können von diesen Unternehmen verwendet werden, um ein Profil Ihrer Interessen zu erstellen und Ihnen relevante Anzeigen auf anderen Websites zu zeigen. Sie speichern nicht direkt personenbezogene Daten, basieren jedoch auf einer einzigartigen Identifizierung Ihres Browsers und Internet-Geräts. Wenn Sie diese Cookies nicht zulassen, werden Sie weniger gezielte Werbung erleben."
    },
    {
        "Ticker": "ISRG",
        "Company": "Intuitive Surgical",
        "Source_URL": "https://www.intuitive.com/de-de/about-us/company/history",
        "Content_Type": "Website Content",
        "Raw_Text": "Seit 1995 setzt sich Intuitive für den Fortschritt in der minimalinvasiven Versorgung ein – mit dem Ziel, Ärztinnen und Ärzten dabei zu helfen, das Leben von Menschen auf der ganzen Welt zu verbessern. Auch in Zukunft werden wir weiterhin minimalinvasive roboter-assistierte Lösungen für die Chirurgie und Bronchoskopie entwickeln, die dazu beitragen, die Ziele der OP-Teams zu erreichen: eine bessere Patientenversorgung, höhere Effizienz und einen verbesserten Zugang zu hochwertiger Gesundheitsversorgung.\n1999\nMarkteinführung des ersten da Vinci Operationssystems in Europa\n5\nGenerationen der da Vinci Operationssysteme\n2024\nMarkteinführung des da Vinci Single-Port Systems in Europa\n2025\nMarkteinführung des da Vinci 5 Systems in Europa\nVom Prototyp zur ersten Installation. Die Geschichte von Intuitive beginnt 1995, als kluge Köpfe mit einer gemeinsamen Vision und dem Willen, etwas Neues zu schaffen, dazu beitragen, die Chirurgie zu verändern.\n1999 haben wir das erste da Vinci Operationssystem in Europa auf den Markt gebracht. In den Händen erfahrener Operateur:innen fand unser minimalinvasives Operationssystem Anwendung – beispielsweise in der Urologie – und erweiterte damit schnell die Möglichkeiten der roboter-assistierten Chirurgie.\n2005–2013\nInternationalisierung. Unsere Technologie erreicht die globale Bühne mit Zulassungen in neuen Ländern und einer wachsenden Präsenz weltweit. Im Jahr 2006 führten wir unser da Vinci S Operationssystem der zweiten Generation in den Vereinigten Staaten ein.\nVon 2009 bis 2013 erlebten wir rasante Innovationen bei unseren Instrumenten und Zubehörteilen, Services und der Einführung von da Vinci Si – unserem System der dritten Generation, das entwickelt wurde, um die Weiterbildung und die allgemeine Erfahrung der Operateur:innen zu verbessern.\n2014–2024\nSteigende Akzeptanz. Das Tempo erhöht sich mit neuen Produkten, kontinuierlicher Kundenakzeptanz und einem wachsenden Team globaler Mitarbeiter:innen, die sich unserer Mission verschrieben haben. Die Technologie wurde immer besser, als Operateur:innen unsere Systeme der vierten Generation einsetzten: da Vinci X, da Vinci Xi und unser erstes Single-Port-System – da Vinci SP. Unser Horizont erweiterte sich 2023 über die Chirurgie hinaus. Das Ion Endoluminalsystem, ein roboter-assistiertes Bronchoskopiesystem, das die Biopsie verdächtiger Lungenknoten verbessern und Pulmolog:innen helfen soll, Lungenkrebs früher zu erkennen, erhielt die CE-Kennzeichnung.\n2025\nChirurgie, transformiert. Das Vinci 5 Operationssystem – so fortschrittlich und integriert wie niemals zuvor – wird auf den Markt eingeführt. Aufbauend auf früherer da Vinci Systeme, bietet da Vinci 5 eine verbesserte Ergonomie¹ und eine mehr als 10.000-fach höhere Rechenleistung². Mit Blick auf die Zukunft bleibt unser Ziel dasselbe: Wir möchten die Kundenerfahrung tiefgreifend verstehen, das gesamte Ökosystem im OP verbessern und die Möglichkeiten von Ärzt:innen erweitern, ohne Einschränkungen zu heilen.\n1. Im Vergleich zu den da Vinci X, Xi und SP Systemen. Daten liegen Intuitive vor.\n2. Im Vergleich zu da Vinci Xi. Daten liegen Intuitive vor.\nHinweise\nDie individuellen Ergebnisse können von einer Reihe von Faktoren abhängen, unter anderem von Patientenmerkmalen, Krankheitsmerkmalen und/oder der Erfahrung des Operateurs.\nEinige Produkte, Funktionen oder Technologien sind möglicherweise nicht in allen Ländern verfügbar. Bitte erkundigen Sie sich bei Ihrem zuständigen Intuitive-Ansprechpartner vor Ort nach der Verfügbarkeit der Produkte in Ihrer Region. Angaben zu Indikationen, Kontraindikationen, Warnhinweisen und anderen Produktinformationen finden Sie in der produktspezifischen Gebrauchsanweisung.\nDa Vinci 5 Chirurgiesystem\nDas da Vinci 5 Chirurgiesystem dient zur Unterstützung bei der präzisen Steuerung von da Vinci Endoskopen und Instrumenten während minimalinvasiven endoskopischen urologisch-chirurgischen Eingriffen, gynäkologisch-chirurgischen Eingriffen, allgemeinen laparoskopisch-chirurgischen Eingriffen und thorakoskopisch-chirurgischen Eingriffen.\nDas System kann sowohl für erwachsene Patienten als auch für Kinder verwendet werden. Es soll von erfahrenen Ärzten in einem Operationssaal verwendet werden.\nDas da Vinci 5 Chirurgiesystem ist ein Medizinprodukt der Klasse IIb mit CE-Kennzeichnung (CE 2460) gemäß der europäischen Medizinprodukteverordnung (EU 2017/745), hergestellt von Intuitive Surgical, Inc. Bitte beachten Sie die Gebrauchsanweisung vor der Anwendung.\nDa Vinci X & Xi Chirurgiesysteme\nDie Endoskopie-Instrumentensteuerungssysteme von Intuitive Surgical (da Vinci X und da Vinci Xi Chirurgiesysteme) dienen zur Unterstützung bei der präzisen Steuerung der endoskopischen Instrumente von Intuitive Surgical während urologisch-chirurgischer Eingriffe, allgemeiner laparoskopischer Eingriffe, gynäkologischer laparoskopisch-chirurgischer Eingriffe, allgemeiner thorakoskopischer Eingriffe und transoraler otolaryngologisch-chirurgischer Eingriffe, die auf gutartige Tumore und bösartige Tumore der Klasse T1 und T2 beschränkt sind, sowie gutartiger Zungengrundresektionseingriffe. Die Systeme können sowohl für erwachsene Patienten als auch für Kinder verwendet werden (sofern es sich nicht um transorale otolaryngologische chirurgische Verfahren handelt). Sie sollen von erfahrenen Ärzten in einem Operationssaal verwendet werden.\nDie da Vinci X und da Vinci Xi Chirurgiesysteme sind Medizinprodukte der Klasse IIb mit CE-Kennzeichnung (CE 2460) gemäß der europäischen Medizinprodukte-Richtlinie (93/42/EWG), hergestellt von Intuitive Surgical, Inc. Bitte beachten Sie die Gebrauchsanweisung vor der Anwendung.\nDa Vinci SP Chirurgiesystem\nDas da Vinci SP Chirurgiesystem dient der genauen Steuerung des zugehörigen Endoskops und der Instrumente bei minimal-invasiven endoskopischen abdominopelvinen, thoraskokopischen, transoralen otolaryngologischen und Brustchirurgieverfahren. Das System ist für den Einsatz bei Erwachsenen indiziert. Es soll von erfahrenen Ärzten in einem Operationssaal verwendet werden.\nDas da Vinci SP Chirurgiesystem ist ein Medizinprodukt der Klasse IIb mit CE-Kennzeichnung (CE 2460) gemäß der europäischen Medizinprodukte-Verordnung (EU 2017/745), hergestellt von Intuitive Surgical, Inc. Bitte beachten Sie die Gebrauchsanweisung vor der Anwendung.\nIon Endoluminalsystem\nDas Ion Endoluminalsystem unterstützt den Anwender bei der Navigation eines Katheters\nund endoskopischer Instrumente im Lungentrakt unter Verwendung der endoskopischen Visualisierung des Tracheobronchialbaums für diagnostische und therapeutische Prozeduren. Das Ion-Endoluminalsystem ermöglicht die Platzierung von Fiducial Markern. Es stellt keine Diagnose und ist nicht für die Pädiatrie geeignet.\nDie Flexision Biopsienadel wird zusammen mit dem Ion Endoluminalsystem zur Biopsie\nvon Gewebe aus einem Zielbereich in der Lunge verwendet. Die PlanPoint\nSoftware erstellt anhand von CT Scans des Patienten einen 3D Plan der Lunge und der Navigationswege für die Verwendung mit dem Ion-Endoluminalsystem\nDas Ion Endoluminalsystem, die Flexision Biopsienadel und die PlanPoint Software sind\nMedizinprodukte der Klasse IIa mit CE Kennzeichnung (CE 2460) gemäß der europäischen Medizinprodukteverordnung (EU 2017/745), hergestellt von Intuitive Surgical, Inc. Bitte beachten Sie die Gebrauchsanweisung vor der Anwendung.\nDiese Cookies sind zur Funktion der Website erforderlich und können in Ihren Systemen nicht deaktiviert werden. In der Regel werden diese Cookies nur als Reaktion auf von Ihnen getätigte Aktionen gesetzt, die einer Dienstanforderung entsprechen, wie etwa dem Festlegen Ihrer Datenschutzeinstellungen, dem Anmelden oder dem Ausfüllen von Formularen. Sie können Ihren Browser so einstellen, dass diese Cookies blockiert oder Sie über diese Cookies benachrichtigt werden. Einige Bereiche der Website funktionieren dann aber nicht. Diese Cookies speichern keine personenbezogenen Daten.\nDiese Cookies ermöglichen es uns, Besuche und Verkehrsquellen zu zählen, damit wir die Leistung unserer Website messen und verbessern können. Sie unterstützen uns bei der Beantwortung der Fragen, welche Seiten am beliebtesten sind, welche am wenigsten genutzt werden und wie sich Besucher auf der Website bewegen. Alle von diesen Cookies erfassten Informationen werden aggregiert und sind deshalb anonym. Wenn Sie diese Cookies nicht zulassen, können wir nicht wissen, wann Sie unsere Website besucht haben.\nMit diesen Cookies ist die Website in der Lage, erweiterte Funktionalität und Personalisierung bereitzustellen. Sie können von uns oder von Drittanbietern gesetzt werden, deren Dienste wir auf unseren Seiten verwenden. Wenn Sie diese Cookies nicht zulassen, funktionieren einige oder alle dieser Dienste möglicherweise nicht einwandfrei.\nDiese Cookies können über unsere Website von unseren Werbepartnern gesetzt werden. Sie können von diesen Unternehmen verwendet werden, um ein Profil Ihrer Interessen zu erstellen und Ihnen relevante Anzeigen auf anderen Websites zu zeigen. Sie speichern nicht direkt personenbezogene Daten, basieren jedoch auf einer einzigartigen Identifizierung Ihres Browsers und Internet-Geräts. Wenn Sie diese Cookies nicht zulassen, werden Sie weniger gezielte Werbung erleben."
    },
    {
        "Ticker": "ISRG",
        "Company": "Intuitive Surgical",
        "Source_URL": "https://www.intuitive.com/de-de/about-us/newsroom/success-story-eisenach",
        "Content_Type": "Website Content",
        "Raw_Text": "St. Georg Klinikum Eisenach implementiert roboter-assistierte Chirurgie für eine hochspezialisierte Versorgung in der Region\nDer Zugang zu hochspezialisierter chirurgischer Versorgung ist außerhalb von Ballungszentren oft begrenzt. Lange Anfahrtswege, eingeschränkte Wahlmöglichkeiten und personelle Engpässe prägen vielerorts die Realität. Das St. Georg Klinikum Eisenach geht einen strategisch klaren Weg, um dieser Entwicklung entgegenzuwirken – mit roboter-assistierter Chirurgie. Die Klinik hat sich frühzeitig und bewusst für den Einsatz der da Vinci Systeme entschieden, um Patientinnen und Patienten in der Region eine Versorgung auf hohem Niveau zu ermöglichen – wohnortnah, präzise und zukunftsgerichtet. „Wir wollten am St. Georg Klinikum Maßstäbe für ganz Thüringen setzen und die roboter-assistierte Chirurgie mitgestalten“, betont Dr. Dr. Markus Mille, Chefarzt für der Klinik für Allgemein-, Viszeral-, Gefäß- und Thoraxchirurgie und Leiter des interdisziplinären Zentrums für roboter-assistierte Chirurgie in Eisenach.\nMenschen in strukturschwachen Regionen erhalten Zugang zu OP-Verfahren mit einem roboter-assistierten Credo. „Wir leisten damit einen wichtigen Beitrag zur Etablierung medizinischer Versorgungsstandards und Versorgungsgerechtigkeit in Thüringen, sodass jede und jeder Zugang zu einer bestmöglichen Behandlung hat. Wir bieten hochspezialisierte Behandlung außerhalb von universitären Strukturen“, bekräftigt Mille.\nTechnologie für bessere operative Ergebnisse\n„Wir haben uns für die roboter-assistierte Chirurgie entschieden, weil sie klinisch nachweisbare Vorteile bietet – für unsere Patientinnen und Patienten. Sie bringt aber auch Vorteile für unsere Teams im OP und für die Klinik an sich“, erklärt Mille. „Zudem glauben wir, dass die Implementierung von Innovationen in Kliniken Beachtung bei der Vergabe von Leistungsgruppen in der Viszeralchirurgie eine besondere Rolle spielen wird. Daher ist es wichtig, für die Zukunft aufgestellt zu sein“, so Mille.\nAufgrund der guten Erfahrungen mit roboter-assistierter Chirurgie wurde das Robotik Programm in Eisenach erweitert und neben dem da Vinci Xi System kommen inzwischen auch ein da Vinci X sowie ein Single-Port System zum Einsatz. Letzteres ermöglicht minimalinvasive Eingriffe über einen einzigen Zugang und kann so das Risiko postoperativer Komplikationen wie etwa Infektionen oder Wundheilungsstörungen senken.\nGezielte Integration in die Versorgungspfade\nAm St. Georg Klinikum ist die roboter-assistierte Chirurgie kein add-on, sondern integraler Bestandteil eines langfristig angelegten Versorgungskonzepts. „Wir haben die Systeme nicht angeschafft, um einen Trend mitzugehen. Sie sind Teil einer übergeordneten Strategie zur Qualitäts- und Effizienzsteigerung in unseren chirurgischen Versorgungsprozessen“, so Mille. Eingriffe wie Darmkrebs-Operationen, Bauchspeicheldrüseneingriffe, Magen- und Leberresektionen aber auch Cholezystektomien sowie Hernienoperationen erfolgen heute standardisiert mit roboter-assistierter Unterstützung – immer dort, wo es medizinisch und ökonomisch sinnvoll ist. Im St. Georg Klinikum in Eisenach werden ca. 90 Prozent aller Darmkrebs-Operationen mit dem da Vinci Operationssystem durchgeführt.\nDas Ergebnis: Patientinnen und Patienten können nach einer Darmkrebs-OP durchschnittlich nach 5 - 6 Tagen entlassen werden – rund 40 % schneller als im Bundesdurchschnitt. Gleichzeitig beobachtet das Team eine Reduktion der Schmerzmittelgabe sowie kurze oder gar keine Aufenthalte auf der Intensivstation.\nNeben der unmittelbaren klinischen Anwendung legt das Klinikum Wert auf nachhaltigen Kompetenzaufbau im eigenen Haus. „Wir bilden gezielt unser gesamtes chirurgisches Team – auch im ärztlichen Nachwuchs – in der roboter-assistierten Chirurgie aus. So sichern wir den Wissenstransfer und erhöhen die Attraktivität des Standorts“, erklärt Mille. Die roboter-assistierte Chirurgie dient dabei nicht nur als Innovationsmotor, sondern auch als Antwort auf den zunehmenden Fachkräftemangel: „Gerade junge Ärztinnen und Ärzte erwarten heute moderne Arbeitsbedingungen und technologischen Zugang.“\nInterdisziplinär, vernetzt, patientenzentriert – Krebszentren als Goldstandard\nAls zertifiziertes Darmkrebszentrum ist das Klinikum interdisziplinär aufgestellt. Chirurgie, Onkologie, Gastroenterologie, Radiologie, Pflege und Psychoonkologie arbeiten eng verzahnt, denn die Diagnose Krebs betrifft nicht nur den Körper – sie beeinflusst das ganze Leben: Beruf, Partnerschaft, Familie, Selbstbild und Zukunftsplanung. Psychoonkologinnen und -onkologen können dabei helfen, mit Ängsten und Unsicherheiten umzugehen, neue Perspektiven zu entwickeln und wieder Vertrauen in den eigenen Körper zu fassen. Für viele Betroffene ist dieses Angebot ein Anker in einer sehr schwierigen Zeit. Dies geht auch an Dr. Dr. Mille nicht spurlos vorbei: „Es sind die Einzelschicksale, die mich bewegen“, sagt er. „Es gibt Patientinnen und Patienten, die mich über Jahre begleiten – mit ihrem Mut, ihrer Geschichte, manchmal auch mit ihrem Leid. Viele von ihnen vergesse ich nie. Sie erinnern mich täglich daran, warum ich diesen Beruf mache und ihn auch so liebe.“\nDas Ziel ist immer eine individuell abgestimmte Behandlung, die sich an wissenschaftlichen Leitlinien orientiert – und gleichzeitig die persönliche Situation der Patientinnen und Patienten berücksichtigt. „In einem zertifizierten Zentrum können wir sicherstellen, dass alle relevanten Fachbereiche von Anfang an eingebunden sind“, erklärt Dr. Dr. Mille. „Innovative Technologie kann uns hier unterstützen, den Patientinnen und Patienten die bestmögliche Behandlung zu ermöglichen. Die roboter-assistierte Chirurgie ist daher für uns kein Selbstzweck“, resümiert Mille. „Sie ist ein Werkzeug, das uns hilft, chirurgische Versorgung intelligenter, präziser und gerechter zu gestalten – heute und mit Blick auf die kommenden Jahre – für unsere Patientinnen und Patienten. Das St. Georg Klinikum in Eisenach hat sich als medizinischer Vorreiter etabliert: Mit dem Einsatz von drei roboter-assistierten Systemen setzt das Klinikum neue Maßstäbe in der Viszeralchirurgie und zeigt eindrucksvoll, wie Hightech-Medizin auch abseits urbaner Zentren zukunftsweisend gestaltet werden kann.\nDie individuellen Ergebnisse können von einer Reihe von Faktoren abhängen, unter anderem von Patientenmerkmalen, Krankheitsmerkmalen und/oder der Erfahrung des Operateurs.\nEinige Produkte, Funktionen oder Technologien sind möglicherweise nicht in allen Ländern verfügbar. Bitte erkundigen Sie sich bei Ihrem zuständigen Intuitive-Ansprechpartner vor Ort nach der Verfügbarkeit der Produkte in Ihrer Region. Angaben zu Indikationen, Kontraindikationen, Warnhinweisen und anderen Produktinformationen finden Sie in der produktspezifischen Gebrauchsanweisung.\nDa Vinci X & Xi Chirurgiesysteme\nDie Endoskopie-Instrumentensteuerungssysteme von Intuitive Surgical (da Vinci X und da Vinci Xi Chirurgiesysteme) dienen zur Unterstützung bei der präzisen Steuerung der endoskopischen Instrumente von Intuitive Surgical während urologisch-chirurgischer Eingriffe, allgemeiner laparoskopischer Eingriffe, gynäkologischer laparoskopisch-chirurgischer Eingriffe, allgemeiner thorakoskopischer Eingriffe und transoraler otolaryngologisch-chirurgischer Eingriffe, die auf gutartige Tumore und bösartige Tumore der Klasse T1 und T2 beschränkt sind, sowie gutartiger Zungengrundresektionseingriffe. Die Systeme können sowohl für erwachsene Patienten als auch für Kinder verwendet werden (sofern es sich nicht um transorale otolaryngologische chirurgische Verfahren handelt). Sie sollen von erfahrenen Ärzten in einem Operationssaal verwendet werden.\nDie da Vinci X und da Vinci Xi Chirurgiesysteme sind Medizinprodukte der Klasse IIb mit CE-Kennzeichnung (CE 2460) gemäß der europäischen Medizinprodukte-Richtlinie (93/42/EWG), hergestellt von Intuitive Surgical, Inc. Bitte beachten Sie die Gebrauchsanweisung vor der Anwendung.\nDa Vinci SP Chirurgiesystem\nDas da Vinci SP Chirurgiesystem dient der genauen Steuerung des zugehörigen Endoskops und der Instrumente bei minimal-invasiven endoskopischen abdominopelvinen, thoraskokopischen, transoralen otolaryngologischen und Brustchirurgieverfahren. Das System ist für den Einsatz bei Erwachsenen indiziert. Es soll von erfahrenen Ärzten in einem Operationssaal verwendet werden.\nDas da Vinci SP Chirurgiesystem ist ein Medizinprodukt der Klasse IIb mit CE-Kennzeichnung (CE 2460) gemäß der europäischen Medizinprodukte-Verordnung (EU 2017/745), hergestellt von Intuitive Surgical, Inc. Bitte beachten Sie die Gebrauchsanweisung vor der Anwendung.\nDiese Cookies sind zur Funktion der Website erforderlich und können in Ihren Systemen nicht deaktiviert werden. In der Regel werden diese Cookies nur als Reaktion auf von Ihnen getätigte Aktionen gesetzt, die einer Dienstanforderung entsprechen, wie etwa dem Festlegen Ihrer Datenschutzeinstellungen, dem Anmelden oder dem Ausfüllen von Formularen. Sie können Ihren Browser so einstellen, dass diese Cookies blockiert oder Sie über diese Cookies benachrichtigt werden. Einige Bereiche der Website funktionieren dann aber nicht. Diese Cookies speichern keine personenbezogenen Daten.\nDiese Cookies ermöglichen es uns, Besuche und Verkehrsquellen zu zählen, damit wir die Leistung unserer Website messen und verbessern können. Sie unterstützen uns bei der Beantwortung der Fragen, welche Seiten am beliebtesten sind, welche am wenigsten genutzt werden und wie sich Besucher auf der Website bewegen. Alle von diesen Cookies erfassten Informationen werden aggregiert und sind deshalb anonym. Wenn Sie diese Cookies nicht zulassen, können wir nicht wissen, wann Sie unsere Website besucht haben.\nMit diesen Cookies ist die Website in der Lage, erweiterte Funktionalität und Personalisierung bereitzustellen. Sie können von uns oder von Drittanbietern gesetzt werden, deren Dienste wir auf unseren Seiten verwenden. Wenn Sie diese Cookies nicht zulassen, funktionieren einige oder alle dieser Dienste möglicherweise nicht einwandfrei.\nDiese Cookies können über unsere Website von unseren Werbepartnern gesetzt werden. Sie können von diesen Unternehmen verwendet werden, um ein Profil Ihrer Interessen zu erstellen und Ihnen relevante Anzeigen auf anderen Websites zu zeigen. Sie speichern nicht direkt personenbezogene Daten, basieren jedoch auf einer einzigartigen Identifizierung Ihres Browsers und Internet-Geräts. Wenn Sie diese Cookies nicht zulassen, werden Sie weniger gezielte Werbung erleben."
    },
    {
        "Ticker": "ISRG",
        "Company": "Intuitive Surgical",
        "Source_URL": "https://www.intuitive.com/de-de/about-us/newsroom/ROI-Tool",
        "Content_Type": "Website Content",
        "Raw_Text": "Intuitive erhält DVKC-Siegel für sein IT-gestütztes Controlling-Instrument\nDas innovative Return-on-Investment (ROI)-Tool von Intuitive Deutschland soll Kliniken bei der Entscheidung für die Investition in ein da Vinci Operationssystem unterstützen, indem es die potenzielle finanzielle Entwicklung simuliert. Den Deutschen Verein für Krankenhaus-Controlling e.V. (DVKC) hat das Tool überzeugt, sodass Intuitive das zum ersten Mal überhaupt vergebene Siegel „IT-gestütztes Controlling-Tool“ erhalten hat.\nInvestition in ein da Vinci Operationssystem: Chance deutlich sehen\nAktuell sind mehr als 340 da Vinci Operationssysteme in medizinischen Versorgungszentren in Deutschland im Einsatz. Die Anschaffung eines da Vinci Systems ist für einige Kliniken jedoch mit Herausforderungen verbunden – dazu zählen Unklarheiten bezüglich Finanzierung. Kliniken möchten wissen, ob die Anschaffungs- und Betriebskosten tragbar sind und sich die Nutzung des Operationssystems für ihre Klinik langfristig rentieren wird. Um Kliniken bei der Investitions-Entscheidung transparent zu unterstützen, hat Intuitive ein Instrument entwickelt – das Return-on-Investment (ROI)-Tool.\nWie funktioniert das ROI-Tool?\nDas Return-on-Investment-Tool ist ein Excel-basiertes Instrument, das die potenzielle finanzielle Entwicklung bei der Investition in ein da Vinci Operationssystem simuliert. Es basiert auf einem klinischen roboter-assistierten Programm, das die individuellen Krankenhausdaten nutzt und auf die verschiedenen Fachabteilungen sowie die zugelassenen Eingriffe des da Vinci Operationssystems abgestimmt ist, die die Klinik anbieten möchte.\nDr. med. Martin Winter\nDirector Market Access Hospital Economics & Custom Analytics DACH\nUnser Tool vergleicht die Fixkosten, laufenden Kosten sowie die absoluten Gegenfinanzierungsanteile aus den Diagnosis Related Groups (DRG) mit den relativen Refinanzierungsanteilen, insbesondere in den Bereichen Normalstation und Intensivpflege. Diese Analyse ermöglicht es uns, die ökonomischen Vorteile eines da Vinci Operationssystems aufzuzeigen, die potenziell eine verkürzte Liegedauer, weniger Komplikationen und Bluttransfusionen, eine geringere Auslastung der Intensivstationen sowie einen reduzierten Bedarf an Personal umfassen können.\nDurch die Anwendung des Return-on-Investment-Tools können Investitionen in ein da Vinci Operationssystem schneller umgesetzt werden, da die Entscheidungsfindung deutlich weniger Verzögerungen unterliegt, die zuvor durch Bedenken hinsichtlich der ökonomischen Skalierbarkeit des Werteversprechens der roboter-assistierten Chirurgie verursacht wurden. Die Ergebnisse des Analyse-Tools bestätigen: eine individuell auf den eigenen Standort bezogene Simulation ist eine sinnvolle und hilfreiche Unterstützung im Entscheidungsprozess für die Anschaffung des roboter-assistierten Operationssystems. Bereits über 40 Kliniken haben eine Analyse mit dem ROI-Tool durchführen lassen und aufgrund der Analyse eine realistische und bessere Sichtbarkeit für die Investition in ein da Vinci Operationssystem erhalten.\nZertifizierte Innovation\nDer Deutsche Verein für Krankenhaus-Controlling e.V. (DVKC), der aus renommierten Krankenhauscontrollern und Wirtschaftswissenschaftlern, die in Krankenhäusern und Hochschulen tätig sind, besteht, entwickelt regelmäßig wissenschaftlich fundierte Standards für das Krankenhaus-Controlling und führt Studien durch. In diesem Jahr hat der DVKC im Rahmen seines Fachkongresses erstmalig ein „IT-gestütztes Controlling-Tool“ ausgezeichnet – das Siegel und Zertifikat ging an das innovative ROI-Tool von Intuitive Deutschland. Der DVKC zertifiziert Lösungen oder Werkzeuge, die Controller und Führungskräfte in Krankenhäusern bei ihrer Arbeit fundiert unterstützen. Mit dem DVKC-IT-Siegel zeichnet der Verband Softwarelösungen aus, die besonders hohe Qualitätsstandards erfüllen und einen nachweisbaren Nutzen für das Controlling in Gesundheitseinrichtungen bieten. Die Bewertung erfolgt durch unabhängige Experten, die anhand von klar definierten Kriterien eine fundierte Einschätzung abgeben. Besonders hervorgehoben wurden die klare Zielsetzung, die benutzerfreundliche Oberfläche und die umfassenden Funktionen des Tools von Intuitive.\nTim Heisterkamp\nRegional Director Vertrieb DACH und Geschäftsführer\nDie Auszeichnung bestätigt, dass unser ROI-Tool den hohen Anforderungen des DVKC in den Bereichen Transparenz, Funktionalität, Datensicherheit und Innovationspotenzial entspricht. Die unabhängige Expertenbewertung ergab, dass unsere Software eine wertvolle Unterstützung für Krankenhäuser und andere Einrichtungen im Gesundheitswesen bietet.\nDas Return-on-Investment (ROI)-Tool zeigt eindrucksvoll, wie Softwarelösungen Krankenhäuser und andere Gesundheitsorganisationen bei einer effizienten Steuerung unterstützen und die Kommunikation innerhalb der Einrichtungen verbessern können.\nWenn Sie nähere Details zum ROI-Tool von Intuitive Deutschland erfahren möchten, freuen wir uns über Ihre Kontaktaufnahme.\nDie individuellen Ergebnisse können von einer Reihe von Faktoren abhängen, unter anderem von Patientenmerkmalen, Krankheitsmerkmalen und/oder der Erfahrung des Operateurs.\nEinige Produkte, Funktionen oder Technologien sind möglicherweise nicht in allen Ländern verfügbar. Bitte erkundigen Sie sich bei Ihrem zuständigen Intuitive-Ansprechpartner vor Ort nach der Verfügbarkeit der Produkte in Ihrer Region. Angaben zu Indikationen, Kontraindikationen, Warnhinweisen und anderen Produktinformationen finden Sie in der produktspezifischen Gebrauchsanweisung.\nDa Vinci X & Xi Chirurgiesysteme\nDie Endoskopie-Instrumentensteuerungssysteme von Intuitive Surgical (da Vinci X- und da Vinci Xi-Chirurgiesysteme) dienen zur Unterstützung bei der präzisen Steuerung der endoskopischen Instrumente von Intuitive Surgical während urologisch-chirurgischer Eingriffe, allgemeiner laparoskopischer Eingriffe, gynäkologischer laparoskopisch-chirurgischer Eingriffe, allgemeiner thorakoskopischer Eingriffe und transoraler otolaryngologisch-chirurgischer Eingriffe, die auf gutartige Tumore und bösartige Tumore der Klasse T1 und T2 beschränkt sind, sowie gutartiger Zungengrundresektionseingriffe. Die Systeme können sowohl für erwachsene Patienten als auch für Kinder verwendet werden (sofern es sich nicht um transorale otolaryngologische chirurgische Verfahren handelt). Sie sollen von erfahrenen Ärzten in einem Operationssaal verwendet werden.\nDie da Vinci X- und da Vinci Xi-Chirurgiesysteme sind Medizinprodukte der Klasse IIb mit CE-Kennzeichnung (CE 2460) gemäß der europäischen Medizinprodukte-Richtlinie (93/42/EWG), hergestellt von Intuitive Surgical, Inc. Bitte beachten Sie die Gebrauchsanweisung vor der Anwendung.\nDa Vinci SP Chirurgiesystem\nDas da Vinci SP Chirurgiesystem dient der genauen Steuerung des zugehörigen Endoskops und der Instrumente bei minimal-invasiven endoskopischen abdominopelvinen, thoraskokopischen, transoralen otolaryngologischen und Brustchirurgieverfahren. Das System ist für den Einsatz bei Erwachsenen indiziert. Es soll von erfahrenen Ärzten in einem Operationssaal verwendet werden.\nDas da Vinci SP Chirurgiesystem ist ein Medizinprodukt der Klasse IIb mit CE-Kennzeichnung (CE 2460) gemäß der europäischen Medizinprodukte-Verordnung (EU 2017/745), hergestellt von Intuitive Surgical, Inc. Bitte beachten Sie die Gebrauchsanweisung vor der Anwendung.\nDiese Cookies sind zur Funktion der Website erforderlich und können in Ihren Systemen nicht deaktiviert werden. In der Regel werden diese Cookies nur als Reaktion auf von Ihnen getätigte Aktionen gesetzt, die einer Dienstanforderung entsprechen, wie etwa dem Festlegen Ihrer Datenschutzeinstellungen, dem Anmelden oder dem Ausfüllen von Formularen. Sie können Ihren Browser so einstellen, dass diese Cookies blockiert oder Sie über diese Cookies benachrichtigt werden. Einige Bereiche der Website funktionieren dann aber nicht. Diese Cookies speichern keine personenbezogenen Daten.\nDiese Cookies ermöglichen es uns, Besuche und Verkehrsquellen zu zählen, damit wir die Leistung unserer Website messen und verbessern können. Sie unterstützen uns bei der Beantwortung der Fragen, welche Seiten am beliebtesten sind, welche am wenigsten genutzt werden und wie sich Besucher auf der Website bewegen. Alle von diesen Cookies erfassten Informationen werden aggregiert und sind deshalb anonym. Wenn Sie diese Cookies nicht zulassen, können wir nicht wissen, wann Sie unsere Website besucht haben.\nMit diesen Cookies ist die Website in der Lage, erweiterte Funktionalität und Personalisierung bereitzustellen. Sie können von uns oder von Drittanbietern gesetzt werden, deren Dienste wir auf unseren Seiten verwenden. Wenn Sie diese Cookies nicht zulassen, funktionieren einige oder alle dieser Dienste möglicherweise nicht einwandfrei.\nDiese Cookies können über unsere Website von unseren Werbepartnern gesetzt werden. Sie können von diesen Unternehmen verwendet werden, um ein Profil Ihrer Interessen zu erstellen und Ihnen relevante Anzeigen auf anderen Websites zu zeigen. Sie speichern nicht direkt personenbezogene Daten, basieren jedoch auf einer einzigartigen Identifizierung Ihres Browsers und Internet-Geräts. Wenn Sie diese Cookies nicht zulassen, werden Sie weniger gezielte Werbung erleben."
    },
    {
        "Ticker": "ISRG",
        "Company": "Intuitive Surgical",
        "Source_URL": "https://www.intuitive.com/en-gb/about-us/newsroom",
        "Content_Type": "Website Content",
        "Raw_Text": "Welcome to our resources for media coverage of Intuitive and its products. Get in touch with us and see regional press releases. See company statements and a library of Intuitive image and video assets that you can use for promotional, editorial, and academic use.\nUK and Ireland: +44 7385 684197 (8am to 6pm GMT).\nOther countries outside the US: +41 21 821 2000 (8am to 6pm CET).\nWithin the US: +1 202-997-7373.\nFor the UK and Ireland, see the following press releases highlighting the latest regional news.\nLearn about Intuitive’s company history and product evolution in our fact sheet that includes timelines and statistics describing our global business.\nIntuitive (Nasdaq: ISRG), headquartered in Sunnyvale, California, is a global leader in minimally invasive care and the pioneer of robotic surgery. Our technologies include the da Vinci surgical system and the Ion endoluminal system. By uniting advanced systems, progressive learning, and value-enhancing services, we help physicians and their teams optimize care delivery to support the best outcomes possible. At Intuitive, we envision a future of care that is less invasive and profoundly better, where diseases are identified early and treated quickly, so patients can get back to what matters most.\nThese materials are provided exclusively for promotional, editorial, and academic use and/or for use in media coverage of Intuitive and its products. Please download zip files that have been packaged to deliver a set of product images or logo files for you to use in your publication.\nIntuitive provides these materials without warranty of any kind. Therefore, please note that permission to use them is only granted if the following guidelines are observed.\nWhile Intuitive authorizes your use of these materials as appropriate, Intuitive promotes and advertises only for procedures cleared by applicable regulatory agencies. Any use of these materials by a third party is in the sole control and responsibility of that party for their promotional, editorial, and academic use and/or media coverage. Intuitive does not advise or provide input to customers on their marketing efforts or materials. You shall not include any statements in your use of these materials that implies that Intuitive assisted in creating or endorses the end product in which you have used these assets.\nNo material found in this section can be used to promote a procedure outside of a system or instrument’s approved/cleared Indications for Use.\nPlease refer to the product’s labeling for a description of clinical uses for which the da Vinci surgical system has been approved/cleared for use.\nAll people depicted are models unless otherwise noted.\nIncluded in this zip folder are high and low resolution images of the following (192 MB):\nIncluded in this zip folder are high and low resolution images of the following (72 MB):\nUse these links to download video files. Below find playback of each video to show you what is included—you may watch the videos in their entirety.\nThis is a modal window.\nBeginning of dialog window. Escape will cancel and close the window.\nEnd of dialog window.\nThis is a modal window. This modal can be closed by pressing the Escape key or activating the close button.\nIntuitive logos\nIncluded in this zip are high and low resolution images (1.4 MB) of Intuitive’s logo in black and white with transparent backgrounds. You must follow the logo usage guidelines that are included in the downloaded zip.\nLegal Notices\nIndividuals' outcomes may depend on a number of factors, including but not limited to patient characteristics, disease characteristics and/or physician/surgeon experience.\nSome products, features or technologies may not be available in all countries. Please contact your local Intuitive representative for product availability in your region. Refer to the product specific User Manual for indications, contraindications, warnings and other product information.\nEuropean Privacy Notice\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nThese cookies allow us to count visits and traffic sources, so we can measure and improve the performance of our site. They help us know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies, we will not know when you have visited our site.\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third-party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising."
    }
]