[
    {
        "Ticker": "KLAC",
        "Company": "KLA Corporation",
        "Source_URL": "https://www.kla.com/",
        "Content_Type": "Website Content",
        "Raw_Text": "Advance\nWhere do great ideas come from? At KLA, our global team of innovators brings forth new ideas, solutions and insights every day—strategies for how to help bring tomorrow’s technologies to life, shape the future and advance humanity. Connect with us here to get the latest KLA information as well as inspiration that can help you make a meaningful impact on the future.\nOct 14, 2025\nArtificial intelligence (AI) is reshaping the semiconductor landscape—both as a fast-growing end market and as a catalyst for innovation across...\nSep 24, 2025\nKLA Drives AI Through Advanced Semiconductor Process Control The age of artificial intelligence (AI) has arrived. As AI systems grow..."
    },
    {
        "Ticker": "KLAC",
        "Company": "KLA Corporation",
        "Source_URL": "https://www.kla.com/company",
        "Content_Type": "Website Content",
        "Raw_Text": "Business Snapshot\nas of December 31, 2024\n18\nRegions\n~15,000\nGlobal Employees\n$10.85B\nCY2024 Revenue\n$1.32B\nCY2024 R&D\nGlobal Impact\nMaking an impact by creating solutions that drive progress and transform industries has long been a part of the KLA DNA, and we remain committed to our purpose in everything we do – through leadership, opportunity, innovation and stewardship.\nEnvironmental, Health & Safety Policy\nKLA is dedicated to complying with the appropriate and relevant environmental, health & safety laws and standards such that its worldwide operations, including product development, sales, service and maintenance, are conducted in an environmentally responsible manner."
    },
    {
        "Ticker": "KLAC",
        "Company": "KLA Corporation",
        "Source_URL": "https://www.kla.com/company/environmental-social-governance",
        "Content_Type": "Website Content",
        "Raw_Text": "Global Impact\nKLA’s ESG strategy is built around four strategic pillars: opportunity, innovation, environmental stewardship and leadership. Within these pillars, specific focus areas and objectives help us prioritize ESG investments and drive progress across our value chain, from our people and operations to our products, services and partnerships.\nOur near-term, science-based Scope 1, 2 and 3 targets have been approved by the SBTi.\n- Reduce absolute Scope 1 and 2 emissions 50% by 2030 from a 2021 base year\n- Reduce Scope 3 GHG emissions from the use of sold products 52% per billion transistors inspected, measured or processed within the same timeframe\nOur Areas of Impact\nLeadership\n2024\nnamed one of the world’s most sustainable companies by TIME magazine\nInnovation\n$4.83B\ninvested in R&D over the past 4 years\nOpportunity\n$6.8M\ntotal community giving in 2024\nStewardship\n68%\nrenewable electricity in 2024\nOur Commitment to Sustainability\nWe believe the future of the semiconductor industry is one in which innovation and sustainability are inextricably intertwined. This will require work on a scale that ranges from microscopic to global – a combination of deep science, technical problem-solving and collaboration across the value chain. As a company that has built its business on tackling complex challenges, we are committed to keep looking for – and leading with – solutions that will take us forward.\nOur approach to sustainability is grounded in the belief that a relentless drive to innovate and improve can have a profound impact on our business, customers and the industry. KLA enables evolution and innovation in the data era across key industries, including automotive, mobile and data center by providing customers with comprehensive process control and process-enabling solutions for semiconductor manufacturing.\nIn 2024, KLA received approval from the Science Based Target initiative (SBTi) for our near-term, science-based targets covering Scope 1, 2 and 3.\nIn addition to our SBTi validated targets, KLA continues to demonstrate meaningful progress to achieving 100% renewable electricity by 2030 across our global operations and aims to achieve net-zero Scope 1 and 2 emissions by 2050.\nGlobal Impact Report\nAt KLA, sustainability is embedded in everything we do. Since 1976, we’ve helped customers increase yield and reduce waste through advanced process control in semiconductor manufacturing.\nWe believe innovation and impact go hand in hand. Our 2024 Global Impact Report outlines the progress we’ve made — not only in advancing semiconductor technology, but also in progressing on our commitment to sustainability and global responsibility.\nAdvance\nAug 25, 2022\nKLA is publishing its latest Global Impact Report, detailing progress of our environmental, social and governance (ESG) programs, results and...\nJun 15, 2022\nSixty-five hackers in 10 project teams at KLA Israel came together in their third annual hackathon, with this year’s event...\nAug 2, 2024\nKLA’s latest Global Impact Report highlights the company’s environmental, social and governance (ESG) activities and impacts for calendar year 2023, including...\nAug 25, 2022\nKLA is publishing its latest Global Impact Report, detailing progress of our environmental, social and governance (ESG) programs, results and...\nJun 15, 2022\nSixty-five hackers in 10 project teams at KLA Israel came together in their third annual hackathon, with this year’s event...\nAug 2, 2024\nKLA’s latest Global Impact Report highlights the company’s environmental, social and governance (ESG) activities and impacts for calendar year 2023, including...\nKLA Foundation\nKLA Foundation is committed to investing in our communities by expanding educational opportunities, improving health, and enhancing community resources for those who need it most. We believe making an impact requires listening, ongoing collaboration, patience, and a holistic understanding of human needs. KLA Foundation strategically partners with organizations that know their communities best to create upstream solutions for sustainable change and empower our employees to get involved in causes that are close to their hearts.\nESG Resources\n-\nCDP Report\nCDP is a not-for-profit charity that runs the global disclosure system for investors, companies, cities, states, and regions to manage their environmental impacts. Our annual CDP report discloses how we measure and manage our risks and opportunities related to climate change and water security.\n-\nKLA’s Global Human Rights Standards\nAt KLA, we are committed to upholding the human rights and dignity of all people. Working ethically and complying with our legal obligations have always been central to the way we conduct business.\n-\nKLA’s Water & Waste Policy\nKLA’s Water & Waste Policy guides our water stewardship and waste reduction strategies."
    },
    {
        "Ticker": "KLAC",
        "Company": "KLA Corporation",
        "Source_URL": "https://www.kla.com/company/supplier",
        "Content_Type": "Website Content",
        "Raw_Text": "Catalyze Partnership Program\nKLA Corporation is now a member of the Catalyze program, a pioneering initiative to expand access to renewable energy across the global semiconductor value chain, designed to help support suppliers and vendors of all sizes transition to a lower carbon energy provider."
    },
    {
        "Ticker": "KLAC",
        "Company": "KLA Corporation",
        "Source_URL": "https://www.kla.com/company/events",
        "Content_Type": "Website Content",
        "Raw_Text": "Tuesday, Nov 18 - Friday, Nov 21, 2025\nKLA is pleased to be an exhibitor and a sponsor at SEMICON Europa. We invite you to visit our experts...\nTuesday, Nov 18 - Friday, Nov 21, 2025\nKLA is pleased to be an exhibitor and a sponsor at SEMICON Europa. We invite you to visit our experts...\nTuesday, Nov 18 - Wednesday, Nov 19, 2025\nKLA is looking forward to meeting you at The International Symposium for Testing and Failure Analysis (ISTFA). Please visit us...\nWednesday, Nov 19, 2025\nKLA is a sponsor of SEMI MEMS and Imaging Sensors Summit. The MEMS and Imaging Sensors Summit brings together thought...\nSunday, Nov 30 - Friday, Dec 5, 2025\nKLA is excited to be returning as an exhibitor and sponsor of the Materials Research Society (MRS) Fall Meeting &...\nSunday, Dec 7 - Thursday, Dec 11, 2025\nKLA is looking forward to participating in the Materials in Nuclear Energy Systems (MiNES) Conference. Come visit our booth and...\nWednesday, Dec 17 - Friday, Dec 19, 2025\nKLA is looking forward to meeting you at SEMICON Japan. Please visit our booth #W1569 to meet with our experts...\nYou've selected to view this site translated by Google Translate.\nKLA China has the same content with improved translations.\nWould you like to visit KLA China instead?\n您已选择查看由Google翻译翻译的此网站。\nKLA中国的内容与英文网站相同并改进了翻译。\n你想访问KLA中国吗？"
    },
    {
        "Ticker": "KLAC",
        "Company": "KLA Corporation",
        "Source_URL": "https://www.kla.com/media-room",
        "Content_Type": "Website Content",
        "Raw_Text": "From atomic-scale breakthroughs to advanced packaging, our process control solutions are elevating the quality of AI chips that are redefining our world. AI isn’t just driving demand for our tools and technologies, it’s fueling a new era of intelligent decision-making and pushing the boundaries of what’s possible in the semiconductor industry.\nWhen you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer.\nMore information\nManage Consent Preferences\nStrictly Necessary Cookies\nAlways Active\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nFunctional Cookies\nThese cookies enable the website to provide enhanced functionality and personalization. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nPerformance Cookies\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nTargeting Cookies\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant advertisements on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising."
    },
    {
        "Ticker": "KLAC",
        "Company": "KLA Corporation",
        "Source_URL": "https://www.kla.com/company/inclusion-for-all",
        "Content_Type": "Website Content",
        "Raw_Text": "Inclusion is foundational to KLA, both as a strategic imperative and an expression of our core values. Our inclusive culture expands the spectrum of innovation and problem-solving potential, fosters better decision making and supports business success.\nIt all connects when we do\nAll electronics are made up of connections. Different parts, different abilities, working together to create something bigger than themselves. That’s how KLA works too. Because to make products that push boundaries, we must first push our own. Learn from, and build on, each other’s wisdom and experiences.\nAll 15,000 of us, across over a dozen regions, bring something essential to KLA. Ourselves.\nInclusion for All is an Opportunity\nAt KLA, we don’t view inclusion as a problem that needs to be solved, but as an opportunity to embrace. Our mission is to learn from and build on each other’s wisdom, ideas, backgrounds and experiences. Our efforts focus on three primary drivers:\nBuild an inclusive environment. We bring out the best in ourselves and each other.\nIncrease engagement. We expand the spectrum of innovation and problem-solving potential.\nEmbody inclusive leadership. We lead by example to foster better decision making and productivity.\nEmployee Resource Groups\nKLA’s Employee Resource Groups (ERGs) align with company goals and are open for all employee participation. Led by volunteers, these groups collaborate, share ideas and advance inclusion across the workplace.\nBELIEVE\nBlack Employees Leading Inclusion, Excellence, Vision and Education (BELIEVE) progresses KLA’s inclusive environment through cultural awareness and understanding of the Black community.\nBRIDGE\nBuilding Relationships In Diverse Generations and Experiences (BRIDGE) conducts programs and events geared to create greater understanding, collaboration and belonging across multigenerational teams.\nKonexión\nKonexión fosters an inclusive community where employees interact and innovate together through sharing and understanding the multicultural Latinx community.\nPRISM\nPRISM (where Pride, Respect, Inclusion and Solidarity Meet) progresses KLA’s inclusive environment through cultural awareness, understanding, and safety of our LGBTQ+ employees.\nVALOR\nVeterans and Allies Leading for Organizational Results (VALOR) embraces the unique skills, capabilities and experiences of U.S. military veterans to foster high-performing teams.\nWise\nWomen in STEM Empowered (WISE) supports engagement of women in STEM fields by fostering an inclusive community.\nWe will ensure that qualified individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. For external applicants, please contact us at talent.acquisition@kla.com to request accommodation. For current employees, contact your designated HR Business Partner.\nAre you sure?\nYou've selected to view this site translated by Google Translate. KLA China has the same content with improved translations.\nWhen you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer.\nMore information\nManage Consent Preferences\nStrictly Necessary Cookies\nAlways Active\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nFunctional Cookies\nThese cookies enable the website to provide enhanced functionality and personalization. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nPerformance Cookies\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nTargeting Cookies\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant advertisements on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising."
    },
    {
        "Ticker": "KLAC",
        "Company": "KLA Corporation",
        "Source_URL": "https://www.kla.com/company/environmental-social-governance/kla-foundation",
        "Content_Type": "Website Content",
        "Raw_Text": "KLA Foundation is committed to investing in our communities by expanding educational opportunities, improving health, and enhancing community resources for those who need it most. We believe making an impact requires listening, ongoing collaboration,patience, and a holistic understanding of human needs. KLA Foundation strategically partners with organizations that know their communities best to create upstream solutions for sustainable change and empower our employees to get involved in causes that are close to their hearts.\nPillars:\nEducation: Create opportunities and increase long-term access to educational resources that guide students in need throughout their unique educational journeys, especially in STEM fields.\nWellness: Promote wellness programs and partner with organizations working to improve the overall health of KLA communities.\nCommunity Enrichment: Nurture strategic partnerships with organizations that deeply understand their community’s needs and encourage positive long-term change.\nHow We Give\nOur Education Opportunity Fund helps organizations provide access to quality education for limited-income and/or underrepresented students in the communities KLA operates.\nThrough Strategic and Community Partner Grants, we increase access to and support of educational, health & wellness, and local community enrichment programs.\nWe amplify employee generosity through matching gifts, volunteer rewards and team volunteer grants.\nAdvance\nNov 15, 2023\nEmployees at several locations in the United States, China, Singapore and Wales supported multiple nonprofits and educational initiatives during the...\nNov 12, 2023\nKLA employees in India, Japan, Taiwan and South Korea rolled up their sleeves to support children and the environment during...\nApr 4, 2024\nApril is Global Volunteer Month. For many employees, helping others isn’t just a monthly activity – they volunteer for worthy...\nMar 25, 2024\nKLA Foundation expanding the KLA Education Equity Fund to $1.5 million in 2024 and is making its multiyear grants available...\nNov 15, 2023\nEmployees at several locations in the United States, China, Singapore and Wales supported multiple nonprofits and educational initiatives during the...\nNov 12, 2023\nKLA employees in India, Japan, Taiwan and South Korea rolled up their sleeves to support children and the environment during...\nApr 4, 2024\nApril is Global Volunteer Month. For many employees, helping others isn’t just a monthly activity – they volunteer for worthy...\nMar 25, 2024\nKLA Foundation expanding the KLA Education Equity Fund to $1.5 million in 2024 and is making its multiyear grants available..."
    },
    {
        "Ticker": "KLAC",
        "Company": "KLA Corporation",
        "Source_URL": "https://www.kla.com/solutions/5g",
        "Content_Type": "Website Content",
        "Raw_Text": "How KLA enables 5G\n5G delivers much more than a faster browsing experience to your mobile device. 5G networking technology is critical to enabling how independent systems interact synergistically with each other. Coupled with innovations in artificial intelligence (AI), 5G is changing how our world works, how we communicate, and how information flows in business and our personal lives. For example, automobile vehicle to everything (V2X) communication technology utilizes 5G to improve safety and help with traffic management by constantly monitoring and communicating with the surroundings. In addition, KLA’s technologies enable the manufacture of thinner and lighter advanced displays that are an essential part of many 5G devices.\nKLA’s products are used at every stage in the 5G component manufacturing process, from R&D through high-volume production of ICs, packages and PCBs, to ensure the highest quality and reliability standards are achieved.\nIntegrated Circuit Quality\nSemiconductor IC quality is fundamental to the success of mission-critical, low‐latency 5G services such as autonomous driving and security monitoring. High chip reliability and performance are achieved through implementation of comprehensive process control strategies across the semiconductor ecosystem.\nSemiconductor Manufacturing\n5G applications are driving increased adoption of electronic devices that utilize RF power amplifiers and high-frequency filters, sensors and MEMS devices. Robust IC process technologies and process control strategies improve chip performance and reliability.\nPackaging Advances\nNew IC packaging architectures with complex levels of integration—system in package (SiP) and fan-out on both wafer and panel—enable the development of 5G devices. Process technologies, including etch, PVD, CVD, and UV laser drilling support the formation of these complex packaging schemes. During packaging processing and after component formation, tighter quality requirements drive the need for accurate inspections at the wafer, die and sub-package levels.\nHigh Density Interconnect PCB\n5G-enabled devices require advanced printed circuit boards with finer linewidths, straight sidewall geometry and multiple layers with more stringent quality and reliability requirements. PCB inspection, repair and imaging systems help manufacturers find and repair defective layers and trace the source of defects, increasing the yield and reliability of finished PCBs.\n5G Highlights\nMar 16, 2021\nToday’s PCB (printed circuit board) engineering departments face many challenges in their process planning, including long and complex planning cycles,...\nNov 30, 2020\nAs 5G smartphones, advanced automotive electronics, medical and WFH/LFH (learn-from-home) devices become lighter in weight, smaller in form factor and...\n5G Commentary\nSemiconductor Engineering / Jan 2022\nInspecting And Testing GaN Power Semis\nSemiconductor Engineering / Jan 2022\nThe Gargantuan 5G Chip Challenge\nSemiconductor Engineering / Aug 2021\nDesigning Chips For Test Data\nSemiconductor Engineering / Jul 2021\nChip Shortages Grow For Mature Nodes\nSemiconductor Engineering / May 2021\nAdvanced Packaging’s Next Wave\nSemiconductor Engineering / Mar 2021\nWhat Goes Wrong In Advanced Packages\nSemiconductor Engineering / Jan 2021\nThe Good, Bad And Unknowns Of Flexible Devices\nSemiconductor Engineering / Dec 2020\nVariation Threat In Advanced Nodes, Packages Grows\nSemiconductor Engineering / Dec 2020\n200mm Demand Surges\nSemiconductor Engineering / Oct 2020\nDefect Challenges Grow For IC Packaging\nSemiconductor Engineering / Apr 2020\nScaling CMOS Image Sensors\nSemiconductor Engineering / Dec 2019\nThe Growing Challenges of 5G Reliability\nSemiconductor Engineering / Jul 2019\nChallenges Grow For 5G Packages And Modules\nOrbotech blog / Jun 2018\nHigh-frequency 5G wireless infrastructure requires a new approach to PCB manufacturing\nOrbotech blog / May 2018\nBrainstorm: how are manufacturers preparing for 5G\nOrbotech blog / Oct 2017\nmSAP: The New PCB Manufacturing Imperative for 5G Smartphones\nExplore More Technology Trends\nAI helps make sense of big data! Our solutions use AI to accelerate production of the very ICs that will power the next generation of AI innovation.\nSemiconductor innovation thrives in advanced packaging. Our solutions help advance connectivity within tomorrow’s high-performance chips."
    },
    {
        "Ticker": "KLAC",
        "Company": "KLA Corporation",
        "Source_URL": "https://www.kla.com/zh-hans/company",
        "Content_Type": "Website Content",
        "Raw_Text": "业务速览\n截止至2024年1月25日\nYou've selected to view this site translated by Google Translate.\nKLA China has the same content with improved translations.\nWould you like to visit KLA China instead?\n您已选择查看由Google翻译翻译的此网站。\nKLA中国的内容与英文网站相同并改进了翻译。\n你想访问KLA中国吗？"
    },
    {
        "Ticker": "KLAC",
        "Company": "KLA Corporation",
        "Source_URL": "https://www.kla.com/ja/company",
        "Content_Type": "Website Content",
        "Raw_Text": "事業スナップショット\n2024年1月25日時点\n事業スナップショット\n2024年1月25日時点\nYou've selected to view this site translated by Google Translate.\nKLA China has the same content with improved translations.\nWould you like to visit KLA China instead?\n您已选择查看由Google翻译翻译的此网站。\nKLA中国的内容与英文网站相同并改进了翻译。\n你想访问KLA中国吗？"
    },
    {
        "Ticker": "KLAC",
        "Company": "KLA Corporation",
        "Source_URL": "https://www.kla.com/ko/company",
        "Content_Type": "Website Content",
        "Raw_Text": "비즈니스 현황\n2024년 1월 25일 기준\n18\n글로벌 지점\n>15,000\n글로벌 직원 수\n$9.7B\nCY23 추정 매출\n$1.3B\nCY23 R&D\n회사관련 기사\nKLA Foundation\n다양한 펀딩 및 자원봉사 기회를 통해 커뮤니티 및 자선 사업을 지원합니다: STEM 교육, 보건 및 웰니스 프로그램, 현지 원조 및 국제 재난 구조. KLA는 산타클라라 카운티의 세컨드 하베스트 푸드 뱅크를 후원하며 아프리카에서 사상충증을 퇴치하기 위해 지원합니다. 이런 활동들은 이익이 아닌 인류를 위함입니다.\n기업 및 사회적 책임\n지속가능성, 친환경 사명감 및 사회적 책임: KLA의 근본적인 가치입니다."
    },
    {
        "Ticker": "KLAC",
        "Company": "KLA Corporation",
        "Source_URL": "https://www.kla.com/advance/leadership/qa-with-klas-john-robinson-some-insights-from-2025-spie-event",
        "Content_Type": "Website Content",
        "Raw_Text": "We sat down with John Robinson, Ph.D., senior principal scientist at KLA and SPIE fellow, to share some insights on AI from the 2025 SPIE Advanced Lithography + Patterning Symposium.\nI wore several hats at the SPIE Advanced Lithography and Patterning symposium. I’m happy to report that we’re back to pre-COVID numbers in terms of paper submissions (more than 526) and attendees (over 2,200). We had four plenary talks by top industry speakers and 15 short courses from leading experts. I’m also in my 16th year as a program committee member for the Metrology, Inspection and Process Control conference.\nThe metrology conference continues to draw the largest number of submitted papers (more than 150) from among the six conferences, and it also generates large crowds. Additionally, I was attending as a member of the technical community, taking the opportunity to learn about the latest advancements, to network with industry experts, and to visit with long-term friends based on many years of participation.\nTop talent is key to the continued success of advanced lithography and patterning. As such we are dedicating significant effort into attracting and retaining top students. Through initiatives such as the student grant program (which KLA is a sponsor) and student paper awards, we encourage student participation. The Karel Urbánek Best Student Paper Award, sponsored by KLA, is awarded annually by the Metrology, Inspection and Process Control program committee. A record 17 candidate student papers met the eligibility criterion. There were many excellent student presentations. Tim Houben of the Technische University of Eindhoven, for his paper “Optimizing surface reconstruction using a segmented scanning electron microscope detector and deep learning,” had the winning entry. He showed an in-depth understanding of both the SEM technology and of machine learning.\nEach year, SPIE promotes select members to become fellows of the society. They are honored for both technical achievement as well as service to the technical community and SPIE in particular. The fellow program is celebrating its 70th year in 2025. The Advanced Lithography and Patterning symposium was honored to have four of this year’s awardees on hand for recognition."
    },
    {
        "Ticker": "KLAC",
        "Company": "KLA Corporation",
        "Source_URL": "https://www.kla.com/zh-hans/company/environmental-social-governance",
        "Content_Type": "Website Content",
        "Raw_Text": "推动人类进步\n自我们创立以来，KLA一直在利用我们的专长和创新思维来克服巨大挑战、改善生活。 我们在领导力、机遇、创新和管理方面取得进步，并通过技术和创意推动人类进步。\n着重推动可持续的盈利能力和增长\n我们的影响领域\n推动领导力\n75%\n在KLA内部晋升的副总裁\n推动创新\n33亿美元\n过去四年的研发投入\n推动机遇\n550万美元\n2021年捐赠社区的总额\n推进管理\n63%\n全公司的废物管理：不再只是将废物运往垃圾填埋场\n我们的环境、社会和治理(ESG)旅程\n积极管理环境、社会和治理影响是我们推动人类进步的使命中不可或缺的一部分。 我们的ESG战略是指引我们实现这一目标的路线图——为我们的决定提供信息，促使我们为自己所在企业和社区的进步贡献力量，并帮助客户实现自己的ESG目标。\n我们不断增进对于与KLA最相关并不断演变的ESG话题的了解，相应管理这些话题，推动我们的表现改善。 2022年8月，KLA宣布了一个新目标，即到2030年将范围1和2的排放量降到2021年基线的50%，到2050年实现范围1和2的排放量达到净零。范围1和2的减排目标是基于科学目标倡议（SBTi）企业净零标准设定的。\n2021年取得的进展：\n- 宣布我们的目标——到2030年，我们将在全球业务中100%使用可再生电力。\n- 制定了新的、改进的温室气体清单基线。\n- 完成了对我们的范围1和2、范围3商务旅行温室气体清单、可再生能源进展的有限第三方核实。\n- 根据气候相关财务信息披露工作组(TCFD)的建议，首次开展了深入的气候风险和机遇评估。\n我们着力进一步降低对气候产生的影响，还将在2023年底之前评估和宣布在制定范围3减排目标方面取得的进展。\n全球影响力报告\n实现有助于促进人类进步的影响是KLA的立业之本，我们始终致力于在一切活动中通过领导力、机遇、创新和管理实现我们的目标。\nAdvance\nKLA基金会\nKLA基金会致力于推动人类进步。为此，它对我们的社区投入资源，以创造更加公平、更加包容、更可及的世界。 我们认为，要产生影响力，就需要聆听、持续合作、耐心全面了解人类需求。 KLA基金会与那些最了解其社区的组织进行战略合作，共创可持续的上游解决方案，并赋能员工参与有意向的项目。\nESG资源\n-\nCDP报告\nCDP是一家非营利慈善机构，运营投资者、公司、城市、州和地区的环境影响全球披露系统。 我们的年度CDP报告揭示我们如何衡量和管理与气候变化和水安全有关的风险和机遇。 -\nKLA的全球人权标准\n在KLA，我们致力于维护所有人的人权和尊严。 遵守工作道德和法律法规一直是我们开展业务的核心。"
    },
    {
        "Ticker": "KLAC",
        "Company": "KLA Corporation",
        "Source_URL": "https://www.kla.com/ko/company/environmental-social-governance",
        "Content_Type": "Website Content",
        "Raw_Text": "인류의 발전\nKLA는 창립 이래 전문 지식과 혁신적인 사고를 활용하여 중대한 위기를 극복하고 삶을 개선하기 위해 힘썼습니다. 당사는 리더십, 기회, 혁신 및 스튜어드십의 진일보를 통해 행동을 이끌어내는 아이디어와 기술로 인류를 계속해서 발전시키고 있습니다.\n지속 가능한 수익 창출 및 성장에 집중\n당사가 영향력을 보유한 영역\n리더십 발전\n75%\nKLA 내부 출신 VP 승진자 비율\n혁신 가속\n33억 달러\n지난 4년 간의 R&D 분야 투자액\n기회 확대\n550만 달러\n2021년 지역사회 기부총액\n스튜어드십 발전\n63%\n매립지에서 전환되는 전사 폐기물 비율\nESG를 향한 여정\n적극적인 ESG(Environmental, social and governance) 임팩트 관리는 인류의 발전을 견인한다는 당사 사명의 핵심입니다. 이러한 사명을 달성하는 과정에서 당사의 ESG 전략은 결정을 알리고, 비즈니스와 지역사회에서 발전에 대한 책임을 지고, 고객 각자의 ESG 목표 달성을 지원하는 등 로드맵이 됩니다.\n당사는 KLA와 가장 관련성이 높으며 진화를 거듭하는 ESG 주제에 대한 이해도를 지속적으로 향상하고, 이를 시의적절하게 관리하며, 성과를 개선하기 위한 여정에 있습니다. 지난 2022년 8월, KLA는 2030년까지 직접배출원(Scope 1) 및 간접배출원(Scope 2)의 탄소 배출량을 2021년 기준치 대비 50%로 감축하고, 2050년까지 직접 및 간접배출원에서 탄소중립(Net zero)을 달성하겠다는 새로운 목표를 발표했습니다. 직접 및 간접배출 감축 목표는 과학 기반 감축목표 이니셔티브(SBTi) 기업 탄소중립 표준에 따라 결정됩니다.\n2021년에 달성한 성과:\n- 2030년까지 전 세계 사업장에서 100% 재생 가능한 전기를 사용하겠다는 목표 발표\n- 개선된 신규 온실가스(GHG) 인벤토리 기준 개발\n- 직접배출, 간접배출, 기타 간접배출(Scope 3) 출장에 대한 당사 GHG 인벤토리의 제한적 제3자 검증 완료\n- 기후관련 재무정보공개 협의체(TCFD)의 권고에 따라 제1회 기후 위험 및 기회 심층 평가 실시\n당사는 기후에 미치는 영향을 더욱 줄이기 위해, 2023년 말까지 기타 간접배출 감축 목표 개발에 대한 진행 상황을 평가 및 발표할 예정입니다.\n글로벌 임팩트 보고서\nKLA는 오랜 시간 동안 인류 발전에 기여할 수 있는 영향력을 발휘할 수 있기를 꿈꾸었으며, 리더십, 기회, 혁신, 스튜어드십을 통해 모든 활동에서 당사의 목적에 전념하고 있습니다.\nKLA Foundation\nKLA Foundation은 인류의 발전을 위해 지역사회에 투자하여 더욱 공평하고 포용력 있으며 접근성이 높은 세상을 만들고자 힘쓰고 있습니다. 영향력을 발휘하기 위해서는 경청, 지속적인 협력, 인내, 인간의 필요에 대한 총체적인 이해가 필요하다고 믿습니다. KLA Foundation은 지역사회에 정통한 조직과의 전략적인 협력을 통해 지속 가능한 변화를 위한 업스트림 솔루션을 만들고, 직원들이 스스로 지지하는 대의에 참여하도록 지원합니다.\nESG 자료\n-\nCDP 보고서\nCDP는 글로벌 공개 시스템을 운영하여 투자자, 기업, 도시, 주, 지역이 환경에 미치는 영향을 관리할 수 있도록 지원하는 비영리 자선 단체입니다. 당사의 연례 CDP 보고서를 통해 KLA가 기후 변화 및 물 안보와 관련된 위험과 기회를 측정 및 관리하는 방법을 확인하실 수 있습니다. -\nKLA의 글로벌 인권 표준\nKLA는 모든 사람의 인권과 존엄성을 수호하기 위해 힘쓰고 있습니다. 윤리적인 근로와 법적 의무 준수는 KLA가 비즈니스를 수행하는 방식의 핵심입니다."
    },
    {
        "Ticker": "KLAC",
        "Company": "KLA Corporation",
        "Source_URL": "https://www.kla.com/zh-hans/company/supplier",
        "Content_Type": "Website Content",
        "Raw_Text": "You've selected to view this site translated by Google Translate.\nKLA China has the same content with improved translations.\nWould you like to visit KLA China instead?\n您已选择查看由Google翻译翻译的此网站。\nKLA中国的内容与英文网站相同并改进了翻译。\n你想访问KLA中国吗？"
    },
    {
        "Ticker": "KLAC",
        "Company": "KLA Corporation",
        "Source_URL": "https://www.kla.com/ja/company/supplier",
        "Content_Type": "Website Content",
        "Raw_Text": "You've selected to view this site translated by Google Translate.\nKLA China has the same content with improved translations.\nWould you like to visit KLA China instead?\n您已选择查看由Google翻译翻译的此网站。\nKLA中国的内容与英文网站相同并改进了翻译。\n你想访问KLA中国吗？"
    },
    {
        "Ticker": "KLAC",
        "Company": "KLA Corporation",
        "Source_URL": "https://www.kla.com/ko/company/supplier",
        "Content_Type": "Website Content",
        "Raw_Text": "우리 모두는 비즈니스 행동 표준(SoBC)을 위반하는 모든 활동을 보고할 책임이 있습니다. 질문을 하고, 지침을\n구하고, 의심스러운 위반 사항을 보고하고, KLA 담당자 또는 당사의 EthicsPoint 신고 포털을 통해 규정\n준수에 대한 우려를 표명하는 것이 좋습니다.\n방문하는 모든 웹사이트의 정보가 브라우저에서 쿠키 형태로 저장되거나 수집될 수 있습니다. 본 정보는 귀하와 귀하의 선호도, 기기에 대한 것이며, 귀하의 선호도에 따라 사이트가 동작하도록 하는 데 사용됩니다. 본 정보는 귀하를 직접적으로 식별하지 않으나 보다 개인화된 웹 경험을 제공하기 위해 사용됩니다. 그러나 일부 쿠키를 거부할 수 있습니다. 더 자세한 정보를 확인하고 기본 설정을 변경하려면 해당 카테고리의 제목을 클릭하세요. 그러나 일부 쿠키를 차단하면 귀하의 사이트 경험과 회사에서 제공하는 서비스에 영향을 미칠 수 있습니다.\n추가 정보\n동의 선호도 관리\n필수 쿠키\n항상 활성화\n이 쿠키는 웹사이트의 기능을 위해 필수적이며, 회사 시스템 내에서 종료할 수 없습니다. 이 쿠키는 개인정보 선호도, 로그인 또는 양식 작성과 같은 서비스 요청에 해당하는 귀하의 행위에 따라서만 주로 설정됩니다. 귀하의 브라우저에서 이 쿠키를 차단하거나 쿠키에 대해 알림 설정을 할 수 있지만, 이 경우 해당 사이트의 일부 기능이 동작하지 않을 수 있습니다.\n기능적 쿠키\n본 쿠키는 동영상 및 실시간 채팅과 같은 고급 기능과 개인화를 허용합니다. 쿠키는 회사 또는 회사 페이지에 추가된 제3 서비스 사업자가 설정할 수 있습니다. 쿠키를 허용하지 않으면 일부 기능이 정상 작동하지 않을 수 있습니다.\n성능 관련 쿠키\n이 쿠키는 방문자 수, 데이터 트래픽 정보를 확인해 회사 사이트의 성능을 측정하고 개선할 수 있도록 합니다. 또한 가장 인기가 많거나 인기가 적은 페이지를 확인하며 방문자가 사이트를 이동하는 방법을 확인할 수 있도록 합니다. 쿠키가 수집하는 모든 정보는 누적되며 익명 처리됩니다. 쿠키를 허용하지 않으면 귀하가 회사 사이트에 방문한 시기를 알 수 없습니다.\n광고 쿠키\n이 쿠키는 회사의 광고 협력사가 회사 사이트에 설정한 것입니다. 해당 협력사는 귀하의 관심사에 대한 프로파일을 만들고 다른 사이트에서도 관련 광고를 표시하기 위해 이 쿠키를 사용합니다. 이 쿠키는 귀하의 브라우저와 기기를 식별함으로써 동작합니다. 이 쿠키를 허용하지 않으면 다른 웹사이트에서 회사가 제공하는 맞춤형 광고를 경험할 수 없습니다."
    },
    {
        "Ticker": "KLAC",
        "Company": "KLA Corporation",
        "Source_URL": "https://www.kla.com/zh-hans/company/events",
        "Content_Type": "Website Content",
        "Raw_Text": "对不起，没有即将举办的活动。请稍后再回来查看。\n对不起，没有即将举办的活动。请稍后再回来查看。\nYou've selected to view this site translated by Google Translate.\nKLA China has the same content with improved translations.\nWould you like to visit KLA China instead?\n您已选择查看由Google翻译翻译的此网站。\nKLA中国的内容与英文网站相同并改进了翻译。\n你想访问KLA中国吗？"
    },
    {
        "Ticker": "KLAC",
        "Company": "KLA Corporation",
        "Source_URL": "https://www.kla.com/ja/company/events",
        "Content_Type": "Website Content",
        "Raw_Text": "そうです、あれらをアップロードします。場所を確認してください。\nそうです、あれらをアップロードします。場所を確認してください。\nYou've selected to view this site translated by Google Translate.\nKLA China has the same content with improved translations.\nWould you like to visit KLA China instead?\n您已选择查看由Google翻译翻译的此网站。\nKLA中国的内容与英文网站相同并改进了翻译。\n你想访问KLA中国吗？"
    },
    {
        "Ticker": "KLAC",
        "Company": "KLA Corporation",
        "Source_URL": "https://www.kla.com/ko/company/events",
        "Content_Type": "Website Content",
        "Raw_Text": "죄송합니다. 예정된 행사가 없습니다. 향후 확인하시기 바랍니다.\n죄송합니다. 예정된 행사가 없습니다. 향후 확인하시기 바랍니다.\nYou've selected to view this site translated by Google Translate.\nKLA China has the same content with improved translations.\nWould you like to visit KLA China instead?\n您已选择查看由Google翻译翻译的此网站。\nKLA中国的内容与英文网站相同并改进了翻译。\n你想访问KLA中国吗？"
    },
    {
        "Ticker": "KLAC",
        "Company": "KLA Corporation",
        "Source_URL": "https://www.kla.com/media-room/channels",
        "Content_Type": "Website Content",
        "Raw_Text": "When you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer.\nMore information\nManage Consent Preferences\nStrictly Necessary Cookies\nAlways Active\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nFunctional Cookies\nThese cookies enable the website to provide enhanced functionality and personalization. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nPerformance Cookies\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nTargeting Cookies\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant advertisements on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising."
    },
    {
        "Ticker": "KLAC",
        "Company": "KLA Corporation",
        "Source_URL": "https://www.kla.com/media-room/browse",
        "Content_Type": "Website Content",
        "Raw_Text": "When you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer.\nMore information\nManage Consent Preferences\nStrictly Necessary Cookies\nAlways Active\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nFunctional Cookies\nThese cookies enable the website to provide enhanced functionality and personalization. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nPerformance Cookies\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nTargeting Cookies\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant advertisements on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising."
    }
]