[
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/",
        "Content_Type": "Website Content",
        "Raw_Text": "People are at the heart of everything we do and every decision we make - whether it be our employees, stakeholders, customers, or the communities we serve.\nNASDAQ:LIN | November 18, 2025 10:18 AM EST\n$418.2\n+0.35\n(+0.08%)\nNASDAQ:LIN | November 18, 2025 10:18 AM EST\n+0.35\n(+0.08%)\nPeople are at the heart of everything we do and every decision we make - whether it be our employees, stakeholders, customers, or the communities we serve.\nWe are driven to ensure no harm comes from our actions to people, the environment or the communities in which we operate.\nTake your career to the next level while making a positive impact in the lives of the people with whom you work, the communities we serve, and the world in which we all live. Whatever you seek to accomplish, at Linde you have the opportunities and resources to fulfil your aspirations. #BeLindeBeLimitless"
    },
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/about-us/frequently-asked-questions",
        "Content_Type": "Website Content",
        "Raw_Text": "We are a leading global industrial gases and engineering company. Our areas of expertise are industrial gases, specialty gases and healthcare gases, engineering and advanced material technologies.\nFrequently Asked Questions\nYour go-to resource for answers to common questions about our company, our products, services, and technologies.\nQuestions and Answers\nWhat is Linde, what does the company do?\nIn which businesses does Linde operate and what are the applications for its products?\nWhat are Linde's core values?\n- We put safety first.\n- We are committed to always acting with integrity.\n- We are committed to improving the communities where we live and work.\n- We embrace inclusion.\n- We hold ourselves accountable for our performance, individually and collectively.\nOur goal is to ensure that Linde continues to create value for all its stakeholders - whether delivering innovative solutions for our customers, helping the communities where we operate, generating industry-leading returns for our investors, or creating an inspiring workplace for our employees.\nHow is Linde making our world more productive?\nBy delivering innovative solutions, technologies and services which make our customers more successful and help to sustain, decarbonize and protect our planet. Our industrial gases and technologies are used in countless applications including production of low-carbon hydrogen and carbon capture systems critical in advancing energy resilience and innovation, life-saving medical oxygen and high-purity and specialty gases for electronics. We also deliver state-of-the-art gas processing solutions to support our customers.\nHow do Linde's products impact the average consumer?\nOur gases, technologies and applications likely impact your life every day, no matter where you call home. They help keep your vegetables fresher, your drive safer and your smartphone smarter. They're used in water, on land, in the air, and even in space.\nHow does Linde help its customers decarbonize?\nAt Linde we are actively advancing clean energy projects across diverse sectors and applications - often involving low-carbon hydrogen as today's most practical solution, but also offering clean hydrogen with the lowest carbon intensities. Another prime example for 'doing more with less' is oxy-fuel technology: using pure oxygen instead of natural air is increasing the efficiency of combustion processes, helping to save fuel and emissions.\nIndustrial decarbonization can boost productivity and enable economic growth. Linde has best-in class technologies and solutions to facilitate cleaner, more efficient, and more sustainable industrial processes. Carbon capture technologies have a critical role to play in decarbonizing our customers' operations. Together with top-tier customers and partners, we are developing CCS projects in the oil & gas, chemical and cement industries.\nHow does Linde support carbon capture and storage?\nLeveraging decades of experience in gas processing and engineering, Linde's innovative carbon capture technologies help reduce emissions. Industries such as cement, chemicals, and steel production are turning to carbon capture technologies to remove CO2 from flue gases, a key step in meeting stringent CO2 emission reduction targets.\nHow is Linde involved in hydrogen?\nHydrogen is used widely across multiple industries and sectors, such as chemicals and refining - for example hydrogen is already used to desulfurize fuel. Linde is driving innovation across the entire hydrogen value chain to decarbonize industrial plants, refuel hydrogen-powered transport and develop new applications. Discover the latest advancements as Linde leads the transition to cleaner energy solutions for a sustainable future.\nHow is Linde helping to sustain and protect our planet?\nWe help customers worldwide improve their environmental performance and reduce their carbon footprint. In fact, Linde helps our clients avoid more than double the emissions that we generate across our entire global footprint. At the same time, we are committed to minimizing our own environmental resource intensity. Linde's climate goals include its 2035 science-based absolute greenhouse gas emissions reduction target and its 2050 climate neutrality ambition. Linde is a participant in the United Nations Global Compact, is a constituent of the FTSE4Good Index and the Dow Jones Best-In-Class Indices (formerly the Dow Jones Sustainability Indices)."
    },
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/about-us",
        "Content_Type": "Website Content",
        "Raw_Text": "Carl Linde founds the Gesellschaft für Linde's Eismaschinen in Wiesbaden, Germany together with five partners. One of them was a wealthy Rhineland brewer who clearly saw the big benefits of Linde's mechanical refrigeration system for the beer brewing industry.\nAbout Us\nEvery day around the world, we are making our world more productive.Learn More About Linde\nEvery day around the world, our people are inspired to make our world more productive - by delivering innovative solutions, technologies and services which make our customers more successful and help to sustain, decarbonize and protect our planet.\nOur industrial gases and technologies are used in countless applications, including production of clean hydrogen and carbon capture systems, life-saving medical oxygen and high-purity and specialty gases for electronics. We also deliver state-of-the-art gas processing solutions to support our customers.\nBe inspired.\nHow We Lead\nCorporate Governance\nA supply chain aligned with our values\nMaking a Difference\nLinde stands for more than 140 years of technological progress\nCarl von Linde’s curiosity as an inventor, his persistence in the implementation of his ideas and theoretical concepts, as well as his ability to recognize the requirements of his customers and fulfill their need for reliability and quality are all timeless factors for success.\n- 1879\n- 1907\n- 1917\n- 1992\n- 1995\n- 1999\n- 2000\n- 2004\n- 2006\n- 2012\n- 2013\n- 2016\n- 2018\n- 2022\n- 2023\nCarl von Linde himself travels to the United States to establish Linde Air Products as a subsidiary in the U.S. The business becomes successful and soon attracts additional investors.\nIn the turmoil of the First World War, Linde loses the United States subsidiary due to expropriation. Linde Air Products becomes part of the newly formed Union Carbide Corporation.\nThe former Linde division from Union Carbide is spun off as Praxair and goes public. In the subsequent years a couple of major acquisitions strengthen Praxair’s position as one of the top industrial gases businesses in the world.\nPraxair acquires Liquid Carbonic, introducing the company to the carbon dioxide market and giving Praxair a full product line of gases. The acquisition also extends Praxair's presence in South America and other geographies.\nLinde AG regains the rights to use the brand name Linde to do business in the United States.\nLinde acquires the Swedish gases company AGA and therefore expands the business footprint in Northern Europe and South and Middle America.\nPraxair acquires Air Liquide’s Germany business serving large customers in the refining, chemical and steel industries via pipeline systems, as well as supplying smaller customers with bulk, medical, specialty and packaged gases.\nLinde AG acquires BOC. The Linde Group is formed. The successful Material Handling business is sold and becomes part of KION, which is still using Linde as a brand name.\nLinde acquires United States based Lincare, a leading respiratory supplier and also a company with Linde roots.\nPraxair acquires NuCO2, the leading provider of beverage carbonation solutions in the United States giving the company opportunity to continue growing the business in the U.S., enhancing distribution efficiency, and extending NuCO2’s offerings to customers in other regions of the world.\nPraxair acquires Yara International ASA’s European CO2 business, expanding the company’s presence in resilient end-markets such as food and beverage.\nMerger of Equals of Praxair and Linde. To honor the common heritage the combined company is named Linde plc.\nLinde completes the sale of non-core business Gist Limited, a temperature-controlled logistics provider, to Marks & Spencer Group plc.\nLinde acquires the remaining interests in nexAir, LLC, one of the largest independent packaged gas distributors in the United States with 2022 sales of approximately $400 million."
    },
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/about-us/our-expertise",
        "Content_Type": "Website Content",
        "Raw_Text": "Our Expertise\nMaking our world more productive through innovationLinde is Everywhere!\nProven expertise, innovative technologies, and a mission to make our world more productive are helping to make our customers more successful, protect our planet and enable more sustainable lifestyles."
    },
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/about-us/our-expertise/advanced-material-technologies",
        "Content_Type": "Website Content",
        "Raw_Text": "Advanced materials and services that meet rigorous specifications to help your operation remain innovative and competitive.\nAdvanced Material Technologies\nPowering Superior Performance with Advanced Materials\nPushing Boundaries in Tech\nRevolutionizing Industry with Superior Innovations\nLinde Advanced Material Technologies (AMT) is a leading provider of industry solutions. Our gas-atomized 3D printing metal powders offer unrivaled precision, igniting the additive manufacturing revolution. We've curated a robust portfolio of surface coatings and service applications, adept at combatting corrosion, oxidation, and wear, prolonging the lifespan of critical components. We are committed to excellence, reflected in our electronic division's sputtering targets, designed to deliver consistent sputter performance and extended sputter life through meticulous control over purity and microstructure.\nA few highlights:\nHigh-Quality Copper Sputtering Targets, Sustainably Made\nLinde is expanding its presence in the copper market as a global manufacturer of Physical Vapor Deposition (PVD) targets, offering the semiconductor industry a wide range of solutions for sputtering the extremely thin films required for microchip production. Being one of the few companies capable of producing materials that meet the semiconductor industry's strict requirements for quality, purity, and consistency, we have invested in a 6N copper refining line to internally produce raw material used to manufacture top-quality copper PVD targets to our customers. Additionally, our refining production line is operated sustainably, as our raw material supplier primarily uses recycled copper, and all process-generated by-products are fully recycled.\nLearn more about our variety of sputtering targets.\nChrome-Free Corrosion Coatings for Environmental Benefits\nOur wide range of coating materials and application technologies ensures performance equal to or better than hexavalent chrome and cadmium-containing coatings without the associated environmental hazards. Our SERMETELTM chrome-free coating systems protect against corrosion, erosion, and abrasion resistance. Our EXOGARDTM coatings are designed to be an alternative to hard chrome plating and offer superior wear and corrosion protection across all industries.\nLearn more about our chrome-free coating materials.\nFull-Service Thermal Spray Equipment\nGet everything you need for your thermal spray application in one place. Our comprehensive selection includes thermal spray equipment and operational accessories from our TAFATM and GenieTM brands. We also offer maintenance services that you won't find anywhere else.\nMetal Powders for Various Applications\nMetal Additive Manufacturing (AM) is an increasingly popular advanced technology that offers significant improvements in cost, performance, and a variety of additional benefits. Whether your organization is focused on creating prototypes or mass-producing metal AM components, our range of TRUFORMTM metal powders is suitable for various applications in aerospace, medical, energy, and industrial sectors.\nLearn more about our metal powders for additive manufacturing.\nFeatured Industries:\nA reliable supply of high-purity metals and application options to meet growing demands in communications, computing and more.\nLightweight, durable materials that support advanced energy production with greater efficiency and performance.\nMaterials and processes are designed for repeatable results, for parts that perform as expected run after run."
    },
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/about-us/our-expertise/engineering",
        "Content_Type": "Website Content",
        "Raw_Text": "Linde Engineering\nYour Partner for the Production and Processing of Gases\nMore than 4,000 references demonstrate our ability to innovate gas processing for more sustainable gas production. Based on excellent customer relationships, our service experts also capitalize on digital solutions to take performance to the next level – during the entire plant lifecycle.\nA few highlights:\nDriving Force for Decarbonization and Efficiency\nWe empower industry to reach its decarbonization and climate protection goals through a rich portfolio of technologies and services aimed at carbon abatement, early adoption and deployment of emerging technologies and an accelerated transition to cleaner sources of energy. We also have a long tradition of customer and industry engagement geared towards constantly increasing plant efficiency.\nThink Hydrogen. Think Linde.\nWe offer technology for every step in the hydrogen value chain – from source to service. Building on decades of research and countless large-scale projects with innovative hydrogen technologies, we are the partner of choice to drive the energy transition.\nTop-to-Bottom Competence – For Your Peace of Mind\nLINDE PLANTSERV® experts listen, are trustworthy and always go the extra mile – no matter what it takes. At all stages of the asset lifecycle, our aim is to help you solve your plant management challenges. Building on the vast experience we have gained in engineering over 4,000 plants worldwide, our portfolio combines efficiency- and reliability-enhancing services with digital innovations to take plant performance to the next level."
    },
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/about-us/our-expertise/gases",
        "Content_Type": "Website Content",
        "Raw_Text": "Our gases, application technologies and expertise in metal fabrication can help increase efficiency and profitability in welding, cutting, heating, joining, additive manufacturing, surface treatment and more.\nGlobal Gases\nLinde Gases are Everywhere\nOur Gases\nLinde gases are used across just about every industry and country in the worldA few highlights:\nReducing Waste with Additive Manufacturing\nAdditive manufacturing, or 3D printing, has the ability to reduce material waste, increase the durability of performance-critical parts, and bring down manufacturing costs. Many factors impact the success of the AM process, including tight control over the atmosphere in the printing chamber. ADDvance® O₂ precision was designed to do just that - and bring AM to new markets and use cases.\nLearn more about our AM services\nDriving Decarbonization\nWe are helping to power the decarbonization of public transport by delivering the enabling refueling technologies and hydrogen gas for back-to-base refueling stations such as the RVK reference project in Cologne Germany. By building out the H2 refueling infrastructure with flexible and modular refueling solutions, we are contributing to the accelerated uptake of clean mobility with zero tailpipe emissions.\nLearn more about our efforts supporting decarbonization\nPromoting More Sustainable Fish Farming\nOur energy-efficient oxygenation solutions for land-based aquaculture tanks are helping to meet growing global demand for more sustainable forms of fish farming. Not only does SOLVOX® OxyStream raise the efficiency of land-based fish farming, it also improves living conditions for fish while relieving environmental pressures on coastal regions otherwise home to sea-based fish cages.\nLearn more about our oxygenation systems for fish farming\nDigitalization in Action\nSmart sensors and remote management services from Linde play an important role in helping our customers to ensure uninterrupted gas supplies. DIGIGAS® automatically monitors the gas content in cylinders remotely, giving customers anytime, anywhere access to inventory insights. Improved planning and automated replenishment can create further efficiency gains.\nLearn more about our digitalization services\nFeatured Industries\nWe are a global supplier of services and technologies to oil and gas producers, specialized in enhanced oil recovery, energized fluid fracturing and well injection.\nWith our full range of industrial gases, technologies and equipment, we can help improve glass quality and help you save money by burning less fuel more efficiently."
    },
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/about-us/our-people",
        "Content_Type": "Website Content",
        "Raw_Text": "Community Engagement: All over the globe, together we are making an impact.\nOur People\nDriven by a missionSummary & chapters\nLinde's success is built on the talent and dedication of our people, whose expertise, passion, and ambition propels us forward every day.\nWe empower our employees to redefine what's possible, fostering an inclusive culture and providing them with limitless opportunities to grow.\nA word from our CEO\nSanjiv Lamba\nCEO, Linde plc\nLimitless Impact and Opportunities\nTalent, Inclusion & Engagement\nWe work hard to exceed the expectations of our customers, employees, shareholders, suppliers and the communities in which we operate. See some of the awards and recognition that we've earned.\nSearch our vacancies by role and region to find the one that speaks to your interests and experience."
    },
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/about-us/our-people/creating-impact",
        "Content_Type": "Website Content",
        "Raw_Text": "Keith says the opportunity to gain new skills and knowledge daily is what sets Linde apart.\nCreating Impact\nOur people create, innovate, share, and grow—making our world more productive, everywhere.\nHear From Our Inspiring People\nMax's Linde Journey\nMax Hovestadt, Project Manager at Linde Engineering, shares his journey at Linde - opportunities to explore a fulfilling career, reach personal goals, and experience new cultures and communities.\nSummary & chapters\nKirstie's Linde Journey\nKirstie Wolfe, Instrument Technician at Linde's largest hydrogen production site on the U.S. Gulf Coast, shares how she took her future into her own hands to make a difference at Linde.\nLife at Linde\nMany different roles, many different backgrounds - but life at Linde connects our people through shared values and experiences. Here are some of our stories.\nWhat Limitless Means to Our People\nBeing limitless is something each of our employees defines in their own way. When asked, here's what they say.\nKate has used Linde's limitless opportunities to balance her passions for work and love of the outdoors.\nProfessionally, Nicolas' adventurous spirit has led him to take on roles in four countries.\nJisook credits her fearlessness to the strong support system provided by her mentors and friends at Linde.\nIn her 25 years at Linde, Deyanira proven herself to be a great example of a \"limitless\" Linde employee.\nGrowing up, Bryce Decker was fascinated by trucks. Upon graduating from college, he jumped at the opportunity to join Linde."
    },
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/about-us/our-people/talent-inclusion-and-engagement",
        "Content_Type": "Website Content",
        "Raw_Text": "Explore Limitless Opportunities.\nTalent, Inclusion & Engagement\nDriven by a mission\nWe are Limitless Together\nAt Linde, it's our people who make innovation and impact possible. Each one of our 65,000 employees worldwide brings unique skills, perspectives and strengths that enable us to deliver solutions across nearly every end market. From decarbonizing chemical plants to carbonating soda, from coating aircraft engine parts to fueling space flights, from saving babies in neonatal care to providing oxygen to patients at home, we succeed because of what we accomplish together.\nOur core value of inclusion ensures every voice is heard, unlocking potential, fostering collaboration and driving the next wave of innovation and growth. At Linde, we don't just create solutions - we create opportunities to thrive, together.\nWinning Together\nAt Linde, the mission of making our world more productive never ends. We know that achieving this relies on fostering an environment where all voices are valued and diverse perspectives come together to drive performance and deliver results we can all be proud of.\nLimitless Growth\nOur colleagues join Linde for a meaningful career filled with opportunities to grow, innovate and achieve more than they ever imagined. Many spend decades at Linde, pursuing paths they never imagined."
    },
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/about-us/linde-is-everywhere",
        "Content_Type": "Website Content",
        "Raw_Text": "From launching rockets to manufacturing satellites, Linde's industrial gases play a mission-critical role in every stage of space exploration.\n#LindeIsEverywhere\nOur gases, technologies and applications likely impact your life every day, whether you live in a bustling metropolis or a remote town. They help make your vegetables fresher, your drive safer and your smartphone smarter. They’re used in water, on land, in the sky, and even in space. They help our customers reduce their carbon footprint and enable the transition to clean energy. We’re passionate about what we do because we believe in our global community and our role in protecting our planet. We are Linde, and Linde is everywhere. #LindeIsEverywhere\nAdvancing Industries\nOur advanced oxygenation solutions help fish farms enhance productivity while reducing environmental impact.\nOur gases and application technologies can help optimize your workflows, improve efficiency, and support sustainable practices in construction.\nCommitted to You\nSummary & chapters\nKick off the evening with the big game on a big screen. Gases like nitrogen, silane and neon are used in producing your flat-screen television so you can root on your favorite teams with a perfect picture that keeps you in the action. #LindeIsEverywhere\nAn essential component of photosynthesis, carbon dioxide helps flowers reach full bloom. Greenhouse carbon dioxide supply helps increase productivity through improved plant growth and vigor, resulting in earlier flowering and improved stem strength and flower size. #LindeIsEverywhere\nSummary & chapters\nForever has a nice ring to it. Linde's oxygen and argon are used to make gold rings. Oxygen helps extract gold in the mining process and argon is used to protect it as it's melted down. #LindeIsEverywhere\nUsing an innovative liquid oxygen/liquid nitrogen mixture, Linde’s SaFog™ Special Effects Service has created spooky fog and smoke effects for major Hollywood blockbusters. In fact, The Academy of Motion Picture Arts and Sciences honored the technology with a Technical Achievement Award. #LindeIsEverywhere\nSummary & chapters\nYou may have heard through the grapevine that Linde’s gases can be used to make wine. Our sulfur dioxide is used to control fermentation and oxidation, reduce pH levels and destroy micro-organisms on grapes, while dry ice is an ideal way to cool grapes in warm weather. During the bottling process, nitrogen or argon are used to reduce flavors and maintain color, extend shelf life and improve product integrity. #LindeIsEverywhere\nDid you know that Linde gases can be found at your holiday dinner, or at almost any other meal? With well over 100 years’ experience in the food and beverage industry, Linde food-grade gases are commonly used in food freezing and chilling as well as packaging to ensure that fresh, safe, high-quality food reaches the marketplace, and ultimately, your table. #LindeIsEverywhere\nNeon is widely used in lighting, but its role has changed from being a gas glowing in a tube to supporting lasers used to make components of the modern display screens seen in big cities across the world. #LindeIsEverywhere\nCarbon dioxide helps pulp mills reduce chemical loss during the pressing and rewashing stage of pulp and paper production. The reduction of chemical loss helps pulp mills save money and oxygen use helps meet stringent environmental regulations when making the pages of your favorite book. #LindeIsEverywhere\nCelebrate special occasions with an ice cold draft. Our carbon dioxide and draft-grade nitrogen result in the perfect pint – great taste and zero waste – from many of your favorite bars and breweries. #LindeIsEverywhere\nStart your amusement park adventure with Linde. Our nitrogen is often used to help launch roller coasters when they are first put into service, ensuring you experience some pulse-pounding fun. #LindeIsEverywhere\nStay cool during the summer heat with Linde. Our oxygen is used to cut metal air-conditioner parts, while argon and carbon dioxide help weld them. #LindeIsEverywhere\nLinde is flying high! Our argon, oxygen and surface technologies specialty metal materials are used for thermal barrier coatings on power turbines and airplane jet engines. They also help our customers avoid millions of metric tons of CO2 emissions. #LindeIsEverywhere"
    },
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/about-us/leadership",
        "Content_Type": "Website Content",
        "Raw_Text": "Chief Executive Officer\n&\nMember of the Board of\nDirectors\nLeadership\nMeet the Linde Leadership Team\nExecutive Vice President &\nChief Operating Officer\nExecutive Vice President\n&\nChief Financial Officer\nExecutive Vice President\n&\nChief Legal Officer\nSenior Vice President\nChief Human Resources Officer\nSenior Vice President\nAmericas\nSenior Vice President, Chief Accounting Officer, FP&A and Sustainability\nSenior Vice President\nLinde Engineering\nSenior Vice President\nAPAC\nSenior Vice President\nEMEA\nSenior Vice President\nGlobal Functions & Growth\nASEAN & South Asia\nLincare\nSouth Latin America\nLinde Gas US\nEurope North\nEngineering EMEA\nGermany Gases\nNorth Latin America\nGreater China\nSouth Pacific\nCanada\nEngineering Americas\nEurope East\nLinde Gas & Equipment\nUK & Ireland\nHelium & Rare Gas\nEurope South-West\nAdvanced Material Technologies\nNuCO2\nSouth Korea\nEngineering Large Projects\nEngineering APAC\nTax & Treasury\nInformation Technology\nSustainability\nSHEQ\nCompliance\nTechnology\nGlobal Public Affairs & Executive Staff\nInclusion\nOperations Excellence & Productivity\nInvestor Relations\nInternal Audit\nStrategy, M&A and Capex"
    },
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/about-us/corporate-governance",
        "Content_Type": "Website Content",
        "Raw_Text": "Corporate Governance\nWe strive to achieve our goals ethically and with the highest integrity through strong practices and policies.\nWe work to continuously improve our corporate governance process to better serve the interests of all stakeholders. Interaction between management, employees and our business partners is expected to be transparent and respectful, and consistent with our Code of Business Integrity (CBI).\nBoard of Directors\nShareholder Outreach and Communications with the Board\nThe Board has established procedures to enable a shareholder or other interested party to direct a communication to the Board of Directors. Such communications may be confidential or anonymous and may be communicated through the following telephone number or mailing address:\nCommunications with the Board:\nPhone: +44 1483 244 402\nAddress:\nForge\n43 Church Street West,\nWoking,\nSurrey,\nGU21 6HT\nUnited Kingdom"
    },
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/about-us/corporate-governance/board-of-directors",
        "Content_Type": "Website Content",
        "Raw_Text": "Chairman\nExecutive Committee, Chairperson\nBoard of Directors\nProviding Strategic Oversight to Our Businesses and Functions\nDirector\nExecutive Committee, Member\nHuman Capital Committee, Chairperson\nSustainability Committee, Member\nSustainability Committee, Chairperson\nAudit Committee, Member\nExecutive Committee, Member\nNomination and Governance Committee, Member\nHuman Capital Committee, Member\nNomination and Governance Committee, Chairperson\nHuman Capital Committee, Member\nAudit Committee, Member\nNomination and Governance Committee, Member\nAudit Committee, Member\nSustainability Committee, Member\nAudit Committee, Chairperson\nSustainability Committee, Member\nLead Independent Director\nExecutive Committee, Member\nHuman Capital Committee, Member\nNomination and Governance Committee, Member"
    },
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/about-us/corporate-governance/board-committees",
        "Content_Type": "Website Content",
        "Raw_Text": "Committee Chair:\nAlberto Weisser\nCurrent Members:\nDr. Thomas Enders\nDr. Victoria E. Ossadnik\nPaula Rosput Reynolds\nThe Audit Committee assists the Board in its oversight of (a) the independence, qualifications and performance of Linde's independent auditor, (b) the integrity of Linde's financial statements, (c) the performance of Linde's internal audit function, and (d) Linde's compliance with legal and regulatory requirements. In furtherance of these responsibilities, the Audit Committee, among other duties:\n- appoints the independent auditor to audit Linde's financial statements, approves the fees and terms of such engagement, approves any non-audit engagements of the independent auditor, and meets regularly with, and receives various reports from, the independent auditor. The independent auditor reports directly to the Audit Committee;\n- reviews Linde's principal policies for accounting and financial reporting and its disclosure controls and processes, and reviews with management and the independent auditor Linde's financial statements prior to their publication;\n- reviews assessments of Linde's internal controls, the performance of the Internal Audit function, the performance evaluations of the General Auditor and the Chief Compliance Officer, and the guidelines and policies by which Linde undertakes risk assessment and risk management; and\n- reviews the effectiveness of Linde's compliance, business conduct, integrity and ethics programs."
    },
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/about-us/corporate-governance/additional-corporate-governance-documents",
        "Content_Type": "Website Content",
        "Raw_Text": "Additional Corporate Governance Documents\nOur corporate governance structure includes key corporate governance documents and policies.\nThis section includes Articles of Association, Corporate Governance Guidelines and Director Independence Standards."
    },
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/about-us/corporate-values",
        "Content_Type": "Website Content",
        "Raw_Text": "Our Vision, Mission and Values\nOur Mission: Making Our World More Productive\nOur Vision\nTo be the best performing global industrial gases and engineering company, where our people deliver innovative and sustainable solutions for our customers in a connected world.\nOur Values\nSafety\nWe put safety first. We believe all incidents are preventable, and our goal is no harm to people, communities or the environment. We continuously work to improve our safety culture and performance worldwide. Learn more\nIntegrity\nWe are committed to acting with integrity at all times. It’s the essence of our Code – Our Code of Business Integrity – and it is at the heart of everything we do and say at Linde. Ethical, respectful, fair and compliant behaviors build transparency and trust, creating a solid basis for growth and prosperity to the benefit of our employees, customers, suppliers, markets and communities. Learn More\nCommunity\nWe are committed to improving the communities where we live and work. Our charitable contributions and employee volunteerism, support initiatives that make important and sustainable contributions to our world. Learn more\nInclusion\nWe embrace inclusion in order to attract, develop and retain the best talent and build high-performance teams. By hearing all voices and benefiting from diverse opinions, thoughts and perspectives, we achieve our full promise and potential.\nLearn more\nAccountability\nWe hold ourselves accountable for our performance, individually and collectively. We focus both on what we accomplish and how we accomplish it, and we are committed to delivering on individual and company goals."
    },
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/about-us/procurement",
        "Content_Type": "Website Content",
        "Raw_Text": "Procurement\nSupplier Guidance and Standards\nOur procurement teams worldwide make a significant contribution to the performance of Linde and are accountable for the definition and implementation of the overall procurement strategy. Sourcing activities are organized through effective global category management which monitors suppliers and market developments and aggregates Linde's global demand into multinational supply contracts. Our goals and strategies are fully aligned with the respective business functions, and our guidelines and standards regarding quality and safety are embedded in our day-to-day activities and sourcing decisions.\nGlobal Terms and Conditions\nThis should serve as a general orientation for Linde's approach to terms and conditions of purchase. Please reach out to your local business contact for the adapted terms and conditions that apply in your country.\nSupplier Code of Conduct\nThe Supplier Code of Conduct defines Linde's most essential requirements for our Suppliers concerning their responsibilities towards Linde and its stakeholders, their employees, societies, and the environment. Linde’s procurement team receives training on topics covered in the Supplier Code of Conduct and is responsible for communicating Linde's requirements to Suppliers.\nDownload the Supplier Code of Conduct\nThe Supplier Code of Conduct is also available in several other languages. Please view and select from the multiple language versions.\nConflict-Free Materials Supply Policy\nThis policy covers our expectations to suppliers or potential suppliers of conflict minerals or other materials, and their sub-suppliers, to only source materials from environmentally and socially responsible sources and be conflict-free.\nSupplier Tender Portal\nWe use a Supplier Tender Portal known as Pactum that is designed to simplify and streamline how we work and communicate with our suppliers across various Linde geographies and business segments."
    },
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/about-us/procurement/supplier-tender-portal",
        "Content_Type": "Website Content",
        "Raw_Text": "Supplier Tender Portal\nPactum: Our Gateway for Efficient Supplier Collaboration\nThe platform provides an intuitive environment for managing selected procurement demands. Our interactive chatbot guides you as a supplier through each step of the process, ensuring a smooth and user-friendly experience.\nInvitation-Based Participation\nSuppliers are invited via email to participate in relevant tenders based on their profile, capabilities, and existing business relationship with Linde.\nOnce invited, you receive a notification containing all necessary details to access the portal and submit your final proposal.\nTo ensure smooth operation, please make sure your systems can receive emails from the domain: @procurement.linde.com\nWe sincerely appreciate your commitment to supporting our procurement processes. Your collaboration plays a vital role in building a resilient and sustainable supply chain in Linde."
    },
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/about-us/awards-and-recognition",
        "Content_Type": "Website Content",
        "Raw_Text": "Awards & Recognition\nExternal Recognition\nFTSE4Good Index Series Constituent\nJuly 2025 - Linde has been included in the FTSE4Good Index Series for the tenth consecutive year. Created by the global index and data provider FTSE Russell, the FTSE4Good Index Series is designed to measure the performance of companies demonstrating strong environmental, social and governance (ESG) practices.\nWorld's Most Ethical Companies\nApril 2025 - Linde has been included in the 2025 World's Most Ethical Companies® list for the fifth consecutive year. Ethisphere's annual list identifies organizations that prioritize integrity and ethical business practices. In 2025, Ethisphere recognized 136 companies across 19 countries and 44 industries.\nS&P Global Sustainability Yearbook\nApril 2025 - Linde has been included in S&P Global's Sustainability Yearbook 2025. The Sustainability Yearbook recognizes the world's leading companies for sustainable business practices.\nDow Jones Sustainability World Index\nDecember 2024 - Linde has been included in the Dow Jones SustainabilityTM World Index (DJSI World) for the twenty-second consecutive year. Linde has also been included in the DJSI North America.\nFair360’s Top 50 Companies List\nJuly 2024 - Making their Top 50 list for the first time, Linde has been selected by Fair360 as part of its 2024 Top 50 Companies. The list includes companies rated on six key areas of workplace fairness including human capital metrics, leadership accountability, talent programs, workforce practices, supplier fairness and philanthropy.\nFor 2024, Linde ranks #47 of 50 overall, #16 for Top Companies for Asian-American Executives and #7 for Top Companies for Executive Women. Learn more at: https://www.fair360.com/company/linde/\nCDP Leadership Score\nApril 2024 - Linde has been recognized by CDP for its approach to addressing both water security and climate change, achieving a Leadership score in both categories. CDP scored Linde at the Leadership level for its 2023 disclosure, with the company achieving 'A-' for both water security and climate change.\nFortune World's Most Admired Companies\nMarch 2024 - Linde is proud to earn recognition as one of the World's Most Admired Companies for 2024 by Fortune. The list is determined by ratings in criteria such as investment value, quality of management, social responsibility and ability to attract talent.\nBloomberg Gender-Equality Index (GEI)\nMarch 2023 - The 2023 Bloomberg GEI tracks the performance of public companies which are considered leaders in gender equality. Members are selected by Bloomberg following detailed analysis of each company’s disclosure and performance across five key areas: female leadership & talent pipeline, equal pay, inclusive culture, anti-sexual harassment policies and brand. Linde has been included in the Bloomberg GEI since the index was launched in 2018.\nTerra Carta Seal\nJanuary 2023 - Linde has been awarded the Sustainable Market Initiative’s Terra Carta Seal. The Terra Carta Seal, launched at COP26 by HM King Charles III when he was Prince of Wales, recognizes global companies which are driving innovation and demonstrating their commitment to creating sustainable markets. It is awarded to companies whose ambitions are aligned with those of the Terra Carta, a recovery plan for nature, people and planet."
    },
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/clean-energy/our-h2-technology",
        "Content_Type": "Website Content",
        "Raw_Text": "Technology\nInnovating for a Cleaner Future\nOur innovative technologies, including the efficient compression and safe refueling of hydrogen, coupled with decades of experience and unrivaled infrastructure, make us well suited to take an active role and support in the transition to clean energy."
    },
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/clean-energy/our-h2-technology/electrolysis-for-green-hydrogen-production",
        "Content_Type": "Website Content",
        "Raw_Text": "Our Hydrogen Technology\nOur innovative technologies coupled with decades of experience and unrivaled infrastructure, make us well suited to take an active role and support in the transition to clean energy.\nContinue ExploringFrom what can look like a shipping container from the outside, is a system of pumps, storage tanks, vents, a power supply, and other components - at the center of which are the cells. Here, the electrochemical reaction occurs. In its simplest form, a cell contains a positively charged anode and a negatively charged cathode.\nWhen a current is applied, the otherwise stable H2O bonds in water break and hydrogen forms on the cathode with oxygen forming on the anode - a by-product that can be used downstream in industrial settings or released into the atmosphere at no carbon cost.\nSummary & chapters\nWater is not a great conductor of electricity. So, to ensure an energy-efficient process, electrolytes are used instead. Electrolysis technologies differ according to the type of electrolyte used. Currently, the two main technologies are alkaline and PEM (Proton Exchange Membrane) - both of which can deliver high pure hydrogen on-site and on-demand.\nAlkaline\nAlkaline electrolysis is a very well-established technology that uses two electrodes separated by a porous diaphragm and a liquid alkaline solution as the electrolyte. The electrolyte solution allows hydroxide ions to be transported between the electrodes to form oxygen and hydrogen but is not consumed during the reaction.\nThis technology is considered as extremely efficient, reliable, and cost-effective. Capacity can stack in the MW range but drawbacks include using corrosive liquid electrolytes, operation at low current densities and low pressures as well as gas crossover. Linde has installed over 80 Alkaline electrolyzers globally.\nProton Exchange Membrane (PEM)\nPEM electrolysis uses pure water and a solid polymer electrolyte instead of a liquid solution. The electricity splits the water into hydrogen and oxygen. Hydrogen protons pass through the membrane, combining with electrons to form H2 gas on the cathode side.\nPEM electrolyzers are well suited for use with volatile renewable energy sources thanks to their fast ramp-up/down capabilities and their wide dynamic operating range. No corrosive electrolyte is involved, and they operate at high current density which speeds up the breakdown of the water molecule, ultimately affecting production price. Finally, a small footprint and compact system design is a benefit for many on-site industrial applications.\nWhatever the technology type, electrolyzers are always described in terms of their capacity. This represents the maximum operation power and so is measured in Watts (or MW, GW). The higher the wattage, the more hydrogen that electrolyzer can potentially produce.\nFor example, if it takes 50kWh of energy to produce 1 kg of hydrogen, a 10 MW electrolyzer will produce 200 kg in an hour (10,000 / 50) while a 20 MW electrolyzer could produce 400 kg in the same time. Individual cells can be stacked in modules to increase the capacity of any one electrolyzer: a valuable flexible feature for scaling up industrial applications.\nWith green hydrogen playing a critical role in long-term decarbonization goals in traditional as well as new applications, its production via electrolysis is receiving increasing attention from governments worldwide and the number of installation projects is growing rapidly. According to the Global Hydrogen Review 2022 published by the International Energy Agency, Global electrolyzer capacity could exceed 35 GW by the mid-2020s and reach 134 GW by 2030 based on the current project pipeline.\nLinde offers end-to-end solutions and expertise to increase green hydrogen production capacity in electrolysis projects throughout the world. Here are some hydrogen highlights ...\nThe new plant will be the largest electrolyzer installed by Linde globally and will more than double Linde’s green liquid hydrogen production capacity in the United States.\nLinde will build, own and operate the industrial-scale electrolyzer and use hydroelectric power to produce green liquid hydrogen. The plant is expected to start up by 2025. Linde will leverage its existing liquefier and distribution infrastructure to supply existing and new customers. This project is the first of several electrolyzers Linde expects to build in the U.S. to address green liquid hydrogen demand.\nLinde continues to expand its production capacity for green hydrogen by constructing a 24 MW PEM (proton exchange membrane) electrolyzer at its Leuna site. It will supply Linde’s industrial customers through the company’s existing pipeline network. In addition, Linde will distribute liquefied green hydrogen to refueling stations and other industrial customers in the region. The total green hydrogen being produced can fuel approximately six hundred fuel cell buses, driving 40 million kilometers and saving up to 40,000 tons of carbon dioxide tailpipe emissions per year.\nLinde will construct and deliver the electrolyzer with a capacity of around 10,000 kg/day of hydrogen. Green hydrogen will partially replace the gray hydrogen in Yara’s ammonia plant, thereby removing 41,000 tonnes of CO2 emissions annually.\nThe electrolyzer will produce enough hydrogen to create 20,500 tonnes of ammonia per year which can be converted to between 60,000 and 80,000 tonnes of green fertilizer. The plant is Yara’s first step towards decarbonization of the ammonia industry.\nWhite Martins, a Linde company, produced the first certified green hydrogen in South America.\nThe hydrogen received the seal of German certifier TÜV Rheinland after having all stages of its production process examined. Annually, White Martins will be able to receive up to 1.6 MW of solar energy that will be used in the water electrolysis process to produce green hydrogen. In all, 156 tons of green hydrogen per year will be produced on an industrial scale to supply the market in the Brazilian state of Pernambuco."
    },
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/clean-energy/our-h2-technology/fueling-technologies",
        "Content_Type": "Website Content",
        "Raw_Text": "Technology for tomorrow's fuel today\nOur first studies around hydrogen mobility date from the 1970's - we were among the first to develop concepts for the production, storage, transport and fueling of hydrogen.\nWith close to 200 stations built worldwide, we are a one-stop shop for hydrogen fueling solutions - from reliable hydrogen supply through state-of-the-art refueling station systems to customized services. Our entire offering is geared towards low total cost of ownership (TOC) per kilogram of hydrogen fueled.\nOur customers can rely on our expertise to plan, design, build and commission high-performance plants tailored to their individual needs. We offer reliable gaseous (GH2) and liquid hydrogen (LH2) supply models, as well as on-site generation plants.\nThe compression unit is the key component of a hydrogen refueling station. It compresses H2 stored at low pressure to up to 100 MPa. The ideal compression technology depends on a range of factors, such as the initial state of the hydrogen (gaseous or liquid), the station throughput and the type of vehicle to be fueled. Linde offers dedicated compression systems for the most varied requirements. Our proprietary, patented ionic compressor and cryo pump offer reliability, low maintenance and high energy efficiency.\nOur key fueling innovations\nOur Ionic Compressor, Cryo Pump and IC FuelBox are at the core of our leading refueling solutions. Find out more below:"
    },
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/clean-energy/our-h2-technology/carbon-capture2",
        "Content_Type": "Website Content",
        "Raw_Text": "Our Hydrogen Technology\nOur innovative technologies coupled with decades of experience and unrivaled infrastructure, make us well suited to take an active role and support in the transition to clean energy.\nContinue ExploringSummary & chapters\nThe captured gas can be further purified and liquefied for commercial use - for example, as food-grade CO2 for the production of food and beverages, as a feedstock for the production of commodities like methanol or urea or in greenhouses. Alternatively, it can be stored underground (sequestered) as a carbon abatement measure.\nBlue Hydrogen is produced by applying a carbon capture step into the production of hydrogen via steam methane reforming. With this additional step, up to 95% of the carbon can be captured, resulting in low-carbon hydrogen.\nIndustries face the challenge to decarbonize their value chains. Implementing carbon management technology into industrial processes helps future-proof businesses. Watch the video below to find out more."
    },
    {
        "Ticker": "LIN",
        "Company": "Linde plc",
        "Source_URL": "http://www.linde.com/clean-energy/our-h2-technology/natural-gas-grid-conversion",
        "Content_Type": "Website Content",
        "Raw_Text": "Natural Gas Grid Conversion\nConverting the Natural Gas Grid for Hydrogen Delivery\nHydrogen Injection: Converting Pipedreams to Reality\nHydrogen (H2) has the potential to play a key role in connecting different infrastructure layers in a low- or zero-carbon economy. Looking beyond its conventional applications as an industry feedstock in refining and fertilizer production, it is increasingly being heralded as a way to unlock the potential of renewable energy. In simple terms, surplus solar and wind energy can be converted to hydrogen and then to electricity on demand. Or it can be used to power zero-emissions fuel cell vehicles. The question is, how can hydrogen be efficiently delivered to the point of use in large quantities? To date, the market has been deterred by the high costs that would be involved in building a dedicated hydrogen pipeline or delivery infrastructure.\nThe good news is that the infrastructure is already in place. With a few adjustments, H2 can be injected into existing natural gas pipelines and delivered to a wide range of end-point applications. The separation and purification technologies required downstream to extract hydrogen from the pipeline or natural gas blend are already available.\nProven PSA expertise\nThis delivery solution combines Linde's market-leading pressure swing adsorption (PSA) technologies with a custom-designed membrane/permeation technology developed in collaboration with Evonik Industries. Made from hollow fiber, the HISELECT® membranes enable hydrogen to be extracted from natural gas blends at concentrations of up to 90%. Our proven PSA technologies then increase the purity to above 99.9999%. Having already engineered over 900 adsorption plants worldwide, including more than 500 H2 PSA plants, Linde builds on decades of experience in adsorption technologies to deliver the world's highest capacities and on-stream availability levels.\nThis innovative, ready-to-use concept will be demonstrated at our Dormagen real-scale plant near Düsseldorf in Germany.\nHighlights of PSA Combined With HISELECT® Powered by Evonik for Hydrogen\nThis innovative combination of technologies increases the reach and potential of hydrogen as a sustainable source of fuel and energy.\n- Cost-effective, ready-to-run solution connecting to existing natural gas network\n- Hydrogen purity rates in excess of 99.9999%\n- High selectivity for cost-effective supply of hydrogen\n- Robust performance under even the harshest conditions\n- Excellent chemical resistance and high temperature tolerance\nSummary & chapters"
    }
]