[
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/",
        "Content_Type": "Website Content",
        "Raw_Text": "To access these documents, you must first read and accept Micron's electronic non-disclosure agreement. If the Recipient has a written confidentiality agreement with Micron Technology, Inc. you will need to click \"Accept\" at the bottom of this page, but the terms of the written confidentiality agreement will apply.\nON-LINE NONDISCLOSURE AGREEMENT THIS IS A LEGAL AGREEMENT BETWEEN YOU OR THE COMPANY YOU REPRESENT (EACH A \"RECIPENT\") AND MICRON TECHNOLOGY, INC. (\"MTI\") STATING THE TERMS AND CONDITIONS THAT GOVERN THE CONFIDENTIALITY OF INFORMATION POSTED TO OR MADE AVAILABLE THROUGH THE MICRON WEBSITE. PLEASE CAREFULLY READ THIS NONDISCLOSURE AGREEMENT (\"AGREEMENT\") BEFORE CLICKING \"ACCEPT\" AT THE BOTTOM OF THE PAGE. BY CLICKING ON\"ACCEPT\", RECIPIENT IS AGREEING TO BE BOUND BY THE TERMS OF THIS AGREEMENT. IF RECIPIENT DOES NOT AGREE TO THE TERMS OF THIS AGREEMENT, PRESS \"DECLINE\" AND RECIPENT WILL BE UNABLE TO ACCESS CONFIDENTIAL INFORMATION.\n1. Written Nondisclosure Agreement. If Recipient and MTI have entered into a written confidentiality agreement (\"Confidentiality Agreement\") that is in effect as of the date Recipient enters into this Agreement and such Confidentiality Agreement already applies to and governs the Confidential Information (defined below), then the terms of such Confidentiality Agreement shall apply to and govern Recipient’s obligations concerning such Confidential Information and not the terms of this Agreement.\n2. Confidential Information. \"Confidential Information\" means any information or data posted to or made available through MTI’s secure website that is (i) marked or labeled as \"Confidential\" or \"Proprietary\" or with similar designation, or (ii) of a nature that a reasonable person would know such information is confidential. Confidential Information does not include that which:\n(i) is proven by Recipient through competent evidence to rightfully have already been in Recipient's possession at the time of disclosure without an obligation of confidentiality;\n(ii) is or becomes available to the public through no fault or breach on the part of Recipient;\n(iii) is independently developed by Recipient without use of or reference to the Confidential Information;\nor (iv) is rightfully obtained from a third party who has the right to transfer or disclose it to Recipient without restriction.\n3. Purpose of Disclosure and Restriction on Use. Confidential Information is disclosed hereunder strictly for the purpose of Recipient’s internal evaluation and/or to assist Recipient in the implementation of an MTI device or product into a commercial product (\"Purpose\"). Recipient shall use the Confidential Information solely in accordance with the terms of this Agreement to accomplish the Purpose and shall make no further use, in whole or in part, of the Confidential Information.\n4. Non-Disclosure. Recipient agrees to protect the Confidential Information, using at least the same degree of care it uses to protect its own confidential and proprietary information, but in no case with less than reasonable care. Recipient shall not disclose, publish or disseminate Confidential Information to anyone other than those of its employees, agents, contractors and consultants (collectively \"Representatives\") who have a need to know the information in order to accomplish the Purpose and who are bound by a written agreement that prohibits unauthorized disclosure or use of Confidential Information on terms no less restrictive and protective than those contained within this Agreement. Recipient will be responsible for any violation of the terms of this Agreement by its Representatives. Recipient may disclose Confidential Information to the extent required by law, provided Recipient shall promptly notify MTI in writing of such requirement to disclose and Recipient shall cooperate with MTI’s efforts to protect the Confidential Information. Recipient shall notify MTI promptly in writing in the event of any disclosure of the Confidential Information which is not authorized under this Agreement.\n5. Feedback. Notwithstanding any other provision in this Agreement, if Recipient provides any ideas, suggestions or recommendations to MTI regarding Confidential Information (\"Feedback\"), MTI is free to use and incorporate such Feedback in MTI’s products, without payment of royalties or other consideration to Recipient, so long as MTI does not infringe Recipient’s patents, copyrights or trademark rights in the Feedback.\n6. Copies. Recipient shall not make any copies of Confidential Information except as strictly necessary to carry out the above-stated Purpose. Any copies that are made must be identical to the original, may not be modified, and shall be considered the property of MTI.\n7. No License. No Warranty. Except as expressly set forth herein, no license is granted hereunder to any patents, copyrights, mask works, or trademarks either expressly, by implication, estoppel or otherwise. Any such license must be express and in writing from MTI. All Confidential Information shall remain the property of MTI and nothing in this Agreement shall restrict MTI from using, disclosing or disseminating such Confidential Information in any way. CONFIDENTIAL INFORMATION IS DISCLOSED HEREUNDER \"AS IS\" WITHOUT ANY REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS OR WARRANTIES AS TO THE ACCURACY, COMPLETENESS OR UTILITY OF SUCH CONFIDENTIAL INFORMATION.\n8. Termination of Obligations of Confidentiality. This Agreement will become effective on the date Recipient clicks on \"Accept.\" Notwithstanding any termination of this Agreement, the provisions of this Agreement shall continue for a period of five (5) years from the date of each disclosure of Confidential Information. MTI may terminate this Agreement at any time in its sole discretion upon written notice to Recipient (including such notice transmitted through this secure MTI website or via electronic mail to Recipient).\n9. Return of Confidential Information. Within ten (10) business days of MTI’s written request, and at MTI’s option, Recipient shall return or certify to MTI the destruction of the Confidential Information including, without limitation, hard copy and electronic documents and all materials created by Recipient that contain the Confidential Information.\n10. Governing Law and Attorneys' Fees. This Agreement shall be governed by the laws of the State of Idaho, U.S.A., excluding its conflict of laws principles. Recipient hereby consents to the personal jurisdiction of the courts of Idaho for any dispute arising out of this Agreement. In the event of any suit, action or proceeding arising out of or relating to this Agreement, the prevailing party will be entitled to reasonable attorneys' fees and reasonable costs incurred.\n11. Export. Recipient agrees that Confidential Information, or any portion thereof, shall not be exported or re-exported, directly or indirectly, in any form, except in compliance with the U.S. Export Administration Act and all other applicable export control laws or regulations.\n12. Injunctive Relief. Recipient acknowledges and agrees that disclosure of Confidential Information in violation of the terms of this Agreement will cause irreparable harm to MTI for which monetary damages would not be an adequate remedy. Therefore, Recipient agrees that, in addition to any other remedies available to MTI, in the event of any breach or threatened breach of this Agreement, MTI shall be entitled to injunctive relief and Recipient waives any requirement for the posting of a bond in connection therewith.\n13. No Implied Waiver. MTI’s failure or delay in exercising any of its rights hereunder will not constitute a waiver of such rights unless expressly waived in writing.\n14. General. This Agreement:\n(i) may be amended or modified only by an express writing signed by Recipient and an authorized representative of MTI;\n(ii) will not be construed as creating any joint venture, partnership or other form of business association between the parties hereto;\n(iii) is not assignable or delegable in whole or in part by Recipient without the express written consent of MTI;\n(iv) shall inure to the benefit of and be binding upon the parties, their successors, the assigns of MTI and the permitted assigns of Recipient;\nand (v) is in the English language only, which language shall be controlling in all respects, and all versions of this Agreement in any other language shall not be binding on the parties hereto.\n15. Authorized Signatory. The individual clicking on \"Accept\" is entering into this Agreement and accessing Confidential Information either (1) as an individual, and hereby agrees that he or she shall be personally liable to MTI if Confidential Information is disclosed or used in a manner not authorized by this Agreement, or (2) on behalf of an employer or other entity, and hereby represents and warrants that he or she has full legal authority to bind such employer or entity to this Agreement and that such employer or entity shall be legally bound by all of the terms and conditions of this Agreement as Recipient hereunder. IF CONFIDENTIAL INFORMATION IS FOR AN EMPLOYER OR ENTITY, BUT YOU DO NOT HAVE THE LEGAL AUTHORITY TO SO BIND SUCH EMPLOYER OR ENTITY, THEN DO NOT ACCESS, VIEW, READ, OR DOWNLOAD IN ANY WAY CONFIDENTIAL INFORMATION, AND DO NOT CLICK ON \"ACCEPT.\"\nIn order to review documents, you must accept the NDA. If you do not accept these terms, select Decline to exit this menu."
    },
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/markets-industries/data-center-servers/data-center-storage-insights-page-1",
        "Content_Type": "Website Content",
        "Raw_Text": "Invalid input. Special characters are not supported.\n- Storage\n- Memory\nStorage technical resource zone\n- AI\n- SQL\n- No SQL\n- Ceph\n- WEKA\n- VMware vSAN™\n- RocksDB\n- Noisy neighbor\nAI\nMicron’s industry-leading memory and storage technologies enable the latest generation of faster, intelligent global infrastructures that make artificial intelligence (AI), machine learning and generative AI possible. As AI data use continues to explode, storage becomes more central to system performance. Learn how the Micron 9400 SSD and NVIDIA GDS work together to improve performance to enhance the efficiency and responsiveness of your GPU deployments.\nAlso learn how Micron makes AI possible with technology that’s powering a new generation of faster, more intelligent global infrastructures."
    },
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/markets-industries/ai/ai-data-center",
        "Content_Type": "Website Content",
        "Raw_Text": "Invalid input. Special characters are not supported.\n- Near memory\n- Main memory\n- Expansion memory\n- Local SSD data cache\n- Networked data lakes\nUnlocking the potential of AI data centers\nWithin every AI server box lives a pyramid or hierarchy of memory and storage to support fast groundbreaking AI. When built with Micron’s leading technology, data center bottlenecks are reduced, sustainability and power efficiencies are increased, and the total cost of ownership is improved.\nInteract with the pyramid to explore our AI portfolio\n1 As compared to previous 1α node generation.\n2 Based on JEDEC specification.\n3 Measured data in pJ/bit compared to commercially available (June 2023) competitive 3DS modules.\n4 Empirical Intel Memory Latency Checker (Intel MLC) data comparing 128GB MRDIMM 8800MT/s against 128GB RDIMM 6400MT/s.\n5 Empirical Stream Triad data comparing 128GB MRDIMM 8800MT/s against 128GB RDIMM 6400MT/s at 1TB.\n6 Empirical OpenFOAM task energy comparing 128GB MRDIMM 8800MT/s against 128GB RDIMM 6400MT/s.\n7 Compared to LPDDR5X 8533 Mbps\n8 Compared to previous generation\n9 MLC bandwidth using 12-channel 4800MT/s RDIMM+ 4x256GB CZ120 vs. RDIMM only.\n10 The 9650 SSD is the only Gen6 SSD available at the time of announcement. SSDs comparisons are based on currently in-production and available mainstream data center SSDs, from the top five competitive suppliers of OEM data center SSDs by revenue as of May 2025, as per Forward Insights analyst report, “SSD Supplier Status Q1/25”.\n11 The 9650 SSD has improved energy efficiency with two times the performance of the 9550 SSD, Micron’s previous-generation drive, with the same 25W maximum power.\n12 NAND comparisons are based on production NAND from the top five competitive NAND suppliers as of May 2025, as noted in the Forward Insights analyst report, “NAND Quarterly Insights Q1/25.” Comparisons are based on publicly available NAND information and Micron engineering data available at product launch.\n13 SSDs comparisons are based on currently in-production and available Gen5 mainstream data center SSDs from the top five competitive suppliers of OEM data center SSDs by revenue as of May 2025, as per Forward Insights analyst report, “SSD Supplier Status Q1/25”. Performance comparisons are based on publicly available data sheet information and as tested in Micron labs.\n14 Latency and performance workload testing with RocksDB in Micron labs with available competitive SSDs per footnote 13"
    },
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/about/company/suppliers",
        "Content_Type": "Website Content",
        "Raw_Text": "To access these documents, you must first read and accept Micron's electronic non-disclosure agreement. If the Recipient has a written confidentiality agreement with Micron Technology, Inc. you will need to click \"Accept\" at the bottom of this page, but the terms of the written confidentiality agreement will apply.\nON-LINE NONDISCLOSURE AGREEMENT THIS IS A LEGAL AGREEMENT BETWEEN YOU OR THE COMPANY YOU REPRESENT (EACH A \"RECIPENT\") AND MICRON TECHNOLOGY, INC. (\"MTI\") STATING THE TERMS AND CONDITIONS THAT GOVERN THE CONFIDENTIALITY OF INFORMATION POSTED TO OR MADE AVAILABLE THROUGH THE MICRON WEBSITE. PLEASE CAREFULLY READ THIS NONDISCLOSURE AGREEMENT (\"AGREEMENT\") BEFORE CLICKING \"ACCEPT\" AT THE BOTTOM OF THE PAGE. BY CLICKING ON\"ACCEPT\", RECIPIENT IS AGREEING TO BE BOUND BY THE TERMS OF THIS AGREEMENT. IF RECIPIENT DOES NOT AGREE TO THE TERMS OF THIS AGREEMENT, PRESS \"DECLINE\" AND RECIPENT WILL BE UNABLE TO ACCESS CONFIDENTIAL INFORMATION.\n1. Written Nondisclosure Agreement. If Recipient and MTI have entered into a written confidentiality agreement (\"Confidentiality Agreement\") that is in effect as of the date Recipient enters into this Agreement and such Confidentiality Agreement already applies to and governs the Confidential Information (defined below), then the terms of such Confidentiality Agreement shall apply to and govern Recipient’s obligations concerning such Confidential Information and not the terms of this Agreement.\n2. Confidential Information. \"Confidential Information\" means any information or data posted to or made available through MTI’s secure website that is (i) marked or labeled as \"Confidential\" or \"Proprietary\" or with similar designation, or (ii) of a nature that a reasonable person would know such information is confidential. Confidential Information does not include that which:\n(i) is proven by Recipient through competent evidence to rightfully have already been in Recipient's possession at the time of disclosure without an obligation of confidentiality;\n(ii) is or becomes available to the public through no fault or breach on the part of Recipient;\n(iii) is independently developed by Recipient without use of or reference to the Confidential Information;\nor (iv) is rightfully obtained from a third party who has the right to transfer or disclose it to Recipient without restriction.\n3. Purpose of Disclosure and Restriction on Use. Confidential Information is disclosed hereunder strictly for the purpose of Recipient’s internal evaluation and/or to assist Recipient in the implementation of an MTI device or product into a commercial product (\"Purpose\"). Recipient shall use the Confidential Information solely in accordance with the terms of this Agreement to accomplish the Purpose and shall make no further use, in whole or in part, of the Confidential Information.\n4. Non-Disclosure. Recipient agrees to protect the Confidential Information, using at least the same degree of care it uses to protect its own confidential and proprietary information, but in no case with less than reasonable care. Recipient shall not disclose, publish or disseminate Confidential Information to anyone other than those of its employees, agents, contractors and consultants (collectively \"Representatives\") who have a need to know the information in order to accomplish the Purpose and who are bound by a written agreement that prohibits unauthorized disclosure or use of Confidential Information on terms no less restrictive and protective than those contained within this Agreement. Recipient will be responsible for any violation of the terms of this Agreement by its Representatives. Recipient may disclose Confidential Information to the extent required by law, provided Recipient shall promptly notify MTI in writing of such requirement to disclose and Recipient shall cooperate with MTI’s efforts to protect the Confidential Information. Recipient shall notify MTI promptly in writing in the event of any disclosure of the Confidential Information which is not authorized under this Agreement.\n5. Feedback. Notwithstanding any other provision in this Agreement, if Recipient provides any ideas, suggestions or recommendations to MTI regarding Confidential Information (\"Feedback\"), MTI is free to use and incorporate such Feedback in MTI’s products, without payment of royalties or other consideration to Recipient, so long as MTI does not infringe Recipient’s patents, copyrights or trademark rights in the Feedback.\n6. Copies. Recipient shall not make any copies of Confidential Information except as strictly necessary to carry out the above-stated Purpose. Any copies that are made must be identical to the original, may not be modified, and shall be considered the property of MTI.\n7. No License. No Warranty. Except as expressly set forth herein, no license is granted hereunder to any patents, copyrights, mask works, or trademarks either expressly, by implication, estoppel or otherwise. Any such license must be express and in writing from MTI. All Confidential Information shall remain the property of MTI and nothing in this Agreement shall restrict MTI from using, disclosing or disseminating such Confidential Information in any way. CONFIDENTIAL INFORMATION IS DISCLOSED HEREUNDER \"AS IS\" WITHOUT ANY REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS OR WARRANTIES AS TO THE ACCURACY, COMPLETENESS OR UTILITY OF SUCH CONFIDENTIAL INFORMATION.\n8. Termination of Obligations of Confidentiality. This Agreement will become effective on the date Recipient clicks on \"Accept.\" Notwithstanding any termination of this Agreement, the provisions of this Agreement shall continue for a period of five (5) years from the date of each disclosure of Confidential Information. MTI may terminate this Agreement at any time in its sole discretion upon written notice to Recipient (including such notice transmitted through this secure MTI website or via electronic mail to Recipient).\n9. Return of Confidential Information. Within ten (10) business days of MTI’s written request, and at MTI’s option, Recipient shall return or certify to MTI the destruction of the Confidential Information including, without limitation, hard copy and electronic documents and all materials created by Recipient that contain the Confidential Information.\n10. Governing Law and Attorneys' Fees. This Agreement shall be governed by the laws of the State of Idaho, U.S.A., excluding its conflict of laws principles. Recipient hereby consents to the personal jurisdiction of the courts of Idaho for any dispute arising out of this Agreement. In the event of any suit, action or proceeding arising out of or relating to this Agreement, the prevailing party will be entitled to reasonable attorneys' fees and reasonable costs incurred.\n11. Export. Recipient agrees that Confidential Information, or any portion thereof, shall not be exported or re-exported, directly or indirectly, in any form, except in compliance with the U.S. Export Administration Act and all other applicable export control laws or regulations.\n12. Injunctive Relief. Recipient acknowledges and agrees that disclosure of Confidential Information in violation of the terms of this Agreement will cause irreparable harm to MTI for which monetary damages would not be an adequate remedy. Therefore, Recipient agrees that, in addition to any other remedies available to MTI, in the event of any breach or threatened breach of this Agreement, MTI shall be entitled to injunctive relief and Recipient waives any requirement for the posting of a bond in connection therewith.\n13. No Implied Waiver. MTI’s failure or delay in exercising any of its rights hereunder will not constitute a waiver of such rights unless expressly waived in writing.\n14. General. This Agreement:\n(i) may be amended or modified only by an express writing signed by Recipient and an authorized representative of MTI;\n(ii) will not be construed as creating any joint venture, partnership or other form of business association between the parties hereto;\n(iii) is not assignable or delegable in whole or in part by Recipient without the express written consent of MTI;\n(iv) shall inure to the benefit of and be binding upon the parties, their successors, the assigns of MTI and the permitted assigns of Recipient;\nand (v) is in the English language only, which language shall be controlling in all respects, and all versions of this Agreement in any other language shall not be binding on the parties hereto.\n15. Authorized Signatory. The individual clicking on \"Accept\" is entering into this Agreement and accessing Confidential Information either (1) as an individual, and hereby agrees that he or she shall be personally liable to MTI if Confidential Information is disclosed or used in a manner not authorized by this Agreement, or (2) on behalf of an employer or other entity, and hereby represents and warrants that he or she has full legal authority to bind such employer or entity to this Agreement and that such employer or entity shall be legally bound by all of the terms and conditions of this Agreement as Recipient hereunder. IF CONFIDENTIAL INFORMATION IS FOR AN EMPLOYER OR ENTITY, BUT YOU DO NOT HAVE THE LEGAL AUTHORITY TO SO BIND SUCH EMPLOYER OR ENTITY, THEN DO NOT ACCESS, VIEW, READ, OR DOWNLOAD IN ANY WAY CONFIDENTIAL INFORMATION, AND DO NOT CLICK ON \"ACCEPT.\"\nIn order to review documents, you must accept the NDA. If you do not accept these terms, select Decline to exit this menu."
    },
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/partners/technology-enablement-programs",
        "Content_Type": "Website Content",
        "Raw_Text": "To access these documents, you must first read and accept Micron's electronic non-disclosure agreement. If the Recipient has a written confidentiality agreement with Micron Technology, Inc. you will need to click \"Accept\" at the bottom of this page, but the terms of the written confidentiality agreement will apply.\nON-LINE NONDISCLOSURE AGREEMENT THIS IS A LEGAL AGREEMENT BETWEEN YOU OR THE COMPANY YOU REPRESENT (EACH A \"RECIPENT\") AND MICRON TECHNOLOGY, INC. (\"MTI\") STATING THE TERMS AND CONDITIONS THAT GOVERN THE CONFIDENTIALITY OF INFORMATION POSTED TO OR MADE AVAILABLE THROUGH THE MICRON WEBSITE. PLEASE CAREFULLY READ THIS NONDISCLOSURE AGREEMENT (\"AGREEMENT\") BEFORE CLICKING \"ACCEPT\" AT THE BOTTOM OF THE PAGE. BY CLICKING ON\"ACCEPT\", RECIPIENT IS AGREEING TO BE BOUND BY THE TERMS OF THIS AGREEMENT. IF RECIPIENT DOES NOT AGREE TO THE TERMS OF THIS AGREEMENT, PRESS \"DECLINE\" AND RECIPENT WILL BE UNABLE TO ACCESS CONFIDENTIAL INFORMATION.\n1. Written Nondisclosure Agreement. If Recipient and MTI have entered into a written confidentiality agreement (\"Confidentiality Agreement\") that is in effect as of the date Recipient enters into this Agreement and such Confidentiality Agreement already applies to and governs the Confidential Information (defined below), then the terms of such Confidentiality Agreement shall apply to and govern Recipient’s obligations concerning such Confidential Information and not the terms of this Agreement.\n2. Confidential Information. \"Confidential Information\" means any information or data posted to or made available through MTI’s secure website that is (i) marked or labeled as \"Confidential\" or \"Proprietary\" or with similar designation, or (ii) of a nature that a reasonable person would know such information is confidential. Confidential Information does not include that which:\n(i) is proven by Recipient through competent evidence to rightfully have already been in Recipient's possession at the time of disclosure without an obligation of confidentiality;\n(ii) is or becomes available to the public through no fault or breach on the part of Recipient;\n(iii) is independently developed by Recipient without use of or reference to the Confidential Information;\nor (iv) is rightfully obtained from a third party who has the right to transfer or disclose it to Recipient without restriction.\n3. Purpose of Disclosure and Restriction on Use. Confidential Information is disclosed hereunder strictly for the purpose of Recipient’s internal evaluation and/or to assist Recipient in the implementation of an MTI device or product into a commercial product (\"Purpose\"). Recipient shall use the Confidential Information solely in accordance with the terms of this Agreement to accomplish the Purpose and shall make no further use, in whole or in part, of the Confidential Information.\n4. Non-Disclosure. Recipient agrees to protect the Confidential Information, using at least the same degree of care it uses to protect its own confidential and proprietary information, but in no case with less than reasonable care. Recipient shall not disclose, publish or disseminate Confidential Information to anyone other than those of its employees, agents, contractors and consultants (collectively \"Representatives\") who have a need to know the information in order to accomplish the Purpose and who are bound by a written agreement that prohibits unauthorized disclosure or use of Confidential Information on terms no less restrictive and protective than those contained within this Agreement. Recipient will be responsible for any violation of the terms of this Agreement by its Representatives. Recipient may disclose Confidential Information to the extent required by law, provided Recipient shall promptly notify MTI in writing of such requirement to disclose and Recipient shall cooperate with MTI’s efforts to protect the Confidential Information. Recipient shall notify MTI promptly in writing in the event of any disclosure of the Confidential Information which is not authorized under this Agreement.\n5. Feedback. Notwithstanding any other provision in this Agreement, if Recipient provides any ideas, suggestions or recommendations to MTI regarding Confidential Information (\"Feedback\"), MTI is free to use and incorporate such Feedback in MTI’s products, without payment of royalties or other consideration to Recipient, so long as MTI does not infringe Recipient’s patents, copyrights or trademark rights in the Feedback.\n6. Copies. Recipient shall not make any copies of Confidential Information except as strictly necessary to carry out the above-stated Purpose. Any copies that are made must be identical to the original, may not be modified, and shall be considered the property of MTI.\n7. No License. No Warranty. Except as expressly set forth herein, no license is granted hereunder to any patents, copyrights, mask works, or trademarks either expressly, by implication, estoppel or otherwise. Any such license must be express and in writing from MTI. All Confidential Information shall remain the property of MTI and nothing in this Agreement shall restrict MTI from using, disclosing or disseminating such Confidential Information in any way. CONFIDENTIAL INFORMATION IS DISCLOSED HEREUNDER \"AS IS\" WITHOUT ANY REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS OR WARRANTIES AS TO THE ACCURACY, COMPLETENESS OR UTILITY OF SUCH CONFIDENTIAL INFORMATION.\n8. Termination of Obligations of Confidentiality. This Agreement will become effective on the date Recipient clicks on \"Accept.\" Notwithstanding any termination of this Agreement, the provisions of this Agreement shall continue for a period of five (5) years from the date of each disclosure of Confidential Information. MTI may terminate this Agreement at any time in its sole discretion upon written notice to Recipient (including such notice transmitted through this secure MTI website or via electronic mail to Recipient).\n9. Return of Confidential Information. Within ten (10) business days of MTI’s written request, and at MTI’s option, Recipient shall return or certify to MTI the destruction of the Confidential Information including, without limitation, hard copy and electronic documents and all materials created by Recipient that contain the Confidential Information.\n10. Governing Law and Attorneys' Fees. This Agreement shall be governed by the laws of the State of Idaho, U.S.A., excluding its conflict of laws principles. Recipient hereby consents to the personal jurisdiction of the courts of Idaho for any dispute arising out of this Agreement. In the event of any suit, action or proceeding arising out of or relating to this Agreement, the prevailing party will be entitled to reasonable attorneys' fees and reasonable costs incurred.\n11. Export. Recipient agrees that Confidential Information, or any portion thereof, shall not be exported or re-exported, directly or indirectly, in any form, except in compliance with the U.S. Export Administration Act and all other applicable export control laws or regulations.\n12. Injunctive Relief. Recipient acknowledges and agrees that disclosure of Confidential Information in violation of the terms of this Agreement will cause irreparable harm to MTI for which monetary damages would not be an adequate remedy. Therefore, Recipient agrees that, in addition to any other remedies available to MTI, in the event of any breach or threatened breach of this Agreement, MTI shall be entitled to injunctive relief and Recipient waives any requirement for the posting of a bond in connection therewith.\n13. No Implied Waiver. MTI’s failure or delay in exercising any of its rights hereunder will not constitute a waiver of such rights unless expressly waived in writing.\n14. General. This Agreement:\n(i) may be amended or modified only by an express writing signed by Recipient and an authorized representative of MTI;\n(ii) will not be construed as creating any joint venture, partnership or other form of business association between the parties hereto;\n(iii) is not assignable or delegable in whole or in part by Recipient without the express written consent of MTI;\n(iv) shall inure to the benefit of and be binding upon the parties, their successors, the assigns of MTI and the permitted assigns of Recipient;\nand (v) is in the English language only, which language shall be controlling in all respects, and all versions of this Agreement in any other language shall not be binding on the parties hereto.\n15. Authorized Signatory. The individual clicking on \"Accept\" is entering into this Agreement and accessing Confidential Information either (1) as an individual, and hereby agrees that he or she shall be personally liable to MTI if Confidential Information is disclosed or used in a manner not authorized by this Agreement, or (2) on behalf of an employer or other entity, and hereby represents and warrants that he or she has full legal authority to bind such employer or entity to this Agreement and that such employer or entity shall be legally bound by all of the terms and conditions of this Agreement as Recipient hereunder. IF CONFIDENTIAL INFORMATION IS FOR AN EMPLOYER OR ENTITY, BUT YOU DO NOT HAVE THE LEGAL AUTHORITY TO SO BIND SUCH EMPLOYER OR ENTITY, THEN DO NOT ACCESS, VIEW, READ, OR DOWNLOAD IN ANY WAY CONFIDENTIAL INFORMATION, AND DO NOT CLICK ON \"ACCEPT.\"\nIn order to review documents, you must accept the NDA. If you do not accept these terms, select Decline to exit this menu."
    },
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/partners/technology-enablement-programs/ddr5-tep-resources",
        "Content_Type": "Website Content",
        "Raw_Text": "To access these documents, you must first read and accept Micron's electronic non-disclosure agreement. If the Recipient has a written confidentiality agreement with Micron Technology, Inc. you will need to click \"Accept\" at the bottom of this page, but the terms of the written confidentiality agreement will apply.\nON-LINE NONDISCLOSURE AGREEMENT THIS IS A LEGAL AGREEMENT BETWEEN YOU OR THE COMPANY YOU REPRESENT (EACH A \"RECIPENT\") AND MICRON TECHNOLOGY, INC. (\"MTI\") STATING THE TERMS AND CONDITIONS THAT GOVERN THE CONFIDENTIALITY OF INFORMATION POSTED TO OR MADE AVAILABLE THROUGH THE MICRON WEBSITE. PLEASE CAREFULLY READ THIS NONDISCLOSURE AGREEMENT (\"AGREEMENT\") BEFORE CLICKING \"ACCEPT\" AT THE BOTTOM OF THE PAGE. BY CLICKING ON\"ACCEPT\", RECIPIENT IS AGREEING TO BE BOUND BY THE TERMS OF THIS AGREEMENT. IF RECIPIENT DOES NOT AGREE TO THE TERMS OF THIS AGREEMENT, PRESS \"DECLINE\" AND RECIPENT WILL BE UNABLE TO ACCESS CONFIDENTIAL INFORMATION.\n1. Written Nondisclosure Agreement. If Recipient and MTI have entered into a written confidentiality agreement (\"Confidentiality Agreement\") that is in effect as of the date Recipient enters into this Agreement and such Confidentiality Agreement already applies to and governs the Confidential Information (defined below), then the terms of such Confidentiality Agreement shall apply to and govern Recipient’s obligations concerning such Confidential Information and not the terms of this Agreement.\n2. Confidential Information. \"Confidential Information\" means any information or data posted to or made available through MTI’s secure website that is (i) marked or labeled as \"Confidential\" or \"Proprietary\" or with similar designation, or (ii) of a nature that a reasonable person would know such information is confidential. Confidential Information does not include that which:\n(i) is proven by Recipient through competent evidence to rightfully have already been in Recipient's possession at the time of disclosure without an obligation of confidentiality;\n(ii) is or becomes available to the public through no fault or breach on the part of Recipient;\n(iii) is independently developed by Recipient without use of or reference to the Confidential Information;\nor (iv) is rightfully obtained from a third party who has the right to transfer or disclose it to Recipient without restriction.\n3. Purpose of Disclosure and Restriction on Use. Confidential Information is disclosed hereunder strictly for the purpose of Recipient’s internal evaluation and/or to assist Recipient in the implementation of an MTI device or product into a commercial product (\"Purpose\"). Recipient shall use the Confidential Information solely in accordance with the terms of this Agreement to accomplish the Purpose and shall make no further use, in whole or in part, of the Confidential Information.\n4. Non-Disclosure. Recipient agrees to protect the Confidential Information, using at least the same degree of care it uses to protect its own confidential and proprietary information, but in no case with less than reasonable care. Recipient shall not disclose, publish or disseminate Confidential Information to anyone other than those of its employees, agents, contractors and consultants (collectively \"Representatives\") who have a need to know the information in order to accomplish the Purpose and who are bound by a written agreement that prohibits unauthorized disclosure or use of Confidential Information on terms no less restrictive and protective than those contained within this Agreement. Recipient will be responsible for any violation of the terms of this Agreement by its Representatives. Recipient may disclose Confidential Information to the extent required by law, provided Recipient shall promptly notify MTI in writing of such requirement to disclose and Recipient shall cooperate with MTI’s efforts to protect the Confidential Information. Recipient shall notify MTI promptly in writing in the event of any disclosure of the Confidential Information which is not authorized under this Agreement.\n5. Feedback. Notwithstanding any other provision in this Agreement, if Recipient provides any ideas, suggestions or recommendations to MTI regarding Confidential Information (\"Feedback\"), MTI is free to use and incorporate such Feedback in MTI’s products, without payment of royalties or other consideration to Recipient, so long as MTI does not infringe Recipient’s patents, copyrights or trademark rights in the Feedback.\n6. Copies. Recipient shall not make any copies of Confidential Information except as strictly necessary to carry out the above-stated Purpose. Any copies that are made must be identical to the original, may not be modified, and shall be considered the property of MTI.\n7. No License. No Warranty. Except as expressly set forth herein, no license is granted hereunder to any patents, copyrights, mask works, or trademarks either expressly, by implication, estoppel or otherwise. Any such license must be express and in writing from MTI. All Confidential Information shall remain the property of MTI and nothing in this Agreement shall restrict MTI from using, disclosing or disseminating such Confidential Information in any way. CONFIDENTIAL INFORMATION IS DISCLOSED HEREUNDER \"AS IS\" WITHOUT ANY REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS OR WARRANTIES AS TO THE ACCURACY, COMPLETENESS OR UTILITY OF SUCH CONFIDENTIAL INFORMATION.\n8. Termination of Obligations of Confidentiality. This Agreement will become effective on the date Recipient clicks on \"Accept.\" Notwithstanding any termination of this Agreement, the provisions of this Agreement shall continue for a period of five (5) years from the date of each disclosure of Confidential Information. MTI may terminate this Agreement at any time in its sole discretion upon written notice to Recipient (including such notice transmitted through this secure MTI website or via electronic mail to Recipient).\n9. Return of Confidential Information. Within ten (10) business days of MTI’s written request, and at MTI’s option, Recipient shall return or certify to MTI the destruction of the Confidential Information including, without limitation, hard copy and electronic documents and all materials created by Recipient that contain the Confidential Information.\n10. Governing Law and Attorneys' Fees. This Agreement shall be governed by the laws of the State of Idaho, U.S.A., excluding its conflict of laws principles. Recipient hereby consents to the personal jurisdiction of the courts of Idaho for any dispute arising out of this Agreement. In the event of any suit, action or proceeding arising out of or relating to this Agreement, the prevailing party will be entitled to reasonable attorneys' fees and reasonable costs incurred.\n11. Export. Recipient agrees that Confidential Information, or any portion thereof, shall not be exported or re-exported, directly or indirectly, in any form, except in compliance with the U.S. Export Administration Act and all other applicable export control laws or regulations.\n12. Injunctive Relief. Recipient acknowledges and agrees that disclosure of Confidential Information in violation of the terms of this Agreement will cause irreparable harm to MTI for which monetary damages would not be an adequate remedy. Therefore, Recipient agrees that, in addition to any other remedies available to MTI, in the event of any breach or threatened breach of this Agreement, MTI shall be entitled to injunctive relief and Recipient waives any requirement for the posting of a bond in connection therewith.\n13. No Implied Waiver. MTI’s failure or delay in exercising any of its rights hereunder will not constitute a waiver of such rights unless expressly waived in writing.\n14. General. This Agreement:\n(i) may be amended or modified only by an express writing signed by Recipient and an authorized representative of MTI;\n(ii) will not be construed as creating any joint venture, partnership or other form of business association between the parties hereto;\n(iii) is not assignable or delegable in whole or in part by Recipient without the express written consent of MTI;\n(iv) shall inure to the benefit of and be binding upon the parties, their successors, the assigns of MTI and the permitted assigns of Recipient;\nand (v) is in the English language only, which language shall be controlling in all respects, and all versions of this Agreement in any other language shall not be binding on the parties hereto.\n15. Authorized Signatory. The individual clicking on \"Accept\" is entering into this Agreement and accessing Confidential Information either (1) as an individual, and hereby agrees that he or she shall be personally liable to MTI if Confidential Information is disclosed or used in a manner not authorized by this Agreement, or (2) on behalf of an employer or other entity, and hereby represents and warrants that he or she has full legal authority to bind such employer or entity to this Agreement and that such employer or entity shall be legally bound by all of the terms and conditions of this Agreement as Recipient hereunder. IF CONFIDENTIAL INFORMATION IS FOR AN EMPLOYER OR ENTITY, BUT YOU DO NOT HAVE THE LEGAL AUTHORITY TO SO BIND SUCH EMPLOYER OR ENTITY, THEN DO NOT ACCESS, VIEW, READ, OR DOWNLOAD IN ANY WAY CONFIDENTIAL INFORMATION, AND DO NOT CLICK ON \"ACCEPT.\"\nIn order to review documents, you must accept the NDA. If you do not accept these terms, select Decline to exit this menu."
    },
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/partners/technology-enablement-programs/cxl-tep-resources",
        "Content_Type": "Website Content",
        "Raw_Text": "To access these documents, you must first read and accept Micron's electronic non-disclosure agreement. If the Recipient has a written confidentiality agreement with Micron Technology, Inc. you will need to click \"Accept\" at the bottom of this page, but the terms of the written confidentiality agreement will apply.\nON-LINE NONDISCLOSURE AGREEMENT THIS IS A LEGAL AGREEMENT BETWEEN YOU OR THE COMPANY YOU REPRESENT (EACH A \"RECIPENT\") AND MICRON TECHNOLOGY, INC. (\"MTI\") STATING THE TERMS AND CONDITIONS THAT GOVERN THE CONFIDENTIALITY OF INFORMATION POSTED TO OR MADE AVAILABLE THROUGH THE MICRON WEBSITE. PLEASE CAREFULLY READ THIS NONDISCLOSURE AGREEMENT (\"AGREEMENT\") BEFORE CLICKING \"ACCEPT\" AT THE BOTTOM OF THE PAGE. BY CLICKING ON\"ACCEPT\", RECIPIENT IS AGREEING TO BE BOUND BY THE TERMS OF THIS AGREEMENT. IF RECIPIENT DOES NOT AGREE TO THE TERMS OF THIS AGREEMENT, PRESS \"DECLINE\" AND RECIPENT WILL BE UNABLE TO ACCESS CONFIDENTIAL INFORMATION.\n1. Written Nondisclosure Agreement. If Recipient and MTI have entered into a written confidentiality agreement (\"Confidentiality Agreement\") that is in effect as of the date Recipient enters into this Agreement and such Confidentiality Agreement already applies to and governs the Confidential Information (defined below), then the terms of such Confidentiality Agreement shall apply to and govern Recipient’s obligations concerning such Confidential Information and not the terms of this Agreement.\n2. Confidential Information. \"Confidential Information\" means any information or data posted to or made available through MTI’s secure website that is (i) marked or labeled as \"Confidential\" or \"Proprietary\" or with similar designation, or (ii) of a nature that a reasonable person would know such information is confidential. Confidential Information does not include that which:\n(i) is proven by Recipient through competent evidence to rightfully have already been in Recipient's possession at the time of disclosure without an obligation of confidentiality;\n(ii) is or becomes available to the public through no fault or breach on the part of Recipient;\n(iii) is independently developed by Recipient without use of or reference to the Confidential Information;\nor (iv) is rightfully obtained from a third party who has the right to transfer or disclose it to Recipient without restriction.\n3. Purpose of Disclosure and Restriction on Use. Confidential Information is disclosed hereunder strictly for the purpose of Recipient’s internal evaluation and/or to assist Recipient in the implementation of an MTI device or product into a commercial product (\"Purpose\"). Recipient shall use the Confidential Information solely in accordance with the terms of this Agreement to accomplish the Purpose and shall make no further use, in whole or in part, of the Confidential Information.\n4. Non-Disclosure. Recipient agrees to protect the Confidential Information, using at least the same degree of care it uses to protect its own confidential and proprietary information, but in no case with less than reasonable care. Recipient shall not disclose, publish or disseminate Confidential Information to anyone other than those of its employees, agents, contractors and consultants (collectively \"Representatives\") who have a need to know the information in order to accomplish the Purpose and who are bound by a written agreement that prohibits unauthorized disclosure or use of Confidential Information on terms no less restrictive and protective than those contained within this Agreement. Recipient will be responsible for any violation of the terms of this Agreement by its Representatives. Recipient may disclose Confidential Information to the extent required by law, provided Recipient shall promptly notify MTI in writing of such requirement to disclose and Recipient shall cooperate with MTI’s efforts to protect the Confidential Information. Recipient shall notify MTI promptly in writing in the event of any disclosure of the Confidential Information which is not authorized under this Agreement.\n5. Feedback. Notwithstanding any other provision in this Agreement, if Recipient provides any ideas, suggestions or recommendations to MTI regarding Confidential Information (\"Feedback\"), MTI is free to use and incorporate such Feedback in MTI’s products, without payment of royalties or other consideration to Recipient, so long as MTI does not infringe Recipient’s patents, copyrights or trademark rights in the Feedback.\n6. Copies. Recipient shall not make any copies of Confidential Information except as strictly necessary to carry out the above-stated Purpose. Any copies that are made must be identical to the original, may not be modified, and shall be considered the property of MTI.\n7. No License. No Warranty. Except as expressly set forth herein, no license is granted hereunder to any patents, copyrights, mask works, or trademarks either expressly, by implication, estoppel or otherwise. Any such license must be express and in writing from MTI. All Confidential Information shall remain the property of MTI and nothing in this Agreement shall restrict MTI from using, disclosing or disseminating such Confidential Information in any way. CONFIDENTIAL INFORMATION IS DISCLOSED HEREUNDER \"AS IS\" WITHOUT ANY REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS OR WARRANTIES AS TO THE ACCURACY, COMPLETENESS OR UTILITY OF SUCH CONFIDENTIAL INFORMATION.\n8. Termination of Obligations of Confidentiality. This Agreement will become effective on the date Recipient clicks on \"Accept.\" Notwithstanding any termination of this Agreement, the provisions of this Agreement shall continue for a period of five (5) years from the date of each disclosure of Confidential Information. MTI may terminate this Agreement at any time in its sole discretion upon written notice to Recipient (including such notice transmitted through this secure MTI website or via electronic mail to Recipient).\n9. Return of Confidential Information. Within ten (10) business days of MTI’s written request, and at MTI’s option, Recipient shall return or certify to MTI the destruction of the Confidential Information including, without limitation, hard copy and electronic documents and all materials created by Recipient that contain the Confidential Information.\n10. Governing Law and Attorneys' Fees. This Agreement shall be governed by the laws of the State of Idaho, U.S.A., excluding its conflict of laws principles. Recipient hereby consents to the personal jurisdiction of the courts of Idaho for any dispute arising out of this Agreement. In the event of any suit, action or proceeding arising out of or relating to this Agreement, the prevailing party will be entitled to reasonable attorneys' fees and reasonable costs incurred.\n11. Export. Recipient agrees that Confidential Information, or any portion thereof, shall not be exported or re-exported, directly or indirectly, in any form, except in compliance with the U.S. Export Administration Act and all other applicable export control laws or regulations.\n12. Injunctive Relief. Recipient acknowledges and agrees that disclosure of Confidential Information in violation of the terms of this Agreement will cause irreparable harm to MTI for which monetary damages would not be an adequate remedy. Therefore, Recipient agrees that, in addition to any other remedies available to MTI, in the event of any breach or threatened breach of this Agreement, MTI shall be entitled to injunctive relief and Recipient waives any requirement for the posting of a bond in connection therewith.\n13. No Implied Waiver. MTI’s failure or delay in exercising any of its rights hereunder will not constitute a waiver of such rights unless expressly waived in writing.\n14. General. This Agreement:\n(i) may be amended or modified only by an express writing signed by Recipient and an authorized representative of MTI;\n(ii) will not be construed as creating any joint venture, partnership or other form of business association between the parties hereto;\n(iii) is not assignable or delegable in whole or in part by Recipient without the express written consent of MTI;\n(iv) shall inure to the benefit of and be binding upon the parties, their successors, the assigns of MTI and the permitted assigns of Recipient;\nand (v) is in the English language only, which language shall be controlling in all respects, and all versions of this Agreement in any other language shall not be binding on the parties hereto.\n15. Authorized Signatory. The individual clicking on \"Accept\" is entering into this Agreement and accessing Confidential Information either (1) as an individual, and hereby agrees that he or she shall be personally liable to MTI if Confidential Information is disclosed or used in a manner not authorized by this Agreement, or (2) on behalf of an employer or other entity, and hereby represents and warrants that he or she has full legal authority to bind such employer or entity to this Agreement and that such employer or entity shall be legally bound by all of the terms and conditions of this Agreement as Recipient hereunder. IF CONFIDENTIAL INFORMATION IS FOR AN EMPLOYER OR ENTITY, BUT YOU DO NOT HAVE THE LEGAL AUTHORITY TO SO BIND SUCH EMPLOYER OR ENTITY, THEN DO NOT ACCESS, VIEW, READ, OR DOWNLOAD IN ANY WAY CONFIDENTIAL INFORMATION, AND DO NOT CLICK ON \"ACCEPT.\"\nIn order to review documents, you must accept the NDA. If you do not accept these terms, select Decline to exit this menu."
    },
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/partners/technology-enablement-programs/socamm2-tep-resources",
        "Content_Type": "Website Content",
        "Raw_Text": "To access these documents, you must first read and accept Micron's electronic non-disclosure agreement. If the Recipient has a written confidentiality agreement with Micron Technology, Inc. you will need to click \"Accept\" at the bottom of this page, but the terms of the written confidentiality agreement will apply.\nON-LINE NONDISCLOSURE AGREEMENT THIS IS A LEGAL AGREEMENT BETWEEN YOU OR THE COMPANY YOU REPRESENT (EACH A \"RECIPENT\") AND MICRON TECHNOLOGY, INC. (\"MTI\") STATING THE TERMS AND CONDITIONS THAT GOVERN THE CONFIDENTIALITY OF INFORMATION POSTED TO OR MADE AVAILABLE THROUGH THE MICRON WEBSITE. PLEASE CAREFULLY READ THIS NONDISCLOSURE AGREEMENT (\"AGREEMENT\") BEFORE CLICKING \"ACCEPT\" AT THE BOTTOM OF THE PAGE. BY CLICKING ON\"ACCEPT\", RECIPIENT IS AGREEING TO BE BOUND BY THE TERMS OF THIS AGREEMENT. IF RECIPIENT DOES NOT AGREE TO THE TERMS OF THIS AGREEMENT, PRESS \"DECLINE\" AND RECIPENT WILL BE UNABLE TO ACCESS CONFIDENTIAL INFORMATION.\n1. Written Nondisclosure Agreement. If Recipient and MTI have entered into a written confidentiality agreement (\"Confidentiality Agreement\") that is in effect as of the date Recipient enters into this Agreement and such Confidentiality Agreement already applies to and governs the Confidential Information (defined below), then the terms of such Confidentiality Agreement shall apply to and govern Recipient’s obligations concerning such Confidential Information and not the terms of this Agreement.\n2. Confidential Information. \"Confidential Information\" means any information or data posted to or made available through MTI’s secure website that is (i) marked or labeled as \"Confidential\" or \"Proprietary\" or with similar designation, or (ii) of a nature that a reasonable person would know such information is confidential. Confidential Information does not include that which:\n(i) is proven by Recipient through competent evidence to rightfully have already been in Recipient's possession at the time of disclosure without an obligation of confidentiality;\n(ii) is or becomes available to the public through no fault or breach on the part of Recipient;\n(iii) is independently developed by Recipient without use of or reference to the Confidential Information;\nor (iv) is rightfully obtained from a third party who has the right to transfer or disclose it to Recipient without restriction.\n3. Purpose of Disclosure and Restriction on Use. Confidential Information is disclosed hereunder strictly for the purpose of Recipient’s internal evaluation and/or to assist Recipient in the implementation of an MTI device or product into a commercial product (\"Purpose\"). Recipient shall use the Confidential Information solely in accordance with the terms of this Agreement to accomplish the Purpose and shall make no further use, in whole or in part, of the Confidential Information.\n4. Non-Disclosure. Recipient agrees to protect the Confidential Information, using at least the same degree of care it uses to protect its own confidential and proprietary information, but in no case with less than reasonable care. Recipient shall not disclose, publish or disseminate Confidential Information to anyone other than those of its employees, agents, contractors and consultants (collectively \"Representatives\") who have a need to know the information in order to accomplish the Purpose and who are bound by a written agreement that prohibits unauthorized disclosure or use of Confidential Information on terms no less restrictive and protective than those contained within this Agreement. Recipient will be responsible for any violation of the terms of this Agreement by its Representatives. Recipient may disclose Confidential Information to the extent required by law, provided Recipient shall promptly notify MTI in writing of such requirement to disclose and Recipient shall cooperate with MTI’s efforts to protect the Confidential Information. Recipient shall notify MTI promptly in writing in the event of any disclosure of the Confidential Information which is not authorized under this Agreement.\n5. Feedback. Notwithstanding any other provision in this Agreement, if Recipient provides any ideas, suggestions or recommendations to MTI regarding Confidential Information (\"Feedback\"), MTI is free to use and incorporate such Feedback in MTI’s products, without payment of royalties or other consideration to Recipient, so long as MTI does not infringe Recipient’s patents, copyrights or trademark rights in the Feedback.\n6. Copies. Recipient shall not make any copies of Confidential Information except as strictly necessary to carry out the above-stated Purpose. Any copies that are made must be identical to the original, may not be modified, and shall be considered the property of MTI.\n7. No License. No Warranty. Except as expressly set forth herein, no license is granted hereunder to any patents, copyrights, mask works, or trademarks either expressly, by implication, estoppel or otherwise. Any such license must be express and in writing from MTI. All Confidential Information shall remain the property of MTI and nothing in this Agreement shall restrict MTI from using, disclosing or disseminating such Confidential Information in any way. CONFIDENTIAL INFORMATION IS DISCLOSED HEREUNDER \"AS IS\" WITHOUT ANY REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS OR WARRANTIES AS TO THE ACCURACY, COMPLETENESS OR UTILITY OF SUCH CONFIDENTIAL INFORMATION.\n8. Termination of Obligations of Confidentiality. This Agreement will become effective on the date Recipient clicks on \"Accept.\" Notwithstanding any termination of this Agreement, the provisions of this Agreement shall continue for a period of five (5) years from the date of each disclosure of Confidential Information. MTI may terminate this Agreement at any time in its sole discretion upon written notice to Recipient (including such notice transmitted through this secure MTI website or via electronic mail to Recipient).\n9. Return of Confidential Information. Within ten (10) business days of MTI’s written request, and at MTI’s option, Recipient shall return or certify to MTI the destruction of the Confidential Information including, without limitation, hard copy and electronic documents and all materials created by Recipient that contain the Confidential Information.\n10. Governing Law and Attorneys' Fees. This Agreement shall be governed by the laws of the State of Idaho, U.S.A., excluding its conflict of laws principles. Recipient hereby consents to the personal jurisdiction of the courts of Idaho for any dispute arising out of this Agreement. In the event of any suit, action or proceeding arising out of or relating to this Agreement, the prevailing party will be entitled to reasonable attorneys' fees and reasonable costs incurred.\n11. Export. Recipient agrees that Confidential Information, or any portion thereof, shall not be exported or re-exported, directly or indirectly, in any form, except in compliance with the U.S. Export Administration Act and all other applicable export control laws or regulations.\n12. Injunctive Relief. Recipient acknowledges and agrees that disclosure of Confidential Information in violation of the terms of this Agreement will cause irreparable harm to MTI for which monetary damages would not be an adequate remedy. Therefore, Recipient agrees that, in addition to any other remedies available to MTI, in the event of any breach or threatened breach of this Agreement, MTI shall be entitled to injunctive relief and Recipient waives any requirement for the posting of a bond in connection therewith.\n13. No Implied Waiver. MTI’s failure or delay in exercising any of its rights hereunder will not constitute a waiver of such rights unless expressly waived in writing.\n14. General. This Agreement:\n(i) may be amended or modified only by an express writing signed by Recipient and an authorized representative of MTI;\n(ii) will not be construed as creating any joint venture, partnership or other form of business association between the parties hereto;\n(iii) is not assignable or delegable in whole or in part by Recipient without the express written consent of MTI;\n(iv) shall inure to the benefit of and be binding upon the parties, their successors, the assigns of MTI and the permitted assigns of Recipient;\nand (v) is in the English language only, which language shall be controlling in all respects, and all versions of this Agreement in any other language shall not be binding on the parties hereto.\n15. Authorized Signatory. The individual clicking on \"Accept\" is entering into this Agreement and accessing Confidential Information either (1) as an individual, and hereby agrees that he or she shall be personally liable to MTI if Confidential Information is disclosed or used in a manner not authorized by this Agreement, or (2) on behalf of an employer or other entity, and hereby represents and warrants that he or she has full legal authority to bind such employer or entity to this Agreement and that such employer or entity shall be legally bound by all of the terms and conditions of this Agreement as Recipient hereunder. IF CONFIDENTIAL INFORMATION IS FOR AN EMPLOYER OR ENTITY, BUT YOU DO NOT HAVE THE LEGAL AUTHORITY TO SO BIND SUCH EMPLOYER OR ENTITY, THEN DO NOT ACCESS, VIEW, READ, OR DOWNLOAD IN ANY WAY CONFIDENTIAL INFORMATION, AND DO NOT CLICK ON \"ACCEPT.\"\nIn order to review documents, you must accept the NDA. If you do not accept these terms, select Decline to exit this menu."
    },
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/partners/odm-partners",
        "Content_Type": "Website Content",
        "Raw_Text": "To access these documents, you must first read and accept Micron's electronic non-disclosure agreement. If the Recipient has a written confidentiality agreement with Micron Technology, Inc. you will need to click \"Accept\" at the bottom of this page, but the terms of the written confidentiality agreement will apply.\nON-LINE NONDISCLOSURE AGREEMENT THIS IS A LEGAL AGREEMENT BETWEEN YOU OR THE COMPANY YOU REPRESENT (EACH A \"RECIPENT\") AND MICRON TECHNOLOGY, INC. (\"MTI\") STATING THE TERMS AND CONDITIONS THAT GOVERN THE CONFIDENTIALITY OF INFORMATION POSTED TO OR MADE AVAILABLE THROUGH THE MICRON WEBSITE. PLEASE CAREFULLY READ THIS NONDISCLOSURE AGREEMENT (\"AGREEMENT\") BEFORE CLICKING \"ACCEPT\" AT THE BOTTOM OF THE PAGE. BY CLICKING ON\"ACCEPT\", RECIPIENT IS AGREEING TO BE BOUND BY THE TERMS OF THIS AGREEMENT. IF RECIPIENT DOES NOT AGREE TO THE TERMS OF THIS AGREEMENT, PRESS \"DECLINE\" AND RECIPENT WILL BE UNABLE TO ACCESS CONFIDENTIAL INFORMATION.\n1. Written Nondisclosure Agreement. If Recipient and MTI have entered into a written confidentiality agreement (\"Confidentiality Agreement\") that is in effect as of the date Recipient enters into this Agreement and such Confidentiality Agreement already applies to and governs the Confidential Information (defined below), then the terms of such Confidentiality Agreement shall apply to and govern Recipient’s obligations concerning such Confidential Information and not the terms of this Agreement.\n2. Confidential Information. \"Confidential Information\" means any information or data posted to or made available through MTI’s secure website that is (i) marked or labeled as \"Confidential\" or \"Proprietary\" or with similar designation, or (ii) of a nature that a reasonable person would know such information is confidential. Confidential Information does not include that which:\n(i) is proven by Recipient through competent evidence to rightfully have already been in Recipient's possession at the time of disclosure without an obligation of confidentiality;\n(ii) is or becomes available to the public through no fault or breach on the part of Recipient;\n(iii) is independently developed by Recipient without use of or reference to the Confidential Information;\nor (iv) is rightfully obtained from a third party who has the right to transfer or disclose it to Recipient without restriction.\n3. Purpose of Disclosure and Restriction on Use. Confidential Information is disclosed hereunder strictly for the purpose of Recipient’s internal evaluation and/or to assist Recipient in the implementation of an MTI device or product into a commercial product (\"Purpose\"). Recipient shall use the Confidential Information solely in accordance with the terms of this Agreement to accomplish the Purpose and shall make no further use, in whole or in part, of the Confidential Information.\n4. Non-Disclosure. Recipient agrees to protect the Confidential Information, using at least the same degree of care it uses to protect its own confidential and proprietary information, but in no case with less than reasonable care. Recipient shall not disclose, publish or disseminate Confidential Information to anyone other than those of its employees, agents, contractors and consultants (collectively \"Representatives\") who have a need to know the information in order to accomplish the Purpose and who are bound by a written agreement that prohibits unauthorized disclosure or use of Confidential Information on terms no less restrictive and protective than those contained within this Agreement. Recipient will be responsible for any violation of the terms of this Agreement by its Representatives. Recipient may disclose Confidential Information to the extent required by law, provided Recipient shall promptly notify MTI in writing of such requirement to disclose and Recipient shall cooperate with MTI’s efforts to protect the Confidential Information. Recipient shall notify MTI promptly in writing in the event of any disclosure of the Confidential Information which is not authorized under this Agreement.\n5. Feedback. Notwithstanding any other provision in this Agreement, if Recipient provides any ideas, suggestions or recommendations to MTI regarding Confidential Information (\"Feedback\"), MTI is free to use and incorporate such Feedback in MTI’s products, without payment of royalties or other consideration to Recipient, so long as MTI does not infringe Recipient’s patents, copyrights or trademark rights in the Feedback.\n6. Copies. Recipient shall not make any copies of Confidential Information except as strictly necessary to carry out the above-stated Purpose. Any copies that are made must be identical to the original, may not be modified, and shall be considered the property of MTI.\n7. No License. No Warranty. Except as expressly set forth herein, no license is granted hereunder to any patents, copyrights, mask works, or trademarks either expressly, by implication, estoppel or otherwise. Any such license must be express and in writing from MTI. All Confidential Information shall remain the property of MTI and nothing in this Agreement shall restrict MTI from using, disclosing or disseminating such Confidential Information in any way. CONFIDENTIAL INFORMATION IS DISCLOSED HEREUNDER \"AS IS\" WITHOUT ANY REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS OR WARRANTIES AS TO THE ACCURACY, COMPLETENESS OR UTILITY OF SUCH CONFIDENTIAL INFORMATION.\n8. Termination of Obligations of Confidentiality. This Agreement will become effective on the date Recipient clicks on \"Accept.\" Notwithstanding any termination of this Agreement, the provisions of this Agreement shall continue for a period of five (5) years from the date of each disclosure of Confidential Information. MTI may terminate this Agreement at any time in its sole discretion upon written notice to Recipient (including such notice transmitted through this secure MTI website or via electronic mail to Recipient).\n9. Return of Confidential Information. Within ten (10) business days of MTI’s written request, and at MTI’s option, Recipient shall return or certify to MTI the destruction of the Confidential Information including, without limitation, hard copy and electronic documents and all materials created by Recipient that contain the Confidential Information.\n10. Governing Law and Attorneys' Fees. This Agreement shall be governed by the laws of the State of Idaho, U.S.A., excluding its conflict of laws principles. Recipient hereby consents to the personal jurisdiction of the courts of Idaho for any dispute arising out of this Agreement. In the event of any suit, action or proceeding arising out of or relating to this Agreement, the prevailing party will be entitled to reasonable attorneys' fees and reasonable costs incurred.\n11. Export. Recipient agrees that Confidential Information, or any portion thereof, shall not be exported or re-exported, directly or indirectly, in any form, except in compliance with the U.S. Export Administration Act and all other applicable export control laws or regulations.\n12. Injunctive Relief. Recipient acknowledges and agrees that disclosure of Confidential Information in violation of the terms of this Agreement will cause irreparable harm to MTI for which monetary damages would not be an adequate remedy. Therefore, Recipient agrees that, in addition to any other remedies available to MTI, in the event of any breach or threatened breach of this Agreement, MTI shall be entitled to injunctive relief and Recipient waives any requirement for the posting of a bond in connection therewith.\n13. No Implied Waiver. MTI’s failure or delay in exercising any of its rights hereunder will not constitute a waiver of such rights unless expressly waived in writing.\n14. General. This Agreement:\n(i) may be amended or modified only by an express writing signed by Recipient and an authorized representative of MTI;\n(ii) will not be construed as creating any joint venture, partnership or other form of business association between the parties hereto;\n(iii) is not assignable or delegable in whole or in part by Recipient without the express written consent of MTI;\n(iv) shall inure to the benefit of and be binding upon the parties, their successors, the assigns of MTI and the permitted assigns of Recipient;\nand (v) is in the English language only, which language shall be controlling in all respects, and all versions of this Agreement in any other language shall not be binding on the parties hereto.\n15. Authorized Signatory. The individual clicking on \"Accept\" is entering into this Agreement and accessing Confidential Information either (1) as an individual, and hereby agrees that he or she shall be personally liable to MTI if Confidential Information is disclosed or used in a manner not authorized by this Agreement, or (2) on behalf of an employer or other entity, and hereby represents and warrants that he or she has full legal authority to bind such employer or entity to this Agreement and that such employer or entity shall be legally bound by all of the terms and conditions of this Agreement as Recipient hereunder. IF CONFIDENTIAL INFORMATION IS FOR AN EMPLOYER OR ENTITY, BUT YOU DO NOT HAVE THE LEGAL AUTHORITY TO SO BIND SUCH EMPLOYER OR ENTITY, THEN DO NOT ACCESS, VIEW, READ, OR DOWNLOAD IN ANY WAY CONFIDENTIAL INFORMATION, AND DO NOT CLICK ON \"ACCEPT.\"\nIn order to review documents, you must accept the NDA. If you do not accept these terms, select Decline to exit this menu."
    },
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/about/company/quality",
        "Content_Type": "Website Content",
        "Raw_Text": "To access these documents, you must first read and accept Micron's electronic non-disclosure agreement. If the Recipient has a written confidentiality agreement with Micron Technology, Inc. you will need to click \"Accept\" at the bottom of this page, but the terms of the written confidentiality agreement will apply.\nON-LINE NONDISCLOSURE AGREEMENT THIS IS A LEGAL AGREEMENT BETWEEN YOU OR THE COMPANY YOU REPRESENT (EACH A \"RECIPENT\") AND MICRON TECHNOLOGY, INC. (\"MTI\") STATING THE TERMS AND CONDITIONS THAT GOVERN THE CONFIDENTIALITY OF INFORMATION POSTED TO OR MADE AVAILABLE THROUGH THE MICRON WEBSITE. PLEASE CAREFULLY READ THIS NONDISCLOSURE AGREEMENT (\"AGREEMENT\") BEFORE CLICKING \"ACCEPT\" AT THE BOTTOM OF THE PAGE. BY CLICKING ON\"ACCEPT\", RECIPIENT IS AGREEING TO BE BOUND BY THE TERMS OF THIS AGREEMENT. IF RECIPIENT DOES NOT AGREE TO THE TERMS OF THIS AGREEMENT, PRESS \"DECLINE\" AND RECIPENT WILL BE UNABLE TO ACCESS CONFIDENTIAL INFORMATION.\n1. Written Nondisclosure Agreement. If Recipient and MTI have entered into a written confidentiality agreement (\"Confidentiality Agreement\") that is in effect as of the date Recipient enters into this Agreement and such Confidentiality Agreement already applies to and governs the Confidential Information (defined below), then the terms of such Confidentiality Agreement shall apply to and govern Recipient’s obligations concerning such Confidential Information and not the terms of this Agreement.\n2. Confidential Information. \"Confidential Information\" means any information or data posted to or made available through MTI’s secure website that is (i) marked or labeled as \"Confidential\" or \"Proprietary\" or with similar designation, or (ii) of a nature that a reasonable person would know such information is confidential. Confidential Information does not include that which:\n(i) is proven by Recipient through competent evidence to rightfully have already been in Recipient's possession at the time of disclosure without an obligation of confidentiality;\n(ii) is or becomes available to the public through no fault or breach on the part of Recipient;\n(iii) is independently developed by Recipient without use of or reference to the Confidential Information;\nor (iv) is rightfully obtained from a third party who has the right to transfer or disclose it to Recipient without restriction.\n3. Purpose of Disclosure and Restriction on Use. Confidential Information is disclosed hereunder strictly for the purpose of Recipient’s internal evaluation and/or to assist Recipient in the implementation of an MTI device or product into a commercial product (\"Purpose\"). Recipient shall use the Confidential Information solely in accordance with the terms of this Agreement to accomplish the Purpose and shall make no further use, in whole or in part, of the Confidential Information.\n4. Non-Disclosure. Recipient agrees to protect the Confidential Information, using at least the same degree of care it uses to protect its own confidential and proprietary information, but in no case with less than reasonable care. Recipient shall not disclose, publish or disseminate Confidential Information to anyone other than those of its employees, agents, contractors and consultants (collectively \"Representatives\") who have a need to know the information in order to accomplish the Purpose and who are bound by a written agreement that prohibits unauthorized disclosure or use of Confidential Information on terms no less restrictive and protective than those contained within this Agreement. Recipient will be responsible for any violation of the terms of this Agreement by its Representatives. Recipient may disclose Confidential Information to the extent required by law, provided Recipient shall promptly notify MTI in writing of such requirement to disclose and Recipient shall cooperate with MTI’s efforts to protect the Confidential Information. Recipient shall notify MTI promptly in writing in the event of any disclosure of the Confidential Information which is not authorized under this Agreement.\n5. Feedback. Notwithstanding any other provision in this Agreement, if Recipient provides any ideas, suggestions or recommendations to MTI regarding Confidential Information (\"Feedback\"), MTI is free to use and incorporate such Feedback in MTI’s products, without payment of royalties or other consideration to Recipient, so long as MTI does not infringe Recipient’s patents, copyrights or trademark rights in the Feedback.\n6. Copies. Recipient shall not make any copies of Confidential Information except as strictly necessary to carry out the above-stated Purpose. Any copies that are made must be identical to the original, may not be modified, and shall be considered the property of MTI.\n7. No License. No Warranty. Except as expressly set forth herein, no license is granted hereunder to any patents, copyrights, mask works, or trademarks either expressly, by implication, estoppel or otherwise. Any such license must be express and in writing from MTI. All Confidential Information shall remain the property of MTI and nothing in this Agreement shall restrict MTI from using, disclosing or disseminating such Confidential Information in any way. CONFIDENTIAL INFORMATION IS DISCLOSED HEREUNDER \"AS IS\" WITHOUT ANY REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS OR WARRANTIES AS TO THE ACCURACY, COMPLETENESS OR UTILITY OF SUCH CONFIDENTIAL INFORMATION.\n8. Termination of Obligations of Confidentiality. This Agreement will become effective on the date Recipient clicks on \"Accept.\" Notwithstanding any termination of this Agreement, the provisions of this Agreement shall continue for a period of five (5) years from the date of each disclosure of Confidential Information. MTI may terminate this Agreement at any time in its sole discretion upon written notice to Recipient (including such notice transmitted through this secure MTI website or via electronic mail to Recipient).\n9. Return of Confidential Information. Within ten (10) business days of MTI’s written request, and at MTI’s option, Recipient shall return or certify to MTI the destruction of the Confidential Information including, without limitation, hard copy and electronic documents and all materials created by Recipient that contain the Confidential Information.\n10. Governing Law and Attorneys' Fees. This Agreement shall be governed by the laws of the State of Idaho, U.S.A., excluding its conflict of laws principles. Recipient hereby consents to the personal jurisdiction of the courts of Idaho for any dispute arising out of this Agreement. In the event of any suit, action or proceeding arising out of or relating to this Agreement, the prevailing party will be entitled to reasonable attorneys' fees and reasonable costs incurred.\n11. Export. Recipient agrees that Confidential Information, or any portion thereof, shall not be exported or re-exported, directly or indirectly, in any form, except in compliance with the U.S. Export Administration Act and all other applicable export control laws or regulations.\n12. Injunctive Relief. Recipient acknowledges and agrees that disclosure of Confidential Information in violation of the terms of this Agreement will cause irreparable harm to MTI for which monetary damages would not be an adequate remedy. Therefore, Recipient agrees that, in addition to any other remedies available to MTI, in the event of any breach or threatened breach of this Agreement, MTI shall be entitled to injunctive relief and Recipient waives any requirement for the posting of a bond in connection therewith.\n13. No Implied Waiver. MTI’s failure or delay in exercising any of its rights hereunder will not constitute a waiver of such rights unless expressly waived in writing.\n14. General. This Agreement:\n(i) may be amended or modified only by an express writing signed by Recipient and an authorized representative of MTI;\n(ii) will not be construed as creating any joint venture, partnership or other form of business association between the parties hereto;\n(iii) is not assignable or delegable in whole or in part by Recipient without the express written consent of MTI;\n(iv) shall inure to the benefit of and be binding upon the parties, their successors, the assigns of MTI and the permitted assigns of Recipient;\nand (v) is in the English language only, which language shall be controlling in all respects, and all versions of this Agreement in any other language shall not be binding on the parties hereto.\n15. Authorized Signatory. The individual clicking on \"Accept\" is entering into this Agreement and accessing Confidential Information either (1) as an individual, and hereby agrees that he or she shall be personally liable to MTI if Confidential Information is disclosed or used in a manner not authorized by this Agreement, or (2) on behalf of an employer or other entity, and hereby represents and warrants that he or she has full legal authority to bind such employer or entity to this Agreement and that such employer or entity shall be legally bound by all of the terms and conditions of this Agreement as Recipient hereunder. IF CONFIDENTIAL INFORMATION IS FOR AN EMPLOYER OR ENTITY, BUT YOU DO NOT HAVE THE LEGAL AUTHORITY TO SO BIND SUCH EMPLOYER OR ENTITY, THEN DO NOT ACCESS, VIEW, READ, OR DOWNLOAD IN ANY WAY CONFIDENTIAL INFORMATION, AND DO NOT CLICK ON \"ACCEPT.\"\nIn order to review documents, you must accept the NDA. If you do not accept these terms, select Decline to exit this menu."
    },
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/about/company/customer-trust-center",
        "Content_Type": "Website Content",
        "Raw_Text": "To access these documents, you must first read and accept Micron's electronic non-disclosure agreement. If the Recipient has a written confidentiality agreement with Micron Technology, Inc. you will need to click \"Accept\" at the bottom of this page, but the terms of the written confidentiality agreement will apply.\nON-LINE NONDISCLOSURE AGREEMENT THIS IS A LEGAL AGREEMENT BETWEEN YOU OR THE COMPANY YOU REPRESENT (EACH A \"RECIPENT\") AND MICRON TECHNOLOGY, INC. (\"MTI\") STATING THE TERMS AND CONDITIONS THAT GOVERN THE CONFIDENTIALITY OF INFORMATION POSTED TO OR MADE AVAILABLE THROUGH THE MICRON WEBSITE. PLEASE CAREFULLY READ THIS NONDISCLOSURE AGREEMENT (\"AGREEMENT\") BEFORE CLICKING \"ACCEPT\" AT THE BOTTOM OF THE PAGE. BY CLICKING ON\"ACCEPT\", RECIPIENT IS AGREEING TO BE BOUND BY THE TERMS OF THIS AGREEMENT. IF RECIPIENT DOES NOT AGREE TO THE TERMS OF THIS AGREEMENT, PRESS \"DECLINE\" AND RECIPENT WILL BE UNABLE TO ACCESS CONFIDENTIAL INFORMATION.\n1. Written Nondisclosure Agreement. If Recipient and MTI have entered into a written confidentiality agreement (\"Confidentiality Agreement\") that is in effect as of the date Recipient enters into this Agreement and such Confidentiality Agreement already applies to and governs the Confidential Information (defined below), then the terms of such Confidentiality Agreement shall apply to and govern Recipient’s obligations concerning such Confidential Information and not the terms of this Agreement.\n2. Confidential Information. \"Confidential Information\" means any information or data posted to or made available through MTI’s secure website that is (i) marked or labeled as \"Confidential\" or \"Proprietary\" or with similar designation, or (ii) of a nature that a reasonable person would know such information is confidential. Confidential Information does not include that which:\n(i) is proven by Recipient through competent evidence to rightfully have already been in Recipient's possession at the time of disclosure without an obligation of confidentiality;\n(ii) is or becomes available to the public through no fault or breach on the part of Recipient;\n(iii) is independently developed by Recipient without use of or reference to the Confidential Information;\nor (iv) is rightfully obtained from a third party who has the right to transfer or disclose it to Recipient without restriction.\n3. Purpose of Disclosure and Restriction on Use. Confidential Information is disclosed hereunder strictly for the purpose of Recipient’s internal evaluation and/or to assist Recipient in the implementation of an MTI device or product into a commercial product (\"Purpose\"). Recipient shall use the Confidential Information solely in accordance with the terms of this Agreement to accomplish the Purpose and shall make no further use, in whole or in part, of the Confidential Information.\n4. Non-Disclosure. Recipient agrees to protect the Confidential Information, using at least the same degree of care it uses to protect its own confidential and proprietary information, but in no case with less than reasonable care. Recipient shall not disclose, publish or disseminate Confidential Information to anyone other than those of its employees, agents, contractors and consultants (collectively \"Representatives\") who have a need to know the information in order to accomplish the Purpose and who are bound by a written agreement that prohibits unauthorized disclosure or use of Confidential Information on terms no less restrictive and protective than those contained within this Agreement. Recipient will be responsible for any violation of the terms of this Agreement by its Representatives. Recipient may disclose Confidential Information to the extent required by law, provided Recipient shall promptly notify MTI in writing of such requirement to disclose and Recipient shall cooperate with MTI’s efforts to protect the Confidential Information. Recipient shall notify MTI promptly in writing in the event of any disclosure of the Confidential Information which is not authorized under this Agreement.\n5. Feedback. Notwithstanding any other provision in this Agreement, if Recipient provides any ideas, suggestions or recommendations to MTI regarding Confidential Information (\"Feedback\"), MTI is free to use and incorporate such Feedback in MTI’s products, without payment of royalties or other consideration to Recipient, so long as MTI does not infringe Recipient’s patents, copyrights or trademark rights in the Feedback.\n6. Copies. Recipient shall not make any copies of Confidential Information except as strictly necessary to carry out the above-stated Purpose. Any copies that are made must be identical to the original, may not be modified, and shall be considered the property of MTI.\n7. No License. No Warranty. Except as expressly set forth herein, no license is granted hereunder to any patents, copyrights, mask works, or trademarks either expressly, by implication, estoppel or otherwise. Any such license must be express and in writing from MTI. All Confidential Information shall remain the property of MTI and nothing in this Agreement shall restrict MTI from using, disclosing or disseminating such Confidential Information in any way. CONFIDENTIAL INFORMATION IS DISCLOSED HEREUNDER \"AS IS\" WITHOUT ANY REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS OR WARRANTIES AS TO THE ACCURACY, COMPLETENESS OR UTILITY OF SUCH CONFIDENTIAL INFORMATION.\n8. Termination of Obligations of Confidentiality. This Agreement will become effective on the date Recipient clicks on \"Accept.\" Notwithstanding any termination of this Agreement, the provisions of this Agreement shall continue for a period of five (5) years from the date of each disclosure of Confidential Information. MTI may terminate this Agreement at any time in its sole discretion upon written notice to Recipient (including such notice transmitted through this secure MTI website or via electronic mail to Recipient).\n9. Return of Confidential Information. Within ten (10) business days of MTI’s written request, and at MTI’s option, Recipient shall return or certify to MTI the destruction of the Confidential Information including, without limitation, hard copy and electronic documents and all materials created by Recipient that contain the Confidential Information.\n10. Governing Law and Attorneys' Fees. This Agreement shall be governed by the laws of the State of Idaho, U.S.A., excluding its conflict of laws principles. Recipient hereby consents to the personal jurisdiction of the courts of Idaho for any dispute arising out of this Agreement. In the event of any suit, action or proceeding arising out of or relating to this Agreement, the prevailing party will be entitled to reasonable attorneys' fees and reasonable costs incurred.\n11. Export. Recipient agrees that Confidential Information, or any portion thereof, shall not be exported or re-exported, directly or indirectly, in any form, except in compliance with the U.S. Export Administration Act and all other applicable export control laws or regulations.\n12. Injunctive Relief. Recipient acknowledges and agrees that disclosure of Confidential Information in violation of the terms of this Agreement will cause irreparable harm to MTI for which monetary damages would not be an adequate remedy. Therefore, Recipient agrees that, in addition to any other remedies available to MTI, in the event of any breach or threatened breach of this Agreement, MTI shall be entitled to injunctive relief and Recipient waives any requirement for the posting of a bond in connection therewith.\n13. No Implied Waiver. MTI’s failure or delay in exercising any of its rights hereunder will not constitute a waiver of such rights unless expressly waived in writing.\n14. General. This Agreement:\n(i) may be amended or modified only by an express writing signed by Recipient and an authorized representative of MTI;\n(ii) will not be construed as creating any joint venture, partnership or other form of business association between the parties hereto;\n(iii) is not assignable or delegable in whole or in part by Recipient without the express written consent of MTI;\n(iv) shall inure to the benefit of and be binding upon the parties, their successors, the assigns of MTI and the permitted assigns of Recipient;\nand (v) is in the English language only, which language shall be controlling in all respects, and all versions of this Agreement in any other language shall not be binding on the parties hereto.\n15. Authorized Signatory. The individual clicking on \"Accept\" is entering into this Agreement and accessing Confidential Information either (1) as an individual, and hereby agrees that he or she shall be personally liable to MTI if Confidential Information is disclosed or used in a manner not authorized by this Agreement, or (2) on behalf of an employer or other entity, and hereby represents and warrants that he or she has full legal authority to bind such employer or entity to this Agreement and that such employer or entity shall be legally bound by all of the terms and conditions of this Agreement as Recipient hereunder. IF CONFIDENTIAL INFORMATION IS FOR AN EMPLOYER OR ENTITY, BUT YOU DO NOT HAVE THE LEGAL AUTHORITY TO SO BIND SUCH EMPLOYER OR ENTITY, THEN DO NOT ACCESS, VIEW, READ, OR DOWNLOAD IN ANY WAY CONFIDENTIAL INFORMATION, AND DO NOT CLICK ON \"ACCEPT.\"\nIn order to review documents, you must accept the NDA. If you do not accept these terms, select Decline to exit this menu."
    },
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/about",
        "Content_Type": "Website Content",
        "Raw_Text": "To access these documents, you must first read and accept Micron's electronic non-disclosure agreement. If the Recipient has a written confidentiality agreement with Micron Technology, Inc. you will need to click \"Accept\" at the bottom of this page, but the terms of the written confidentiality agreement will apply.\nON-LINE NONDISCLOSURE AGREEMENT THIS IS A LEGAL AGREEMENT BETWEEN YOU OR THE COMPANY YOU REPRESENT (EACH A \"RECIPENT\") AND MICRON TECHNOLOGY, INC. (\"MTI\") STATING THE TERMS AND CONDITIONS THAT GOVERN THE CONFIDENTIALITY OF INFORMATION POSTED TO OR MADE AVAILABLE THROUGH THE MICRON WEBSITE. PLEASE CAREFULLY READ THIS NONDISCLOSURE AGREEMENT (\"AGREEMENT\") BEFORE CLICKING \"ACCEPT\" AT THE BOTTOM OF THE PAGE. BY CLICKING ON\"ACCEPT\", RECIPIENT IS AGREEING TO BE BOUND BY THE TERMS OF THIS AGREEMENT. IF RECIPIENT DOES NOT AGREE TO THE TERMS OF THIS AGREEMENT, PRESS \"DECLINE\" AND RECIPENT WILL BE UNABLE TO ACCESS CONFIDENTIAL INFORMATION.\n1. Written Nondisclosure Agreement. If Recipient and MTI have entered into a written confidentiality agreement (\"Confidentiality Agreement\") that is in effect as of the date Recipient enters into this Agreement and such Confidentiality Agreement already applies to and governs the Confidential Information (defined below), then the terms of such Confidentiality Agreement shall apply to and govern Recipient’s obligations concerning such Confidential Information and not the terms of this Agreement.\n2. Confidential Information. \"Confidential Information\" means any information or data posted to or made available through MTI’s secure website that is (i) marked or labeled as \"Confidential\" or \"Proprietary\" or with similar designation, or (ii) of a nature that a reasonable person would know such information is confidential. Confidential Information does not include that which:\n(i) is proven by Recipient through competent evidence to rightfully have already been in Recipient's possession at the time of disclosure without an obligation of confidentiality;\n(ii) is or becomes available to the public through no fault or breach on the part of Recipient;\n(iii) is independently developed by Recipient without use of or reference to the Confidential Information;\nor (iv) is rightfully obtained from a third party who has the right to transfer or disclose it to Recipient without restriction.\n3. Purpose of Disclosure and Restriction on Use. Confidential Information is disclosed hereunder strictly for the purpose of Recipient’s internal evaluation and/or to assist Recipient in the implementation of an MTI device or product into a commercial product (\"Purpose\"). Recipient shall use the Confidential Information solely in accordance with the terms of this Agreement to accomplish the Purpose and shall make no further use, in whole or in part, of the Confidential Information.\n4. Non-Disclosure. Recipient agrees to protect the Confidential Information, using at least the same degree of care it uses to protect its own confidential and proprietary information, but in no case with less than reasonable care. Recipient shall not disclose, publish or disseminate Confidential Information to anyone other than those of its employees, agents, contractors and consultants (collectively \"Representatives\") who have a need to know the information in order to accomplish the Purpose and who are bound by a written agreement that prohibits unauthorized disclosure or use of Confidential Information on terms no less restrictive and protective than those contained within this Agreement. Recipient will be responsible for any violation of the terms of this Agreement by its Representatives. Recipient may disclose Confidential Information to the extent required by law, provided Recipient shall promptly notify MTI in writing of such requirement to disclose and Recipient shall cooperate with MTI’s efforts to protect the Confidential Information. Recipient shall notify MTI promptly in writing in the event of any disclosure of the Confidential Information which is not authorized under this Agreement.\n5. Feedback. Notwithstanding any other provision in this Agreement, if Recipient provides any ideas, suggestions or recommendations to MTI regarding Confidential Information (\"Feedback\"), MTI is free to use and incorporate such Feedback in MTI’s products, without payment of royalties or other consideration to Recipient, so long as MTI does not infringe Recipient’s patents, copyrights or trademark rights in the Feedback.\n6. Copies. Recipient shall not make any copies of Confidential Information except as strictly necessary to carry out the above-stated Purpose. Any copies that are made must be identical to the original, may not be modified, and shall be considered the property of MTI.\n7. No License. No Warranty. Except as expressly set forth herein, no license is granted hereunder to any patents, copyrights, mask works, or trademarks either expressly, by implication, estoppel or otherwise. Any such license must be express and in writing from MTI. All Confidential Information shall remain the property of MTI and nothing in this Agreement shall restrict MTI from using, disclosing or disseminating such Confidential Information in any way. CONFIDENTIAL INFORMATION IS DISCLOSED HEREUNDER \"AS IS\" WITHOUT ANY REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS OR WARRANTIES AS TO THE ACCURACY, COMPLETENESS OR UTILITY OF SUCH CONFIDENTIAL INFORMATION.\n8. Termination of Obligations of Confidentiality. This Agreement will become effective on the date Recipient clicks on \"Accept.\" Notwithstanding any termination of this Agreement, the provisions of this Agreement shall continue for a period of five (5) years from the date of each disclosure of Confidential Information. MTI may terminate this Agreement at any time in its sole discretion upon written notice to Recipient (including such notice transmitted through this secure MTI website or via electronic mail to Recipient).\n9. Return of Confidential Information. Within ten (10) business days of MTI’s written request, and at MTI’s option, Recipient shall return or certify to MTI the destruction of the Confidential Information including, without limitation, hard copy and electronic documents and all materials created by Recipient that contain the Confidential Information.\n10. Governing Law and Attorneys' Fees. This Agreement shall be governed by the laws of the State of Idaho, U.S.A., excluding its conflict of laws principles. Recipient hereby consents to the personal jurisdiction of the courts of Idaho for any dispute arising out of this Agreement. In the event of any suit, action or proceeding arising out of or relating to this Agreement, the prevailing party will be entitled to reasonable attorneys' fees and reasonable costs incurred.\n11. Export. Recipient agrees that Confidential Information, or any portion thereof, shall not be exported or re-exported, directly or indirectly, in any form, except in compliance with the U.S. Export Administration Act and all other applicable export control laws or regulations.\n12. Injunctive Relief. Recipient acknowledges and agrees that disclosure of Confidential Information in violation of the terms of this Agreement will cause irreparable harm to MTI for which monetary damages would not be an adequate remedy. Therefore, Recipient agrees that, in addition to any other remedies available to MTI, in the event of any breach or threatened breach of this Agreement, MTI shall be entitled to injunctive relief and Recipient waives any requirement for the posting of a bond in connection therewith.\n13. No Implied Waiver. MTI’s failure or delay in exercising any of its rights hereunder will not constitute a waiver of such rights unless expressly waived in writing.\n14. General. This Agreement:\n(i) may be amended or modified only by an express writing signed by Recipient and an authorized representative of MTI;\n(ii) will not be construed as creating any joint venture, partnership or other form of business association between the parties hereto;\n(iii) is not assignable or delegable in whole or in part by Recipient without the express written consent of MTI;\n(iv) shall inure to the benefit of and be binding upon the parties, their successors, the assigns of MTI and the permitted assigns of Recipient;\nand (v) is in the English language only, which language shall be controlling in all respects, and all versions of this Agreement in any other language shall not be binding on the parties hereto.\n15. Authorized Signatory. The individual clicking on \"Accept\" is entering into this Agreement and accessing Confidential Information either (1) as an individual, and hereby agrees that he or she shall be personally liable to MTI if Confidential Information is disclosed or used in a manner not authorized by this Agreement, or (2) on behalf of an employer or other entity, and hereby represents and warrants that he or she has full legal authority to bind such employer or entity to this Agreement and that such employer or entity shall be legally bound by all of the terms and conditions of this Agreement as Recipient hereunder. IF CONFIDENTIAL INFORMATION IS FOR AN EMPLOYER OR ENTITY, BUT YOU DO NOT HAVE THE LEGAL AUTHORITY TO SO BIND SUCH EMPLOYER OR ENTITY, THEN DO NOT ACCESS, VIEW, READ, OR DOWNLOAD IN ANY WAY CONFIDENTIAL INFORMATION, AND DO NOT CLICK ON \"ACCEPT.\"\nIn order to review documents, you must accept the NDA. If you do not accept these terms, select Decline to exit this menu."
    },
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/about/company",
        "Content_Type": "Website Content",
        "Raw_Text": "To access these documents, you must first read and accept Micron's electronic non-disclosure agreement. If the Recipient has a written confidentiality agreement with Micron Technology, Inc. you will need to click \"Accept\" at the bottom of this page, but the terms of the written confidentiality agreement will apply.\nON-LINE NONDISCLOSURE AGREEMENT THIS IS A LEGAL AGREEMENT BETWEEN YOU OR THE COMPANY YOU REPRESENT (EACH A \"RECIPENT\") AND MICRON TECHNOLOGY, INC. (\"MTI\") STATING THE TERMS AND CONDITIONS THAT GOVERN THE CONFIDENTIALITY OF INFORMATION POSTED TO OR MADE AVAILABLE THROUGH THE MICRON WEBSITE. PLEASE CAREFULLY READ THIS NONDISCLOSURE AGREEMENT (\"AGREEMENT\") BEFORE CLICKING \"ACCEPT\" AT THE BOTTOM OF THE PAGE. BY CLICKING ON\"ACCEPT\", RECIPIENT IS AGREEING TO BE BOUND BY THE TERMS OF THIS AGREEMENT. IF RECIPIENT DOES NOT AGREE TO THE TERMS OF THIS AGREEMENT, PRESS \"DECLINE\" AND RECIPENT WILL BE UNABLE TO ACCESS CONFIDENTIAL INFORMATION.\n1. Written Nondisclosure Agreement. If Recipient and MTI have entered into a written confidentiality agreement (\"Confidentiality Agreement\") that is in effect as of the date Recipient enters into this Agreement and such Confidentiality Agreement already applies to and governs the Confidential Information (defined below), then the terms of such Confidentiality Agreement shall apply to and govern Recipient’s obligations concerning such Confidential Information and not the terms of this Agreement.\n2. Confidential Information. \"Confidential Information\" means any information or data posted to or made available through MTI’s secure website that is (i) marked or labeled as \"Confidential\" or \"Proprietary\" or with similar designation, or (ii) of a nature that a reasonable person would know such information is confidential. Confidential Information does not include that which:\n(i) is proven by Recipient through competent evidence to rightfully have already been in Recipient's possession at the time of disclosure without an obligation of confidentiality;\n(ii) is or becomes available to the public through no fault or breach on the part of Recipient;\n(iii) is independently developed by Recipient without use of or reference to the Confidential Information;\nor (iv) is rightfully obtained from a third party who has the right to transfer or disclose it to Recipient without restriction.\n3. Purpose of Disclosure and Restriction on Use. Confidential Information is disclosed hereunder strictly for the purpose of Recipient’s internal evaluation and/or to assist Recipient in the implementation of an MTI device or product into a commercial product (\"Purpose\"). Recipient shall use the Confidential Information solely in accordance with the terms of this Agreement to accomplish the Purpose and shall make no further use, in whole or in part, of the Confidential Information.\n4. Non-Disclosure. Recipient agrees to protect the Confidential Information, using at least the same degree of care it uses to protect its own confidential and proprietary information, but in no case with less than reasonable care. Recipient shall not disclose, publish or disseminate Confidential Information to anyone other than those of its employees, agents, contractors and consultants (collectively \"Representatives\") who have a need to know the information in order to accomplish the Purpose and who are bound by a written agreement that prohibits unauthorized disclosure or use of Confidential Information on terms no less restrictive and protective than those contained within this Agreement. Recipient will be responsible for any violation of the terms of this Agreement by its Representatives. Recipient may disclose Confidential Information to the extent required by law, provided Recipient shall promptly notify MTI in writing of such requirement to disclose and Recipient shall cooperate with MTI’s efforts to protect the Confidential Information. Recipient shall notify MTI promptly in writing in the event of any disclosure of the Confidential Information which is not authorized under this Agreement.\n5. Feedback. Notwithstanding any other provision in this Agreement, if Recipient provides any ideas, suggestions or recommendations to MTI regarding Confidential Information (\"Feedback\"), MTI is free to use and incorporate such Feedback in MTI’s products, without payment of royalties or other consideration to Recipient, so long as MTI does not infringe Recipient’s patents, copyrights or trademark rights in the Feedback.\n6. Copies. Recipient shall not make any copies of Confidential Information except as strictly necessary to carry out the above-stated Purpose. Any copies that are made must be identical to the original, may not be modified, and shall be considered the property of MTI.\n7. No License. No Warranty. Except as expressly set forth herein, no license is granted hereunder to any patents, copyrights, mask works, or trademarks either expressly, by implication, estoppel or otherwise. Any such license must be express and in writing from MTI. All Confidential Information shall remain the property of MTI and nothing in this Agreement shall restrict MTI from using, disclosing or disseminating such Confidential Information in any way. CONFIDENTIAL INFORMATION IS DISCLOSED HEREUNDER \"AS IS\" WITHOUT ANY REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS OR WARRANTIES AS TO THE ACCURACY, COMPLETENESS OR UTILITY OF SUCH CONFIDENTIAL INFORMATION.\n8. Termination of Obligations of Confidentiality. This Agreement will become effective on the date Recipient clicks on \"Accept.\" Notwithstanding any termination of this Agreement, the provisions of this Agreement shall continue for a period of five (5) years from the date of each disclosure of Confidential Information. MTI may terminate this Agreement at any time in its sole discretion upon written notice to Recipient (including such notice transmitted through this secure MTI website or via electronic mail to Recipient).\n9. Return of Confidential Information. Within ten (10) business days of MTI’s written request, and at MTI’s option, Recipient shall return or certify to MTI the destruction of the Confidential Information including, without limitation, hard copy and electronic documents and all materials created by Recipient that contain the Confidential Information.\n10. Governing Law and Attorneys' Fees. This Agreement shall be governed by the laws of the State of Idaho, U.S.A., excluding its conflict of laws principles. Recipient hereby consents to the personal jurisdiction of the courts of Idaho for any dispute arising out of this Agreement. In the event of any suit, action or proceeding arising out of or relating to this Agreement, the prevailing party will be entitled to reasonable attorneys' fees and reasonable costs incurred.\n11. Export. Recipient agrees that Confidential Information, or any portion thereof, shall not be exported or re-exported, directly or indirectly, in any form, except in compliance with the U.S. Export Administration Act and all other applicable export control laws or regulations.\n12. Injunctive Relief. Recipient acknowledges and agrees that disclosure of Confidential Information in violation of the terms of this Agreement will cause irreparable harm to MTI for which monetary damages would not be an adequate remedy. Therefore, Recipient agrees that, in addition to any other remedies available to MTI, in the event of any breach or threatened breach of this Agreement, MTI shall be entitled to injunctive relief and Recipient waives any requirement for the posting of a bond in connection therewith.\n13. No Implied Waiver. MTI’s failure or delay in exercising any of its rights hereunder will not constitute a waiver of such rights unless expressly waived in writing.\n14. General. This Agreement:\n(i) may be amended or modified only by an express writing signed by Recipient and an authorized representative of MTI;\n(ii) will not be construed as creating any joint venture, partnership or other form of business association between the parties hereto;\n(iii) is not assignable or delegable in whole or in part by Recipient without the express written consent of MTI;\n(iv) shall inure to the benefit of and be binding upon the parties, their successors, the assigns of MTI and the permitted assigns of Recipient;\nand (v) is in the English language only, which language shall be controlling in all respects, and all versions of this Agreement in any other language shall not be binding on the parties hereto.\n15. Authorized Signatory. The individual clicking on \"Accept\" is entering into this Agreement and accessing Confidential Information either (1) as an individual, and hereby agrees that he or she shall be personally liable to MTI if Confidential Information is disclosed or used in a manner not authorized by this Agreement, or (2) on behalf of an employer or other entity, and hereby represents and warrants that he or she has full legal authority to bind such employer or entity to this Agreement and that such employer or entity shall be legally bound by all of the terms and conditions of this Agreement as Recipient hereunder. IF CONFIDENTIAL INFORMATION IS FOR AN EMPLOYER OR ENTITY, BUT YOU DO NOT HAVE THE LEGAL AUTHORITY TO SO BIND SUCH EMPLOYER OR ENTITY, THEN DO NOT ACCESS, VIEW, READ, OR DOWNLOAD IN ANY WAY CONFIDENTIAL INFORMATION, AND DO NOT CLICK ON \"ACCEPT.\"\nIn order to review documents, you must accept the NDA. If you do not accept these terms, select Decline to exit this menu."
    },
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/about/company/company-timeline",
        "Content_Type": "Website Content",
        "Raw_Text": "To access these documents, you must first read and accept Micron's electronic non-disclosure agreement. If the Recipient has a written confidentiality agreement with Micron Technology, Inc. you will need to click \"Accept\" at the bottom of this page, but the terms of the written confidentiality agreement will apply.\nON-LINE NONDISCLOSURE AGREEMENT THIS IS A LEGAL AGREEMENT BETWEEN YOU OR THE COMPANY YOU REPRESENT (EACH A \"RECIPENT\") AND MICRON TECHNOLOGY, INC. (\"MTI\") STATING THE TERMS AND CONDITIONS THAT GOVERN THE CONFIDENTIALITY OF INFORMATION POSTED TO OR MADE AVAILABLE THROUGH THE MICRON WEBSITE. PLEASE CAREFULLY READ THIS NONDISCLOSURE AGREEMENT (\"AGREEMENT\") BEFORE CLICKING \"ACCEPT\" AT THE BOTTOM OF THE PAGE. BY CLICKING ON\"ACCEPT\", RECIPIENT IS AGREEING TO BE BOUND BY THE TERMS OF THIS AGREEMENT. IF RECIPIENT DOES NOT AGREE TO THE TERMS OF THIS AGREEMENT, PRESS \"DECLINE\" AND RECIPENT WILL BE UNABLE TO ACCESS CONFIDENTIAL INFORMATION.\n1. Written Nondisclosure Agreement. If Recipient and MTI have entered into a written confidentiality agreement (\"Confidentiality Agreement\") that is in effect as of the date Recipient enters into this Agreement and such Confidentiality Agreement already applies to and governs the Confidential Information (defined below), then the terms of such Confidentiality Agreement shall apply to and govern Recipient’s obligations concerning such Confidential Information and not the terms of this Agreement.\n2. Confidential Information. \"Confidential Information\" means any information or data posted to or made available through MTI’s secure website that is (i) marked or labeled as \"Confidential\" or \"Proprietary\" or with similar designation, or (ii) of a nature that a reasonable person would know such information is confidential. Confidential Information does not include that which:\n(i) is proven by Recipient through competent evidence to rightfully have already been in Recipient's possession at the time of disclosure without an obligation of confidentiality;\n(ii) is or becomes available to the public through no fault or breach on the part of Recipient;\n(iii) is independently developed by Recipient without use of or reference to the Confidential Information;\nor (iv) is rightfully obtained from a third party who has the right to transfer or disclose it to Recipient without restriction.\n3. Purpose of Disclosure and Restriction on Use. Confidential Information is disclosed hereunder strictly for the purpose of Recipient’s internal evaluation and/or to assist Recipient in the implementation of an MTI device or product into a commercial product (\"Purpose\"). Recipient shall use the Confidential Information solely in accordance with the terms of this Agreement to accomplish the Purpose and shall make no further use, in whole or in part, of the Confidential Information.\n4. Non-Disclosure. Recipient agrees to protect the Confidential Information, using at least the same degree of care it uses to protect its own confidential and proprietary information, but in no case with less than reasonable care. Recipient shall not disclose, publish or disseminate Confidential Information to anyone other than those of its employees, agents, contractors and consultants (collectively \"Representatives\") who have a need to know the information in order to accomplish the Purpose and who are bound by a written agreement that prohibits unauthorized disclosure or use of Confidential Information on terms no less restrictive and protective than those contained within this Agreement. Recipient will be responsible for any violation of the terms of this Agreement by its Representatives. Recipient may disclose Confidential Information to the extent required by law, provided Recipient shall promptly notify MTI in writing of such requirement to disclose and Recipient shall cooperate with MTI’s efforts to protect the Confidential Information. Recipient shall notify MTI promptly in writing in the event of any disclosure of the Confidential Information which is not authorized under this Agreement.\n5. Feedback. Notwithstanding any other provision in this Agreement, if Recipient provides any ideas, suggestions or recommendations to MTI regarding Confidential Information (\"Feedback\"), MTI is free to use and incorporate such Feedback in MTI’s products, without payment of royalties or other consideration to Recipient, so long as MTI does not infringe Recipient’s patents, copyrights or trademark rights in the Feedback.\n6. Copies. Recipient shall not make any copies of Confidential Information except as strictly necessary to carry out the above-stated Purpose. Any copies that are made must be identical to the original, may not be modified, and shall be considered the property of MTI.\n7. No License. No Warranty. Except as expressly set forth herein, no license is granted hereunder to any patents, copyrights, mask works, or trademarks either expressly, by implication, estoppel or otherwise. Any such license must be express and in writing from MTI. All Confidential Information shall remain the property of MTI and nothing in this Agreement shall restrict MTI from using, disclosing or disseminating such Confidential Information in any way. CONFIDENTIAL INFORMATION IS DISCLOSED HEREUNDER \"AS IS\" WITHOUT ANY REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS OR WARRANTIES AS TO THE ACCURACY, COMPLETENESS OR UTILITY OF SUCH CONFIDENTIAL INFORMATION.\n8. Termination of Obligations of Confidentiality. This Agreement will become effective on the date Recipient clicks on \"Accept.\" Notwithstanding any termination of this Agreement, the provisions of this Agreement shall continue for a period of five (5) years from the date of each disclosure of Confidential Information. MTI may terminate this Agreement at any time in its sole discretion upon written notice to Recipient (including such notice transmitted through this secure MTI website or via electronic mail to Recipient).\n9. Return of Confidential Information. Within ten (10) business days of MTI’s written request, and at MTI’s option, Recipient shall return or certify to MTI the destruction of the Confidential Information including, without limitation, hard copy and electronic documents and all materials created by Recipient that contain the Confidential Information.\n10. Governing Law and Attorneys' Fees. This Agreement shall be governed by the laws of the State of Idaho, U.S.A., excluding its conflict of laws principles. Recipient hereby consents to the personal jurisdiction of the courts of Idaho for any dispute arising out of this Agreement. In the event of any suit, action or proceeding arising out of or relating to this Agreement, the prevailing party will be entitled to reasonable attorneys' fees and reasonable costs incurred.\n11. Export. Recipient agrees that Confidential Information, or any portion thereof, shall not be exported or re-exported, directly or indirectly, in any form, except in compliance with the U.S. Export Administration Act and all other applicable export control laws or regulations.\n12. Injunctive Relief. Recipient acknowledges and agrees that disclosure of Confidential Information in violation of the terms of this Agreement will cause irreparable harm to MTI for which monetary damages would not be an adequate remedy. Therefore, Recipient agrees that, in addition to any other remedies available to MTI, in the event of any breach or threatened breach of this Agreement, MTI shall be entitled to injunctive relief and Recipient waives any requirement for the posting of a bond in connection therewith.\n13. No Implied Waiver. MTI’s failure or delay in exercising any of its rights hereunder will not constitute a waiver of such rights unless expressly waived in writing.\n14. General. This Agreement:\n(i) may be amended or modified only by an express writing signed by Recipient and an authorized representative of MTI;\n(ii) will not be construed as creating any joint venture, partnership or other form of business association between the parties hereto;\n(iii) is not assignable or delegable in whole or in part by Recipient without the express written consent of MTI;\n(iv) shall inure to the benefit of and be binding upon the parties, their successors, the assigns of MTI and the permitted assigns of Recipient;\nand (v) is in the English language only, which language shall be controlling in all respects, and all versions of this Agreement in any other language shall not be binding on the parties hereto.\n15. Authorized Signatory. The individual clicking on \"Accept\" is entering into this Agreement and accessing Confidential Information either (1) as an individual, and hereby agrees that he or she shall be personally liable to MTI if Confidential Information is disclosed or used in a manner not authorized by this Agreement, or (2) on behalf of an employer or other entity, and hereby represents and warrants that he or she has full legal authority to bind such employer or entity to this Agreement and that such employer or entity shall be legally bound by all of the terms and conditions of this Agreement as Recipient hereunder. IF CONFIDENTIAL INFORMATION IS FOR AN EMPLOYER OR ENTITY, BUT YOU DO NOT HAVE THE LEGAL AUTHORITY TO SO BIND SUCH EMPLOYER OR ENTITY, THEN DO NOT ACCESS, VIEW, READ, OR DOWNLOAD IN ANY WAY CONFIDENTIAL INFORMATION, AND DO NOT CLICK ON \"ACCEPT.\"\nIn order to review documents, you must accept the NDA. If you do not accept these terms, select Decline to exit this menu."
    },
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/about/company/public-policy",
        "Content_Type": "Website Content",
        "Raw_Text": "To access these documents, you must first read and accept Micron's electronic non-disclosure agreement. If the Recipient has a written confidentiality agreement with Micron Technology, Inc. you will need to click \"Accept\" at the bottom of this page, but the terms of the written confidentiality agreement will apply.\nON-LINE NONDISCLOSURE AGREEMENT THIS IS A LEGAL AGREEMENT BETWEEN YOU OR THE COMPANY YOU REPRESENT (EACH A \"RECIPENT\") AND MICRON TECHNOLOGY, INC. (\"MTI\") STATING THE TERMS AND CONDITIONS THAT GOVERN THE CONFIDENTIALITY OF INFORMATION POSTED TO OR MADE AVAILABLE THROUGH THE MICRON WEBSITE. PLEASE CAREFULLY READ THIS NONDISCLOSURE AGREEMENT (\"AGREEMENT\") BEFORE CLICKING \"ACCEPT\" AT THE BOTTOM OF THE PAGE. BY CLICKING ON\"ACCEPT\", RECIPIENT IS AGREEING TO BE BOUND BY THE TERMS OF THIS AGREEMENT. IF RECIPIENT DOES NOT AGREE TO THE TERMS OF THIS AGREEMENT, PRESS \"DECLINE\" AND RECIPENT WILL BE UNABLE TO ACCESS CONFIDENTIAL INFORMATION.\n1. Written Nondisclosure Agreement. If Recipient and MTI have entered into a written confidentiality agreement (\"Confidentiality Agreement\") that is in effect as of the date Recipient enters into this Agreement and such Confidentiality Agreement already applies to and governs the Confidential Information (defined below), then the terms of such Confidentiality Agreement shall apply to and govern Recipient’s obligations concerning such Confidential Information and not the terms of this Agreement.\n2. Confidential Information. \"Confidential Information\" means any information or data posted to or made available through MTI’s secure website that is (i) marked or labeled as \"Confidential\" or \"Proprietary\" or with similar designation, or (ii) of a nature that a reasonable person would know such information is confidential. Confidential Information does not include that which:\n(i) is proven by Recipient through competent evidence to rightfully have already been in Recipient's possession at the time of disclosure without an obligation of confidentiality;\n(ii) is or becomes available to the public through no fault or breach on the part of Recipient;\n(iii) is independently developed by Recipient without use of or reference to the Confidential Information;\nor (iv) is rightfully obtained from a third party who has the right to transfer or disclose it to Recipient without restriction.\n3. Purpose of Disclosure and Restriction on Use. Confidential Information is disclosed hereunder strictly for the purpose of Recipient’s internal evaluation and/or to assist Recipient in the implementation of an MTI device or product into a commercial product (\"Purpose\"). Recipient shall use the Confidential Information solely in accordance with the terms of this Agreement to accomplish the Purpose and shall make no further use, in whole or in part, of the Confidential Information.\n4. Non-Disclosure. Recipient agrees to protect the Confidential Information, using at least the same degree of care it uses to protect its own confidential and proprietary information, but in no case with less than reasonable care. Recipient shall not disclose, publish or disseminate Confidential Information to anyone other than those of its employees, agents, contractors and consultants (collectively \"Representatives\") who have a need to know the information in order to accomplish the Purpose and who are bound by a written agreement that prohibits unauthorized disclosure or use of Confidential Information on terms no less restrictive and protective than those contained within this Agreement. Recipient will be responsible for any violation of the terms of this Agreement by its Representatives. Recipient may disclose Confidential Information to the extent required by law, provided Recipient shall promptly notify MTI in writing of such requirement to disclose and Recipient shall cooperate with MTI’s efforts to protect the Confidential Information. Recipient shall notify MTI promptly in writing in the event of any disclosure of the Confidential Information which is not authorized under this Agreement.\n5. Feedback. Notwithstanding any other provision in this Agreement, if Recipient provides any ideas, suggestions or recommendations to MTI regarding Confidential Information (\"Feedback\"), MTI is free to use and incorporate such Feedback in MTI’s products, without payment of royalties or other consideration to Recipient, so long as MTI does not infringe Recipient’s patents, copyrights or trademark rights in the Feedback.\n6. Copies. Recipient shall not make any copies of Confidential Information except as strictly necessary to carry out the above-stated Purpose. Any copies that are made must be identical to the original, may not be modified, and shall be considered the property of MTI.\n7. No License. No Warranty. Except as expressly set forth herein, no license is granted hereunder to any patents, copyrights, mask works, or trademarks either expressly, by implication, estoppel or otherwise. Any such license must be express and in writing from MTI. All Confidential Information shall remain the property of MTI and nothing in this Agreement shall restrict MTI from using, disclosing or disseminating such Confidential Information in any way. CONFIDENTIAL INFORMATION IS DISCLOSED HEREUNDER \"AS IS\" WITHOUT ANY REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS OR WARRANTIES AS TO THE ACCURACY, COMPLETENESS OR UTILITY OF SUCH CONFIDENTIAL INFORMATION.\n8. Termination of Obligations of Confidentiality. This Agreement will become effective on the date Recipient clicks on \"Accept.\" Notwithstanding any termination of this Agreement, the provisions of this Agreement shall continue for a period of five (5) years from the date of each disclosure of Confidential Information. MTI may terminate this Agreement at any time in its sole discretion upon written notice to Recipient (including such notice transmitted through this secure MTI website or via electronic mail to Recipient).\n9. Return of Confidential Information. Within ten (10) business days of MTI’s written request, and at MTI’s option, Recipient shall return or certify to MTI the destruction of the Confidential Information including, without limitation, hard copy and electronic documents and all materials created by Recipient that contain the Confidential Information.\n10. Governing Law and Attorneys' Fees. This Agreement shall be governed by the laws of the State of Idaho, U.S.A., excluding its conflict of laws principles. Recipient hereby consents to the personal jurisdiction of the courts of Idaho for any dispute arising out of this Agreement. In the event of any suit, action or proceeding arising out of or relating to this Agreement, the prevailing party will be entitled to reasonable attorneys' fees and reasonable costs incurred.\n11. Export. Recipient agrees that Confidential Information, or any portion thereof, shall not be exported or re-exported, directly or indirectly, in any form, except in compliance with the U.S. Export Administration Act and all other applicable export control laws or regulations.\n12. Injunctive Relief. Recipient acknowledges and agrees that disclosure of Confidential Information in violation of the terms of this Agreement will cause irreparable harm to MTI for which monetary damages would not be an adequate remedy. Therefore, Recipient agrees that, in addition to any other remedies available to MTI, in the event of any breach or threatened breach of this Agreement, MTI shall be entitled to injunctive relief and Recipient waives any requirement for the posting of a bond in connection therewith.\n13. No Implied Waiver. MTI’s failure or delay in exercising any of its rights hereunder will not constitute a waiver of such rights unless expressly waived in writing.\n14. General. This Agreement:\n(i) may be amended or modified only by an express writing signed by Recipient and an authorized representative of MTI;\n(ii) will not be construed as creating any joint venture, partnership or other form of business association between the parties hereto;\n(iii) is not assignable or delegable in whole or in part by Recipient without the express written consent of MTI;\n(iv) shall inure to the benefit of and be binding upon the parties, their successors, the assigns of MTI and the permitted assigns of Recipient;\nand (v) is in the English language only, which language shall be controlling in all respects, and all versions of this Agreement in any other language shall not be binding on the parties hereto.\n15. Authorized Signatory. The individual clicking on \"Accept\" is entering into this Agreement and accessing Confidential Information either (1) as an individual, and hereby agrees that he or she shall be personally liable to MTI if Confidential Information is disclosed or used in a manner not authorized by this Agreement, or (2) on behalf of an employer or other entity, and hereby represents and warrants that he or she has full legal authority to bind such employer or entity to this Agreement and that such employer or entity shall be legally bound by all of the terms and conditions of this Agreement as Recipient hereunder. IF CONFIDENTIAL INFORMATION IS FOR AN EMPLOYER OR ENTITY, BUT YOU DO NOT HAVE THE LEGAL AUTHORITY TO SO BIND SUCH EMPLOYER OR ENTITY, THEN DO NOT ACCESS, VIEW, READ, OR DOWNLOAD IN ANY WAY CONFIDENTIAL INFORMATION, AND DO NOT CLICK ON \"ACCEPT.\"\nIn order to review documents, you must accept the NDA. If you do not accept these terms, select Decline to exit this menu."
    },
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/about/company/leadership",
        "Content_Type": "Website Content",
        "Raw_Text": "To access these documents, you must first read and accept Micron's electronic non-disclosure agreement. If the Recipient has a written confidentiality agreement with Micron Technology, Inc. you will need to click \"Accept\" at the bottom of this page, but the terms of the written confidentiality agreement will apply.\nON-LINE NONDISCLOSURE AGREEMENT THIS IS A LEGAL AGREEMENT BETWEEN YOU OR THE COMPANY YOU REPRESENT (EACH A \"RECIPENT\") AND MICRON TECHNOLOGY, INC. (\"MTI\") STATING THE TERMS AND CONDITIONS THAT GOVERN THE CONFIDENTIALITY OF INFORMATION POSTED TO OR MADE AVAILABLE THROUGH THE MICRON WEBSITE. PLEASE CAREFULLY READ THIS NONDISCLOSURE AGREEMENT (\"AGREEMENT\") BEFORE CLICKING \"ACCEPT\" AT THE BOTTOM OF THE PAGE. BY CLICKING ON\"ACCEPT\", RECIPIENT IS AGREEING TO BE BOUND BY THE TERMS OF THIS AGREEMENT. IF RECIPIENT DOES NOT AGREE TO THE TERMS OF THIS AGREEMENT, PRESS \"DECLINE\" AND RECIPENT WILL BE UNABLE TO ACCESS CONFIDENTIAL INFORMATION.\n1. Written Nondisclosure Agreement. If Recipient and MTI have entered into a written confidentiality agreement (\"Confidentiality Agreement\") that is in effect as of the date Recipient enters into this Agreement and such Confidentiality Agreement already applies to and governs the Confidential Information (defined below), then the terms of such Confidentiality Agreement shall apply to and govern Recipient’s obligations concerning such Confidential Information and not the terms of this Agreement.\n2. Confidential Information. \"Confidential Information\" means any information or data posted to or made available through MTI’s secure website that is (i) marked or labeled as \"Confidential\" or \"Proprietary\" or with similar designation, or (ii) of a nature that a reasonable person would know such information is confidential. Confidential Information does not include that which:\n(i) is proven by Recipient through competent evidence to rightfully have already been in Recipient's possession at the time of disclosure without an obligation of confidentiality;\n(ii) is or becomes available to the public through no fault or breach on the part of Recipient;\n(iii) is independently developed by Recipient without use of or reference to the Confidential Information;\nor (iv) is rightfully obtained from a third party who has the right to transfer or disclose it to Recipient without restriction.\n3. Purpose of Disclosure and Restriction on Use. Confidential Information is disclosed hereunder strictly for the purpose of Recipient’s internal evaluation and/or to assist Recipient in the implementation of an MTI device or product into a commercial product (\"Purpose\"). Recipient shall use the Confidential Information solely in accordance with the terms of this Agreement to accomplish the Purpose and shall make no further use, in whole or in part, of the Confidential Information.\n4. Non-Disclosure. Recipient agrees to protect the Confidential Information, using at least the same degree of care it uses to protect its own confidential and proprietary information, but in no case with less than reasonable care. Recipient shall not disclose, publish or disseminate Confidential Information to anyone other than those of its employees, agents, contractors and consultants (collectively \"Representatives\") who have a need to know the information in order to accomplish the Purpose and who are bound by a written agreement that prohibits unauthorized disclosure or use of Confidential Information on terms no less restrictive and protective than those contained within this Agreement. Recipient will be responsible for any violation of the terms of this Agreement by its Representatives. Recipient may disclose Confidential Information to the extent required by law, provided Recipient shall promptly notify MTI in writing of such requirement to disclose and Recipient shall cooperate with MTI’s efforts to protect the Confidential Information. Recipient shall notify MTI promptly in writing in the event of any disclosure of the Confidential Information which is not authorized under this Agreement.\n5. Feedback. Notwithstanding any other provision in this Agreement, if Recipient provides any ideas, suggestions or recommendations to MTI regarding Confidential Information (\"Feedback\"), MTI is free to use and incorporate such Feedback in MTI’s products, without payment of royalties or other consideration to Recipient, so long as MTI does not infringe Recipient’s patents, copyrights or trademark rights in the Feedback.\n6. Copies. Recipient shall not make any copies of Confidential Information except as strictly necessary to carry out the above-stated Purpose. Any copies that are made must be identical to the original, may not be modified, and shall be considered the property of MTI.\n7. No License. No Warranty. Except as expressly set forth herein, no license is granted hereunder to any patents, copyrights, mask works, or trademarks either expressly, by implication, estoppel or otherwise. Any such license must be express and in writing from MTI. All Confidential Information shall remain the property of MTI and nothing in this Agreement shall restrict MTI from using, disclosing or disseminating such Confidential Information in any way. CONFIDENTIAL INFORMATION IS DISCLOSED HEREUNDER \"AS IS\" WITHOUT ANY REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS OR WARRANTIES AS TO THE ACCURACY, COMPLETENESS OR UTILITY OF SUCH CONFIDENTIAL INFORMATION.\n8. Termination of Obligations of Confidentiality. This Agreement will become effective on the date Recipient clicks on \"Accept.\" Notwithstanding any termination of this Agreement, the provisions of this Agreement shall continue for a period of five (5) years from the date of each disclosure of Confidential Information. MTI may terminate this Agreement at any time in its sole discretion upon written notice to Recipient (including such notice transmitted through this secure MTI website or via electronic mail to Recipient).\n9. Return of Confidential Information. Within ten (10) business days of MTI’s written request, and at MTI’s option, Recipient shall return or certify to MTI the destruction of the Confidential Information including, without limitation, hard copy and electronic documents and all materials created by Recipient that contain the Confidential Information.\n10. Governing Law and Attorneys' Fees. This Agreement shall be governed by the laws of the State of Idaho, U.S.A., excluding its conflict of laws principles. Recipient hereby consents to the personal jurisdiction of the courts of Idaho for any dispute arising out of this Agreement. In the event of any suit, action or proceeding arising out of or relating to this Agreement, the prevailing party will be entitled to reasonable attorneys' fees and reasonable costs incurred.\n11. Export. Recipient agrees that Confidential Information, or any portion thereof, shall not be exported or re-exported, directly or indirectly, in any form, except in compliance with the U.S. Export Administration Act and all other applicable export control laws or regulations.\n12. Injunctive Relief. Recipient acknowledges and agrees that disclosure of Confidential Information in violation of the terms of this Agreement will cause irreparable harm to MTI for which monetary damages would not be an adequate remedy. Therefore, Recipient agrees that, in addition to any other remedies available to MTI, in the event of any breach or threatened breach of this Agreement, MTI shall be entitled to injunctive relief and Recipient waives any requirement for the posting of a bond in connection therewith.\n13. No Implied Waiver. MTI’s failure or delay in exercising any of its rights hereunder will not constitute a waiver of such rights unless expressly waived in writing.\n14. General. This Agreement:\n(i) may be amended or modified only by an express writing signed by Recipient and an authorized representative of MTI;\n(ii) will not be construed as creating any joint venture, partnership or other form of business association between the parties hereto;\n(iii) is not assignable or delegable in whole or in part by Recipient without the express written consent of MTI;\n(iv) shall inure to the benefit of and be binding upon the parties, their successors, the assigns of MTI and the permitted assigns of Recipient;\nand (v) is in the English language only, which language shall be controlling in all respects, and all versions of this Agreement in any other language shall not be binding on the parties hereto.\n15. Authorized Signatory. The individual clicking on \"Accept\" is entering into this Agreement and accessing Confidential Information either (1) as an individual, and hereby agrees that he or she shall be personally liable to MTI if Confidential Information is disclosed or used in a manner not authorized by this Agreement, or (2) on behalf of an employer or other entity, and hereby represents and warrants that he or she has full legal authority to bind such employer or entity to this Agreement and that such employer or entity shall be legally bound by all of the terms and conditions of this Agreement as Recipient hereunder. IF CONFIDENTIAL INFORMATION IS FOR AN EMPLOYER OR ENTITY, BUT YOU DO NOT HAVE THE LEGAL AUTHORITY TO SO BIND SUCH EMPLOYER OR ENTITY, THEN DO NOT ACCESS, VIEW, READ, OR DOWNLOAD IN ANY WAY CONFIDENTIAL INFORMATION, AND DO NOT CLICK ON \"ACCEPT.\"\nIn order to review documents, you must accept the NDA. If you do not accept these terms, select Decline to exit this menu."
    },
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/about/company/opportunity-for-all",
        "Content_Type": "Website Content",
        "Raw_Text": "To access these documents, you must first read and accept Micron's electronic non-disclosure agreement. If the Recipient has a written confidentiality agreement with Micron Technology, Inc. you will need to click \"Accept\" at the bottom of this page, but the terms of the written confidentiality agreement will apply.\nON-LINE NONDISCLOSURE AGREEMENT THIS IS A LEGAL AGREEMENT BETWEEN YOU OR THE COMPANY YOU REPRESENT (EACH A \"RECIPENT\") AND MICRON TECHNOLOGY, INC. (\"MTI\") STATING THE TERMS AND CONDITIONS THAT GOVERN THE CONFIDENTIALITY OF INFORMATION POSTED TO OR MADE AVAILABLE THROUGH THE MICRON WEBSITE. PLEASE CAREFULLY READ THIS NONDISCLOSURE AGREEMENT (\"AGREEMENT\") BEFORE CLICKING \"ACCEPT\" AT THE BOTTOM OF THE PAGE. BY CLICKING ON\"ACCEPT\", RECIPIENT IS AGREEING TO BE BOUND BY THE TERMS OF THIS AGREEMENT. IF RECIPIENT DOES NOT AGREE TO THE TERMS OF THIS AGREEMENT, PRESS \"DECLINE\" AND RECIPENT WILL BE UNABLE TO ACCESS CONFIDENTIAL INFORMATION.\n1. Written Nondisclosure Agreement. If Recipient and MTI have entered into a written confidentiality agreement (\"Confidentiality Agreement\") that is in effect as of the date Recipient enters into this Agreement and such Confidentiality Agreement already applies to and governs the Confidential Information (defined below), then the terms of such Confidentiality Agreement shall apply to and govern Recipient’s obligations concerning such Confidential Information and not the terms of this Agreement.\n2. Confidential Information. \"Confidential Information\" means any information or data posted to or made available through MTI’s secure website that is (i) marked or labeled as \"Confidential\" or \"Proprietary\" or with similar designation, or (ii) of a nature that a reasonable person would know such information is confidential. Confidential Information does not include that which:\n(i) is proven by Recipient through competent evidence to rightfully have already been in Recipient's possession at the time of disclosure without an obligation of confidentiality;\n(ii) is or becomes available to the public through no fault or breach on the part of Recipient;\n(iii) is independently developed by Recipient without use of or reference to the Confidential Information;\nor (iv) is rightfully obtained from a third party who has the right to transfer or disclose it to Recipient without restriction.\n3. Purpose of Disclosure and Restriction on Use. Confidential Information is disclosed hereunder strictly for the purpose of Recipient’s internal evaluation and/or to assist Recipient in the implementation of an MTI device or product into a commercial product (\"Purpose\"). Recipient shall use the Confidential Information solely in accordance with the terms of this Agreement to accomplish the Purpose and shall make no further use, in whole or in part, of the Confidential Information.\n4. Non-Disclosure. Recipient agrees to protect the Confidential Information, using at least the same degree of care it uses to protect its own confidential and proprietary information, but in no case with less than reasonable care. Recipient shall not disclose, publish or disseminate Confidential Information to anyone other than those of its employees, agents, contractors and consultants (collectively \"Representatives\") who have a need to know the information in order to accomplish the Purpose and who are bound by a written agreement that prohibits unauthorized disclosure or use of Confidential Information on terms no less restrictive and protective than those contained within this Agreement. Recipient will be responsible for any violation of the terms of this Agreement by its Representatives. Recipient may disclose Confidential Information to the extent required by law, provided Recipient shall promptly notify MTI in writing of such requirement to disclose and Recipient shall cooperate with MTI’s efforts to protect the Confidential Information. Recipient shall notify MTI promptly in writing in the event of any disclosure of the Confidential Information which is not authorized under this Agreement.\n5. Feedback. Notwithstanding any other provision in this Agreement, if Recipient provides any ideas, suggestions or recommendations to MTI regarding Confidential Information (\"Feedback\"), MTI is free to use and incorporate such Feedback in MTI’s products, without payment of royalties or other consideration to Recipient, so long as MTI does not infringe Recipient’s patents, copyrights or trademark rights in the Feedback.\n6. Copies. Recipient shall not make any copies of Confidential Information except as strictly necessary to carry out the above-stated Purpose. Any copies that are made must be identical to the original, may not be modified, and shall be considered the property of MTI.\n7. No License. No Warranty. Except as expressly set forth herein, no license is granted hereunder to any patents, copyrights, mask works, or trademarks either expressly, by implication, estoppel or otherwise. Any such license must be express and in writing from MTI. All Confidential Information shall remain the property of MTI and nothing in this Agreement shall restrict MTI from using, disclosing or disseminating such Confidential Information in any way. CONFIDENTIAL INFORMATION IS DISCLOSED HEREUNDER \"AS IS\" WITHOUT ANY REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS OR WARRANTIES AS TO THE ACCURACY, COMPLETENESS OR UTILITY OF SUCH CONFIDENTIAL INFORMATION.\n8. Termination of Obligations of Confidentiality. This Agreement will become effective on the date Recipient clicks on \"Accept.\" Notwithstanding any termination of this Agreement, the provisions of this Agreement shall continue for a period of five (5) years from the date of each disclosure of Confidential Information. MTI may terminate this Agreement at any time in its sole discretion upon written notice to Recipient (including such notice transmitted through this secure MTI website or via electronic mail to Recipient).\n9. Return of Confidential Information. Within ten (10) business days of MTI’s written request, and at MTI’s option, Recipient shall return or certify to MTI the destruction of the Confidential Information including, without limitation, hard copy and electronic documents and all materials created by Recipient that contain the Confidential Information.\n10. Governing Law and Attorneys' Fees. This Agreement shall be governed by the laws of the State of Idaho, U.S.A., excluding its conflict of laws principles. Recipient hereby consents to the personal jurisdiction of the courts of Idaho for any dispute arising out of this Agreement. In the event of any suit, action or proceeding arising out of or relating to this Agreement, the prevailing party will be entitled to reasonable attorneys' fees and reasonable costs incurred.\n11. Export. Recipient agrees that Confidential Information, or any portion thereof, shall not be exported or re-exported, directly or indirectly, in any form, except in compliance with the U.S. Export Administration Act and all other applicable export control laws or regulations.\n12. Injunctive Relief. Recipient acknowledges and agrees that disclosure of Confidential Information in violation of the terms of this Agreement will cause irreparable harm to MTI for which monetary damages would not be an adequate remedy. Therefore, Recipient agrees that, in addition to any other remedies available to MTI, in the event of any breach or threatened breach of this Agreement, MTI shall be entitled to injunctive relief and Recipient waives any requirement for the posting of a bond in connection therewith.\n13. No Implied Waiver. MTI’s failure or delay in exercising any of its rights hereunder will not constitute a waiver of such rights unless expressly waived in writing.\n14. General. This Agreement:\n(i) may be amended or modified only by an express writing signed by Recipient and an authorized representative of MTI;\n(ii) will not be construed as creating any joint venture, partnership or other form of business association between the parties hereto;\n(iii) is not assignable or delegable in whole or in part by Recipient without the express written consent of MTI;\n(iv) shall inure to the benefit of and be binding upon the parties, their successors, the assigns of MTI and the permitted assigns of Recipient;\nand (v) is in the English language only, which language shall be controlling in all respects, and all versions of this Agreement in any other language shall not be binding on the parties hereto.\n15. Authorized Signatory. The individual clicking on \"Accept\" is entering into this Agreement and accessing Confidential Information either (1) as an individual, and hereby agrees that he or she shall be personally liable to MTI if Confidential Information is disclosed or used in a manner not authorized by this Agreement, or (2) on behalf of an employer or other entity, and hereby represents and warrants that he or she has full legal authority to bind such employer or entity to this Agreement and that such employer or entity shall be legally bound by all of the terms and conditions of this Agreement as Recipient hereunder. IF CONFIDENTIAL INFORMATION IS FOR AN EMPLOYER OR ENTITY, BUT YOU DO NOT HAVE THE LEGAL AUTHORITY TO SO BIND SUCH EMPLOYER OR ENTITY, THEN DO NOT ACCESS, VIEW, READ, OR DOWNLOAD IN ANY WAY CONFIDENTIAL INFORMATION, AND DO NOT CLICK ON \"ACCEPT.\"\nIn order to review documents, you must accept the NDA. If you do not accept these terms, select Decline to exit this menu."
    },
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/about/company/product-security-center",
        "Content_Type": "Website Content",
        "Raw_Text": "To access these documents, you must first read and accept Micron's electronic non-disclosure agreement. If the Recipient has a written confidentiality agreement with Micron Technology, Inc. you will need to click \"Accept\" at the bottom of this page, but the terms of the written confidentiality agreement will apply.\nON-LINE NONDISCLOSURE AGREEMENT THIS IS A LEGAL AGREEMENT BETWEEN YOU OR THE COMPANY YOU REPRESENT (EACH A \"RECIPENT\") AND MICRON TECHNOLOGY, INC. (\"MTI\") STATING THE TERMS AND CONDITIONS THAT GOVERN THE CONFIDENTIALITY OF INFORMATION POSTED TO OR MADE AVAILABLE THROUGH THE MICRON WEBSITE. PLEASE CAREFULLY READ THIS NONDISCLOSURE AGREEMENT (\"AGREEMENT\") BEFORE CLICKING \"ACCEPT\" AT THE BOTTOM OF THE PAGE. BY CLICKING ON\"ACCEPT\", RECIPIENT IS AGREEING TO BE BOUND BY THE TERMS OF THIS AGREEMENT. IF RECIPIENT DOES NOT AGREE TO THE TERMS OF THIS AGREEMENT, PRESS \"DECLINE\" AND RECIPENT WILL BE UNABLE TO ACCESS CONFIDENTIAL INFORMATION.\n1. Written Nondisclosure Agreement. If Recipient and MTI have entered into a written confidentiality agreement (\"Confidentiality Agreement\") that is in effect as of the date Recipient enters into this Agreement and such Confidentiality Agreement already applies to and governs the Confidential Information (defined below), then the terms of such Confidentiality Agreement shall apply to and govern Recipient’s obligations concerning such Confidential Information and not the terms of this Agreement.\n2. Confidential Information. \"Confidential Information\" means any information or data posted to or made available through MTI’s secure website that is (i) marked or labeled as \"Confidential\" or \"Proprietary\" or with similar designation, or (ii) of a nature that a reasonable person would know such information is confidential. Confidential Information does not include that which:\n(i) is proven by Recipient through competent evidence to rightfully have already been in Recipient's possession at the time of disclosure without an obligation of confidentiality;\n(ii) is or becomes available to the public through no fault or breach on the part of Recipient;\n(iii) is independently developed by Recipient without use of or reference to the Confidential Information;\nor (iv) is rightfully obtained from a third party who has the right to transfer or disclose it to Recipient without restriction.\n3. Purpose of Disclosure and Restriction on Use. Confidential Information is disclosed hereunder strictly for the purpose of Recipient’s internal evaluation and/or to assist Recipient in the implementation of an MTI device or product into a commercial product (\"Purpose\"). Recipient shall use the Confidential Information solely in accordance with the terms of this Agreement to accomplish the Purpose and shall make no further use, in whole or in part, of the Confidential Information.\n4. Non-Disclosure. Recipient agrees to protect the Confidential Information, using at least the same degree of care it uses to protect its own confidential and proprietary information, but in no case with less than reasonable care. Recipient shall not disclose, publish or disseminate Confidential Information to anyone other than those of its employees, agents, contractors and consultants (collectively \"Representatives\") who have a need to know the information in order to accomplish the Purpose and who are bound by a written agreement that prohibits unauthorized disclosure or use of Confidential Information on terms no less restrictive and protective than those contained within this Agreement. Recipient will be responsible for any violation of the terms of this Agreement by its Representatives. Recipient may disclose Confidential Information to the extent required by law, provided Recipient shall promptly notify MTI in writing of such requirement to disclose and Recipient shall cooperate with MTI’s efforts to protect the Confidential Information. Recipient shall notify MTI promptly in writing in the event of any disclosure of the Confidential Information which is not authorized under this Agreement.\n5. Feedback. Notwithstanding any other provision in this Agreement, if Recipient provides any ideas, suggestions or recommendations to MTI regarding Confidential Information (\"Feedback\"), MTI is free to use and incorporate such Feedback in MTI’s products, without payment of royalties or other consideration to Recipient, so long as MTI does not infringe Recipient’s patents, copyrights or trademark rights in the Feedback.\n6. Copies. Recipient shall not make any copies of Confidential Information except as strictly necessary to carry out the above-stated Purpose. Any copies that are made must be identical to the original, may not be modified, and shall be considered the property of MTI.\n7. No License. No Warranty. Except as expressly set forth herein, no license is granted hereunder to any patents, copyrights, mask works, or trademarks either expressly, by implication, estoppel or otherwise. Any such license must be express and in writing from MTI. All Confidential Information shall remain the property of MTI and nothing in this Agreement shall restrict MTI from using, disclosing or disseminating such Confidential Information in any way. CONFIDENTIAL INFORMATION IS DISCLOSED HEREUNDER \"AS IS\" WITHOUT ANY REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS OR WARRANTIES AS TO THE ACCURACY, COMPLETENESS OR UTILITY OF SUCH CONFIDENTIAL INFORMATION.\n8. Termination of Obligations of Confidentiality. This Agreement will become effective on the date Recipient clicks on \"Accept.\" Notwithstanding any termination of this Agreement, the provisions of this Agreement shall continue for a period of five (5) years from the date of each disclosure of Confidential Information. MTI may terminate this Agreement at any time in its sole discretion upon written notice to Recipient (including such notice transmitted through this secure MTI website or via electronic mail to Recipient).\n9. Return of Confidential Information. Within ten (10) business days of MTI’s written request, and at MTI’s option, Recipient shall return or certify to MTI the destruction of the Confidential Information including, without limitation, hard copy and electronic documents and all materials created by Recipient that contain the Confidential Information.\n10. Governing Law and Attorneys' Fees. This Agreement shall be governed by the laws of the State of Idaho, U.S.A., excluding its conflict of laws principles. Recipient hereby consents to the personal jurisdiction of the courts of Idaho for any dispute arising out of this Agreement. In the event of any suit, action or proceeding arising out of or relating to this Agreement, the prevailing party will be entitled to reasonable attorneys' fees and reasonable costs incurred.\n11. Export. Recipient agrees that Confidential Information, or any portion thereof, shall not be exported or re-exported, directly or indirectly, in any form, except in compliance with the U.S. Export Administration Act and all other applicable export control laws or regulations.\n12. Injunctive Relief. Recipient acknowledges and agrees that disclosure of Confidential Information in violation of the terms of this Agreement will cause irreparable harm to MTI for which monetary damages would not be an adequate remedy. Therefore, Recipient agrees that, in addition to any other remedies available to MTI, in the event of any breach or threatened breach of this Agreement, MTI shall be entitled to injunctive relief and Recipient waives any requirement for the posting of a bond in connection therewith.\n13. No Implied Waiver. MTI’s failure or delay in exercising any of its rights hereunder will not constitute a waiver of such rights unless expressly waived in writing.\n14. General. This Agreement:\n(i) may be amended or modified only by an express writing signed by Recipient and an authorized representative of MTI;\n(ii) will not be construed as creating any joint venture, partnership or other form of business association between the parties hereto;\n(iii) is not assignable or delegable in whole or in part by Recipient without the express written consent of MTI;\n(iv) shall inure to the benefit of and be binding upon the parties, their successors, the assigns of MTI and the permitted assigns of Recipient;\nand (v) is in the English language only, which language shall be controlling in all respects, and all versions of this Agreement in any other language shall not be binding on the parties hereto.\n15. Authorized Signatory. The individual clicking on \"Accept\" is entering into this Agreement and accessing Confidential Information either (1) as an individual, and hereby agrees that he or she shall be personally liable to MTI if Confidential Information is disclosed or used in a manner not authorized by this Agreement, or (2) on behalf of an employer or other entity, and hereby represents and warrants that he or she has full legal authority to bind such employer or entity to this Agreement and that such employer or entity shall be legally bound by all of the terms and conditions of this Agreement as Recipient hereunder. IF CONFIDENTIAL INFORMATION IS FOR AN EMPLOYER OR ENTITY, BUT YOU DO NOT HAVE THE LEGAL AUTHORITY TO SO BIND SUCH EMPLOYER OR ENTITY, THEN DO NOT ACCESS, VIEW, READ, OR DOWNLOAD IN ANY WAY CONFIDENTIAL INFORMATION, AND DO NOT CLICK ON \"ACCEPT.\"\nIn order to review documents, you must accept the NDA. If you do not accept these terms, select Decline to exit this menu."
    },
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/about/company/security",
        "Content_Type": "Website Content",
        "Raw_Text": "To access these documents, you must first read and accept Micron's electronic non-disclosure agreement. If the Recipient has a written confidentiality agreement with Micron Technology, Inc. you will need to click \"Accept\" at the bottom of this page, but the terms of the written confidentiality agreement will apply.\nON-LINE NONDISCLOSURE AGREEMENT THIS IS A LEGAL AGREEMENT BETWEEN YOU OR THE COMPANY YOU REPRESENT (EACH A \"RECIPENT\") AND MICRON TECHNOLOGY, INC. (\"MTI\") STATING THE TERMS AND CONDITIONS THAT GOVERN THE CONFIDENTIALITY OF INFORMATION POSTED TO OR MADE AVAILABLE THROUGH THE MICRON WEBSITE. PLEASE CAREFULLY READ THIS NONDISCLOSURE AGREEMENT (\"AGREEMENT\") BEFORE CLICKING \"ACCEPT\" AT THE BOTTOM OF THE PAGE. BY CLICKING ON\"ACCEPT\", RECIPIENT IS AGREEING TO BE BOUND BY THE TERMS OF THIS AGREEMENT. IF RECIPIENT DOES NOT AGREE TO THE TERMS OF THIS AGREEMENT, PRESS \"DECLINE\" AND RECIPENT WILL BE UNABLE TO ACCESS CONFIDENTIAL INFORMATION.\n1. Written Nondisclosure Agreement. If Recipient and MTI have entered into a written confidentiality agreement (\"Confidentiality Agreement\") that is in effect as of the date Recipient enters into this Agreement and such Confidentiality Agreement already applies to and governs the Confidential Information (defined below), then the terms of such Confidentiality Agreement shall apply to and govern Recipient’s obligations concerning such Confidential Information and not the terms of this Agreement.\n2. Confidential Information. \"Confidential Information\" means any information or data posted to or made available through MTI’s secure website that is (i) marked or labeled as \"Confidential\" or \"Proprietary\" or with similar designation, or (ii) of a nature that a reasonable person would know such information is confidential. Confidential Information does not include that which:\n(i) is proven by Recipient through competent evidence to rightfully have already been in Recipient's possession at the time of disclosure without an obligation of confidentiality;\n(ii) is or becomes available to the public through no fault or breach on the part of Recipient;\n(iii) is independently developed by Recipient without use of or reference to the Confidential Information;\nor (iv) is rightfully obtained from a third party who has the right to transfer or disclose it to Recipient without restriction.\n3. Purpose of Disclosure and Restriction on Use. Confidential Information is disclosed hereunder strictly for the purpose of Recipient’s internal evaluation and/or to assist Recipient in the implementation of an MTI device or product into a commercial product (\"Purpose\"). Recipient shall use the Confidential Information solely in accordance with the terms of this Agreement to accomplish the Purpose and shall make no further use, in whole or in part, of the Confidential Information.\n4. Non-Disclosure. Recipient agrees to protect the Confidential Information, using at least the same degree of care it uses to protect its own confidential and proprietary information, but in no case with less than reasonable care. Recipient shall not disclose, publish or disseminate Confidential Information to anyone other than those of its employees, agents, contractors and consultants (collectively \"Representatives\") who have a need to know the information in order to accomplish the Purpose and who are bound by a written agreement that prohibits unauthorized disclosure or use of Confidential Information on terms no less restrictive and protective than those contained within this Agreement. Recipient will be responsible for any violation of the terms of this Agreement by its Representatives. Recipient may disclose Confidential Information to the extent required by law, provided Recipient shall promptly notify MTI in writing of such requirement to disclose and Recipient shall cooperate with MTI’s efforts to protect the Confidential Information. Recipient shall notify MTI promptly in writing in the event of any disclosure of the Confidential Information which is not authorized under this Agreement.\n5. Feedback. Notwithstanding any other provision in this Agreement, if Recipient provides any ideas, suggestions or recommendations to MTI regarding Confidential Information (\"Feedback\"), MTI is free to use and incorporate such Feedback in MTI’s products, without payment of royalties or other consideration to Recipient, so long as MTI does not infringe Recipient’s patents, copyrights or trademark rights in the Feedback.\n6. Copies. Recipient shall not make any copies of Confidential Information except as strictly necessary to carry out the above-stated Purpose. Any copies that are made must be identical to the original, may not be modified, and shall be considered the property of MTI.\n7. No License. No Warranty. Except as expressly set forth herein, no license is granted hereunder to any patents, copyrights, mask works, or trademarks either expressly, by implication, estoppel or otherwise. Any such license must be express and in writing from MTI. All Confidential Information shall remain the property of MTI and nothing in this Agreement shall restrict MTI from using, disclosing or disseminating such Confidential Information in any way. CONFIDENTIAL INFORMATION IS DISCLOSED HEREUNDER \"AS IS\" WITHOUT ANY REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS OR WARRANTIES AS TO THE ACCURACY, COMPLETENESS OR UTILITY OF SUCH CONFIDENTIAL INFORMATION.\n8. Termination of Obligations of Confidentiality. This Agreement will become effective on the date Recipient clicks on \"Accept.\" Notwithstanding any termination of this Agreement, the provisions of this Agreement shall continue for a period of five (5) years from the date of each disclosure of Confidential Information. MTI may terminate this Agreement at any time in its sole discretion upon written notice to Recipient (including such notice transmitted through this secure MTI website or via electronic mail to Recipient).\n9. Return of Confidential Information. Within ten (10) business days of MTI’s written request, and at MTI’s option, Recipient shall return or certify to MTI the destruction of the Confidential Information including, without limitation, hard copy and electronic documents and all materials created by Recipient that contain the Confidential Information.\n10. Governing Law and Attorneys' Fees. This Agreement shall be governed by the laws of the State of Idaho, U.S.A., excluding its conflict of laws principles. Recipient hereby consents to the personal jurisdiction of the courts of Idaho for any dispute arising out of this Agreement. In the event of any suit, action or proceeding arising out of or relating to this Agreement, the prevailing party will be entitled to reasonable attorneys' fees and reasonable costs incurred.\n11. Export. Recipient agrees that Confidential Information, or any portion thereof, shall not be exported or re-exported, directly or indirectly, in any form, except in compliance with the U.S. Export Administration Act and all other applicable export control laws or regulations.\n12. Injunctive Relief. Recipient acknowledges and agrees that disclosure of Confidential Information in violation of the terms of this Agreement will cause irreparable harm to MTI for which monetary damages would not be an adequate remedy. Therefore, Recipient agrees that, in addition to any other remedies available to MTI, in the event of any breach or threatened breach of this Agreement, MTI shall be entitled to injunctive relief and Recipient waives any requirement for the posting of a bond in connection therewith.\n13. No Implied Waiver. MTI’s failure or delay in exercising any of its rights hereunder will not constitute a waiver of such rights unless expressly waived in writing.\n14. General. This Agreement:\n(i) may be amended or modified only by an express writing signed by Recipient and an authorized representative of MTI;\n(ii) will not be construed as creating any joint venture, partnership or other form of business association between the parties hereto;\n(iii) is not assignable or delegable in whole or in part by Recipient without the express written consent of MTI;\n(iv) shall inure to the benefit of and be binding upon the parties, their successors, the assigns of MTI and the permitted assigns of Recipient;\nand (v) is in the English language only, which language shall be controlling in all respects, and all versions of this Agreement in any other language shall not be binding on the parties hereto.\n15. Authorized Signatory. The individual clicking on \"Accept\" is entering into this Agreement and accessing Confidential Information either (1) as an individual, and hereby agrees that he or she shall be personally liable to MTI if Confidential Information is disclosed or used in a manner not authorized by this Agreement, or (2) on behalf of an employer or other entity, and hereby represents and warrants that he or she has full legal authority to bind such employer or entity to this Agreement and that such employer or entity shall be legally bound by all of the terms and conditions of this Agreement as Recipient hereunder. IF CONFIDENTIAL INFORMATION IS FOR AN EMPLOYER OR ENTITY, BUT YOU DO NOT HAVE THE LEGAL AUTHORITY TO SO BIND SUCH EMPLOYER OR ENTITY, THEN DO NOT ACCESS, VIEW, READ, OR DOWNLOAD IN ANY WAY CONFIDENTIAL INFORMATION, AND DO NOT CLICK ON \"ACCEPT.\"\nIn order to review documents, you must accept the NDA. If you do not accept these terms, select Decline to exit this menu."
    },
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/about/company/ventures",
        "Content_Type": "Website Content",
        "Raw_Text": "To access these documents, you must first read and accept Micron's electronic non-disclosure agreement. If the Recipient has a written confidentiality agreement with Micron Technology, Inc. you will need to click \"Accept\" at the bottom of this page, but the terms of the written confidentiality agreement will apply.\nON-LINE NONDISCLOSURE AGREEMENT THIS IS A LEGAL AGREEMENT BETWEEN YOU OR THE COMPANY YOU REPRESENT (EACH A \"RECIPENT\") AND MICRON TECHNOLOGY, INC. (\"MTI\") STATING THE TERMS AND CONDITIONS THAT GOVERN THE CONFIDENTIALITY OF INFORMATION POSTED TO OR MADE AVAILABLE THROUGH THE MICRON WEBSITE. PLEASE CAREFULLY READ THIS NONDISCLOSURE AGREEMENT (\"AGREEMENT\") BEFORE CLICKING \"ACCEPT\" AT THE BOTTOM OF THE PAGE. BY CLICKING ON\"ACCEPT\", RECIPIENT IS AGREEING TO BE BOUND BY THE TERMS OF THIS AGREEMENT. IF RECIPIENT DOES NOT AGREE TO THE TERMS OF THIS AGREEMENT, PRESS \"DECLINE\" AND RECIPENT WILL BE UNABLE TO ACCESS CONFIDENTIAL INFORMATION.\n1. Written Nondisclosure Agreement. If Recipient and MTI have entered into a written confidentiality agreement (\"Confidentiality Agreement\") that is in effect as of the date Recipient enters into this Agreement and such Confidentiality Agreement already applies to and governs the Confidential Information (defined below), then the terms of such Confidentiality Agreement shall apply to and govern Recipient’s obligations concerning such Confidential Information and not the terms of this Agreement.\n2. Confidential Information. \"Confidential Information\" means any information or data posted to or made available through MTI’s secure website that is (i) marked or labeled as \"Confidential\" or \"Proprietary\" or with similar designation, or (ii) of a nature that a reasonable person would know such information is confidential. Confidential Information does not include that which:\n(i) is proven by Recipient through competent evidence to rightfully have already been in Recipient's possession at the time of disclosure without an obligation of confidentiality;\n(ii) is or becomes available to the public through no fault or breach on the part of Recipient;\n(iii) is independently developed by Recipient without use of or reference to the Confidential Information;\nor (iv) is rightfully obtained from a third party who has the right to transfer or disclose it to Recipient without restriction.\n3. Purpose of Disclosure and Restriction on Use. Confidential Information is disclosed hereunder strictly for the purpose of Recipient’s internal evaluation and/or to assist Recipient in the implementation of an MTI device or product into a commercial product (\"Purpose\"). Recipient shall use the Confidential Information solely in accordance with the terms of this Agreement to accomplish the Purpose and shall make no further use, in whole or in part, of the Confidential Information.\n4. Non-Disclosure. Recipient agrees to protect the Confidential Information, using at least the same degree of care it uses to protect its own confidential and proprietary information, but in no case with less than reasonable care. Recipient shall not disclose, publish or disseminate Confidential Information to anyone other than those of its employees, agents, contractors and consultants (collectively \"Representatives\") who have a need to know the information in order to accomplish the Purpose and who are bound by a written agreement that prohibits unauthorized disclosure or use of Confidential Information on terms no less restrictive and protective than those contained within this Agreement. Recipient will be responsible for any violation of the terms of this Agreement by its Representatives. Recipient may disclose Confidential Information to the extent required by law, provided Recipient shall promptly notify MTI in writing of such requirement to disclose and Recipient shall cooperate with MTI’s efforts to protect the Confidential Information. Recipient shall notify MTI promptly in writing in the event of any disclosure of the Confidential Information which is not authorized under this Agreement.\n5. Feedback. Notwithstanding any other provision in this Agreement, if Recipient provides any ideas, suggestions or recommendations to MTI regarding Confidential Information (\"Feedback\"), MTI is free to use and incorporate such Feedback in MTI’s products, without payment of royalties or other consideration to Recipient, so long as MTI does not infringe Recipient’s patents, copyrights or trademark rights in the Feedback.\n6. Copies. Recipient shall not make any copies of Confidential Information except as strictly necessary to carry out the above-stated Purpose. Any copies that are made must be identical to the original, may not be modified, and shall be considered the property of MTI.\n7. No License. No Warranty. Except as expressly set forth herein, no license is granted hereunder to any patents, copyrights, mask works, or trademarks either expressly, by implication, estoppel or otherwise. Any such license must be express and in writing from MTI. All Confidential Information shall remain the property of MTI and nothing in this Agreement shall restrict MTI from using, disclosing or disseminating such Confidential Information in any way. CONFIDENTIAL INFORMATION IS DISCLOSED HEREUNDER \"AS IS\" WITHOUT ANY REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS OR WARRANTIES AS TO THE ACCURACY, COMPLETENESS OR UTILITY OF SUCH CONFIDENTIAL INFORMATION.\n8. Termination of Obligations of Confidentiality. This Agreement will become effective on the date Recipient clicks on \"Accept.\" Notwithstanding any termination of this Agreement, the provisions of this Agreement shall continue for a period of five (5) years from the date of each disclosure of Confidential Information. MTI may terminate this Agreement at any time in its sole discretion upon written notice to Recipient (including such notice transmitted through this secure MTI website or via electronic mail to Recipient).\n9. Return of Confidential Information. Within ten (10) business days of MTI’s written request, and at MTI’s option, Recipient shall return or certify to MTI the destruction of the Confidential Information including, without limitation, hard copy and electronic documents and all materials created by Recipient that contain the Confidential Information.\n10. Governing Law and Attorneys' Fees. This Agreement shall be governed by the laws of the State of Idaho, U.S.A., excluding its conflict of laws principles. Recipient hereby consents to the personal jurisdiction of the courts of Idaho for any dispute arising out of this Agreement. In the event of any suit, action or proceeding arising out of or relating to this Agreement, the prevailing party will be entitled to reasonable attorneys' fees and reasonable costs incurred.\n11. Export. Recipient agrees that Confidential Information, or any portion thereof, shall not be exported or re-exported, directly or indirectly, in any form, except in compliance with the U.S. Export Administration Act and all other applicable export control laws or regulations.\n12. Injunctive Relief. Recipient acknowledges and agrees that disclosure of Confidential Information in violation of the terms of this Agreement will cause irreparable harm to MTI for which monetary damages would not be an adequate remedy. Therefore, Recipient agrees that, in addition to any other remedies available to MTI, in the event of any breach or threatened breach of this Agreement, MTI shall be entitled to injunctive relief and Recipient waives any requirement for the posting of a bond in connection therewith.\n13. No Implied Waiver. MTI’s failure or delay in exercising any of its rights hereunder will not constitute a waiver of such rights unless expressly waived in writing.\n14. General. This Agreement:\n(i) may be amended or modified only by an express writing signed by Recipient and an authorized representative of MTI;\n(ii) will not be construed as creating any joint venture, partnership or other form of business association between the parties hereto;\n(iii) is not assignable or delegable in whole or in part by Recipient without the express written consent of MTI;\n(iv) shall inure to the benefit of and be binding upon the parties, their successors, the assigns of MTI and the permitted assigns of Recipient;\nand (v) is in the English language only, which language shall be controlling in all respects, and all versions of this Agreement in any other language shall not be binding on the parties hereto.\n15. Authorized Signatory. The individual clicking on \"Accept\" is entering into this Agreement and accessing Confidential Information either (1) as an individual, and hereby agrees that he or she shall be personally liable to MTI if Confidential Information is disclosed or used in a manner not authorized by this Agreement, or (2) on behalf of an employer or other entity, and hereby represents and warrants that he or she has full legal authority to bind such employer or entity to this Agreement and that such employer or entity shall be legally bound by all of the terms and conditions of this Agreement as Recipient hereunder. IF CONFIDENTIAL INFORMATION IS FOR AN EMPLOYER OR ENTITY, BUT YOU DO NOT HAVE THE LEGAL AUTHORITY TO SO BIND SUCH EMPLOYER OR ENTITY, THEN DO NOT ACCESS, VIEW, READ, OR DOWNLOAD IN ANY WAY CONFIDENTIAL INFORMATION, AND DO NOT CLICK ON \"ACCEPT.\"\nIn order to review documents, you must accept the NDA. If you do not accept these terms, select Decline to exit this menu."
    },
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/about/sustainability",
        "Content_Type": "Website Content",
        "Raw_Text": "To access these documents, you must first read and accept Micron's electronic non-disclosure agreement. If the Recipient has a written confidentiality agreement with Micron Technology, Inc. you will need to click \"Accept\" at the bottom of this page, but the terms of the written confidentiality agreement will apply.\nON-LINE NONDISCLOSURE AGREEMENT THIS IS A LEGAL AGREEMENT BETWEEN YOU OR THE COMPANY YOU REPRESENT (EACH A \"RECIPENT\") AND MICRON TECHNOLOGY, INC. (\"MTI\") STATING THE TERMS AND CONDITIONS THAT GOVERN THE CONFIDENTIALITY OF INFORMATION POSTED TO OR MADE AVAILABLE THROUGH THE MICRON WEBSITE. PLEASE CAREFULLY READ THIS NONDISCLOSURE AGREEMENT (\"AGREEMENT\") BEFORE CLICKING \"ACCEPT\" AT THE BOTTOM OF THE PAGE. BY CLICKING ON\"ACCEPT\", RECIPIENT IS AGREEING TO BE BOUND BY THE TERMS OF THIS AGREEMENT. IF RECIPIENT DOES NOT AGREE TO THE TERMS OF THIS AGREEMENT, PRESS \"DECLINE\" AND RECIPENT WILL BE UNABLE TO ACCESS CONFIDENTIAL INFORMATION.\n1. Written Nondisclosure Agreement. If Recipient and MTI have entered into a written confidentiality agreement (\"Confidentiality Agreement\") that is in effect as of the date Recipient enters into this Agreement and such Confidentiality Agreement already applies to and governs the Confidential Information (defined below), then the terms of such Confidentiality Agreement shall apply to and govern Recipient’s obligations concerning such Confidential Information and not the terms of this Agreement.\n2. Confidential Information. \"Confidential Information\" means any information or data posted to or made available through MTI’s secure website that is (i) marked or labeled as \"Confidential\" or \"Proprietary\" or with similar designation, or (ii) of a nature that a reasonable person would know such information is confidential. Confidential Information does not include that which:\n(i) is proven by Recipient through competent evidence to rightfully have already been in Recipient's possession at the time of disclosure without an obligation of confidentiality;\n(ii) is or becomes available to the public through no fault or breach on the part of Recipient;\n(iii) is independently developed by Recipient without use of or reference to the Confidential Information;\nor (iv) is rightfully obtained from a third party who has the right to transfer or disclose it to Recipient without restriction.\n3. Purpose of Disclosure and Restriction on Use. Confidential Information is disclosed hereunder strictly for the purpose of Recipient’s internal evaluation and/or to assist Recipient in the implementation of an MTI device or product into a commercial product (\"Purpose\"). Recipient shall use the Confidential Information solely in accordance with the terms of this Agreement to accomplish the Purpose and shall make no further use, in whole or in part, of the Confidential Information.\n4. Non-Disclosure. Recipient agrees to protect the Confidential Information, using at least the same degree of care it uses to protect its own confidential and proprietary information, but in no case with less than reasonable care. Recipient shall not disclose, publish or disseminate Confidential Information to anyone other than those of its employees, agents, contractors and consultants (collectively \"Representatives\") who have a need to know the information in order to accomplish the Purpose and who are bound by a written agreement that prohibits unauthorized disclosure or use of Confidential Information on terms no less restrictive and protective than those contained within this Agreement. Recipient will be responsible for any violation of the terms of this Agreement by its Representatives. Recipient may disclose Confidential Information to the extent required by law, provided Recipient shall promptly notify MTI in writing of such requirement to disclose and Recipient shall cooperate with MTI’s efforts to protect the Confidential Information. Recipient shall notify MTI promptly in writing in the event of any disclosure of the Confidential Information which is not authorized under this Agreement.\n5. Feedback. Notwithstanding any other provision in this Agreement, if Recipient provides any ideas, suggestions or recommendations to MTI regarding Confidential Information (\"Feedback\"), MTI is free to use and incorporate such Feedback in MTI’s products, without payment of royalties or other consideration to Recipient, so long as MTI does not infringe Recipient’s patents, copyrights or trademark rights in the Feedback.\n6. Copies. Recipient shall not make any copies of Confidential Information except as strictly necessary to carry out the above-stated Purpose. Any copies that are made must be identical to the original, may not be modified, and shall be considered the property of MTI.\n7. No License. No Warranty. Except as expressly set forth herein, no license is granted hereunder to any patents, copyrights, mask works, or trademarks either expressly, by implication, estoppel or otherwise. Any such license must be express and in writing from MTI. All Confidential Information shall remain the property of MTI and nothing in this Agreement shall restrict MTI from using, disclosing or disseminating such Confidential Information in any way. CONFIDENTIAL INFORMATION IS DISCLOSED HEREUNDER \"AS IS\" WITHOUT ANY REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS OR WARRANTIES AS TO THE ACCURACY, COMPLETENESS OR UTILITY OF SUCH CONFIDENTIAL INFORMATION.\n8. Termination of Obligations of Confidentiality. This Agreement will become effective on the date Recipient clicks on \"Accept.\" Notwithstanding any termination of this Agreement, the provisions of this Agreement shall continue for a period of five (5) years from the date of each disclosure of Confidential Information. MTI may terminate this Agreement at any time in its sole discretion upon written notice to Recipient (including such notice transmitted through this secure MTI website or via electronic mail to Recipient).\n9. Return of Confidential Information. Within ten (10) business days of MTI’s written request, and at MTI’s option, Recipient shall return or certify to MTI the destruction of the Confidential Information including, without limitation, hard copy and electronic documents and all materials created by Recipient that contain the Confidential Information.\n10. Governing Law and Attorneys' Fees. This Agreement shall be governed by the laws of the State of Idaho, U.S.A., excluding its conflict of laws principles. Recipient hereby consents to the personal jurisdiction of the courts of Idaho for any dispute arising out of this Agreement. In the event of any suit, action or proceeding arising out of or relating to this Agreement, the prevailing party will be entitled to reasonable attorneys' fees and reasonable costs incurred.\n11. Export. Recipient agrees that Confidential Information, or any portion thereof, shall not be exported or re-exported, directly or indirectly, in any form, except in compliance with the U.S. Export Administration Act and all other applicable export control laws or regulations.\n12. Injunctive Relief. Recipient acknowledges and agrees that disclosure of Confidential Information in violation of the terms of this Agreement will cause irreparable harm to MTI for which monetary damages would not be an adequate remedy. Therefore, Recipient agrees that, in addition to any other remedies available to MTI, in the event of any breach or threatened breach of this Agreement, MTI shall be entitled to injunctive relief and Recipient waives any requirement for the posting of a bond in connection therewith.\n13. No Implied Waiver. MTI’s failure or delay in exercising any of its rights hereunder will not constitute a waiver of such rights unless expressly waived in writing.\n14. General. This Agreement:\n(i) may be amended or modified only by an express writing signed by Recipient and an authorized representative of MTI;\n(ii) will not be construed as creating any joint venture, partnership or other form of business association between the parties hereto;\n(iii) is not assignable or delegable in whole or in part by Recipient without the express written consent of MTI;\n(iv) shall inure to the benefit of and be binding upon the parties, their successors, the assigns of MTI and the permitted assigns of Recipient;\nand (v) is in the English language only, which language shall be controlling in all respects, and all versions of this Agreement in any other language shall not be binding on the parties hereto.\n15. Authorized Signatory. The individual clicking on \"Accept\" is entering into this Agreement and accessing Confidential Information either (1) as an individual, and hereby agrees that he or she shall be personally liable to MTI if Confidential Information is disclosed or used in a manner not authorized by this Agreement, or (2) on behalf of an employer or other entity, and hereby represents and warrants that he or she has full legal authority to bind such employer or entity to this Agreement and that such employer or entity shall be legally bound by all of the terms and conditions of this Agreement as Recipient hereunder. IF CONFIDENTIAL INFORMATION IS FOR AN EMPLOYER OR ENTITY, BUT YOU DO NOT HAVE THE LEGAL AUTHORITY TO SO BIND SUCH EMPLOYER OR ENTITY, THEN DO NOT ACCESS, VIEW, READ, OR DOWNLOAD IN ANY WAY CONFIDENTIAL INFORMATION, AND DO NOT CLICK ON \"ACCEPT.\"\nIn order to review documents, you must accept the NDA. If you do not accept these terms, select Decline to exit this menu."
    },
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/about/sustainability/corporate-governance",
        "Content_Type": "Website Content",
        "Raw_Text": "To access these documents, you must first read and accept Micron's electronic non-disclosure agreement. If the Recipient has a written confidentiality agreement with Micron Technology, Inc. you will need to click \"Accept\" at the bottom of this page, but the terms of the written confidentiality agreement will apply.\nON-LINE NONDISCLOSURE AGREEMENT THIS IS A LEGAL AGREEMENT BETWEEN YOU OR THE COMPANY YOU REPRESENT (EACH A \"RECIPENT\") AND MICRON TECHNOLOGY, INC. (\"MTI\") STATING THE TERMS AND CONDITIONS THAT GOVERN THE CONFIDENTIALITY OF INFORMATION POSTED TO OR MADE AVAILABLE THROUGH THE MICRON WEBSITE. PLEASE CAREFULLY READ THIS NONDISCLOSURE AGREEMENT (\"AGREEMENT\") BEFORE CLICKING \"ACCEPT\" AT THE BOTTOM OF THE PAGE. BY CLICKING ON\"ACCEPT\", RECIPIENT IS AGREEING TO BE BOUND BY THE TERMS OF THIS AGREEMENT. IF RECIPIENT DOES NOT AGREE TO THE TERMS OF THIS AGREEMENT, PRESS \"DECLINE\" AND RECIPENT WILL BE UNABLE TO ACCESS CONFIDENTIAL INFORMATION.\n1. Written Nondisclosure Agreement. If Recipient and MTI have entered into a written confidentiality agreement (\"Confidentiality Agreement\") that is in effect as of the date Recipient enters into this Agreement and such Confidentiality Agreement already applies to and governs the Confidential Information (defined below), then the terms of such Confidentiality Agreement shall apply to and govern Recipient’s obligations concerning such Confidential Information and not the terms of this Agreement.\n2. Confidential Information. \"Confidential Information\" means any information or data posted to or made available through MTI’s secure website that is (i) marked or labeled as \"Confidential\" or \"Proprietary\" or with similar designation, or (ii) of a nature that a reasonable person would know such information is confidential. Confidential Information does not include that which:\n(i) is proven by Recipient through competent evidence to rightfully have already been in Recipient's possession at the time of disclosure without an obligation of confidentiality;\n(ii) is or becomes available to the public through no fault or breach on the part of Recipient;\n(iii) is independently developed by Recipient without use of or reference to the Confidential Information;\nor (iv) is rightfully obtained from a third party who has the right to transfer or disclose it to Recipient without restriction.\n3. Purpose of Disclosure and Restriction on Use. Confidential Information is disclosed hereunder strictly for the purpose of Recipient’s internal evaluation and/or to assist Recipient in the implementation of an MTI device or product into a commercial product (\"Purpose\"). Recipient shall use the Confidential Information solely in accordance with the terms of this Agreement to accomplish the Purpose and shall make no further use, in whole or in part, of the Confidential Information.\n4. Non-Disclosure. Recipient agrees to protect the Confidential Information, using at least the same degree of care it uses to protect its own confidential and proprietary information, but in no case with less than reasonable care. Recipient shall not disclose, publish or disseminate Confidential Information to anyone other than those of its employees, agents, contractors and consultants (collectively \"Representatives\") who have a need to know the information in order to accomplish the Purpose and who are bound by a written agreement that prohibits unauthorized disclosure or use of Confidential Information on terms no less restrictive and protective than those contained within this Agreement. Recipient will be responsible for any violation of the terms of this Agreement by its Representatives. Recipient may disclose Confidential Information to the extent required by law, provided Recipient shall promptly notify MTI in writing of such requirement to disclose and Recipient shall cooperate with MTI’s efforts to protect the Confidential Information. Recipient shall notify MTI promptly in writing in the event of any disclosure of the Confidential Information which is not authorized under this Agreement.\n5. Feedback. Notwithstanding any other provision in this Agreement, if Recipient provides any ideas, suggestions or recommendations to MTI regarding Confidential Information (\"Feedback\"), MTI is free to use and incorporate such Feedback in MTI’s products, without payment of royalties or other consideration to Recipient, so long as MTI does not infringe Recipient’s patents, copyrights or trademark rights in the Feedback.\n6. Copies. Recipient shall not make any copies of Confidential Information except as strictly necessary to carry out the above-stated Purpose. Any copies that are made must be identical to the original, may not be modified, and shall be considered the property of MTI.\n7. No License. No Warranty. Except as expressly set forth herein, no license is granted hereunder to any patents, copyrights, mask works, or trademarks either expressly, by implication, estoppel or otherwise. Any such license must be express and in writing from MTI. All Confidential Information shall remain the property of MTI and nothing in this Agreement shall restrict MTI from using, disclosing or disseminating such Confidential Information in any way. CONFIDENTIAL INFORMATION IS DISCLOSED HEREUNDER \"AS IS\" WITHOUT ANY REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS OR WARRANTIES AS TO THE ACCURACY, COMPLETENESS OR UTILITY OF SUCH CONFIDENTIAL INFORMATION.\n8. Termination of Obligations of Confidentiality. This Agreement will become effective on the date Recipient clicks on \"Accept.\" Notwithstanding any termination of this Agreement, the provisions of this Agreement shall continue for a period of five (5) years from the date of each disclosure of Confidential Information. MTI may terminate this Agreement at any time in its sole discretion upon written notice to Recipient (including such notice transmitted through this secure MTI website or via electronic mail to Recipient).\n9. Return of Confidential Information. Within ten (10) business days of MTI’s written request, and at MTI’s option, Recipient shall return or certify to MTI the destruction of the Confidential Information including, without limitation, hard copy and electronic documents and all materials created by Recipient that contain the Confidential Information.\n10. Governing Law and Attorneys' Fees. This Agreement shall be governed by the laws of the State of Idaho, U.S.A., excluding its conflict of laws principles. Recipient hereby consents to the personal jurisdiction of the courts of Idaho for any dispute arising out of this Agreement. In the event of any suit, action or proceeding arising out of or relating to this Agreement, the prevailing party will be entitled to reasonable attorneys' fees and reasonable costs incurred.\n11. Export. Recipient agrees that Confidential Information, or any portion thereof, shall not be exported or re-exported, directly or indirectly, in any form, except in compliance with the U.S. Export Administration Act and all other applicable export control laws or regulations.\n12. Injunctive Relief. Recipient acknowledges and agrees that disclosure of Confidential Information in violation of the terms of this Agreement will cause irreparable harm to MTI for which monetary damages would not be an adequate remedy. Therefore, Recipient agrees that, in addition to any other remedies available to MTI, in the event of any breach or threatened breach of this Agreement, MTI shall be entitled to injunctive relief and Recipient waives any requirement for the posting of a bond in connection therewith.\n13. No Implied Waiver. MTI’s failure or delay in exercising any of its rights hereunder will not constitute a waiver of such rights unless expressly waived in writing.\n14. General. This Agreement:\n(i) may be amended or modified only by an express writing signed by Recipient and an authorized representative of MTI;\n(ii) will not be construed as creating any joint venture, partnership or other form of business association between the parties hereto;\n(iii) is not assignable or delegable in whole or in part by Recipient without the express written consent of MTI;\n(iv) shall inure to the benefit of and be binding upon the parties, their successors, the assigns of MTI and the permitted assigns of Recipient;\nand (v) is in the English language only, which language shall be controlling in all respects, and all versions of this Agreement in any other language shall not be binding on the parties hereto.\n15. Authorized Signatory. The individual clicking on \"Accept\" is entering into this Agreement and accessing Confidential Information either (1) as an individual, and hereby agrees that he or she shall be personally liable to MTI if Confidential Information is disclosed or used in a manner not authorized by this Agreement, or (2) on behalf of an employer or other entity, and hereby represents and warrants that he or she has full legal authority to bind such employer or entity to this Agreement and that such employer or entity shall be legally bound by all of the terms and conditions of this Agreement as Recipient hereunder. IF CONFIDENTIAL INFORMATION IS FOR AN EMPLOYER OR ENTITY, BUT YOU DO NOT HAVE THE LEGAL AUTHORITY TO SO BIND SUCH EMPLOYER OR ENTITY, THEN DO NOT ACCESS, VIEW, READ, OR DOWNLOAD IN ANY WAY CONFIDENTIAL INFORMATION, AND DO NOT CLICK ON \"ACCEPT.\"\nIn order to review documents, you must accept the NDA. If you do not accept these terms, select Decline to exit this menu."
    },
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/about/sustainability/compliance-ethics",
        "Content_Type": "Website Content",
        "Raw_Text": "To access these documents, you must first read and accept Micron's electronic non-disclosure agreement. If the Recipient has a written confidentiality agreement with Micron Technology, Inc. you will need to click \"Accept\" at the bottom of this page, but the terms of the written confidentiality agreement will apply.\nON-LINE NONDISCLOSURE AGREEMENT THIS IS A LEGAL AGREEMENT BETWEEN YOU OR THE COMPANY YOU REPRESENT (EACH A \"RECIPENT\") AND MICRON TECHNOLOGY, INC. (\"MTI\") STATING THE TERMS AND CONDITIONS THAT GOVERN THE CONFIDENTIALITY OF INFORMATION POSTED TO OR MADE AVAILABLE THROUGH THE MICRON WEBSITE. PLEASE CAREFULLY READ THIS NONDISCLOSURE AGREEMENT (\"AGREEMENT\") BEFORE CLICKING \"ACCEPT\" AT THE BOTTOM OF THE PAGE. BY CLICKING ON\"ACCEPT\", RECIPIENT IS AGREEING TO BE BOUND BY THE TERMS OF THIS AGREEMENT. IF RECIPIENT DOES NOT AGREE TO THE TERMS OF THIS AGREEMENT, PRESS \"DECLINE\" AND RECIPENT WILL BE UNABLE TO ACCESS CONFIDENTIAL INFORMATION.\n1. Written Nondisclosure Agreement. If Recipient and MTI have entered into a written confidentiality agreement (\"Confidentiality Agreement\") that is in effect as of the date Recipient enters into this Agreement and such Confidentiality Agreement already applies to and governs the Confidential Information (defined below), then the terms of such Confidentiality Agreement shall apply to and govern Recipient’s obligations concerning such Confidential Information and not the terms of this Agreement.\n2. Confidential Information. \"Confidential Information\" means any information or data posted to or made available through MTI’s secure website that is (i) marked or labeled as \"Confidential\" or \"Proprietary\" or with similar designation, or (ii) of a nature that a reasonable person would know such information is confidential. Confidential Information does not include that which:\n(i) is proven by Recipient through competent evidence to rightfully have already been in Recipient's possession at the time of disclosure without an obligation of confidentiality;\n(ii) is or becomes available to the public through no fault or breach on the part of Recipient;\n(iii) is independently developed by Recipient without use of or reference to the Confidential Information;\nor (iv) is rightfully obtained from a third party who has the right to transfer or disclose it to Recipient without restriction.\n3. Purpose of Disclosure and Restriction on Use. Confidential Information is disclosed hereunder strictly for the purpose of Recipient’s internal evaluation and/or to assist Recipient in the implementation of an MTI device or product into a commercial product (\"Purpose\"). Recipient shall use the Confidential Information solely in accordance with the terms of this Agreement to accomplish the Purpose and shall make no further use, in whole or in part, of the Confidential Information.\n4. Non-Disclosure. Recipient agrees to protect the Confidential Information, using at least the same degree of care it uses to protect its own confidential and proprietary information, but in no case with less than reasonable care. Recipient shall not disclose, publish or disseminate Confidential Information to anyone other than those of its employees, agents, contractors and consultants (collectively \"Representatives\") who have a need to know the information in order to accomplish the Purpose and who are bound by a written agreement that prohibits unauthorized disclosure or use of Confidential Information on terms no less restrictive and protective than those contained within this Agreement. Recipient will be responsible for any violation of the terms of this Agreement by its Representatives. Recipient may disclose Confidential Information to the extent required by law, provided Recipient shall promptly notify MTI in writing of such requirement to disclose and Recipient shall cooperate with MTI’s efforts to protect the Confidential Information. Recipient shall notify MTI promptly in writing in the event of any disclosure of the Confidential Information which is not authorized under this Agreement.\n5. Feedback. Notwithstanding any other provision in this Agreement, if Recipient provides any ideas, suggestions or recommendations to MTI regarding Confidential Information (\"Feedback\"), MTI is free to use and incorporate such Feedback in MTI’s products, without payment of royalties or other consideration to Recipient, so long as MTI does not infringe Recipient’s patents, copyrights or trademark rights in the Feedback.\n6. Copies. Recipient shall not make any copies of Confidential Information except as strictly necessary to carry out the above-stated Purpose. Any copies that are made must be identical to the original, may not be modified, and shall be considered the property of MTI.\n7. No License. No Warranty. Except as expressly set forth herein, no license is granted hereunder to any patents, copyrights, mask works, or trademarks either expressly, by implication, estoppel or otherwise. Any such license must be express and in writing from MTI. All Confidential Information shall remain the property of MTI and nothing in this Agreement shall restrict MTI from using, disclosing or disseminating such Confidential Information in any way. CONFIDENTIAL INFORMATION IS DISCLOSED HEREUNDER \"AS IS\" WITHOUT ANY REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS OR WARRANTIES AS TO THE ACCURACY, COMPLETENESS OR UTILITY OF SUCH CONFIDENTIAL INFORMATION.\n8. Termination of Obligations of Confidentiality. This Agreement will become effective on the date Recipient clicks on \"Accept.\" Notwithstanding any termination of this Agreement, the provisions of this Agreement shall continue for a period of five (5) years from the date of each disclosure of Confidential Information. MTI may terminate this Agreement at any time in its sole discretion upon written notice to Recipient (including such notice transmitted through this secure MTI website or via electronic mail to Recipient).\n9. Return of Confidential Information. Within ten (10) business days of MTI’s written request, and at MTI’s option, Recipient shall return or certify to MTI the destruction of the Confidential Information including, without limitation, hard copy and electronic documents and all materials created by Recipient that contain the Confidential Information.\n10. Governing Law and Attorneys' Fees. This Agreement shall be governed by the laws of the State of Idaho, U.S.A., excluding its conflict of laws principles. Recipient hereby consents to the personal jurisdiction of the courts of Idaho for any dispute arising out of this Agreement. In the event of any suit, action or proceeding arising out of or relating to this Agreement, the prevailing party will be entitled to reasonable attorneys' fees and reasonable costs incurred.\n11. Export. Recipient agrees that Confidential Information, or any portion thereof, shall not be exported or re-exported, directly or indirectly, in any form, except in compliance with the U.S. Export Administration Act and all other applicable export control laws or regulations.\n12. Injunctive Relief. Recipient acknowledges and agrees that disclosure of Confidential Information in violation of the terms of this Agreement will cause irreparable harm to MTI for which monetary damages would not be an adequate remedy. Therefore, Recipient agrees that, in addition to any other remedies available to MTI, in the event of any breach or threatened breach of this Agreement, MTI shall be entitled to injunctive relief and Recipient waives any requirement for the posting of a bond in connection therewith.\n13. No Implied Waiver. MTI’s failure or delay in exercising any of its rights hereunder will not constitute a waiver of such rights unless expressly waived in writing.\n14. General. This Agreement:\n(i) may be amended or modified only by an express writing signed by Recipient and an authorized representative of MTI;\n(ii) will not be construed as creating any joint venture, partnership or other form of business association between the parties hereto;\n(iii) is not assignable or delegable in whole or in part by Recipient without the express written consent of MTI;\n(iv) shall inure to the benefit of and be binding upon the parties, their successors, the assigns of MTI and the permitted assigns of Recipient;\nand (v) is in the English language only, which language shall be controlling in all respects, and all versions of this Agreement in any other language shall not be binding on the parties hereto.\n15. Authorized Signatory. The individual clicking on \"Accept\" is entering into this Agreement and accessing Confidential Information either (1) as an individual, and hereby agrees that he or she shall be personally liable to MTI if Confidential Information is disclosed or used in a manner not authorized by this Agreement, or (2) on behalf of an employer or other entity, and hereby represents and warrants that he or she has full legal authority to bind such employer or entity to this Agreement and that such employer or entity shall be legally bound by all of the terms and conditions of this Agreement as Recipient hereunder. IF CONFIDENTIAL INFORMATION IS FOR AN EMPLOYER OR ENTITY, BUT YOU DO NOT HAVE THE LEGAL AUTHORITY TO SO BIND SUCH EMPLOYER OR ENTITY, THEN DO NOT ACCESS, VIEW, READ, OR DOWNLOAD IN ANY WAY CONFIDENTIAL INFORMATION, AND DO NOT CLICK ON \"ACCEPT.\"\nIn order to review documents, you must accept the NDA. If you do not accept these terms, select Decline to exit this menu."
    },
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/about/sustainability/micron-gives",
        "Content_Type": "Website Content",
        "Raw_Text": "To access these documents, you must first read and accept Micron's electronic non-disclosure agreement. If the Recipient has a written confidentiality agreement with Micron Technology, Inc. you will need to click \"Accept\" at the bottom of this page, but the terms of the written confidentiality agreement will apply.\nON-LINE NONDISCLOSURE AGREEMENT THIS IS A LEGAL AGREEMENT BETWEEN YOU OR THE COMPANY YOU REPRESENT (EACH A \"RECIPENT\") AND MICRON TECHNOLOGY, INC. (\"MTI\") STATING THE TERMS AND CONDITIONS THAT GOVERN THE CONFIDENTIALITY OF INFORMATION POSTED TO OR MADE AVAILABLE THROUGH THE MICRON WEBSITE. PLEASE CAREFULLY READ THIS NONDISCLOSURE AGREEMENT (\"AGREEMENT\") BEFORE CLICKING \"ACCEPT\" AT THE BOTTOM OF THE PAGE. BY CLICKING ON\"ACCEPT\", RECIPIENT IS AGREEING TO BE BOUND BY THE TERMS OF THIS AGREEMENT. IF RECIPIENT DOES NOT AGREE TO THE TERMS OF THIS AGREEMENT, PRESS \"DECLINE\" AND RECIPENT WILL BE UNABLE TO ACCESS CONFIDENTIAL INFORMATION.\n1. Written Nondisclosure Agreement. If Recipient and MTI have entered into a written confidentiality agreement (\"Confidentiality Agreement\") that is in effect as of the date Recipient enters into this Agreement and such Confidentiality Agreement already applies to and governs the Confidential Information (defined below), then the terms of such Confidentiality Agreement shall apply to and govern Recipient’s obligations concerning such Confidential Information and not the terms of this Agreement.\n2. Confidential Information. \"Confidential Information\" means any information or data posted to or made available through MTI’s secure website that is (i) marked or labeled as \"Confidential\" or \"Proprietary\" or with similar designation, or (ii) of a nature that a reasonable person would know such information is confidential. Confidential Information does not include that which:\n(i) is proven by Recipient through competent evidence to rightfully have already been in Recipient's possession at the time of disclosure without an obligation of confidentiality;\n(ii) is or becomes available to the public through no fault or breach on the part of Recipient;\n(iii) is independently developed by Recipient without use of or reference to the Confidential Information;\nor (iv) is rightfully obtained from a third party who has the right to transfer or disclose it to Recipient without restriction.\n3. Purpose of Disclosure and Restriction on Use. Confidential Information is disclosed hereunder strictly for the purpose of Recipient’s internal evaluation and/or to assist Recipient in the implementation of an MTI device or product into a commercial product (\"Purpose\"). Recipient shall use the Confidential Information solely in accordance with the terms of this Agreement to accomplish the Purpose and shall make no further use, in whole or in part, of the Confidential Information.\n4. Non-Disclosure. Recipient agrees to protect the Confidential Information, using at least the same degree of care it uses to protect its own confidential and proprietary information, but in no case with less than reasonable care. Recipient shall not disclose, publish or disseminate Confidential Information to anyone other than those of its employees, agents, contractors and consultants (collectively \"Representatives\") who have a need to know the information in order to accomplish the Purpose and who are bound by a written agreement that prohibits unauthorized disclosure or use of Confidential Information on terms no less restrictive and protective than those contained within this Agreement. Recipient will be responsible for any violation of the terms of this Agreement by its Representatives. Recipient may disclose Confidential Information to the extent required by law, provided Recipient shall promptly notify MTI in writing of such requirement to disclose and Recipient shall cooperate with MTI’s efforts to protect the Confidential Information. Recipient shall notify MTI promptly in writing in the event of any disclosure of the Confidential Information which is not authorized under this Agreement.\n5. Feedback. Notwithstanding any other provision in this Agreement, if Recipient provides any ideas, suggestions or recommendations to MTI regarding Confidential Information (\"Feedback\"), MTI is free to use and incorporate such Feedback in MTI’s products, without payment of royalties or other consideration to Recipient, so long as MTI does not infringe Recipient’s patents, copyrights or trademark rights in the Feedback.\n6. Copies. Recipient shall not make any copies of Confidential Information except as strictly necessary to carry out the above-stated Purpose. Any copies that are made must be identical to the original, may not be modified, and shall be considered the property of MTI.\n7. No License. No Warranty. Except as expressly set forth herein, no license is granted hereunder to any patents, copyrights, mask works, or trademarks either expressly, by implication, estoppel or otherwise. Any such license must be express and in writing from MTI. All Confidential Information shall remain the property of MTI and nothing in this Agreement shall restrict MTI from using, disclosing or disseminating such Confidential Information in any way. CONFIDENTIAL INFORMATION IS DISCLOSED HEREUNDER \"AS IS\" WITHOUT ANY REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS OR WARRANTIES AS TO THE ACCURACY, COMPLETENESS OR UTILITY OF SUCH CONFIDENTIAL INFORMATION.\n8. Termination of Obligations of Confidentiality. This Agreement will become effective on the date Recipient clicks on \"Accept.\" Notwithstanding any termination of this Agreement, the provisions of this Agreement shall continue for a period of five (5) years from the date of each disclosure of Confidential Information. MTI may terminate this Agreement at any time in its sole discretion upon written notice to Recipient (including such notice transmitted through this secure MTI website or via electronic mail to Recipient).\n9. Return of Confidential Information. Within ten (10) business days of MTI’s written request, and at MTI’s option, Recipient shall return or certify to MTI the destruction of the Confidential Information including, without limitation, hard copy and electronic documents and all materials created by Recipient that contain the Confidential Information.\n10. Governing Law and Attorneys' Fees. This Agreement shall be governed by the laws of the State of Idaho, U.S.A., excluding its conflict of laws principles. Recipient hereby consents to the personal jurisdiction of the courts of Idaho for any dispute arising out of this Agreement. In the event of any suit, action or proceeding arising out of or relating to this Agreement, the prevailing party will be entitled to reasonable attorneys' fees and reasonable costs incurred.\n11. Export. Recipient agrees that Confidential Information, or any portion thereof, shall not be exported or re-exported, directly or indirectly, in any form, except in compliance with the U.S. Export Administration Act and all other applicable export control laws or regulations.\n12. Injunctive Relief. Recipient acknowledges and agrees that disclosure of Confidential Information in violation of the terms of this Agreement will cause irreparable harm to MTI for which monetary damages would not be an adequate remedy. Therefore, Recipient agrees that, in addition to any other remedies available to MTI, in the event of any breach or threatened breach of this Agreement, MTI shall be entitled to injunctive relief and Recipient waives any requirement for the posting of a bond in connection therewith.\n13. No Implied Waiver. MTI’s failure or delay in exercising any of its rights hereunder will not constitute a waiver of such rights unless expressly waived in writing.\n14. General. This Agreement:\n(i) may be amended or modified only by an express writing signed by Recipient and an authorized representative of MTI;\n(ii) will not be construed as creating any joint venture, partnership or other form of business association between the parties hereto;\n(iii) is not assignable or delegable in whole or in part by Recipient without the express written consent of MTI;\n(iv) shall inure to the benefit of and be binding upon the parties, their successors, the assigns of MTI and the permitted assigns of Recipient;\nand (v) is in the English language only, which language shall be controlling in all respects, and all versions of this Agreement in any other language shall not be binding on the parties hereto.\n15. Authorized Signatory. The individual clicking on \"Accept\" is entering into this Agreement and accessing Confidential Information either (1) as an individual, and hereby agrees that he or she shall be personally liable to MTI if Confidential Information is disclosed or used in a manner not authorized by this Agreement, or (2) on behalf of an employer or other entity, and hereby represents and warrants that he or she has full legal authority to bind such employer or entity to this Agreement and that such employer or entity shall be legally bound by all of the terms and conditions of this Agreement as Recipient hereunder. IF CONFIDENTIAL INFORMATION IS FOR AN EMPLOYER OR ENTITY, BUT YOU DO NOT HAVE THE LEGAL AUTHORITY TO SO BIND SUCH EMPLOYER OR ENTITY, THEN DO NOT ACCESS, VIEW, READ, OR DOWNLOAD IN ANY WAY CONFIDENTIAL INFORMATION, AND DO NOT CLICK ON \"ACCEPT.\"\nIn order to review documents, you must accept the NDA. If you do not accept these terms, select Decline to exit this menu."
    },
    {
        "Ticker": "MU",
        "Company": "Micron Technology",
        "Source_URL": "https://www.micron.com/about/sustainability/culture",
        "Content_Type": "Website Content",
        "Raw_Text": "To access these documents, you must first read and accept Micron's electronic non-disclosure agreement. If the Recipient has a written confidentiality agreement with Micron Technology, Inc. you will need to click \"Accept\" at the bottom of this page, but the terms of the written confidentiality agreement will apply.\nON-LINE NONDISCLOSURE AGREEMENT THIS IS A LEGAL AGREEMENT BETWEEN YOU OR THE COMPANY YOU REPRESENT (EACH A \"RECIPENT\") AND MICRON TECHNOLOGY, INC. (\"MTI\") STATING THE TERMS AND CONDITIONS THAT GOVERN THE CONFIDENTIALITY OF INFORMATION POSTED TO OR MADE AVAILABLE THROUGH THE MICRON WEBSITE. PLEASE CAREFULLY READ THIS NONDISCLOSURE AGREEMENT (\"AGREEMENT\") BEFORE CLICKING \"ACCEPT\" AT THE BOTTOM OF THE PAGE. BY CLICKING ON\"ACCEPT\", RECIPIENT IS AGREEING TO BE BOUND BY THE TERMS OF THIS AGREEMENT. IF RECIPIENT DOES NOT AGREE TO THE TERMS OF THIS AGREEMENT, PRESS \"DECLINE\" AND RECIPENT WILL BE UNABLE TO ACCESS CONFIDENTIAL INFORMATION.\n1. Written Nondisclosure Agreement. If Recipient and MTI have entered into a written confidentiality agreement (\"Confidentiality Agreement\") that is in effect as of the date Recipient enters into this Agreement and such Confidentiality Agreement already applies to and governs the Confidential Information (defined below), then the terms of such Confidentiality Agreement shall apply to and govern Recipient’s obligations concerning such Confidential Information and not the terms of this Agreement.\n2. Confidential Information. \"Confidential Information\" means any information or data posted to or made available through MTI’s secure website that is (i) marked or labeled as \"Confidential\" or \"Proprietary\" or with similar designation, or (ii) of a nature that a reasonable person would know such information is confidential. Confidential Information does not include that which:\n(i) is proven by Recipient through competent evidence to rightfully have already been in Recipient's possession at the time of disclosure without an obligation of confidentiality;\n(ii) is or becomes available to the public through no fault or breach on the part of Recipient;\n(iii) is independently developed by Recipient without use of or reference to the Confidential Information;\nor (iv) is rightfully obtained from a third party who has the right to transfer or disclose it to Recipient without restriction.\n3. Purpose of Disclosure and Restriction on Use. Confidential Information is disclosed hereunder strictly for the purpose of Recipient’s internal evaluation and/or to assist Recipient in the implementation of an MTI device or product into a commercial product (\"Purpose\"). Recipient shall use the Confidential Information solely in accordance with the terms of this Agreement to accomplish the Purpose and shall make no further use, in whole or in part, of the Confidential Information.\n4. Non-Disclosure. Recipient agrees to protect the Confidential Information, using at least the same degree of care it uses to protect its own confidential and proprietary information, but in no case with less than reasonable care. Recipient shall not disclose, publish or disseminate Confidential Information to anyone other than those of its employees, agents, contractors and consultants (collectively \"Representatives\") who have a need to know the information in order to accomplish the Purpose and who are bound by a written agreement that prohibits unauthorized disclosure or use of Confidential Information on terms no less restrictive and protective than those contained within this Agreement. Recipient will be responsible for any violation of the terms of this Agreement by its Representatives. Recipient may disclose Confidential Information to the extent required by law, provided Recipient shall promptly notify MTI in writing of such requirement to disclose and Recipient shall cooperate with MTI’s efforts to protect the Confidential Information. Recipient shall notify MTI promptly in writing in the event of any disclosure of the Confidential Information which is not authorized under this Agreement.\n5. Feedback. Notwithstanding any other provision in this Agreement, if Recipient provides any ideas, suggestions or recommendations to MTI regarding Confidential Information (\"Feedback\"), MTI is free to use and incorporate such Feedback in MTI’s products, without payment of royalties or other consideration to Recipient, so long as MTI does not infringe Recipient’s patents, copyrights or trademark rights in the Feedback.\n6. Copies. Recipient shall not make any copies of Confidential Information except as strictly necessary to carry out the above-stated Purpose. Any copies that are made must be identical to the original, may not be modified, and shall be considered the property of MTI.\n7. No License. No Warranty. Except as expressly set forth herein, no license is granted hereunder to any patents, copyrights, mask works, or trademarks either expressly, by implication, estoppel or otherwise. Any such license must be express and in writing from MTI. All Confidential Information shall remain the property of MTI and nothing in this Agreement shall restrict MTI from using, disclosing or disseminating such Confidential Information in any way. CONFIDENTIAL INFORMATION IS DISCLOSED HEREUNDER \"AS IS\" WITHOUT ANY REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS OR WARRANTIES AS TO THE ACCURACY, COMPLETENESS OR UTILITY OF SUCH CONFIDENTIAL INFORMATION.\n8. Termination of Obligations of Confidentiality. This Agreement will become effective on the date Recipient clicks on \"Accept.\" Notwithstanding any termination of this Agreement, the provisions of this Agreement shall continue for a period of five (5) years from the date of each disclosure of Confidential Information. MTI may terminate this Agreement at any time in its sole discretion upon written notice to Recipient (including such notice transmitted through this secure MTI website or via electronic mail to Recipient).\n9. Return of Confidential Information. Within ten (10) business days of MTI’s written request, and at MTI’s option, Recipient shall return or certify to MTI the destruction of the Confidential Information including, without limitation, hard copy and electronic documents and all materials created by Recipient that contain the Confidential Information.\n10. Governing Law and Attorneys' Fees. This Agreement shall be governed by the laws of the State of Idaho, U.S.A., excluding its conflict of laws principles. Recipient hereby consents to the personal jurisdiction of the courts of Idaho for any dispute arising out of this Agreement. In the event of any suit, action or proceeding arising out of or relating to this Agreement, the prevailing party will be entitled to reasonable attorneys' fees and reasonable costs incurred.\n11. Export. Recipient agrees that Confidential Information, or any portion thereof, shall not be exported or re-exported, directly or indirectly, in any form, except in compliance with the U.S. Export Administration Act and all other applicable export control laws or regulations.\n12. Injunctive Relief. Recipient acknowledges and agrees that disclosure of Confidential Information in violation of the terms of this Agreement will cause irreparable harm to MTI for which monetary damages would not be an adequate remedy. Therefore, Recipient agrees that, in addition to any other remedies available to MTI, in the event of any breach or threatened breach of this Agreement, MTI shall be entitled to injunctive relief and Recipient waives any requirement for the posting of a bond in connection therewith.\n13. No Implied Waiver. MTI’s failure or delay in exercising any of its rights hereunder will not constitute a waiver of such rights unless expressly waived in writing.\n14. General. This Agreement:\n(i) may be amended or modified only by an express writing signed by Recipient and an authorized representative of MTI;\n(ii) will not be construed as creating any joint venture, partnership or other form of business association between the parties hereto;\n(iii) is not assignable or delegable in whole or in part by Recipient without the express written consent of MTI;\n(iv) shall inure to the benefit of and be binding upon the parties, their successors, the assigns of MTI and the permitted assigns of Recipient;\nand (v) is in the English language only, which language shall be controlling in all respects, and all versions of this Agreement in any other language shall not be binding on the parties hereto.\n15. Authorized Signatory. The individual clicking on \"Accept\" is entering into this Agreement and accessing Confidential Information either (1) as an individual, and hereby agrees that he or she shall be personally liable to MTI if Confidential Information is disclosed or used in a manner not authorized by this Agreement, or (2) on behalf of an employer or other entity, and hereby represents and warrants that he or she has full legal authority to bind such employer or entity to this Agreement and that such employer or entity shall be legally bound by all of the terms and conditions of this Agreement as Recipient hereunder. IF CONFIDENTIAL INFORMATION IS FOR AN EMPLOYER OR ENTITY, BUT YOU DO NOT HAVE THE LEGAL AUTHORITY TO SO BIND SUCH EMPLOYER OR ENTITY, THEN DO NOT ACCESS, VIEW, READ, OR DOWNLOAD IN ANY WAY CONFIDENTIAL INFORMATION, AND DO NOT CLICK ON \"ACCEPT.\"\nIn order to review documents, you must accept the NDA. If you do not accept these terms, select Decline to exit this menu."
    }
]