[
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/",
        "Content_Type": "Website Content",
        "Raw_Text": "NVIDIA GB200 und NVIDIA Quantum-X800 InfiniBand-Netzwerke fördern die Forschung Japans in den Bereichen Seismologie, Robotik, Fertigung und Quantenanwendungen.\nKünstliche Intelligenz\nDas wachsende Ökosystem für physische KI von NVIDIA bringt neue Smart-City-Technologien nach Dublin, Raleigh, Ho-Chi-Minh-Stadt und darüber hinaus.\nTelekommunikation\nNokia setzt NVIDIA-Plattformen zur Entwicklung neuer AI-RAN-Produkte ein. NVIDIA stellt Aerial RAN Computer Pro vor.\nHPC\nDie Hochgeschwindigkeits-GPU-QPU-Verbindung integriert Quantenprozessoren innerhalb von Supercomputern in Partnerschaft mit nationalen Labors und Branchenführern.\nNVIDIA und RIKEN erweitern die wissenschaftlichen Grenzen Japans\nFührende Supercomputing-Zentren setzen NVQLink ein\nNVIDIA DGX Spark kommt für KI-Entwickler weltweit\nStädte mit physischer KI intelligenter und sicherer gestalten\nNVIDIA und Nokia treiben das KI-Zeitalter der Telekommunikation voran\nNVIDIA kündigt NVQLink für Quantum-GPU-Computing an\nNVIDIA-CEO Jensen Huang tritt auf die Bühne, um über die Entwicklungen in den Bereichen KI-Fabriken, agentenbasierte KI und physische KI zu berichten, die die neue industrielle Revolution vorantreiben. Jetzt ansehen\nNVIDIA und unsere Drittpartner verwenden Cookies und andere Tools, um die von Ihnen bereitgestellten Informationen sowie Informationen über Ihre Interaktionen mit unseren Websites zu erfassen und aufzuzeichnen, um die Leistung zu verbessern, Analysen durchzuführen und unsere Marketingaktivitäten zu unterstützen. Indem Sie auf „Alles akzeptieren“ klicken, stimmen Sie der Verwendung von Cookies und anderen Tools zu, wie dies in unserer Cookie-Richtlinie beschrieben ist. Sie können Ihre Cookie-Einstellungen verwalten, indem Sie auf „Einstellungen verwalten“ klicken. Bitte beachten Sie unsere Datenschutzrichtlinien, um weitere Informationen über unsere Datenschutzpraktiken zu erhalten.\nWir haben das Global-Privacy-Control-Signal (GPC) erkannt und Ihre Ablehnung aller optionalen Cookies auf dieser Website für diesen Browser registriert. Sie können Ihre Cookie-Einstellungen verwalten, indem Sie auf „Einstellungen verwalten“ klicken. Bitte beachten Sie unsere Cookie-Richtlinie, um weitere Informationen zu erhalten und unsere Datenschutzrichtlinien betreffend Einzelheiten zu unseren Datenschutzpraktiken.\nCookie-Einstellungen\nErforderliche Cookies\nDiese Cookies ermöglichen Kernfunktionen wie Sicherheit, Netzwerkverwaltung und Barrierefreiheit. Diese Cookies sind notwendig, damit unsere Websites funktionieren, und können nicht deaktiviert werden.\nLeistungs-Cookies\nDiese Cookies werden verwendet, um quantitative Messungen der Besuche unserer Website bereitzustellen, z. B. in Bezug auf die Anzahl der Besuche, die Verweildauer auf der Seite, Mausbewegungen, Scrollbewegungen, Klicks und Tastatureingaben auf den Websites, sonstiges Browsing-, Such- oder Produktrechercheverhalten und den Ursprung der Weiterleitung zu unserer Website. Diese Cookies können eine eindeutige Kennung speichern, damit sich unser System an Sie erinnert, wenn Sie zurückkehren. Die mit diesen Cookies erfassten Informationen werden verwendet, um die Performance der Website zu messen und Möglichkeiten zur Verbesserung zu finden.\nPersonalisierungs-Cookies\nDiese Cookies erfassen Daten darüber, wie Sie mit unserer Website interagiert haben, um Ihr Web-Erlebnis zu verbessern. Dabei wird z. B. erfasst, welche Seiten Sie besucht haben. Diese Cookies können eine eindeutige Kennung speichern, damit sich unser System an Sie erinnert, wenn Sie zurückkehren. Sie können von uns oder von Drittanbietern genutzt werden, deren Dienste wir auf unseren Seiten hinzugefügt haben. Diese Cookies ermöglichen es uns, erweiterte Funktionen und eine Personalisierung der Website bereitzustellen und die Marketingbenachrichtigungen, die wir Ihnen senden, relevanter für Ihre Interessen zu gestalten. Wenn Sie diese Cookies nicht zulassen, funktionieren einige oder alle dieser Dienste möglicherweise nicht richtig.\nWerbe-Cookies\nDiese Cookies zeichnen Ihren Besuch auf unseren Websites, die von Ihnen besuchten Seiten und die von Ihnen angeklickten Links auf, um die Werbung anzupassen, die Ihnen auf anderen Websites angezeigt wird. Diese Cookies und die von ihnen erfassten Informationen werden möglicherweise von anderen Unternehmen, einschließlich unseren Werbepartnern, verwaltet und können verwendet werden, um ein Profil Ihrer Interessen zu erstellen und Ihnen relevante Werbung auf anderen Websites anzuzeigen. Wir und unsere Werbepartner verwenden diese Informationen, um unsere Websites und die darauf angezeigte Werbung für Ihre Interessen relevanter zu gestalten.\nCookie-Liste"
    },
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/de-de/clara/biopharma/",
        "Content_Type": "Website Content",
        "Raw_Text": "Beschleunigen Sie die Arzneimittelforschung mit NVIDIA BioNeMo™ für Biopharma, einer Sammlung von Frameworks, Anwendungen, generativen KI-Lösungen und vortrainierten Modellen.\nDie NVIDIA CUDA-X™-Bibliotheken bieten Drop-in-Code-Module, die die rechenintensivsten Schichten in den heutigen biomolekularen KI-Modellen beschleunigen, sodass Forscher schneller Innovationen entwickeln können.\ncuEquivariance ist eine Python-Bibliothek von NVIDIA, die die Erstellung leistungsfähiger äquivarianter neuronaler Netzwerken mithilfe von segmentierten Tensor-Produkten erleichtert. cuEquivariance verfügt jetzt auch über optimierte Kernel für Triangle Attention und Triangle Multiplication zur Modellierung paarweiser Wechselwirkungen bei der Proteinstrukturvorhersage (z. B. Architekturen im AlphaFold-Stil).\nDank einzeiliger Codeänderungen und sofort einsatzbereiter Integrationen über PyTorch- und Jax-Bindings ist es einfacher denn je, die aufwendigsten Schritte in Ihrem Workflow durch CUDA®-optimierte Kernel zu ersetzen.\nErfahren Sie, wie cuEquivariance neue Leistungsniveaus in Ihren Modellen für Proteinstrukturen, generative Chemie und Molekulardynamik erschließen kann.\nBleiben Sie auf dem Laufenden über neue Versionen, Fehlerbehebungen, kritische Sicherheitsupdates und mehr für den Biopharma-Bereich.\nHaben Sie Fragen? Unsere Expertinnen und Experten des Gesundheitswesens sind für Sie da!"
    },
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/de-de/data-center/dgx-cloud/",
        "Content_Type": "Website Content",
        "Raw_Text": "Überblick\nEntwickeln und implementieren Sie geschäftskritische KI schneller. Jede Ebene der NVIDIA DGX™ Cloud wird von NVIDIA optimiert und verwaltet, um maximale Leistung von NVIDIA AI in der Cloud zu gewährleisten.Die einheitliche Plattform mit einer Suite von vollständig verwalteten Plattformen und Diensten ermöglicht es jedem Unternehmen, an jedem Standort eine KI-Fabrik zu haben, mit der es KI-Workloads im Zeitalter der agentenbasierten und physischen KI von der Entwicklung bis zur Bereitstellung übertragen kann.\nNVIDIA DGX Cloud ist eine einheitliche KI-Plattform in führenden Clouds, die die Leistung mit Software, Services und KI-Know-how für sich entwickelnde Workloads optimiert.\nBeschleunigen Sie Ihre KI-Fabrik mit den besten NVIDIA KI-Technologien in der Cloud.\nErleben Sie die Produktivität am ersten Tag in der Cloud auf vollständig verwalteten Plattformen, um die Wertschöpfung zu verkürzen.\nBeschleunigen Sie die KI-Entwicklung und -Bereitstellung mit einer Suite von Software und Managed Services, die Ihnen dabei helfen, im Bereich der KI auf dem neuesten Stand zu bleiben.\nNutzen Sie das Netzwerk der NVIDIA KI-Experten, um die Effizienz und die Leistung zu steigern und niedrigere Gesamtbetriebskosten zu erzielen.\nGeschäftskritische Forschung und Modelle der nächsten Generation werden von NVIDIA DGX Cloud entwickelt und beschleunigt.\nSprechen Sie mit einem KI-Experten von NVIDIA über Ihre Initiativen mit generativer KI.\nGreifen Sie auf die technische Dokumentation über NVIDIA DGX Cloud zu."
    },
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/en-us/gpu-cloud/nemo-llm-service/",
        "Content_Type": "Website Content",
        "Raw_Text": "Overview\nNVIDIA NeMo™ is a modular software suite for managing the AI agent lifecycle. It provides microservices and toolkits for data processing, model fine-tuning and evaluation, reinforcement learning, policy enforcement, and system observability. NeMo helps enterprises build, monitor, and optimize agentic AI systems at scale, on any GPU-accelerated infrastructure. It integrates with existing AI platforms and supports cloud, on-premises, and hybrid deployment, enabling enterprises to rapidly manage and effortlessly create data flywheels that continuously optimize AI agents.\nManage the AI agent lifecycle—from data curation, customization, and evaluation to guardrailing, observability, and optimization—with an enterprise-ready, interoperable software suite.\nEasily build data flywheels that use enterprise data to improve AI agents, powering the entire flywheel with a simple Helm chart deployment or API calls for various parts of the workflow.\nMaximize AI agent performance and throughput with GPU-accelerated optimization, multi-node scaling, and tuning for cost-efficient training, deployment, and continuous improvement.\nBuild safer agentic AI systems by vetting models, guardrailing prompts, and continuously scanning for vulnerabilities.\nDeploy into production with a secure, optimized, full-stack solution that offers support, security, and API stability as part of NVIDIA AI Enterprise.\nBuild, monitor, and optimize AI agents anywhere—from the cloud and data center to the edge.\nThe AI agent lifecycle is an end-to-end process for developing and improving AI agents in production applications. NVIDIA NeMo provides tools that enable each step of this workflow, so enterprises can build powerful, secure, and continuously learning agents.\n| Build | |\n|---|---|\n| Prepare AI-ready data Process existing multimodal datasets into high-quality, AI-ready formats for development pipelines, and generate synthetic data to close critical data gaps. |\n|\n| Select the right model Pick or build models suited to the use case, validate with academic benchmarks, run custom evaluations, and fine-tune if needed. |\n|\n| Build your AI agent Turn your custom model into a scalable application, seamlessly connect it to your enterprise stack and tools, and define workflows with flexible orchestration. |\n|\n| Deploy | |\n| Deploy your agent with maximum performance Optimize your agent for production with high-throughput, low-latency inference, ensuring it can scale to meet enterprise demands and deliver fast, reliable responses. |\n|\n| Stay grounded in data and enforce guardrails Use retrieval-augmented generation (RAG) to anchor agent responses in trusted knowledge while applying safety, compliance, and content moderation guardrails. |\n|\n| Optimize | |\n| Monitor and collect feedback Track the agent's real-world interactions with users and other systems. Systematically evaluate its performance and accuracy, finding opportunities to continuously improve. |\n|\n| Continuously improve with data flywheels Use the feedback and data gathered from monitoring to create a data-driven flywheel, iteratively retraining the agent to continuously optimize and stay effective over time. |\n|\nUse Cases\nSee how NVIDIA NeMo supports industry use cases and jump-starts your AI development.\nAI agents are transforming customer service across sectors, helping companies enhance customer conversations, achieve high resolution rates, and improve human representative productivity. AI agents can handle predictive tasks, reason and problem-solve, be trained to understand industry-specific terms, and pull relevant information from an organization’s knowledge bases, wherever that data resides.\nSpecialized agentic systems need massive, high-quality datasets that are slow and expensive to collect from real-world sources. Synthetic data created through simulations or generative AI models can eliminate this bottleneck by creating unlimited training scenarios without privacy restrictions or quality issues. This enables faster development of reasoning LLMs, multi-step decision-makers, and multimodal AI assistants.\nBusinesses are deploying AI assistants to efficiently address the queries of millions of customers and employees around the clock. Powered by customized NVIDIA NIM microservices for LLMs, RAG, and speech and translation AI, these AI teammates deliver immediate and accurate spoken responses, even in the presence of background noise, poor sound quality, and diverse dialects and accents.\nTrillions of PDF files are generated every year, each file likely consisting of multiple pages filled with various content types, including text, images, charts, and tables. This goldmine of data can only be used as quickly as humans can read and understand it. But with generative AI and RAG, this untapped data can be used to uncover business insights that can help employees work more efficiently and result in lower costs.\nGenerative AI makes it possible to generate highly relevant, bespoke, and accurate content grounded in the domain expertise and proprietary IP of your enterprise.\nHumanoid robots are built to adapt quickly to existing human-centric urban and industrial work spaces, tackling tedious, repetitive, or physically demanding tasks. Their versatility has them in such varied locations as factory floors to healthcare facilities, where these robots are assisting humans and helping alleviate labor shortages with automation.\nApptronik\nManage the AI agent lifecycle with tools and technologies for building, monitoring, and optimizing AI agents in production.\nShell Trains Custom AI Chatbot With NVIDIA NeMo to Uplevel Operations\nShell, a global leader in the energy industry, has leveraged NVIDIA NeMo™ to empower their journey toward developing a custom AI chatbot for chemical domain expertise. This innovative solution has the potential to significantly enhance employee productivity by streamlining search processes, improving decision-making, and supporting research and development in production environments.\nAI Sweden facilitated regional language model applications by providing easy access to a powerful 100 billion-parameter model. They digitized historical records to develop language models for commercial use.\nAmazon doubles inference speeds for new AI capabilities using NVIDIA TensorRT-LLM and GPUs to help sellers optimize product listings faster.\nAmdocs plans to build custom LLMs for $1.7 trillion global telecommunications industry using NVIDIA AI foundry service on Microsoft Azure.\nAT&T, one of the world’s largest telecommunications companies, is reimagining customer care through the power of AI. Facing challenges like model drift, rising computational demands, and the need for real-time data access, AT&T turned to NVIDIA NeMo™ microservices to build a feedback-driven AI platform that continuously improves performance while optimizing cost, speed, and compliance.\nAmazon leveraged the NVIDIA NeMo framework, GPUs, and AWS EFAs to train its next-generation LLM, giving some of the largest Amazon Titan foundation models customers a faster, more accessible solution for generative AI.\nServiceNow, NVIDIA, and Accenture announced the launch of AI Lighthouse, a first-of-its-kind program designed to fast-track the development and adoption of enterprise generative AI capabilities.\nGet access to a complete ecosystem of tools, libraries, frameworks, and support services tailored for enterprise environments on Microsoft Azure.\nBria, a startup based in Tel Aviv, is helping businesses who are seeking responsible ways to integrate visual generative AI technology into their enterprise products with a generative AI service that emphasizes model transparency alongside fair attribution and copyright protections.\nWith NVIDIA NIM and optimized models, Cohesity DataProtect customers can add generative AI intelligence to data backups and archives. This allows Cohesity and NVIDIA to bring the power of generative AI to all Cohesity DataProtect customers. Leveraging the power of NIM and NVIDIA optimized models, Cohesity DataProtect customers obtain the power of data-driven insights from their data backups and archives, unleashing new levels of efficiency, innovation, and growth.\nCrowdStrike and NVIDIA are leveraging accelerated computing and generative AI to provide customers with an innovative range of AI-powered solutions tailored to efficiently address security threats.\nDell Technologies and NVIDIA announced an initiative to make it easier for businesses to build and use generative AI models on premises quickly and securely.\nDeloitte will use NVIDIA AI technology and expertise to build high-performing generative AI solutions for enterprise software platforms to help unlock significant business value.\nWith NVIDIA NeMo, data scientists can fine-tune LLMs in Domino’s platform for domain-specific use cases based on proprietary data and IP—without needing to start from scratch.\nDropbox plans to leverage NVIDIA’s AI foundry to build custom models and improve AI-powered knowledge work with Dropbox Dash universal search tool and Dropbox AI.\nAt its Next conference, Google Cloud announced the availability of its A3 instances powered by NVIDIA H100 Tensor Core GPUs. Engineering teams from both companies have collaborated to bring NVIDIA NeMo to the A3 instances for faster training and inference.\nSouth Korea’s leading mobile operator builds billion-parameter LLMs trained with the NVIDIA DGX SuperPOD platform and NeMo framework to power smart speakers and customer call centers.\nCustomers can harness their business data in cloud solutions from SAP using customized LLMs deployed with NVIDIA AI foundry services and NVIDIA NIM Microservices.\nServiceNow develops custom LLMs on its ServiceNow platform to enable intelligent workflow automation and boost productivity across enterprise IT processes.\nUsing NVIDIA NeMo, Perplexity aims to quickly customize frontier models to improve the accuracy and quality of search results and optimize them for lower latency and high throughput for a better user experience.\nVMware Private AI Foundation with NVIDIA will enable enterprises to customize models and run generative AI applications, including intelligent chatbots, assistants, search, and summarization.\nWeights & Biases helps teams working on generative AI use cases or with LLMs track and visualize all prompt-engineering experiments—helping users debug and optimize LLM pipelines—as well as provides monitoring and observability capabilities for LLMs.\nUsing NVIDIA NeMo, Writer is building LLMs that are helping hundreds of companies create custom content for enterprise use cases across marketing, training, support, and more.\nArize’s LLM engineering and observability platform integrates NVIDIA NeMo microservices to power AI data flywheels, enabling continuous model refinement through real-world feedback. With NeMo Customizer, Evaluator, and Guardrails, Arize ensures agentic systems are performant, safe, and aligned with evolving enterprise needs. This collaboration supports the development of adaptive AI that learns and evolves over time.\nWith NVIDIA NeMo embedded into the DataRobot Enterprise AI Suite, enterprises can ensure agentic systems are safe, compliant, and grounded in enterprise-specific data. This integration facilitates the development of AI agents that deliver accurate, context-aware responses while adhering to organizational standards.\nOver the past year, DataStax has partnered with NVIDIA to adopt the NVIDIA NeMo microservices to enhance generative AI, retrieval-augmented generation, and hybrid search across its database and AI offerings. The results have been impressive: 19x better performance in throughput, a significant reduction in costs, and improved latency.\nGalileo integrates NVIDIA NeMo microservices to build AI data flywheels that strengthen agent performance, reliability, and trust. NeMo adds complementary capabilities to the Galileo platform—enabling continuous domain-specific fine-tuning via NeMo Customizer, advanced evaluation with NeMo Evaluator, and safeguarding user interactions with NeMo Guardrails to empower AI teams to build, evaluate, and monitor agentic AI systems that learn and improve continuously in real-world environments.\nCookie Settings\nRequired Cookies\nThese cookies enable core functionality such as security, network management, and accessibility. These cookies are required for the site to function and cannot be turned off.\nPerformance Cookies\nThese cookies are used to provide quantitative measures of our website visitors, such as the number of times you visit, time on page, your mouse movements, scrolling, clicks and keystroke activity on the websites; other browsing, search, or product research behavior; and what brought you to our site. These cookies may store a unique ID so that our system will remember you when you return. Information collected with these cookies is used to measure and find ways to improve website performance.\nPersonalization Cookies\nThese cookies collect data about how you have interacted with our website to help us improve your web experience, such as which pages you have visited. These cookies may store a unique ID so that our system will remember you when you return. They may be set by us or by third party providers whose services we have added to our pages. These cookies enable us to provide enhanced website functionality and personalization as well as make the marketing messages we send to you more relevant to your interests. If you do not allow these cookies, then some or all of these services may not function properly.\nAdvertising Cookies\nThese cookies record your visit to our websites, the pages you have visited and the links you have followed to influence the advertisements that you see on other websites. These cookies and the information they collect may be managed by other companies, including our advertising partners, and may be used to build a profile of your interests and show you relevant advertising on other sites. We and our advertising partners will use this information to make our websites and the advertising displayed on it, more relevant to your interests.\nCookie List"
    },
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/de-de/data-center/dgx-platform/",
        "Content_Type": "Website Content",
        "Raw_Text": "Die NVIDIA DGX-Plattform mit NVIDIA DGX SuperPOD wurde speziell für Unternehmens-KI entwickelt und vereint das Beste aus Software, Infrastruktur und Know-how von NVIDIA in einer modernen, einheitlichen KI-Entwicklungslösung – für KI-Fabriken der nächsten Generation mit beispielloser Leistung, Skalierbarkeit und Innovation.\nSteigern Sie die Produktivität mit der DGX-Plattform, einer KI-Komplettlösung mit intelligenter Full-Stack-Software in NVIDIA Mission Control, die für die Ausführung von NVIDIA AI Enterprise-Software optimiert ist. Sie beschleunigt Datenwissenschafts-Pipelines und rationalisiert die Entwicklung und Bereitstellung von KI-Anwendungen für den Produktivbetrieb.\nProfitieren Sie von der besten Software und Hardware von NVIDIA in einer einzigen Plattform – mit direktem Zugriff auf KI-Experten von NVIDIA, die Sie bei der Optimierung Ihrer KI-Workloads unterstützen, um schnellere Ergebnisse und einen schnelleren ROI zu erzielen.\nLockheed Martin fördert Innovation und senkt Kosten\nLockheed Martin zentralisiert Rechenressourcen, Betriebstools für maschinelles Lernen und Best Practices in seiner KI-Fabrik – unterstützt von einem NVIDIA DGX SuperPOD™. Diese Plattform verbessert die Produktivität von Entwicklern und die Datensicherheit, während sie gleichzeitig Tausende von Benutzern und eine Vielzahl von KI-Anwendungen im gesamten Unternehmen unterstützt.\nDas Softwareprogramm NVIDIA DGX-Ready bietet MLOps-Lösungen für Workflow, Cluster-Management sowie Planung und Orchestrierung auf Unternehmensebene und stellt so die Produktivität der Datenwissenschaft und die optimale Nutzung der KI-Infrastruktur sicher.\nNVIDIA DGX Cloud ist eine hochleistungsfähige, vollständig verwaltete KI-Plattform, die optimierte beschleunigte Computing-Cluster in jeder Cloud mit flexiblen Laufzeiten und Zugriff auf NVIDIA-Experten für schnelle KI-Initiativen bietet.\nDGX Spark bringt die Leistungsfähigkeit von NVIDIA Grace Blackwell™ auf die Desktops von Entwicklern. Der GB10-Superchip in Kombination mit einem einheitlichen Systemspeicher von 128 GB ermöglicht KI-Forschern, Datenwissenschaftlern und Studierenden, mit KI-Modellen mit bis zu 200 Milliarden Parametern lokal zu arbeiten.\nNächste Schritte\nInformieren Sie sich weiterhin über die DGX-Plattform, die über eine Vielzahl von Partnern und Optionen erhältlich ist.\nDie NVIDIA DGX-Plattform ist der bewährte Standard, auf dem Unternehmens-KI aufgebaut ist."
    },
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/de-de/data-center/hgx/",
        "Content_Type": "Website Content",
        "Raw_Text": "Beschleunigung fortschrittlicher KI in jedem Rechenzentrum.\nKI, komplexe Simulationen und riesige Datenmengen erfordern mehrere GPUs mit extrem schnellen Verbindungen und einem vollständig beschleunigten Softwarestack. Die NVIDIA HGX™-Plattform vereint die volle Leistung von NVIDIA GPUs, NVIDIA NVLink™, NVIDIA Netzwerktechnik und vollständig optimierten KI- und HPC-Softwarestacks (High-Performance-Computing), um die höchstmögliche Anwendungsleistung und schnellste Zeit zur Erkenntnisgewinnung für jedes Rechenzentrum bereitzustellen.\nNVIDIA HGX B300 integriert NVIDIA Blackwell Ultra GPUs mit Hochgeschwindigkeitsverbindungen, um Rechenzentren mit noch nie dagewesener Rechenleistung und generativer KI zu versorgen. Auf Blackwell basierende HGX-Systeme sind als führende beschleunigte Skalierungsplattformen mit bis zu 11-mal mehr Inferenzleistung als bei der vorherigen Generation für enorm anspruchsvolle generative KI-, Datenanalyse- und HPC-Workloads konzipiert.\nNVIDIA HGX umfasst fortschrittliche Netzwerkoptionen mit Geschwindigkeiten von bis zu 800 Gigabit pro Sekunde (Gbit/s) und NVIDIA Quantum-X800 InfiniBand und Spectrum™-X Ethernet für erstklassige KI-Leistung. HGX enthält außerdem NVIDIA BlueField®-3 DPUs (Data Processing Units), um Cloud-Netzwerke, zusammensetzbaren Datenspeicher, Zero-Trust-Sicherheit und GPU-Computing-Elastizität in Hyperscale-KI-Clouds zu ermöglichen.\nDie voraussichtliche Leistung kann Änderungen unterliegen. Token-zu-Token-Latenz (TTL) = 20 ms Echtzeit, Latenz des ersten Tokens (FTL) = 5 s, Länge der Eingabesequenz = 32.768, Länge der Ausgabesequenz = 1.028, 8 x luftgekühlte Acht-Wege-HGX H100 GPUs im Vergleich zu 1 x luftgekühlte HGX B300, Leistungsvergleich pro GPU; Bereitstellung mittels verteilter Inferenz.\nHGX B300 erreicht eine bis zu 11-mal höhere Inferenzleistung im Vergleich zur vorherigen NVIDIA Hopper™ Generation für Modelle wie Llama 3.1 405B. Die Transformer-Engine der zweiten Generation nutzt benutzerdefinierte Blackwell-Tensor-Core-Technik in Kombination mit TensorRT™-LLM-Innovationen, um die Inferenz für große Sprachmodelle (LLMs) zu beschleunigen.\nPrognostizierte Leistung kann sich ändern. Leistungsvergleich pro Grafikprozessor: 8x Eight-Way HGX H100 vs. 1x HGX B300.\nDie zweite Generation der Transformer-Engine mit 8-Bit-Gleitkomma-Technologie (FP8) und neuen Präzisionen ermöglicht ein bemerkenswertes 4-mal schnelleres Training für große Sprachmodelle wie Llama 3.1 405B. Ergänzt wird dieser Durchbruch durch NVLink der fünften Generation mit 1,8 TB/s GPU-zu-GPU-Verbindung, InfiniBand-Netzwerken und NVIDIA Magnum IO™-Software. n Kombination sorgen sie für effiziente Skalierbarkeit für Unternehmen und umfangreiche GPU-Computing-Cluster.\nDas Rechenzentrum ist die Recheneinheit der Zukunft und Netzwerke spielen eine wesentliche Rolle bei der Skalierung der Anwendungsleistung im gesamten Rechenzentrum. In Verbindung mit NVIDIA Quantum InfiniBand bietet HGX erstklassige Leistung und Effizienz, um die Rechenressourcen voll auszulasten.\nIn KI-Cloud-Rechenzentren mit Ethernet sollte HGX am besten mit der NVIDIA Spectrum-X™-Netzwerkplattform kombiniert werden, die in Verbindung mit Ethernet die bestmögliche KI-Leistung bietet. Sie verfügt über Spectrum-X-Switches und NVIDIA SuperNIC™ für eine optimale Ressourcennutzung und Leistungsisolierung. Zudem sorgt sie für konsistente, vorhersehbare Ergebnisse für Tausende von gleichzeitigen KI-Jobs jeder Größenordnung. Spectrum-X ermöglicht fortschrittliche Cloud-Mehrmandantenfähigkeit und Zero-Trust-Sicherheit. NVIDIA hat als Referenzdesign Israel-1 entwickelt, einen auf generativer KI basierenden Hyperscale-Supercomputer entwickelt, der mit Dell PowerEdge XE9680-Servern ausgestattet ist, die wiederum auf der NVIDIA HGX 8-GPU-Plattform, BlueField-3 SuperNICs und Spectrum-4-Switches basieren.\nNVIDIA HGX ist in einzelnen Basisplatinen mit vier oder acht Hopper-SXMs oder acht NVIDIA Blackwell- oder NVIDIA Blackwell Ultra-SXMs verfügbar. Diese leistungsstarken Kombinationen aus Hard- und Software bilden den Grundstein für eine beispiellose KI-Supercomputing-Leistung.\n| HGX B300 | HGX B200 | |\n|---|---|---|\n| Formfaktor | 8x NVIDIA Blackwell Ultra SXM | 8x NVIDIA Blackwell SXM |\n| FP4 Tensor-Core** | 144 PFLOPS | 105 PFLOPS | 144 PFLOPS | 72 PFLOPS |\n| FP8/FP6 Tensor Core* | 72 PFLOPS | 72 PFLOPS |\n| INT8 Tensor Core* | 2 POPS | 72 POPS |\n| FP16/BF16 Tensor Core* | 36 PFLOPS | 36 PFLOPS |\n| TF32 Tensor Core* | 18 PFLOPS | 18 PFLOPS |\n| FP32 | 600 TFLOPS | 600 TFLOPS |\n| FP64/FP64 Tensor Core | 10 TFLOPS | 296 TFLOPS |\n| Gesamtspeicher | Bis zu 2,3 TB | 1,4 TB |\n| NVLink | Fünfte Generation | Fünfte Generation |\n| NVIDIA NVSwitch™ | NVLink 5 Switch | NVLink 5 Switch |\n| NVSwitch-Bandbreite für Verbindungen zwischen GPUs | 1,8 TB/s | 1,8 TB/s |\n| Gesamte NVLink-Bandbreite | 14,4 TB/s | 14,4 TB/s |\n| Networking Bandwidth | 1,6 TB/s | 0,8 TB/s |\n| Attention Performance | 2X | 1X |\n* Mit geringer Dichte\n** Mit geringer Dichte | ohne geringe Dichte\nErfahren Sie mehr über die NVIDIA Blackwell-Architektur."
    },
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/de-de/autonomous-machines/embedded-systems/",
        "Content_Type": "Website Content",
        "Raw_Text": "NVIDIA Jetson™ ist die führende Plattform für Edge-KI und Robotik und bietet leistungsstarke, kompakte Computer sowie das NVIDIA JetPack™ SDK für beschleunigte Entwicklung. JetPack bietet vorkonfigurierte Softwaredienste zur Beschleunigung anspruchsvoller KI-Anwendungen in der Peripherie, einschließlich Robotik, generativer KI und Computer Vision. Dadurch können Sie Ihre Automatisierung und Produktivität mit der Leistung von KI transformieren.\nDas NVIDIA® Jetson AGX Thor™-Entwicklerkit bietet unübertroffene Leistung und Skalierbarkeit. Mit der NVIDIA Blackwell-GPU und 128 GB Arbeitsspeicher bietet es bis zu 2.070 FP4 TFLOPS KI-Rechenleistung für die mühelose Ausführung der neuesten generativen KI-Modelle– und das alles bei einem Leistungsbereich von 130 W. Im Vergleich zu NVIDIA Jetson AGX Orin™ bietet es das 7,5-Fache an KI-Rechenleistung und eine um das 3,5-Fache höhere Energieeffizienz.\nDie NVIDIA Jetson-Software optimiert die Entwicklung und Bereitstellung von fortschrittlicher Robotik und generativer KI-Lösungen in der Peripherie. Sie unterstützt alle Jetson-Module und bietet Sensorverarbeitung in Echtzeit, visuelle KI und fortschrittliche Robotikfunktionen in einem einheitlichen Ökosystem. Mit dem JetPack 7 SDK, den Isaac-Robotiktools und der nahtlosen Cloud-Integration ermöglicht die Jetson-Software schnelle, skalierbare Innovationen in der physischen KI.\nNVIDIA Jetson-Module sind in verschiedenen Leistungsstufen und Preisklassen verfügbar, wodurch sie sich für eine Vielzahl autonomer Anwendungen eignen. Die Jetson-Plattform bietet u. a. in den Bereichen Produktion, Konstruktion, Gesundheitswesen, Zustellungsbranche und weiteren unerreichte Leistung, Energieeffizienz und einfache Entwicklung.\nDas NVIDIA Jetson-Ökosystem bietet eine umfassende Reihe an Produkten und Dienstleistungen, darunter KI-Software, Entwicklungstools und Hardwarelösungen wie Server, Edge-Geräte und Industrie-PCs. Diese Lösungen unterstützen Branchen von der Robotik über die Fertigung bis hin zum Einzelhandel, Transportwesen und dem Gesundheitswesen, wobei auch kommerzielle und robuste Optionen verfügbar sind.\nAuf der NVIDIA-Entwicklerwebsite finden Sie die Software und Dokumentation, die Sie für den Einstieg benötigen.\nBeginnen Sie mit Jetson-Entwicklerkits -Modulen.\nErhalten Sie die aktuellen News zu Robotik und Edge-KI von NVIDIA."
    },
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/de-de/geforce/technologies/dlss/",
        "Content_Type": "Website Content",
        "Raw_Text": "DLSS Ray Reconstruction, Super Resolution und DLAA verwenden jetzt ein neues Transformator-KI-Modell. Es wird von den Supercomputern von NVIDIA trainiert, um die komplexesten Teile einer Szene besser zu rendern. Das Ergebnis ist eine verbesserte Stabilität zwischen den Frames, verbesserte Beleuchtungsdetails und detailliertere Bewegungen.\nGeForce RTX 5090, 4 K Max. Einstellungen, DLSS mit Multi Frame-Generation (4X-Modus), Ray Reconstruction, Super Resolution (Performance-Modus).\nMit der GeForce RTX 50-Serie und Tensor-Recheneinheiten der fünften Generation steigert die neue DLSS Multi Frame Generation die FPS, indem bis zu drei Frames pro gerenderten Frame durch AI generiert werden.\n* GeForce RTX 5090, 4K, RT Overdrive, maximale Einstellungen, DLSS mit Multi Frame Generation (4X Modus), Ray Reconstruction, Super Auflösung (Performance-Modus)\nSteigert die Leistung mithilfe von AI, um Frames zu erstellen und gleichzeitig die hervorragende Reaktionsschnelligkeit mit NVIDIA Reflex beizubehalten.\n* Aufgenommen mit GeForce RTX 4090 bei 3840 x 2160, Neues Raytracing: Overdrive-Modus, DLSS 3, Pre-Release-Build.\nVerbessert die Bildqualität durch Einsatz von AI, um zusätzliche Pixel für Szenen mit intensivem Raytracing zu generieren. DLSS ersetzt manuell abgestimmte Denoiser durch ein von einem NVIDIA Supercomputer trainiertes AI-Netzwerk, das zwischen den gesampelten Strahlen qualitativ hochwertigere Pixel erzeugt.\n* Aufgenommen mit GeForce RTX 4090 bei 3840 x 2160, höchsten Spieleinstellungen und RT-Overdrive-Modus\nSteigert die Leistung aller GeForce RTX-Grafikprozessoren durch die Verwendung von AI zur Ausgabe von Bildern mit höherer Auflösung aus einer Eingabe mit niedrigerer Auflösung. DLSS nimmt mehrere Bilder mit geringerer Auflösung auf und verwendet Bewegungsdaten und Rückmeldungen aus früheren Bildern, um Bilder in hoher Qualität zu erstellen.\n* Aufgenommen mit 3840x2160-Auflösung, höchste Spieleinstellungen\nBietet eine höhere Bildqualität mit AI-basierter Anti-Aliasing-Technologie. DLAA verwendet dieselbe Super Resolution-Technologie, die für DLSS entwickelt wurde, und erstellt damit ein realistischeres, hochqualitatives Bild bei nativer Auflösung.\n* Aufgenommen mit 3840x2160-Auflösung, höchste Spieleinstellungen\nMaximiere deine Leistung, Reaktionsschnelligkeit und Bildqualität mit GeForce RTX-Grafikkarten.\n| GeForce RTX 50-Serie | GeForce RTX 40-Serie | GeForce RTX 30-Serie | GeForce RTX 20-Serie | |\n|---|---|---|---|---|\n| DLSS Multi Frame Generation | - | - | - | |\n| DLSS Frame Generation | - | - | ||\n| DLSS Ray Reconstruction | ||||\n| DLSS Super Resolution | ||||\n| Deep Learning Anti-Aliasing (DLAA) |\nDLSS verändert die Branche und ist jetzt in den beliebtesten Spielen und Apps verfügbar, von „Black Myth: Wukong“ und „Indiana Jones and the Great Circle“ bis hin zu Indie-Favoriten wie „Still Wakes the Deep“. Außerdem kommen regelmäßig neue Spiele hinzu.\nSo verbessert DLSS deine Lieblingsspiele."
    },
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/de-de/geforce/rtx/",
        "Content_Type": "Website Content",
        "Raw_Text": "RTX ist die fortschrittlichste Plattform für vollständiges Raytracing und neuronale Technologien. Diese Technologien revolutionieren, wie wir spielen und kreativ arbeiten. Mehr als 800 Top-Spiele und Anwendungen nutzen RTX, um realistische Grafiken und unglaublich schnelle Leistung mit modernsten KI-Funktionen wie DLSS Multiframe-Erstellung zu liefern.\nVollständiges Raytracing mit neuronalem Rendering\nDie NVIDIA Blackwell-Architektur ermöglicht den bahnbrechenden Realismus von vollständigem Raytracing. Erlebe Grafik in Kinoqualität mit beispielloser Geschwindigkeit mit der GeForce RTX 50-Serie mit RT-Recheneinheiten der vierten Generation und neuronalen Rendering-Technologien, beschleunigt durch Tensor-Recheneinheiten der fünften Generation.\nDLSS ist eine revolutionäre Suite neuronaler Rendering-Technologien, die KI nutzt, um die FPS zu steigern, die Latenz zu reduzieren und die Bildqualität zu verbessern.Der neueste Durchbruch, DLSS 4, bietet eine neue Multiframe-Erstellung und verbesserte Super Resolution, unterstützt von Grafikprozessoren der GeForce RTX™ 50-Serie und Tensor-Recheneinheiten der fünften Generation. DLSS auf GeForce RTX ist die beste Art zu spielen – unterstützt durch einem NVIDIA-KI-Supercomputer in der Cloud, der die Gaming-Funktionen deines PCs ständig verbessert.\n*GeForce RTX 5090, 4K, RT Overdrive, maximale Einstellungen, DLSS mit Multi Frame Generation (4X Modus), Ray Reconstruction, Super Auflösung (Performance-Modus)\nRTX-AI-PCs\nSteige auf fortschrittliche AI mit NVIDIA GeForce RTX™-Grafikkarten um und beschleunige dein Gaming, deine Erstellung von Inhalten, deine Produktivität und die Entwicklung. Dank integrierter AI-Prozessoren erhältst du die weltweit führende AI-Technologie für deinen Windows-PC.\n© 2023 NVIDIA Corporation. Alle Rechte vorbehalten. NVIDIA, das NVIDIA-Logo, GeForce, GeForce RTX und GeForce NOW sind Marken bzw. eingetragene Marken der NVIDIA Corporation in den USA und in anderen Ländern."
    },
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/de-de/data-center/virtual-solutions/",
        "Content_Type": "Website Content",
        "Raw_Text": "Die in drei Editionen erhältliche NVIDIA vGPU-Softwaresuite beschleunigt die kontinuierliche Innovation in einer virtualisierten Umgebung und bietet zudem fortlaufenden Support und Wartung.\nDie NVIDIA vGPU-Software enthält Tools, mit denen Sie Ihre virtualisierte Umgebung proaktiv verwalten und überwachen können, und gewährleistet eine kontinuierliche Betriebszeit mit Unterstützung für die Live-Migration von GPU-beschleunigten VMs. Erfahren Sie, wie die NVIDIA vGPU dazu beiträgt, die Ressourcenauslastung im Rechenzentrum zu maximieren und erhalten Sie Tipps zur Vereinfachung des Bereitstellungsprozesses.\nDie NVIDIA RTX vWS mit RTX-Technologie und GPU-Beschleunigung ist hervorragend für die KI-Entwicklung geeignet und ein idealer Startpunkt für Unternehmen auf ihrer Reise in die Welt der KI. Die in NVIDIA RTX vWS enthaltenen KI-vWS-Toolkits bieten Referenzdokumentation wie Kurzanleitungen, Schritt-für-Schritt-Demos, Bereitstellungsanleitungen und Größenleitfäden für IT- und KI-Entwickler.\nEntdecken Sie alle Möglichkeiten, wie NVIDIA Virtual GPUs komplexe Probleme auf der ganzen Welt lösen können.\nFinden Sie einen NVIDIA-Partner, der NVIDIA vGPU-Lösungen verkauft.\nGreifen Sie auf die neueste NVIDIA vGPU-Software zu.\nKontaktieren Sie den NVIDIA Unternehmenssupport."
    },
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/de-de/autonomous-machines/intelligent-video-analytics-platform/",
        "Content_Type": "Website Content",
        "Raw_Text": "NVIDIA Metropolis ist eine Vision-KI-Anwendungsplattform und ein Partner-Ökosystem, das die Entwicklung, den Einsatz und die Skalierbarkeit von visuellen KI-Agenten vereinfacht, die vom Rand bis zur Cloud eingesetzt werden. Diese KI-Agenten können eine wichtige Rolle dabei spielen, die betriebliche Effizienz zu steigern, die Produktivität der Mitarbeiter zu erhöhen und die Sicherheit in physischen Bereichen wie Smart Cities, Fertigung, Einzelhandel und Logistik zu verbessern.\nGeben Sie Ihren physischen Räumen die Fähigkeit, wahrzunehmen und zu denken. Metropolis kombiniert KI mit Sensor- und visuellen Daten, um unglaubliche Effizienz- und Sicherheitsgewinne zu erzielen.\nGeben Sie Ihren Mitarbeitern an vorderster Front leistungsstarke visuelle KI-Agenten und -Anwendungen an die Hand, die ihnen das Wissen und die Einsichten vermitteln, die sie zur Bewältigung jeder Aufgabe benötigen.\nGreifen Sie auf die wichtigsten Bausteine für KI-Agenten und -Anwendungen für die Videoanalyse zu, mit den neuesten VLM- und CV-Modellen und Microservices für Video-Ingestion, Speicherung und Modellabstimmung.\nNutzen Sie Hunderte von Metropolis-Ökosystemlösungen, um die Komplexität des Trainings, der Erstellung und des Einsatzes von KI-Agenten und -Anwendungen in einer Vielzahl von Branchen zu reduzieren.\nStellen Sie hochpräzise und interaktive KI-Agenten für Videoanalysen mit Multi-Kamera-Tracking bereit, die in Fabriken, Lagerhäusern, Einzelhandelsgeschäften, Flughäfen und Verkehrskreuzungen eingesetzt werden, um große Mengen an Live-oder archivierten Videodaten zu durchsuchen und zu verstehen. Ihre Betriebsteams können jetzt dank natürlicher Sprachabfragen und Interaktionen schnellere und fundiertere Entscheidungen auf Basis umfassender Erkenntnisse treffen.\nEntdecken Sie die Metropolis-Plattform und finden Sie die Bausteine, mit denen Sie die Erstellung und Bereitstellung Ihres visuellen KI-Agenten oder Ihrer Anwendungen vereinfachen und beschleunigen können.\nTesten Sie hochmoderne Vision Foundation-Modelle von führenden KI-Unternehmen, die mit NVIDIA TAO angepasst und mit NVIDIA NIM™ Microservices bereitgestellt werden können.\nErfolgsgeschichten\nDas NVIDIA Metropolis Ökosystem ist eine große und wachsende Familie von über 1.000 Unternehmen, die KI-Agenten und -Anwendungen in Dutzenden von Branchen auf den Markt bringen.\nUnterstützte Plattformen\nNutzen Sie das Leistungspotenzial des NVIDIA VSS-Blueprints, um KI-Agenten nahtlos von Edge-Systemen bis zur Cloud bereitzustellen – mit skalierbarer Leistung für unterschiedliche GPUs. Die VSS-Unterstützung für NVIDIA DGX™ Spark wird bald verfügbar sein.\nHier finden Sie alles, was Sie brauchen, um die Entwicklung Ihrer Gesprächs-KI-Anwendung zu starten, darunter aktuelle Dokumentation, Tutorials, technische Blogs und vieles mehr."
    },
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/de-de/data-center/mission-control/",
        "Content_Type": "Website Content",
        "Raw_Text": "NVIDIA Mission Control™ unterstützt alle Aspekte des KI-Fabrikbetriebs – von Entwickler-Workloads über Infrastruktur bis hin zu Anlagen – mit dem Know-how eines erstklassigen Betriebsteams, das in Form von Software bereitgestellt wird. Die Lösung unterstützt NVIDIA Blackwell™-Rechenzentren für neueste KI-Möglichkeiten und bietet sofortige Agilität für Inferenz- und Trainings-Workloads sowie Full-Stack-Intelligence, um für erstklassige Ausfallsicherheit der Infrastruktur zu sorgen. Mit Mission Control kann jedes Unternehmen KI mit Hyperscale-Effizienz betreiben und KI-Experimente spürbar beschleunigen.\nSorgen Sie mit nahtloser Orchestrierung, Workload-Flexibilität und fortschrittlicher Cluster-Steuerung für Agilität in geschäftskritischen Workloads.\nNutzen Sie einen professionellen KI-Fabrikbetrieb für intelligentes Rechenzentrumsmanagement rund um die Uhr, die Automatisierung von Aufgaben und das Schließen kritischer Kompetenzlücken.\nProaktive Überwachung, schnelle Fehlererkennung und eine 10-mal schnellere Wiederherstellungszeit bei Trainings- und Inferenz-Workloads definieren die Ausfallsicherheit von Infrastruktur neu.\nMaximieren Sie die Workload-Auslastung sowie Rechenzyklen und steigern Sie die Produktivität der Entwickler – für einen neuen Standard der Enterprise-KI in großem Maßstab.\nVereinfachen Sie die Bereitstellung und den Betrieb von KI-Fabriken während des gesamten Cluster-Lebenszyklus.\nBalancieren Sie Energieanforderungen aus und optimieren Sie die GPU-Leistung für verschiedene Workload-Typen mit von Entwicklern wählbaren Steuerungen.\nIdentifizieren, isolieren und beheben Sie Probleme ohne manuelles Eingreifen für maximale Produktivität und Ausfallsicherheit der Infrastruktur.\nVerfolgen Sie wichtige Leistungskennzahlen mit Zugriff auf kritische Telemetriedaten über Ihren Cluster und einfach zu konfigurierenden Dashboards.\nValidieren Sie die Hardware- und Cluster-Leistung während des gesamten Lebenszyklus Ihrer Infrastruktur.\nVerbessern Sie die Steuerung von Stromversorgungs- und Kühlereignissen (einschließlich einer schnellen Erkennung von Lecks) mithilfe von verbesserter Systemkoordination."
    },
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/de-de/software/nvidia-app-enterprise/",
        "Content_Type": "Website Content",
        "Raw_Text": "Überblick\nDie NVIDIA-App ist der ultimative Begleiter für Profis, die NVIDIA RTX™ Grafikkarten verwenden. Optimieren Sie Anwendungen mit einem einheitlichen GPU-Kontrollzentrum, zeichnen Sie Ihren Desktop mit Auflösungen von bis zu 8K auf und entdecken Sie die neuesten NVIDIA-Tools und -Softwarelösungen. Halten Sie Ihre Workstation mit automatischen Hinweisen zu neuen Treiber-Releases auf dem neuesten Stand und sorgen Sie dafür, dass Sie stets über die neuesten Funktionen und Leistungsverbesserungen verfügen.\nTreibereinstellungen\nMit der Treiberempfehlungsfunktion der NVIDIA-App lassen sich neue Treiber-Releases ganz leicht finden. Wählen Sie Treiber anhand Ihrer Workflow-Anforderungen aus und melden Sie sich für Benachrichtigungen an. So erfahren Sie, wenn neue Treiber verfügbar sind, um höhere Leistung, mehr Stabilität und Zugriff auf neue Funktionen zu erhalten. Sobald Sie bereit sind, ein Update zu starten, sorgt der Download- und Installationsprozess mit nur einem Klick dafür, dass Ihr Treiber für Ihre bevorzugten Anwendungen aktualisiert, optimiert und zertifiziert wird. Und wenn Sie Ihre Meinung ändern, können Sie mit der Rollback-Funktion für Treiber ganz einfach zu Ihrer vorherigen Treiberversion zurückkehren. Das bietet Ihnen in Unternehmensumgebungen noch mehr Flexibilität und Kontrolle.\nGPU-Kontrollzentrum\nOptimieren Sie In-App- und GPU-Einstellungen bequem an einem Ort. Passen Sie Ihre NVIDIA-Grafikeinstellungen wie VSync, DSR und Low Latency Mode an. Optimieren Sie Anwendungseinstellungen, indem Sie die Vorteile des NVIDIA Cloud-Rechenzentrums nutzen, um je nach GPU, CPU und Display Ihres Systems personalisierte Grafikeinstellungen bereitzustellen. Außerdem können Sie Ihre GPU mit einem einzigen Klick überwachen und automatisch feinabstimmen. Egal ob Sie komplexe Modelle entwerfen, hochauflösende Szenen rendern oder intensive Simulationen durchführen: Ihr System benötigt für ein optimales Arbeitserlebnis maximale Leistung.\nSystemstatistiken\nZeigen Sie mithilfe des überarbeiteten NVIDIA-Overlays FPS- und Leistungsstatistiken in Echtzeit an. Passen Sie das Display so an, dass durch die Systemstatistik-Funktion kritische Kennzahlen wie GPU- und CPU-Auslastung sowie Systemlatenz angezeigt werden. Auf diese Weise können Sie Ihr System in anspruchsvollen Umgebungen für Spitzenleistung überwachen und optimieren.\nNVIDIA-Overlay\nProfessionelle Workflows sind interaktiver und kollaborativer denn je. Die NVIDIA-App bietet native Bildschirmaufnahmen und Desktop-Aufzeichnungen mit Auflösungen von bis zu 8K, sodass Sie Ihre Arbeitsergebnisse schnell teilen können. Erstellen Sie mit integrierten Aufzeichnungstools, die Ihre Aufgaben erleichtern, How-to-Videos, um Schulungen zu optimieren, erfassen Sie Debugging-Sessions zur schnelleren Problemlösung und beschleunigen Sie Produktentwicklungszyklen, Design-Reviews und mehr. Optimieren Sie Ihren Workflow mit Tools, die für moderne, schnelllebige professionelle Umgebungen entwickelt wurden.\nNVIDIA-Grafiktreiber\nLaden Sie die neuesten NVIDIA RTX Enterprise-Treiber für Ihre Anwendungen herunter.\nNVIDIA RTX Enterprise-Treiber wurden in Zusammenarbeit mit Entwicklern feinabgestimmt und ausgiebig getestet, um bei Ihren Anwendungen für das beste Erlebnis zu sorgen.\nNeue Treiberempfehlungsfunktion\nDie NVIDIA-App für Unternehmen enthält Treiberempfehlungen, um Ihnen die Auswahl des passenden Treibers für Ihre Workflows zu erleichtern. Es gibt drei Einstellungen zur Auswahl: Von NVIDIA empfohlen, Alle Innovationen und Konservativ.\nDie nächsten Schritte\nLaden Sie die neueste Version der NVIDIA-App für Unternehmen herunter und starten Sie noch heute.\nHier finden Sie Antworten auf häufig gestellte Fragen zur NVIDIA-App.\nSprechen Sie mit einem Produktspezialisten von NVIDIA über Ihre professionellen Anforderungen."
    },
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/de-de/gpu-cloud/",
        "Content_Type": "Website Content",
        "Raw_Text": "NGC bietet eine Reihe von Cloud-Diensten, darunter NVIDIA NeMo , BioNemo und Riva Studio für generative KI, Medikamentenentwicklung und Sprach-KI-Lösungen, und die NGC Private Registry für das sichere Teilen von proprietärer KI-Software.\nNVIDIA NGC™ ist das Portal für Enterprise-Dienste, Software, Verwaltungstools und Unterstützung für End-to-End-KI und digitale Zwillings-Workflows. Bringen Sie Ihre Lösungen mit vollständig verwalteten Diensten schneller auf den Markt oder nutzen Sie die Vorteile von leistungsoptimierter Software, um Lösungen auf Ihren bevorzugten Cloud-, lokalen oder Edge-Systemen zu erstellen und bereitzustellen.\nNGC bietet eine Reihe von Cloud-Diensten, darunter NVIDIA NeMo , BioNemo und Riva Studio für generative KI, Medikamentenentwicklung und Sprach-KI-Lösungen, und die NGC Private Registry für das sichere Teilen von proprietärer KI-Software.\nDer NGC-Katalog beschleunigt End-to-End-Workflows mit Containern der Enterprise-Klasse, vorab trainierten KI-Modellen und branchenspezifischen SDKs, die lokal, in der Cloud oder in der Peripherie bereitgestellt werden können.\nDas KI-Framework und SDK-Container werden ständig optimiert und monatlich veröffentlicht, um die Zeit bis zur Lösung zu verkürzen.\nMit hochmodernen vortrainierten Modellen können Sie benutzerdefinierte Modelle für Computer Vision, Sprach-KI und mehr schneller erstellen.\nMit Hunderten von Jupyter-Notebooks können Sie Modelle schneller verstehen, anpassen, testen und erstellen, während Sie von Best Practices profitieren.\nContainer werden monatlichen Sicherheitsüberprüfungen und detaillierten Berichten unterzogen, um sicherzustellen, dass die Container den Sicherheitsrichtlinien Ihres Unternehmens entsprechen.\nTesten Sie die Modelle direkt über Ihren Browser, integrieren Sie sie mithilfe von APIs in Ihre Anwendungen oder laden Sie sie herunter und führen Sie sie auf Ihrem Windows-Computer aus – ganz ohne Einrichtung.\nVon HPC über Gesprächs-KI bis hin zu medizinischer Bildgebung und Empfehlungsdiensten und vielem mehr: NGC Collections bietet sofort einsatzbereite Container, vorab trainierte Modelle, SDKs und Helm-Charts für verschiedene Anwendungsfälle und Branchen – an einem Ort, um Ihren Anwendungsentwicklungs- und Bereitstellungsprozess zu beschleunigen.\nNVIDIA AI Enterprise ist eine durchgängige, sichere Cloud-native Suite aus KI-Software, mit der Unternehmen neue Herausforderungen lösen und gleichzeitig die betriebliche Effizienz steigern.\nSoftware aus dem NGC-Katalog kann auf Bare-Metal-Servern, Kubernetes oder in virtualisierten Umgebungen ausgeführt und lokal, in der Cloud oder im Edge bereitgestellt werden. Sie maximiert so die Auslastung von Grafikprozessoren sowie die Portabilität und Skalierbarkeit von Anwendungen. Benutzer können den gesamten Lebenszyklus der KI-Entwicklung mit NVIDIA Base Command verwalten.\nDie Software des NGC-Katalogs läuft auf einer Vielzahl von GPU-beschleunigten Plattformen von NVIDIA, einschließlich NVIDIA-zertifizierter Systeme, NVIDIA DGX-Systeme, Workstations mit NVIDIA TITAN und NVIDIA RTX™ sowie virtueller Umgebungen mit NVIDIA Virtual Compute Server.\nSoftware aus dem NGC-Katalog kann auf GPU-gestützten Instanzen bereitgestellt werden. Die Software kann direkt auf virtuellen Maschinen (VMs) oder auf Kubernetes-Diensten bereitgestellt werden, die von großen Clouddienstleistern (CSPs) angeboten werden. KI-Software von NVIDIA macht es Unternehmen leicht, ihre Lösungen in der Cloud zu entwickeln und bereitzustellen.\nDa sich das Computing über Rechenzentren hinaus bis zum Edge-Bereich ausdehnt, kann die Software aus dem NGC-Katalog auf Kubernetes-basierenden, modernsten Systemen für Inferenzen mit niedriger Latenz und hohem Durchsatz bereitgestellt werden. Mit NVIDIA AI Enterprise können Sie KI-Anwendungen von NGC über verteilte Edge-Infrastrukturen hinweg sicher bereitstellen, verwalten und skalieren.\nDer NGC-Katalog bietet eine Reihe von Ressourcen, die die Anforderungen von Datenwissenschaftlern, Entwicklern und Forschern mit unterschiedlichem Know-how erfüllen. Hierzu gehören Container, vorab trainierte Modelle, domänenspezifische SDKs, anwendungsfallbasierte Sammlungen und Helm-Charts für die schnellsten KI-Implementierungen.\nDer NGC-Katalog enthält das NVIDIA TAO Toolkit, NVIDIA Triton™ Inference Server und NVIDIA TensorRT™, die es Entwicklern von Deep-Learning-Anwendungen und Datenwissenschaftlern ermöglichen, Deep-Learning-Modelle neu zu trainieren und sie einfach für die Inferenz zu optimieren und bereitzustellen.\nDer NGC-Katalog hostet Container für die wichtigste KI- und Datenwissenschaftssoftware, die von NVIDIA abgestimmt, getestet und optimiert wurde. Außerdem sind vollständig getestete Container für HPC-Anwendungen und Datenanalysen verfügbar, sodass Benutzer Lösungen aus einem getesteten Framework mit vollständiger Kontrolle erstellen können.\nThe NGC catalog hosts pretrained GPU-optimized models for a variety of common AI tasks that developers can use as-is or retrain them easily, thus saving valuable time in bringing solutions to market. Each model comes with a model resume outlining the architecture, training details, datasets used, and limitations. The AI playground enables developers to experience the models directly in their browsers, integrate them into applications using APIs or download and run them on Windows machines with RTX GPUs.\nMit Sammlungen lassen sich kompatible Framework-Container, Modelle, Juptyer Notebooks und weitere Ressourcen ganz einfach entdecken, um schneller mit KI zu starten. Die jeweiligen Sammlungen enthalten zudem detaillierte Dokumentationen zur Bereitstellung der Inhalte für bestimmte Anwendungsfälle.\nDer NGC-Katalog bietet sofort einsatzbereite Sammlungen für verschiedene Anwendungen, darunter NLP, ASR, intelligente Videoanalysen und Objekterkennung.\nHelm-Charts automatisieren die Softwarebereitstellung auf Kubernetes-Clustern. Der NGC-Katalog hostet Kubernetes-fähige Helm-Charts, die eine konsistente und sichere Bereitstellung von Software von NVIDIA und Drittanbietern vereinfachen.\nNVIDIA GPU Operator ist eine Suite von NVIDIA-Treibern, Container-Laufzeit, Geräte-Plug-ins und Verwaltungssoftware, die IT-Teams in Kubernetes-Clustern installieren können, um Benutzern schnelleren Zugriff auf ihre Workloads zu ermöglichen.\nDer NGC-Katalog enthält das NVIDIA TAO Toolkit, NVIDIA Triton™ Inference Server und NVIDIA TensorRT™, die es Entwicklern von Deep-Learning-Anwendungen und Datenwissenschaftlern ermöglichen, Deep-Learning-Modelle neu zu trainieren und sie einfach für die Inferenz zu optimieren und bereitzustellen.\nBeschleunigen Ihres Workflows mit dem NGC-Katalog\nNVIDIA-Partner bieten eine Reihe von Lösungen für Datenwissenschaft, KI-Training und -Inferenz, High Performance Computing (HPC) und Visualisierung.\nErfahren Sie, wie Sie Ihre GPU-optimierte Software im NGC-Katalog veröffentlichen können."
    },
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/de-de/solutions/ai/",
        "Content_Type": "Website Content",
        "Raw_Text": "Verwandeln Sie jedes Unternehmen in eine KI-Organisation mit Full-Stack-Innovationen über beschleunigte Infrastruktur, Unternehmenssoftware und KI-Modelle. Durch die Beschleunigung des gesamten KI-Workflows erreichen Projekte die Produktion schneller, mit höherer Genauigkeit, Effizienz und Infrastrukturleistung zu niedrigeren Gesamtkosten für verschiedene Lösungen und Anwendungen.\nKrankheiten vorbeugen. Natürlichen Code, Dialoge und Bilder generieren. Die Datenanalyse revolutionieren. Dies sind nur einige der bahnbrechenden Neuheiten, die NVIDIA AI möglich macht."
    },
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/de-de/data-center/ai-data-platform/",
        "Content_Type": "Website Content",
        "Raw_Text": "Unterstützung einer neuen Klasse der Unternehmensinfrastruktur für agentenbasierte KI.\nÜberblick\nDie NVIDIA KI-Datenplattform ist ein anpassbarer Referenz-Design-Leitfaden für eine neue Klasse der KI-Infrastruktur, die Unternehmensspeicher mit NVIDIA-beschleunigtem Computing integriert, um KI-Agenten mit Geschäftserkenntnissen nahezu in Echtzeit zu versorgen.\nDiese Datenplattformen werden von führenden Anbietern im Bereich Enterprise Storage entwickelt, um die Performance und Präzision agentenbasierter KI-Workflows zu verbessern. Die Plattform umfasst NVIDIA Blackwell-GPUs, BlueField®-3 DPUs, Spectrum™-X Ethernet Networking und NVIDIA AI Enterprise-Software.\nBeschleunigter Unternehmensspeicher ermöglicht die Freigabe von Geschäftsdaten und die Unterstützung von KI-Agenten.\nDie Plattform bringt die Leistung von beschleunigtem Computing in die KI-Datenverarbeitung und Netzwerkkonnektivität. Dies optimiert Workflows, sodass KI-Agenten umfangreiches Geschäftswissen effizienter und mit niedrigerer Latenz analysieren und darauf reagieren können.\nDie Plattform optimiert die KI-Inferenzleistung für Anwendungsfälle im Unternehmensmaßstab mit leistungsoptimierten Modelllaufzeiten mit den Microservices NVIDIA NIM™ und NeMo™.\nMit der Plattform können Unternehmen Einblicke aus strukturierten oder unstrukturierten Daten verarbeiten und extrahieren und so wertvolle Einblicke aus allen verfügbaren Datenquellen erschließen – Text, PDF, Bilder und Videos.\nDie Plattform integriert den Wissensabruf aus proprietären Unternehmensdatenquellen – interne Dokumente, Kundendaten und fachspezifische Informationen – nahtlos in KI-Workflows, um die Genauigkeit und Relevanz der Antworten von KI-Agenten zu verbessern.\nBenutzer\nIn Zusammenarbeit mit führenden Unternehmen der Datenspeicherbranche ermöglicht es die NVIDIA KI-Datenplattform Unternehmen, intelligente Systeme bereitzustellen, die verwertbares Wissen aus Unternehmensdaten erschließen.\nDie NVIDIA KI-Datenplattform vereint Datenspeicher, NVIDIA-beschleunigte Infrastruktur und NVIDIA-Unternehmenssoftware, um Datenextraktions- und Abrufprozesse zu beschleunigen und nahtlose Verbindungen zwischen KI-Agenten und Ihren wertvollen Geschäftsdaten zu schaffen.\nSprechen Sie mit einem NVIDIA-Produktspezialisten, um die Zusammenarbeit bei unseren Unternehmensspeicherlösungen und der Implementierung von Partnerspeicherlösungen zu erkunden.\nErhalten Sie die neuesten Nachrichten über KI, Technologien, Durchbrüche und mehr direkt in Ihren Posteingang."
    },
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/de-de/solutions/ai/cybersecurity/",
        "Content_Type": "Website Content",
        "Raw_Text": "Die Anzahl und Raffinesse von Cyberbedrohungen nimmt zu. NVIDIA ist einzigartig positioniert, um Unternehmen ind die Lage zu versetzen, robustere Cybersicherheitslösungen mit KI und beschleunigtem Computing bereitzustellen, die Bedrohungserkennung mit KI zu verbessern, die betriebliche Sicherheit mit generativer KI zu erhöhen und sensible Daten und geistiges Eigentum mit einer sicheren Infrastruktur zu schützen. Es kombiniert robuste KI-Frameworks, Architekturen und Best Practices, um Zero-Trust- und skalierbare KI-Rechenzentren zu schaffen und die Cybersicherheit angesichts erhöhter Sicherheitsbedrohungen zu verbessern.\nBietet KI-Inferenzen und Echtzeit-Überwachung aller Server, Pakete, Benutzer und Maschinen im gesamten Netzwerk mit GPU-beschleunigter Leistung, die bis zu 600-mal schneller ist als Server, die nur mit CPU arbeiten.\nBietet eine sichere und beschleunigte Infrastruktur für jeden Workload in jeder Umgebung, die eine schnellere Datenübertragung und verteilte Sicherheit auf jedem Server ermöglicht und damit ein neues Zeitalter des beschleunigten Computings und der KI einzuläutet.\nVerschaffen Sie sich revolutionäre Erkenntnisse auf sichere Weise und mit der Gewissheit, dass Ihre Daten und Modelle sicher, konform und unversehrt bleiben – selbst wenn Sie Datensätze oder Infrastrukturen mit konkurrierenden oder nicht vertrauenswürdigen Parteien teilen.\nDie generative KI-Integration erweitert die Fähigkeiten von Sicherheitsanalysten durch Automatisierung und ermöglicht eine schnellere und genauere Sicherheitsanalyse und -reaktion.\nUnternehmen müssen KI vollständig integrieren, um wirksam zu schützen. Die innovativen Technologien von NVIDIA helfen Unternehmen und Cybersicherheitsanbietern, ihre Lösungen durch die Nutzung von KI und beschleunigtem Computing zu stärken. Cybersicherheit ist ein Datenproblem. KI ermöglicht die effiziente Verarbeitung großer Mengen an Echtzeitdaten und beschleunigt die Erkennung von Bedrohungen und die Identifizierung von Risiken. Sicherheitsanalysten können die Effizienz durch die Integration generativer KI weiter steigern. Mit beschleunigter KI können Unternehmen auch die KI-Infrastruktur, Daten und Modelle mit Netzwerken und vertraulichen Plattformen schützen.\nDie Behebung von Sicherheitsproblemen in der Software ist schwierig und zeitaufwendig, aber KI-gestützte Sicherheitsagenten können die Verteidigung von Schwachstellen verbessern und gleichzeitig die Belastung der Sicherheitsteams verringern. Mit NVIDIA NIM und NVIDIA Morpheus verkürzt diese ereignisgesteuerte RAG-Anwendung die Analyse und Korrektur von bekannten Schwachstellen und Anfälligkeiten (Common Vulnerabilities and Exposure, CVE) von Tagen auf nur wenige Sekunden.\nGPU-beschleunigte, erstklassige Sprach-, Übersetzungs- und Sprachworkflows, die den Anforderungen im Unternehmen gerecht weden.\nHier finden Sie alles, was Sie für die Entwicklung Ihrer KI-Anwendung für Cybersicherheit benötigen, einschließlich der neuesten Dokumentation, Tutorials, technischen Blogs und mehr.\nRegistrieren Sie sich für die neuesten Nachrichten, Updates und mehr von NVIDIA."
    },
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/de-de/data-center/colocation-partners/",
        "Content_Type": "Website Content",
        "Raw_Text": "Verbinden Sie sich mit einem Partner, um Ihre DGX-Infrastruktur zu hosten.\nMit dem NVIDIA DGX-Ready-Programm für Rechenzentren, basierend auf der NVIDIA DGX™-Plattform und bereitgestellt von einem NVIDIA-Partnerkönnen Sie Ihre KI-Mission beschleunigen – und das noch heute. Nutzen Sie die umweltfreundlichsten und kostengünstigsten Zentren weltweit mit einer breiten Palette an Services, darunter moderne Rechenzentren, Vernetzungs- und Kühlungslösungen, um die KI-Skalierung in Ihrem Unternehmen zu beschleunigen.\nJede Generation von NVIDIA DGX-Systemen bietet mehr Leistung pro petaFLOP als frühere Generationen, sodass Unternehmen die komplexesten KI-Probleme mit noch größerer Effizienz angehen können. Zahlreiche DGX-Systeme zählen zu den energieeffizientesten Supercomputern der Welt und haben sich Plätze auf der Green500-Liste erobert. In Kombination mit dem nachhaltigen Betrieb unserer Partner und den innovativen Rechenzentrumsdesigns ermöglicht DGX Unternehmen eine nachhaltige und kostengünstige Skalierung der KI-Transformation.\nBeginnen Sie mit Ihrem Colocation-Partner in Ihrer Region\nNVIDIA ist für dieses Programm eine Partnerschaft mit einer ausgewählten Gruppe regionaler Rechenzentren eingegangen. Beachten Sie, dass NVIDIA zwar DGX-fähige Rechenzentrumsoptionen vorstellt, diese Unternehmen bzw. deren Produkte oder Dienstleistungen jedoch nicht unterstützt und Ihre Auswahl und Nutzung von Produkten und Diensten von Drittanbietern ausschließlich auf Ihr eigenes Risiko erfolgt.\nEntdecken Sie zertifizierte Partner, die Ihre DGX-Infrastruktur für Sie verwalten."
    },
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/de-de/networking/",
        "Content_Type": "Website Content",
        "Raw_Text": "Netzwerke der nächsten Generation für leistungsstarke, skalierbare und sichere KI-gesteuerte Rechenzentren\nEinführung\nKI-Rechenzentren erfordern eine beschleunigte Netzwerkleistung für RAG (Retrieval-Augmented Generation), Modelltraining und Inferenz. NVIDIA-Netzwerke gewährleisten Datenübertragungen mit der höchsten Effizienz und der geringsten Latenz, die für die heutigen KI-Anwendungsfälle erforderlich sind.\nEntdecken Sie beschleunigte Netzwerke – von Standardservern in Unternehmen bis hin zu leistungsstarken Supercomputern.\nFeatured"
    },
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/de-de/solutions/robotics-and-edge-computing/",
        "Content_Type": "Website Content",
        "Raw_Text": "Humanoide Universalroboter sind so konzipiert, dass sie sich schnell an menschenorientierte urbane und industrielle Arbeitsbereiche anpassen und mühsame, sich wiederholende oder körperlich anstrengende Aufgaben bewältigen können. Sie werden zunehmend in Fabriken und Gesundheitseinrichtungen eingesetzt, um Menschen zu unterstützen und den Arbeitskräftemangel durch Automatisierung abzuschwächen."
    },
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/de-de/high-performance-computing/",
        "Content_Type": "Website Content",
        "Raw_Text": "Wir beschleunigen wissenschaftliche Entdeckungen\nHigh-Performance Computing (HPC) ist eines der wichtigsten Tools für den Fortschritt von wissenschaftlichem Computing. Von der Wettervorhersage über die Energiewirtschaft bis zur numerischen Strömungssimulation und den Biowissenschaften: Forscher kombinieren herkömmliche Simulationen mit künstlicher Intelligenz, maschinellem Lernen, Big Data-Analysen und Edge-Computing, um die Geheimnisse der Welt um uns herum zu erforschen.\nErfahren Sie, wie NVIDIA zu den neuesten Durchbrüchen in Wissenschaft und Technologie beiträgt und Forschung und Innovation in beispielloser Geschwindigkeit vorantreibt.\nKlima- und Wettersimulationen können mit interaktiver Visualisierung beschleunigt werden.\nDie branchenführenden Software-Tools ermöglichen die Erstellung interaktiver digitaler Zwillinge beliebiger physischer Systeme.\nErstellen Sie realitätsnahe KI-Modelle und digitale Zwillinge für mehrere Bereiche.\nSimulieren und beschleunigen Sie Quantenschaltungen auf klassischen Computern.\nNVIDIA-Grafikprozessoren optimieren mehr als 700 Anwendungen in einer Vielzahl von Branchen und Bereichen. Erfahren Sie, wie GPU-Technologie bei der Bewältigung komplexer Probleme hilft und die Arbeit der weltweiten Forschungsgemeinschaft verändert.\nSimulation und Modellierung, die Kombination von HPC + KI und Visualisierung kommen in einer Vielzahl von Branchen zur Anwendung – von der wissenschaftlichen Forschung bis zur Finanzmodellierung. Diese wissenschaftlichen Computing-Workloads ermöglichen es Fachleuten, mithilfe von High-Performance Computing und NVIDIA-GPUs ihr Lebenswerk innerhalb ihrer Lebzeit zu vollenden.\nSimulation und Modellierung kommen in einer Vielzahl von Branchen mit dem Ziel zum Einsatz, Herausforderungen in der Praxis zu begegnen, darunter die Pharmaindustrie, das Finanzwesen, die wissenschaftliche Forschung und das Ingenieurwesen.\nMithilfe von KI lassen sich in HPC umfangreiche Simulationen in einem beschleunigten Zeitrahmen durchführen, damit Forscher schneller wissenschaftliche Fortschritte erzielen können.\nWissenschaftliche Visualisierung ermöglicht es, umfangreiche Datensätze zu analysieren und wichtige Erkenntnisse aus Simulation und Modellierung zu gewinnen.\nErfahren Sie, wie Entwickler, Wissenschaftler und Forscher die Rechenleistung von NVIDIA HPC-Lösungen in den unterschiedlichsten Anwendungsfällen und wissenschaftlichen Disziplinen einsetzen.\nMelden Sie sich an, um Neuigkeiten zum Thema High-Performance Computing zu erhalten."
    },
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/de-de/industries/media-and-entertainment/",
        "Content_Type": "Website Content",
        "Raw_Text": "Weltweit führende Film- und Fernsehstudios verlassen sich bei hochmodernen, visuell aufwendigen Spielfilmen und Fernsehsendungen auf NVIDIA. Erfahren Sie jetzt, wie NVIDIA mit generativer KI, Datenanalysen und Hyper-Personalisierung für Streaming-Dienste, Filme und Fernsehsendungen die Umsatzgenerierung beschleunigt."
    },
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/en-eu/geforce/news/borderlands-4-geforce-reward-and-new-dlss-games/",
        "Content_Type": "Website Content",
        "Raw_Text": "More than 800 games and applications feature RTX technologies, and each week new games integrating NVIDIA DLSS, NVIDIA Reflex, and advanced ray-traced effects are released or announced, delivering the definitive PC experience for GeForce RTX players.\nLast week, Assetto Corsa Rally and Call of Duty: Black Ops 7 launched with day-one DLSS 4 with Multi Frame Generation support, while Chip ‘n Clawz vs. The Brainioids launched with DLSS Frame Generation, and Anno 117: Pax Romana arrived with DLSS Super Resolution.\nThis week, we’re highlighting AION2, Pizza Bandit, and DAVY x JONES, three new DLSS games.\nAnd you can grab a free Borderlands 4 ECHO-4 skin from NVIDIA app with GeForce Rewards.\nRead on for all the details.\nTis’ the GeForce Season of RTX and we’re celebrating every Season of Play with new reveals, exclusive rewards, custom GPU giveaways and epic deals. Follow GeForce social channels to be the first to know.\nGet free in-game content and other great rewards in popular PC games just for being a GeForce gamer, with GeForce Rewards. Our latest reward is a free Borderlands 4 ECHO-4 skin!\nAION2 is a next-generation MMORPG developed by NCSOFT, reimagining the original AION universe with a fresh approach. Powered by Unreal Engine 5, AION2 delivers a highly immersive fantasy experience with high-end graphics, gameplay enhancements, new movement and fighting mechanics that incorporate gliding and flying, making large-scale and open-field battles more dynamic and exciting.\nAION2 launches simultaneously in Korea and Taiwan on November 19th, followed by a global release in 2026. At launch, AION2 will include support for NVIDIA DLSS Frame Generation and NVIDIA Reflex, for enhanced graphics performance and input responsiveness, giving GeForce RTX gamers the best possible experience in the massively multiplayer game. DLSS Multi Frame Generation will be available in December.\nPizza Bandit, from JOFSOFT, is a chaotic third-person co-op shooter where hilarious bounty hunting and panic-fueled cooking collide. Travel through time, blast enemies, and cook under fire with up to 4 players to fund your dream pizzeria.\nArmed with time-travel tech and a questionable business plan, you’ll dive into chaotic eras, take down dangerous targets, and cook under pressure—literally. From flipping dough in a warzone to seasoning your kills with style, every mission is a high-stakes recipe for disaster.\nPizza Bandit is available now, and GeForce RTX gamers can maximize frame rates using DLSS 4 with Multi Frame Generation, DLSS Frame generation and DLSS Super Resolution.\nBetrayed and robbed, legendary pirate Davy Jones sinks to The Locker — the seafarers’ afterlife. But death is merely the beginning of his epic tale of revenge in PARASIGHT’s DAVY x JONES. Control the captain’s headless body — Jones — and forge an unlikely alliance with his stubborn skull — Davy — as you reclaim your stolen artifacts and face your eternal nemesis: Blackbeard. Grow into power and unlock your true nature — because the only way out of Davy Jones’ Locker is to become the Devil himself.\nDAVY x JONES is available now in Early Access, and GeForce RTX gamers can accelerate frame rates thanks to the inclusion of DLSS Super Resolution.\nJoin us on Facebook, Instagram, Tiktok and X to celebrate the holidays and the amazing games released throughout 2025. Watch for prompts, follow the steps and you’ll be in the running for Steam Cash, game keys, and even hardware.\nThere’ll be tons of PC gaming goodness posted to our channels from now through to Christmas, so be sure to subscribe and follow us, otherwise you may miss out!\nThere are even more DLSS integrations arriving soon for a whole host of games. Return regularly for a rundown of the next DLSS and RTX titles, and head here to see the full list of over 800 RTX-enhanced games and apps, along with a list of all games and apps with verified support for NVIDIA app’s DLSS 4 overrides.\nCookie Settings\nRequired Cookies\nThese cookies enable core functionality such as security, network management, and accessibility. These cookies are required for the site to function and cannot be turned off.\nPerformance Cookies\nThese cookies are used to provide quantitative measures of our website visitors, such as the number of times you visit, time on page, your mouse movements, scrolling, clicks and keystroke activity on the websites; other browsing, search, or product research behavior; and what brought you to our site. These cookies may store a unique ID so that our system will remember you when you return. Information collected with these cookies is used to measure and find ways to improve website performance.\nPersonalization Cookies\nThese cookies collect data about how you have interacted with our website to help us improve your web experience, such as which pages you have visited. These cookies may store a unique ID so that our system will remember you when you return. They may be set by us or by third party providers whose services we have added to our pages. These cookies enable us to provide enhanced website functionality and personalization as well as make the marketing messages we send to you more relevant to your interests. If you do not allow these cookies, then some or all of these services may not function properly.\nAdvertising Cookies\nThese cookies record your visit to our websites, the pages you have visited and the links you have followed to influence the advertisements that you see on other websites. These cookies and the information they collect may be managed by other companies, including our advertising partners, and may be used to build a profile of your interests and show you relevant advertising on other sites. We and our advertising partners will use this information to make our websites and the advertising displayed on it, more relevant to your interests.\nCookie List"
    },
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/en-eu/geforce/news/battlefield-6-dlss-4-multi-frame-generation-nvidia-reflex/",
        "Content_Type": "Website Content",
        "Raw_Text": "More than 800 games and applications feature RTX technologies, and each week new games integrating NVIDIA DLSS, NVIDIA Reflex, and advanced ray-traced effects are released or announced, delivering the definitive PC experience for GeForce RTX players.\nLast week, Alien: Rogue Incursion - Part One: Evolved Edition and X4: Foundations joined the ever-expanding list of DLSS 4 with Multi Frame Generation games.\nNow, Battlefield 6 is available with DLSS 4 with Multi Frame Generation, as is Little Nightmares III.\nMAVRIX by Matt Jones is also available now with DLSS Frame Generation. And the KPOP Demon Hunters are available now in Fortnite, the world’s most popular game, which is enhanced by DLSS and Reflex on GeForce RTX systems.\nRead on for all the details.\nEA’s Battlefield 6 is the ultimate all-out warfare experience. Fight in high-intensity infantry combat. Rip through the skies in aerial dogfights. Demolish your environment for a strategic advantage. Harness complete control over every action and movement using the Kinesthetic Combat System. In a war of tanks, fighter jets, and massive combat arsenals, the deadliest weapon is your squad.\nFollowing the most successful beta in franchise history where players put in 92 million hours of gameplay resulting in over 420 million matches played, Battlefield 6 has been officially released!\nBattlefield 6 includes support for DLSS 4 with Multi Frame Generation, DLSS Frame Generation, DLSS Super Resolution, DLAA, and NVIDIA Reflex. At 4K, at Ultra settings, DLSS 4 with Multi Frame Generation and DLSS Super Resolution multiply Battlefield 6’s GeForce RTX 50 Series frame rates by an average of 3.8X. GeForce RTX 5090 performance rockets to over 470 FPS, the GeForce RTX 5080 exceeds 330 FPS, the GeForce RTX 5070 Ti is in touching distance of 300 FPS, and the GeForce RTX 5070 surpasses 230 FPS, giving GeForce RTX 50 Series players a fantastic fast, fluid experience.\nAt 2560x1440, Ultra settings, DLSS 4 with Multi Frame Generation and DLSS Super Resolution increase Battlefield 6 frame rates by an average of 3X, enabling the GeForce RTX 5090 to run at almost 600 frames per second, and the GeForce RTX 5060 Ti over 240 frames per second.\nAt 1920x1080, Ultra settings, the combination of DLSS 4 with Multi Frame Generation and DLSS Super Resolution boost Battlefield 6’s GeForce RTX 50 Series frame rates by an average of 2.9X, allowing every GPU in our line-up to play at over 230 frames per second, with performance continually climbing on more powerful products, maxing out at over 740 frames per second on the GeForce RTX 5090, the world’s fastest consumer gaming GPU.\nGeForce RTX 50 Series Laptop GPUs benefit similarly from DLSS 4 with Multi Frame Generation and DLSS Super Resolution, with Battlefield 6 frame rates multiplied by 3X on average at 2560x1600, with Ultra settings, enabling performance of up to 360 FPS.\nAt 1920x1080, Ultra settings, GeForce RTX 50 Series Laptop GPU performance increases by 2.8X on average, enabling Battlefield 6 frame rates to surpass 480 FPS, and the range to run at over 200 frames per second.\nEA’s official Battlefield 6 recommended settings suggest a GeForce RTX 5080 for 4K, max setting gameplay:\nTo ensure your system performs at its best, at the levels shown above, download and install our Battlefield 6 Game Ready Driver.\nGamers on the go, or those without the latest hardware, can still enjoy Battlefield 6 in all its glory — with DLSS 4 with Multi Frame Generation and GeForce RTX 5080-class performance — by streaming it in the cloud with a GeForce NOW Ultimate membership. GeForce RTX 5080 power is rolling out now, providing immersive, ultra-smooth gaming across devices.\nThe super popular KPop Demon Hunters have come to take over Fortnite’s Horde Rush mode, turning it into Demon Rush. Team up and crush the incoming swarm of Demons. Conquer waves of baddies with HUNTR/X gear, build up powerful Perks, and earn a chart-topping high score!\nTake a powerful swing at enemies with Rumi's Empowered Sword, heal up and stay safe in Zoey’s Golden Bubble Shield, and take a snack break with Mira’s X-tra Spicy Ramyeon to refuel for the fight! For a quick escape, don the Tiger Teleporting Mask and teleport away from danger.\nOn GeForce RTX GPUs, accelerate Fortnite frame rates using DLSS, and reduce PC latency for even more responsive gameplay by simply activating NVIDIA Reflex with a few clicks in Video -> Advanced Graphics -> NVIDIA Reflex Low Latency.\nOn GeForce RTX 50 Series GPUs, PC latency is reduced by up to 54% in Battle Royale, making it easy to react to opponents, aim precisely, and achieve victory.\nPrepare for high-tension gameplay in Embark Studios’ multiplayer extraction adventure game, ARC Raiders. Craft, repair, and upgrade your gear in the safety of your own workshop, before venturing topside to scavenge the remnants of a devastated but beautiful world. Shape your legacy as you scavenge loot from the lethal surface, in parties of up to three, or as a solo Raider, navigating the constant threat of ARC's machines and the unpredictable choices of fellow survivors.\nGamers get the best ARC Raiders experience on GeForce RTX 50 Series GPUs with the performance multiplying DLSS 4 with Multi Frame Generation, stunning ray-traced global illumination, and the best responsiveness with NVIDIA Reflex.\nWhen you venture into ARC Raiders’ world, enhance immersion, increase responsiveness and accelerate frame rates with a suite of NVIDIA technologies. DLSS 4 with Multi Frame Generation, working in concert with DLSS Super Resolution, will multiply performance. NVIDIA Reflex will reduce PC latency, allowing your actions to occur faster in-game, making gameplay feel more responsive. And NVIDIA RTXGI uses the power of ray tracing to make lighting more realistic and responsive. See for yourself in our new ARC Raiders RTX video:\nStarting today, as part of our ARC Raiders GeForce RTX 50 Series Bundle, you’ll receive a Deluxe Edition copy of the game, plus pre-order bonus cosmetics, with the purchase of qualifying GeForce RTX 5090, 5080, 5070 Ti, or 5070 desktops or graphics card, or laptops with a GeForce RTX 5090, 5080, 5070 Ti, or 5070 Laptop GPUs at participating retailers and etailers.\nThe ARC Raiders GeForce RTX 50 Series Bundle includes the Deluxe Edition Wanderer and Astro cosmetic packs, plus the Hatchling backpack and Golden Rubber Duck backpack charm pre-order cosmetics, enabling you to gear up in style for the adventures ahead.\nSupermassive Games and Bandai Namco Entertainment's Little Nightmares III is an atmospheric adventure game in which you follow the journey of Low and Alone, two best friends in search of a way out of the Nowhere. In two-player online co-op, or solo with an AI helper , work together to solve puzzles and survive in this nightmarish world. If they cannot find a way out of this Nowhere place, they’ll be condemned to a fate worse than death.\nLittle Nightmares III is available now, featuring DLSS 4 with Multi Frame Generation, and enhanced ray-traced effects, giving GeForce RTX gamers the best possible experience. And in fact, you can try the tech now by downloading the Little Nightmares III demo.\nPearl Abyss and PLAION’s Crimson Desert is an open-world action-adventure game set in the stunning yet perilous continent of Pywel.\nA devastating ambush by their sworn enemy the Black Bears leaves the Greymanes dead or scattered across the land. Players follow the protagonist Kliff who, determined to reunite with his surviving comrades and rebuild what was lost, embarks on a journey to rebuild the Greymanes and reclaim what has been lost. As he traverses across the vast landscapes of Pywel, players will engage in intense battles, defeat formidable monsters, collect valuable loot, and follow the story of the Greymanes' journey with next-generation visuals.\nToday, we can confirm that when Crimson Desert launches on March 19th, 2026, it will feature support for DLSS 4 with Multi Frame Generation, maximizing frame rates.\nMountain biking legend Matt Jones has brought the thrill of high speed racing and freestyle to the small screen in MAVRIX by Matt Jones. Discover mountains and trails with limitless control and build your own career. Pull huge tricks, or race through the global rankings in online co-op and competitive sessions. Nail challenges to secure sponsorship deals with real world brands. And master the controls to successfully land the hardest jumps and tricks.\nMAVRIX by Matt Jones is available now, and following a recent update now includes support for both DLSS Frame Generation and DLSS Super Resolution, which can be upgraded to our latest AI transformer model using NVIDIA app’s DLSS overrides.\nThere are even more DLSS integrations arriving soon for a whole host of games. Return regularly for a rundown of the next DLSS and RTX titles, and head here to see the full list of over 800 RTX-enhanced games and apps, along with a list of all games and apps with verified support for NVIDIA app’s DLSS 4 overrides.\nCookie Settings\nRequired Cookies\nThese cookies enable core functionality such as security, network management, and accessibility. These cookies are required for the site to function and cannot be turned off.\nPerformance Cookies\nThese cookies are used to provide quantitative measures of our website visitors, such as the number of times you visit, time on page, your mouse movements, scrolling, clicks and keystroke activity on the websites; other browsing, search, or product research behavior; and what brought you to our site. These cookies may store a unique ID so that our system will remember you when you return. Information collected with these cookies is used to measure and find ways to improve website performance.\nPersonalization Cookies\nThese cookies collect data about how you have interacted with our website to help us improve your web experience, such as which pages you have visited. These cookies may store a unique ID so that our system will remember you when you return. They may be set by us or by third party providers whose services we have added to our pages. These cookies enable us to provide enhanced website functionality and personalization as well as make the marketing messages we send to you more relevant to your interests. If you do not allow these cookies, then some or all of these services may not function properly.\nAdvertising Cookies\nThese cookies record your visit to our websites, the pages you have visited and the links you have followed to influence the advertisements that you see on other websites. These cookies and the information they collect may be managed by other companies, including our advertising partners, and may be used to build a profile of your interests and show you relevant advertising on other sites. We and our advertising partners will use this information to make our websites and the advertising displayed on it, more relevant to your interests.\nCookie List"
    },
    {
        "Ticker": "NVDA",
        "Company": "Nvidia",
        "Source_URL": "https://www.nvidia.com/en-eu/geforce/news/gamescom-2025-dlss-4-full-ray-tracing-game-announcements/",
        "Content_Type": "Website Content",
        "Raw_Text": "More than 800 games and applications feature RTX technologies, and each week new games integrating DLSS 4 with Multi Frame Generation, NVIDIA Reflex, and advanced ray-traced effects are released or announced, delivering the definitive PC experience for GeForce RTX players.\nThis week, it’s Gamescom, the world’s largest consumer and industry games event, making it the perfect place to announce new games, unveil new tech features, and reveal new content. In this article you can get all of the details, and check out new videos from each game captured on GeForce RTX 50 Series GPUs.\nFull details can be found by reading on, but in summary:\nDLSS 4 with Multi Frame Generation generates up to three additional frames per traditionally rendered frame, working in unison with the complete suite of DLSS technologies to multiply frame rates by up to 8X over traditional brute-force rendering. This massive performance improvement on GeForce RTX 50 Series graphics cards and laptops enables you to max out visuals at the highest resolutions, and play at incredible frame rates.\nGeForce RTX 50 Series graphics cards and DLSS 4 with Multi Frame Generation launched at the end of January, with support available in 75 games and apps. Less than 8 months later, the number of supported titles has grown to over 175, with adoption showing no sign of slowing down.\nEach DLSS 4 with Multi Frame Generation game also includes support for DLSS Frame Generation, accelerating frame rates on GeForce RTX 40 Series GPUs, as well as support for DLSS Super Resolution, boosting performance for every GeForce RTX owner. And in many games, our latest DLSS Super Resolution transformer AI model can be activated via NVIDIA app, instantly enhancing image quality, making your experience even better.\nPrepare to escape death in a heart-stopping survival horror experience that will chill you to your core! Resident Evil Requiem, the ninth mainline Resident Evil game, maintains the combat, exploration, and resource management gameplay of the genre-defining series, while now allowing players to switch between first and third person perspectives.\nThe story returns to Raccoon City, the iconic setting featured in past Resident Evil games. FBI analyst Grace Ashcroft is assigned to investigate a body discovered at an abandoned hotel in a case which will uncover the hidden truth behind the Raccoon City incident, the biological disaster that shook the world.\nWhile the Resident Evil series first began on console systems, many gamers, including those who are playing it for the first time, now experience it on PC. The next installment, Resident Evil Requiem, is being optimized for a wide range of PCs ahead of its release on February 27th next year, and will also include DLSS 4 and path-traced effects, accelerating performance and enhancing image quality.\nIn survival horror, the expression of light and shadow is crucial, whether it’s flickering hallway lights, a faintly glowing red lamp in the dark, or the flame of a lighter illuminating the path ahead. With path tracing implemented, Resident Evil Requiem now renders multiple shadows from various light sources, as well as complex lighting effects like reflections and refractions through glass, with more natural lighting, enhancing immersion during gameplay.\nPath tracing and DLSS 4 will be coming to Resident Evil Requiem, enhancing realism and accelerating performance. Don’t miss the new era of survival horror when it begins in 2026.\nTo learn more, watch our exclusive Resident Evil Requiem Inside the Game RTX video below, featuring Masaru Ijuin, Capcom’s Engine Development Support Manager:\nGearbox’s Borderlands® 4 brings intense 4-player co-op action, badass Vault Hunters, and billions of wild and deadly weapons to Kairos, an all-new planet ruled by a ruthless tyrant. On GeForce RTX 50 Series PCs and laptops, Borderlands 4 will be enhanced by DLSS 4 with Multi Frame Generation and Reflex, delivering the definitive looter shooter experience.\nThe game will also launch day one on GeForce NOW, NVIDIA’s premier cloud gaming service, taking full advantage of the upcoming NVIDIA Blackwell upgrade arriving in September. Gamers can experience the same technologies as GeForce RTX 50 Series GPU owners, including cutting-edge DLSS 4 with Multi Frame Generation, streaming from the cloud, without the latest hardware.\nUntil September 22nd, as part of our Borderlands 4 GeForce RTX 50 Series Bundle, you’ll receive a copy of the game and the Gilded Glory Pack with the purchase of qualifying GeForce RTX 5090, 5080, 5070 Ti, or 5070 desktops or graphics card, or laptops with a GeForce RTX 5090, 5080, 5070 Ti, or 5070 Laptop GPUs at participating retailers and etailers. Learn more here.\nSet in the near future, Capcom’s PRAGMATA transports players to a lunar research station. In the years since the discovery of Lunam Ore, humanity has developed Lunafilament, a material capable of replicating almost anything. One day without warning, Earth lost contact with the station dedicated to this Lunafilament, as all signals went dark. After a chance meeting aboard the seemingly lifeless station, spacefarer Hugh Williams and android Diana find themselves caught in the crosshairs of a hostile AI now in control of the station. Stranded and surrounded by enemies, only together can they hope to survive.\nAs Hugh finds himself needing to work with Diana to return to Earth, they must each rely on their own strengths and abilities to overcome the many obstacles in their path. In a twist, players will control both characters – at the same time – in this single-player adventure. At the heart of the action is Hacking. Diana is able to Hack the enemies they come upon, and Hugh can then shoot them down as their armor has opened up, exposing their weak spots. This 2-in-1 combat system gives a sense of strategy and excitement unique to PRAGMATA.\nThis eagerly anticipated new game launches in 2026 with ray tracing and DLSS 4.\nIn a new, exclusive video, you can take your first peek at PRAGMATA enhanced by multiplatform ray-traced effects, with more visual enhancement options to be announced at a later date. To ensure you don’t miss the reveal, subscribe to the NVIDIA GeForce YouTube channel. And don’t forget to follow PRAGMATA’s official channels on X, Instagram and YouTube to get the latest updates on the game!\nDeveloped in-house by Bigfire Games under NCSOFT, CINDER CITY (formerly Project LLL) is an open-world, cinematic tactical shooter set in a post-apocalyptic near-future Seoul. CINDER CITY depicts a dystopian post-apocalyptic world where humanity in the 21st century is diverted into an alternate timeline due to the arrival of future humans from the 23rd century, who have traveled back in time to prevent an impending catastrophe.\nPlayers take on the role of a Knight from the 21st century, trained and enhanced by 23rd-century technology, experiencing a heroic journey to uncover the whereabouts of their missing daughter and reclaim the future of humanity.\nAs they navigate hostile environments, hijacking vehicles and mechs, they’ll face intense tactical combat and complex moral choices. The game offers a deeply immersive single-player narrative experience, alongside cooperative gameplay where survival depends on teamwork and strategy.\nWhen CINDER CITY launches, there’ll be day-one support for DLSS 4 with Multi Frame Generation, DLSS Frame Generation, and DLSS Super Resolution. Additionally, gamers can activate Unreal Engine 5 Lumen lighting, and enhanced ray-traced effects powered by NVIDIA’s extensive suite of RTX effects. Those who don’t have the latest hardware or are away from their gaming rig can also catch the game at launch on GeForce NOW.\nGet a new, exclusive look at CINDER CITY in the video below, captured on a GeForce RTX 50 Series system.\nS-GAME’s Phantom Blade Zero is an upcoming action role-playing game designed around high-speed, authentic martial arts combat, creating a highly original and unique art style named Kong-fu Punk. Powered by Unreal Engine 5, the game’s release date has yet to be announced, but S-GAME has already committed to launching with day-one support for DLSS 4 with Multi Frame Generation, and now, at Gamescom 2025, they’re showing the PC version of the game enhanced by ray-traced effects for the very first time.\nRay-traced reflections will add realistic reflectivity to surfaces. Ray-traced shadows will enhance every scene throughout the game, adding accurate contact hardness and softness to higher-fidelity shadows. And ray-traced caustics replicate the distortion of light under water.\nAll of this technology is accelerated by the Ray Tracing Cores of GeForce RTX GPUs, and by DLSS 4 with Multi Frame Generation. Watch the new, exclusive video below to see much of this technology in action in Pang Town, a never-before-seen location in Phantom Blade Zero:\nA secret group of scientists called the Architects summons you for a mysterious mission where doors lead to diverse and unexpected locations, rendered in incredible photorealistic detail, with effects powered by advanced ray tracing.\nMotion Blur's Black State sits atop many a wishlist thanks to its impressive visuals, high-octane action, and unique environment-hopping gameplay. Get a new, exclusive look at Black State in the video below, featuring DLSS 4 with Multi Frame Generation and ray-traced reflections:\nLearn more about Black State by heading to the game’s official website, and add it to your Wishlist on Steam.\nNacon and Rogue Factor’s Hell is Us is a 3rd-person action-adventure game that combines intense melee combat with the thrill of exploration. No map, no compass, no quest markers: following your instincts to find answers to mysteries is part of the adventure. Enjoy a unique experience that uses innovative writing and level design to let you make your own decisions. Trust your senses, ready your blade: in Hell is Us your discoveries are yours alone.\nFollowing a well-received demo, Rogue Factor is rapidly approaching Hell Is Us’ full release on September 4th. Today, they’re announcing that the game will be playable on GeForce NOW at launch, and will ship with day-one support for DLSS 4 with Multi Frame Generation, as well as DLSS Frame Generation and DLSS Super Resolution, maximizing frame rates for GeForce RTX gamers.\nCheck out a new, exclusive Hell is Us DLSS 4 with Multi Frame Generation video below:\nThe Outer Worlds 2 is the eagerly-awaited sequel to the award-winning first-person sci-fi RPG from Obsidian Entertainment. Get ready for an action-packed adventure with a new crew, new weapons, and new enemies in a new colony!\nAs a daring and most likely good-looking Earth Directorate agent, you must uncover the source of devastating rifts threatening to destroy all of humanity. Your investigation leads to Arcadia, home of skip drive technology, where the fate of the colony, and ultimately the entire galaxy, rests on your decisions—your strengths, your flaws, your crew, and the factions you choose to trust.\nWhen The Outer Worlds 2 launches on October 29th, GeForce RTX gamers can maximize frame rates using DLSS 4 with Multi Frame Generation, DLSS Frame Generation, and DLSS Super Resolution. And image quality can be taken to new heights with the addition of ray tracing.\nThe Outer Worlds 2 will also be available on GeForce NOW at launch, enabling owners of the game to play on virtually any modern device from anywhere with a high speed internet connection. With the upcoming NVIDIA Blackwell GeForce NOW upgrade in September, players can experience The Outer Worlds 2 with DLSS 4 and Multi Frame Generation at up to 5K 120 FPS. Additionally, GeForce NOW members will be able to enable the new advanced Cinematic Quality Streaming mode. Learn more here.\nWorld of Tanks: HEAT is a new cross-platform, free-to-play tactical vehicle shooter from Wargaming where players command hero-enhanced tanks in fast-paced 10 vs. 10 battles. Positioned between FPS shooters and vehicle combat games, World of Tanks: HEAT aims to build long-term engagement and strong monetization without pay-to-win.\nAt launch, World of Tanks: HEAT will include DLSS 4 with Multi Frame Generation, DLSS Frame Generation, and DLSS Super Resolution to accelerate frame rates on GeForce RTX GPUs. And NVIDIA Reflex will reduce PC latency, making the multiplayer action game even more responsive and enjoyable.\nWatch the world premiere trailer below:\nOne More Level, developer of Ghostrunner, has unveiled Valor Mortis, a new action role-playing game launching 2026. Set in an alternative-history, war-torn 19th-century Europe conquered by Napoleon Bonaparte, players must battle his forces and supernatural threats at every step. Wield swords, firearms and mystical powers, discover secrets through metroidvania-esque exploration, and overcome threats using skill. For more information, check out the Steam page and the debut Valor Mortis trailer:\nAt launch, Valor Mortis will feature a full suite of DLSS 4 technologies. GeForce RTX 50 Series gamers can activate DLSS 4 with Multi Frame Generation to multiply performance. GeForce RTX 40 Series gamers can double frame rates with DLSS Frame Generation. All GeForce RTX gamers can activate DLSS Super Resolution, leveraging our enhanced transformer AI model. GeForce players activating Valor Mortis’ ray-traced reflections and lighting can further improve their fidelity using DLSS Ray Reconstruction. And players with performance to spare can enable DLAA, for the highest image quality possible.\nNTE is a Supernatural Urban Open-World RPG from Hotta Studio and Perfect World Games that takes place in the city of Hethereau - a vast, seamless open world rendered with the power of Unreal Engine 5, where humans co-exist with supernatural anomalies.\nIn July 2025, the latest NTE beta test debuted support for DLSS 4 with Multi Frame Generation, multiplying frame rates on GeForce RTX 50 Series GPUs.\nIn addition to DLSS 4 with Multi Frame Generation, path tracing will come to NTE upon its official release. This cutting-edge rendering technology will enhance image quality and immersion in Hethereau by delivering a highly accurate lighting environment.\nWatch an exclusive path tracing NTE technical showcase video below:\n2004’s Vampire: The Masquerade – Bloodlines is a classic RPG, famed for its excellent writing and branching gameplay. In Vampire: The Masquerade - Bloodlines 2, from BAFTA award-winning developer The Chinese Room, and publishers Paradox Interactive and White Wolf, players will fight their way through a modern-day Seattle on the brink of an open war as an elder Vampire. Meet the power-players, ally yourself and decide who will rule and what the city will become.\nBlood sustains you and powers your vampiric Disciplines. You’ll stalk and feed on the city’s population by night. Use your supernatural powers or raw persuasion on civilians and lure them into deep, dark alleys to sate your Hunger. Beware of breaking the Masquerade though: do not reveal what you are or you risk reprisals.\nWhen Vampire: The Masquerade - Bloodlines 2 launches on October 21st, GeForce RTX gamers can accelerate their frame rates in the much-anticipated game using DLSS 4 with Multi Frame Generation, DLSS Frame Generation, and DLSS Super Resolution. Check out our new, exclusive video to see how DLSS 4 with Multi Frame Generation multiplies frame rates in this long-awaited sequel:\nVampire: The Masquerade - Bloodlines 2 will also be available on GeForce NOW at launch, enabling owners of the game to play on virtually any modern device from anywhere with a high speed internet connection. Learn more here.\nBloober Team, developer of the critically-acclaimed SILENT HILL 2 remake, is now creating Cronos: The New Dawn, an all-new, original survival horror IP. Set across two time periods - the grim ruins of a post-apocalyptic future as well as in 1980s-era Poland - Cronos: The New Dawn thrusts players into the decaying district of New Dawn, inspired by real-life Nowa Huta. You play as a Traveller, an agent of the mysterious Collective, emerging from a dystopian future to dive back into time and extract key people before they perish in the apocalypse. As you explore a world on the brink of annihilation, you’ll encounter grotesque enemies known as the Orphans — twisted, body-horror monstrosities born from humanity’s darkest nightmares.\nAt launch on September 5th, Cronos: The New Dawn will feature support for DLSS 4 with Multi Frame Generation, DLSS Frame Generation, and DLSS Super Resolution, and visuals that are further enhanced by ray-traced effects.\nIn Directive 8020, Earth is dying and humanity is running out of time. 12 light years from home, Tau Ceti f offers a small sliver of hope. When the colony ship Cassiopeia crash lands on the planet, its crew soon realize they are far from being alone. From Supermassive Games, creators of Until Dawn and The Quarry, comes an all-new cinematic sci-fi horror adventure, set in their Dark Pictures universe, blending intense survival gameplay with meaningful choices and a branching storyline.\nHunted by an alien organism capable of mimicking its prey, the crew of the Cassiopeia must outwit their pursuers to make it home alive. They must battle to survive and confront the hardest choice of all: save yourself, or risk the lives of everyone on Earth. In space, death takes many forms!\nOn GeForce RTX 50 Series systems, Directive 8020 can be experienced at its absolute best when it launches in 2026. DLSS 4 with Multi Frame Generation, working in concert with DLSS Super Resolution, will maximize performance and image quality, giving gamers the headroom to activate immersive path-traced direct and indirect lighting, which is further enhanced by DLSS Ray Reconstruction.\nYou are Kyle Crane. After being captured by the Baron and enduring his painful experiments for years, you escape. But the scars remain. Left on the edge of humanity with both human and zombie DNA, you struggle to control your inner beast and the conflict that comes with it. But you’ll need to, if you want to get your revenge on the man who did this to you.\nDying Light: The Beast is a unique blend of open world and action survival horror set in the beautiful, yet dangerous valley of Castor Woods that’s now overrun with zombies. To take your former captor down, you’ll need to form fragile alliances, as well as utilize all the brutal combat and traversal options in your arsenal.\nWhen the beast is unleashed on September 19th, GeForce RTX gamers playing Dying Light: The Beast can use DLSS 4 with Multi Frame Generation, DLSS Frame Generation, and DLSS Super Resolution to enhance their experience. And with a suite of ray-traced effects, further enhanced by DLSS Ray Reconstruction, image quality will reach new heights.\nThe game will also launch day one on GeForce NOW, NVIDIA’s premier cloud gaming service, taking full advantage of the upcoming NVIDIA Blackwell upgrade arriving in September. Gamers can experience the same technologies as 50 Series GPU owners, including cutting-edge DLSS 4 with Multi Frame Generation, streaming from the cloud, without the latest hardware.\nAhead of the game’s launch, watch our new, exclusive Dying Light: The Beast #RTXON video for your first look at this highly anticipated release running on a GeForce RTX 50 Series PC:\nSaroasis Studios’ Fate Trigger is an upcoming, 3D anime-style, hero-based tactical shooter powered by Unreal Engine 5. Dive into a dynamic world of floating islands, become a sharpshooter with extraordinary special skills, craft your own strategies, and engage in thrilling, spectacular life-or-death showdowns.\nHaving previously announced that Fate Trigger is using a NVIDIA ACE Audio2Face-3D technology to generate real-time facial animations and natural lip-sync for dialogue, Saroasis Studios is now announcing that the game will feature DLSS 4 with Multi Frame Generation and Reflex at launch, and also include to enhance image quality.\nGet a first look at Fate Trigger accelerated by DLSS 4 with Multi Frame Generation in our new, exclusive video:\nHead to Steam to sign up for Fate Trigger playtests, and to learn more about the game as it gets closer to release.\nFrozen Way and Snail Games USA’s Honeycomb: The World Beyond is a survival-sandbox game set on an exuberant planet – Sota7. Explore its vast world and face challenges on your bioengineering journey. Step into an unknown world as Hennessy, a bioengineer on a mission. Sota7 looks beautiful and peaceful, but don't let it deceive you, it's full of dangers! Discover alien plant and animal species, try to understand them, and use your knowledge as one of the many tools in your arsenal. Persevere against all odds, and be prepared to outsmart or outrun any dangers you might encounter.\nWhen Honeycomb: The World Beyond launches on November 6th, GeForce RTX gamers can enhance visuals and accelerate performance for the best possible experience, as demonstrated in the new, exclusive video below. DLSS 4 with Multi Frame Generation, DLSS Frame Generation, DLSS Super Resolution, and DLAA will all be on offer to maximize frame rates. And for users enabling ray tracing, superior NVIDIA RTXDI can be activated, upgrading the fidelity and detail of light sources. Quality can then be taken a notch higher with DLSS Ray Reconstruction.\nAltogether, our RTX technologies will dramatically accelerate performance, while simultaneously enhancing image quality. To see all the visual and performance improvements GeForce RTX brings to Honeycomb: The World Beyond, check out the video below!\nThe critically acclaimed adventures of Indiana Jones™ in Indiana Jones and the Great Circle™ can be experienced on GeForce RTX PCs at their very best thanks to DLSS 4 with Multi Frame Generation and immersive path tracing.\nOn September 4th, Indy returns to Rome for a new adventure in the Indiana Jones and the Great Circle: The Order of Giants™ DLC. When Indy encounters Father Ricci, a young priest desperate for help to track down a Roman artifact, a standard treasure hunt soon turns into a perilous journey. Along the way Indy must face the sinister plots of Emperor Nero and his gladiator games, the enigmatic Cult of Mithras, and whatever else lurks in the shadows. Can Father Ricci's cryptic knowledge guide Indy through these treacherous passageways? Only Indiana Jones can piece together this breathtaking mystery in an adventure that takes him through the bustling city of Rome, to the crumbling ruins of the Colosseum, and the pristine Vatican Gardens.\nIndiana Jones and the Great Circle: The Order of Giants will be accompanied by a game update that adds NVIDIA RTX Hair to key characters throughout the DLC and main game.\nCutting edge strand-based hair techniques are used to render ever-better hair effects in games, allowing hair to look more geometrically detailed, and to interact more realistically with light and shadow. However, if applying ray tracing effects to hair, these require several triangles per strand of hair, making the ray tracing bounding volume hierarchy (BVH) builds computationally expensive, impacting frame rates significantly.\nRTX Hair uses a new hardware-accelerated capability in GeForce RTX 50 Series GPUs that adds support for Linear-Swept Spheres (LSS) primitives, and makes performant path-traced strand-based hair rendering possible for the very first time. RTX Hair reduces the amount of geometry necessary to render strands of hair, and uses spheres/tubes instead of triangles to get a more accurate fit for hair shapes in ray tracing.\nWith these innovations, NVIDIA RTX Hair adds more realistic, higher-quality hair rendering, which is especially notable in Indiana Jones and the Great Circle’s cinematic cut scenes, further enhancing image quality and immersion for GeForce RTX 50 Series players.\nEmbark on an epic odyssey to save your younger sister – and the whole of humanity – from mysterious dimensional invaders in Ultizero Games and PlayStation Publishing's Lost Soul Aside. Run the gauntlet of formidable enemies and colossal bosses in this breathtakingly stylish single player action-adventure RPG; chaining weapon and spectacular attack combos in high-octane, dynamic combat. Adventure far and wide across dangerous dimensions, majestic lands, and strange new worlds filled with mysterious architecture. Adapt your fighting style, solve puzzles, and evolve incredible abilities on a truly heroic quest - your enemies are relentless and will show no mercy. Neither must you.\nLost Soul Aside launches next week on August 29th; GeForce RTX gamers will receive the definitive PC experience thanks to a full suite of RTX technologies that’ll be available from day-one.\nDLSS 4 with Multi Frame Generation will maximize performance on GeForce RTX 50 Series GPUs, multiplying frame rates by up to 5X. DLSS Frame Generation will double performance for GeForce RTX 40 Series gamers. DLSS Super Resolution will accelerate performance for all GeForce RTX users. NVIDIA Reflex will further reduce PC latency, making the fast-paced gameplay even more responsive. And realistic ray-traced reflections and ray-traced shadows will run best on GeForce RTX GPUs thanks to our dedicated Ray Tracing Cores.\nSee how all of this technologies delivers the best possible experience in Lost Soul Aside by watching this new, exclusive #RTXON video:\nNVIDIA ACE is a suite of digital human technologies that bring game characters to life with generative AI. NVIDIA ACE activates a higher level of intelligence through small language models - in KRAFTON’s inZOI, it turns NPCs into autonomous game characters that adapt and respond more realistically based on player input.\nIn a new update launching this month, the game’s AI-powered Smart ZOIs are getting even smarter. Now, they can better observe the environment, react more dynamically to events, and their actions are more aligned with their inner thoughts, making Smart ZOIs more realistic and entertaining to watch and mould.\nAdditionally, GeForce RTX 50 Series owners will be able to activate DLSS 4 with Multi Frame Generation in inZOI, accelerating frame rates. Check out an example in our new, exclusive video, below:\nNVIDIA ACE is a suite of technologies that brings game characters to life with AI. It enables a new generation of living breathing worlds, filled with knowledgeable companions, dynamic agents, and conversational actors.\nThe Oversight Bureau by Iconic Interactive is enhanced with NVIDIA ACE. It uses our latest on-device NVIDIA Riva Automatic Speech Recognition (ASR) model to provide high word accuracy at real-time performance and latency, with word-boosting and streaming functionality for English transcription. Iconic’s patent-pending Narrative Engine uses an AI model to analyze and understand the transcription and another model to determine and deliver dialogue, behavior and theatrical performance that best fits the situation.\nIn The Oversight Bureau, you play as Candidate 404, trapped in an underground reconditioning facility. Every day you’re forced to participate in simulations as the Bureau attempts to reprogram your mind and turn you into a more compliant member of society. The player interacts with the game using speech, which the ACE model then transcribes into text.\nSee NVIDIA ACE in action in The Oversight Bureau in our new, exclusive video:\nThere are even more DLSS integrations arriving soon for a whole host of games. Return regularly for a rundown of the next DLSS and RTX titles, and head here to see the full list of over 800 RTX-enhanced games and apps, along with a list of all games and apps with verified support for NVIDIA app’s DLSS 4 overrides.\nCookie Settings\nRequired Cookies\nThese cookies enable core functionality such as security, network management, and accessibility. These cookies are required for the site to function and cannot be turned off.\nPerformance Cookies\nThese cookies are used to provide quantitative measures of our website visitors, such as the number of times you visit, time on page, your mouse movements, scrolling, clicks and keystroke activity on the websites; other browsing, search, or product research behavior; and what brought you to our site. These cookies may store a unique ID so that our system will remember you when you return. Information collected with these cookies is used to measure and find ways to improve website performance.\nPersonalization Cookies\nThese cookies collect data about how you have interacted with our website to help us improve your web experience, such as which pages you have visited. These cookies may store a unique ID so that our system will remember you when you return. They may be set by us or by third party providers whose services we have added to our pages. These cookies enable us to provide enhanced website functionality and personalization as well as make the marketing messages we send to you more relevant to your interests. If you do not allow these cookies, then some or all of these services may not function properly.\nAdvertising Cookies\nThese cookies record your visit to our websites, the pages you have visited and the links you have followed to influence the advertisements that you see on other websites. These cookies and the information they collect may be managed by other companies, including our advertising partners, and may be used to build a profile of your interests and show you relevant advertising on other sites. We and our advertising partners will use this information to make our websites and the advertising displayed on it, more relevant to your interests.\nCookie List"
    }
]