[
    {
        "Ticker": "ODFL",
        "Company": "Old Dominion Freight Line",
        "Source_URL": "http://www.odfl.com/",
        "Content_Type": "Website Content",
        "Raw_Text": "At OD, we lead the LTL category by doing things the right way. We continually invest in our people and improve our technology to ensure we can meet your every business need. That’s why, for 16 years running, shippers have named us their #1 National LTL Carrier for Quality for our commitment to customer service and trustworthiness.\nFrom Standard to Expedited LTL and everything in between, we offer a range of freight transportation services for businesses across the United States, Canada, Mexico, and beyond. Each OD service is backed by our on-time, damage-free promise."
    },
    {
        "Ticker": "ODFL",
        "Company": "Old Dominion Freight Line",
        "Source_URL": "http://www.odfl.com/us/en/tools/service-center-locator.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Use the map to find your nearest OD Service Center or use one of these options to search for your location:\nThe search results will show your service center's location, contact information, and transit time details.\n*The U.S. Virgin Islands ships out of Puerto Rico."
    },
    {
        "Ticker": "ODFL",
        "Company": "Old Dominion Freight Line",
        "Source_URL": "http://www.odfl.com/us/en/about/od-difference.html",
        "Content_Type": "Website Content",
        "Raw_Text": "OD partners to understand your business and then builds a custom shipping solution to meet your specific needs. Our premium service means your shipments deliver to your customers on time and damage free. OD protects your reputation and your bottom line by preventing chargebacks, fines, lost sales, and lost customers.\nContact OD today to get connected with your Solutions Specialist.\nOur Commitment Goes Beyond the Shipment\nOur Commitment Goes Beyond the Shipment\nCarrier performance directly affects your business’s total cost of transportation, and a premium carrier delivers value beyond the price on a freight invoice. As the #1 National LTL Carrier for Quality*, OD goes the extra mile to provide exceptional service through on-time transit, damage-free deliveries, careful handling procedures, and outstanding customer service. We provide value to our partners by helping them improve their shipping operation and avoid unforeseen costs associated with:\n*The Mastio Quality Award is a trademark of Mastio & Company.\nEach Freight Shipment is a Promise Delivered\nEach Freight Shipment is a Promise Delivered\nAt OD, we believe our success is directly tied to the success of our customers. We deliver your freight shipments with a best-in-class on time record and a low claims rate that is the envy of the LTL shipping industry. From daily LTL shipments to the most time-critical expedited shipment, each freight shipment is handled as if our business depends on it, because we believe it does.\nContact OD today and see how you can put our performance to work for your business.\nAs the complexity and speed of today’s supply chains continue to evolve, accurate and timely access to data becomes more and more important. OD invests approximately $12 million into technology annually, enhancing efficiency and security throughout our operations by building transparency and access for our customers to their shipping data.\nFrom the advanced telematics in our trucks to the state-of-the-art load planning and routing systems, OD technology makes sure your freight moves in the most secure and efficient manner to your customer. OD’s web and app based customer portals provide resources, tools, and access to your shipping information wherever you are and on any device.\nFlexible Solutions Drive Business\nFlexible Solutions Drive Business\nWhen business opportunities appear, be ready with an LTL shipping partner prepared to meet any demand. OD stands ready to build custom solutions to meet any challenge, including high priority and time-sensitive shipments. Rush shipping? No problem. Vendor scorecard compliance? We can help. Just-in-time inventory management? OD is ready to keep your promises to customers.\nContact OD today and get started with a custom LTL freight solution to match your exact business needs. Our Solutions Specialists are ready to help."
    },
    {
        "Ticker": "ODFL",
        "Company": "Old Dominion Freight Line",
        "Source_URL": "http://www.odfl.com/us/en/about/ODFL-news.html",
        "Content_Type": "Website Content",
        "Raw_Text": "|\nODFL Announces General Rate Increase Set For November 3, 2025\nOctober 20, 2025 Effective November 3, 2025, OD announced a general rate increase (GRI) of 4.9 percent applicable to rates established under existing 559, 670, and 550 tariffs. |\n|\n|\nodfl:media-resources/types/press-releases\nPress Release\nOD Named No. 1 National LTL Carrier for Quality by Mastio & Company\nOctober 7, 2025 OD has been named the #1 National LTL Carrier for Quality by Mastio & Company for an unprecedented 16th consecutive year. Carriers are measured on 28 attributes of performance and in 2025, OD ranked in the top spot for 23 of those attributes. |\n|\n|\nodfl:media-resources/types/press-releases\nPress Release\nODFL Announces General Rate Increase Set For December 2, 2024\nNovember 18, 2024 Effective December 2, 2024, OD announced a general rate increase (GRI) of 4.9 percent applicable to rates established under existing 559, 670, and 550 tariffs. |\n|\n|\nodfl:media-resources/year/2024\n2024\nodfl:media-resources/types/press-releases\nPress Release\nOD Announces Partnership with Folds of Honor\nNovember 8, 2024 OD is proud to announce a partnership with Folds of Honor to provide scholarships to families of fallen or disabled service members and first responders. Our corporate donation will be directed to scholarships for those pursuing their CDL or degrees in supply chain, operations, or transportation. |\n|\n|\nmastio\nMastio\nodfl:media-resources/types/press-releases\nPress Release\nOld Dominion Freight Line Named #1 National LTL Carrier for Quality by Mastio & Company for 15th Consecutive Year\nOctober 16, 2024 OD has been named the #1 National LTL Carrier for Quality by Mastio & Company for an unprecedented 15th consecutive year. Carriers are measured on 28 attributes of performance and in 2024, OD ranked in the top spot for 23 of those attributes. |"
    },
    {
        "Ticker": "ODFL",
        "Company": "Old Dominion Freight Line",
        "Source_URL": "http://www.odfl.com/us/en/about/technology.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Our advanced technology solutions simplify shipping.\nYou want your shipments to move as efficiently and as safely as possible. You want to track their progress and delivery times. At Old Dominion, we are committed to making sure that happens with the state-of-the-art freight shipping technology and innovative tools that we are continually seeking."
    },
    {
        "Ticker": "ODFL",
        "Company": "Old Dominion Freight Line",
        "Source_URL": "http://www.odfl.com/us/en/about/OD-certificates-licenses.html",
        "Content_Type": "Website Content",
        "Raw_Text": "When you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer.\nMore informationPrivacy Policy\nManage Consent Preferences\nStrictly Necessary Cookies\nAlways Active\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nPerformance Cookies\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nFunctional Cookies\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nMarketing Cookies\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising."
    },
    {
        "Ticker": "ODFL",
        "Company": "Old Dominion Freight Line",
        "Source_URL": "http://www.odfl.com/us/en/about/ceo-letter.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Throughout our 90 years, we have seen many things change in the LTL business. ODFL has navigated nine decades in business by staying customer-focused and understanding that each shipment is as important as the next. You have trusted us to partner with your business because you want the assurance that your product will arrive on your customer’s dock on-time and without exceptions.\nYou’re not shipping freight. You’re shipping a promise.\nProliferation in technology has made shipping more efficient, but with progress comes new challenges. We live in an on-demand economy with tighter supply chains, an increased need for shipping velocity, shorter delivery windows, high-quality customer service, and real-time track and traceability. Old Dominion has made significant investments in each of these areas to ensure we are meeting your shipping needs.\nBecause ultimately, our promise is to deliver your promise.\nWe see ourselves as an extension of your team. With our 99%+ on-time delivery and industry-leading claims ratio, you can count on OD when it matters most. We offer four service lines, OD-Domestic, OD-Expedited, OD-Global, and OD-Technology. Each offers several custom products and services to fit your needs. But most importantly, when you ship with OD, you have access to our most valuable asset: our OD-People.\nIt is OD's people that embody the OD Family Spirit and build the relationships with our customers that we value so deeply. We believe our team of more than 23,000 employees are the best in the business. Our investments in equipment and technology need high quality people behind them to operate at the level you expect from OD. Our people are OD’s greatest asset and what makes us an industry leader.\nWe are thankful to be your trusted business partner and are dedicated to helping you keep your promises.\nPresident & CEO"
    },
    {
        "Ticker": "ODFL",
        "Company": "Old Dominion Freight Line",
        "Source_URL": "http://www.odfl.com/us/en/about/old-dominion-to-partner-with-36-college-athletic-departments.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Old Dominion is Proud to Support The Best in the Game® by Partnering with 44 Universities and ESPN College GameDay\nProud Sponsor of College Athletics\nOld Dominion Freight Line is proud to partner with 44 college athletic programs and their commitment to excellence on and off the field. Our sponsorship showcases our dedication to supporting the athletes working hard to be The Best in The Game®.\nWe're proud to partner with these premier athletic departments, as their pursuit of excellence mirrors our dedication to delivering outstanding service to our customers.\nFor 16 consecutive years, Mastio & Company has recognized Old Dominion as the #1 National LTL Carrier for Quality.* Our commitment to superior service and operational efficiency ensures your business is always in trusted hands.\nESPN College GameDay Partnership\nOld Dominion Freight Line is proud to partner with ESPN as the Official Freight Carrier of College GameDay. OD sponsors the fan bleachers and The Best in the Game® highlight, both of which drive energy and excitement throughout the football season.\nOD is proud to support college sports and the teams striving to be The Best in the Game® as it aligns with our desire to deliver the very best service for our customers.\nDiscover What It Means to Be The Best in The Game®\nJoin Old Dominion Freight Line in celebrating the spirit of college sports and excellence in service.\n*The Mastio Quality Award is a trademark of Mastio & Company.\nPreference Center\nWhen you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer.\nMore informationPrivacy Policy\nManage Consent Preferences\nStrictly Necessary Cookies\nAlways Active\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nPerformance Cookies\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nFunctional Cookies\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nMarketing Cookies\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising."
    },
    {
        "Ticker": "ODFL",
        "Company": "Old Dominion Freight Line",
        "Source_URL": "http://www.odfl.com/us/en/about.html",
        "Content_Type": "Website Content",
        "Raw_Text": "A lot has changed over the years, but we’re still the company that puts you first and one that continually invests in our business and our people. OD does more than excel at delivering freight. We deliver on promises.\nTo be the premier transportation solutions company in domestic and global markets served.\nTo provide innovative solutions designed to exceed customer expectations, increase shareholder value and ensure the continued success of the OD company and our family of employees.\nOD and its employees believe and uphold these core values: Professional, Reliable, Open, Mindful, Innovative, Serving, Ethical and Supportive."
    },
    {
        "Ticker": "ODFL",
        "Company": "Old Dominion Freight Line",
        "Source_URL": "http://www.odfl.com/bin/aadb2c/userFlowServlet",
        "Content_Type": "Website Content",
        "Raw_Text": "Old Dominion Freight Line has been in the freight shipment business for over 75 years.\nIn that time, we've learned to leverage state-of-the-art technologies that help our domestic and global shipping clients manage their cargo and freight efficiently."
    },
    {
        "Ticker": "ODFL",
        "Company": "Old Dominion Freight Line",
        "Source_URL": "https://www.odfl.com/us/en/services/global-freight/Worldwide-LCL-Container-Load-Service.html",
        "Content_Type": "Website Content",
        "Raw_Text": "OD Global* helps you get freight across the globe with the premium service you expect. Through our strategic alliance with Mallory Alexander International Logistics, LLC, we provide access to reliable Less-than-Container Load (LCL) and Full Container Load (FCL) import export services worldwide. Get seamless container importing, exporting, and domestic distribution with the same real-time tracking and premium service OD delivers domestically."
    },
    {
        "Ticker": "ODFL",
        "Company": "Old Dominion Freight Line",
        "Source_URL": "http://www.odfl.com/us/en/services/od-expedited-ltl/special-rollouts.html",
        "Content_Type": "Website Content",
        "Raw_Text": "OD arranges all necessary equipment, including lift gates and inside delivery, to match your shipment’s unique requirements.\nOD’s Special Rollout service ensures timely, damage-free deliveries to retailers, supported by one of the industry's leading on-time records and lowest claims rates. Whether you're opening a new store, distributing seasonal displays, or coordinating a multi-location event, with OD, your special project is our priority.\n| Improved Performance | On-time service to meet stringent delivery windows and seasonal shipping demands |\n| Industry Expertise | A preferred carrier with national retailers and extensive experience in managing complex rollouts |\n| Comprehensive Support | Dedicated Special Project Coordinator and detailed status reports for full visibility of shipments |\n| Dependable Partner | Industry-leading, damage-free service across our national network of OD Service Centers |\nYour extra diligence on these shipments coupled with a lead time change we implemented, were the main driving factors of this, and it is much appreciated!\nA leading U.S. medical device and nutrition company turned to OD to support a complex, nationwide product rollout. With strict compliance standards and narrow time-sensitive freight windows, they needed a logistics partner they could trust.\nOD created a tailored plan with enhanced tracking, proactive coordination, and real-time visibility. Within two months, the customer’s on-time delivery rate improved from 60% to 94% — cutting chargebacks and strengthening relationships with major retailers."
    },
    {
        "Ticker": "ODFL",
        "Company": "Old Dominion Freight Line",
        "Source_URL": "http://www.odfl.com/us/en/resources/freight-knowledge/odfl-blog/avoid-freight-class-surprises.html",
        "Content_Type": "Website Content",
        "Raw_Text": "We never want to let our customers down or have them end up with surprises on their freight bill. Our entire business is founded on service and trust.\nFor more than 80 years, the National Motor Freight Classification (NMFC) standard has determined the freight classes of commodities for motor carriers. The NMFC system standardizes thousands of commodities that go through LTL networks by establishing class types based on four characteristics — density, handling, stowability, and liability.\nThis system is important in ensuring more predictable billing for shippers and streamlining load planning for carriers, so everyone knows what to expect from the shipping process.\nHowever, in practice, it can be complex and take shippers time to learn how to properly navigate it. This confusion can have negative effects on both shippers and carriers.\nFreight classification mistakes and inaccurate Bills of Lading can create confusion, delays, and unexpected charges on final invoices. These unanticipated fees are reflected on the carrier’s invoice and then either absorbed by the shipper or passed on to their customers. If the carrier has to reclassify freight because it was incorrect on your BOL, it takes time, energy, and incurs clerical costs for both shipper and carrier.\nShippers that want predictability in their pricing should be working with a transportation partner that can help them navigate the system to avoid surprises.\nMisclassifying freight is a common error because determining NMFC classes is challenging. Classifications can shift if the commodity changes, and the NMFC’s published commodity codes are regularly updated.\n“On average, more than half of freight is misclassified,” says Erin Topper, Director of Pricing Services for Old Dominion. Topper worked at NMFTA for 18 years and led the Freight Classification Development Council (FCDC), before joining OD in 2023.\n“Since the NMFC classification must account for any commodity a company might tender to a carrier at any time, it used to have individualized items for a particular commodity or set of commodities. Over the last year and a half, the classification has been simplified and numerous items consolidated, but even those changes may be hard for individual shippers to track.”\nRecently, the NMFTA announced that in spring 2025, they will start a comprehensive overhaul of the NMFC system. These changes aim to make the class system easier to use and understand by transitioning most items to a standardized density scale.\n“At one point in time, the NMFC book itself was probably 900 to 1,000 pages. It was very difficult for shippers to really dig into the NMFC and figure out exactly what the classification of their product was,” Topper says. “There’s been a change in philosophy. And that change goes to more being density based.”\nMost shippers would prefer to focus on their day-to-day business operations rather than keeping up with the NMFC changes. That's why shippers need to partner with a carrier that will help ensure their freight classification is correct and help them avoid pricing adjustments on their final bills.\nOld Dominion recently worked with a customer who ships industrial air filters to resolve a freight classification issue. The customer had previously shipped their products under the NMFC air filter machine class. Then, they noticed that their class had suddenly changed to a designation for cabinets.\nThis increased their freight bill by hundreds of dollars. This customer contacted their OD Solutions Specialist, who worked with OD’s Weight and Inspections team to request a ruling from the NMFTA to understand the classification change.\nWithin days, the OD team explained to the customer that the class change happened because of the way the product was shipped. The air filter product included two parts, a cabinet and an air filter. The shipper started getting increased costs because the cabinet and air filter were being shipped separately. So, the rate changed simply because the product didn't have the filter attached.\nBased on their work with the NMFTA, OD was able to come back to the customer with the correct NMFC item number, an explanation in the change, and a solution that could help the customer reduce their shipping costs moving forward.\nWe have found that the most effective approach to navigating the NMFC system is by providing one-on-one consultation to ensure our customers know how their shipment is classified and how to properly complete a BOL.\n“We never want to let our customers down or have them end up with surprises on their freight bill,” says Todd Polen, Vice President of Pricing Services at Old Dominion. “Our entire business is founded on service and trust.”\n“Our customers want to know their freight is protected and they can rely on their shipping costs to be predictable. People want their invoices to match the rates they were quoted. That’s why we dedicate many people within the company to understanding the NMFC and helping our customers classify their freight correctly up front,” Polen said.\nAs an OD customer, you will have a local Solutions Specialist to assist with all of your account needs.\nKey areas of support include:\nIdentifying the correct NMFC code and freight class for your shipment(s)\nNotifying you of industry changes and updates that could affect your business\nProviding an accurate freight estimate to avoid invoice discrepancies\nConsulting on OD’s array of shipping services to help you choose the best solution\nTroubleshooting any potential issues and future problem resolution\nWhat matters most is that shippers know how their freight is classified, they are given an accurate estimate, and there are no surprises on their final bill. When in doubt, get in touch with your carrier and let them know about any changes to the weight, packaging, or commodity of your freight. No matter what you want to ship, OD is here to make it predictable while helping you deliver your customer's promises.\nUnderstanding freight class is a critical part of the shipping process. If freight is not properly classified, the most accurate rates may not be applied, and this can lead to an unwelcome surprise on the final bill.\nIn this episode, hear from Old Dominion’s Director of Pricing Services, Erin Topper. Erin previously spent 18 years at the NMFTA, where she was responsible for managing the classification development process."
    },
    {
        "Ticker": "ODFL",
        "Company": "Old Dominion Freight Line",
        "Source_URL": "http://www.odfl.com/us/en/resources/freight-knowledge/odfl-blog/annual-capital-expenditures-investments.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Old Dominion Freight Line (OD) is set to invest $575 million in its less-than-truckload (LTL) network in 2025, bolstering capacity to continue delivering the exceptional service its customers expect. This expansion reinforces OD’s commitment to maintaining its position as the #1 National LTL Carrier for Quality and position its network to grow with customers in the years ahead.\nSince 2015, OD has allocated more than $5 billion in capital expenditures, including new service centers and service center expansions, fleet upgrades with new tractors, trailers, yard switchers, and forklifts, and advanced technology systems. These carefully planned investments, combined with OD’s dedication to its employees—the OD Family—lay a strong foundation for consistently providing premium service to LTL shippers.\nHere’s a closer look at the planned investments:\nOD will allocate $300 million toward land acquisition, new service centers, and facility upgrades. With an existing network of 261 service centers across the continental U.S., OD aims to enhance its infrastructure to improve shipping lanes and shorten transit times. For LTL carriers, expanded physical space is essential to efficiently handle business growth while maintaining outstanding service in critical markets.\nIn 2024, OD opened four new service centers and expanded three others, paving the way for another active year in 2025. Since 2015, the company has invested approximately $2.4 billion in its service center expansion program, adding 39 new locations to its network.\nOD plans to invest $225 million in new tractors and trailers. Maintaining a modern, well-equipped fleet allows OD to optimize fuel efficiency and minimize maintenance downtime to ensure efficient and on-time deliveries.\nThese ongoing fleet enhancements are part of OD’s tractor replacement program, ensuring its fleet remains one of the youngest and most efficient in the industry.\nOD will invest $50 million in information technology and other key assets to strengthen operational efficiency and drive innovation. These investments will enable customer API integrations, new feature enhancements to ODFL.com, and freight tracking tools to improve transparency from pickup to delivery.\nThese technological upgrades have already improved critical aspects of OD’s LTL experience, such as billing accuracy, appointment scheduling, compliance, and freight visibility—all while providing shippers with unparalleled flexibility in how they do business."
    },
    {
        "Ticker": "ODFL",
        "Company": "Old Dominion Freight Line",
        "Source_URL": "http://www.odfl.com/us/en/resources/freight-knowledge/odfl-blog/comparing-od-expedited-ltl-services.html",
        "Content_Type": "Website Content",
        "Raw_Text": "When choosing the right LTL expedited freight service, shippers should consider several factors, including the transit time needed, special delivery requirements, and the benefits for both the shipper and consignee. In this article, we compare three types of OD's Expedited LTL Freight Services – Must Arrive By Date (MABD), Expedited On Demand, and OD Guaranteed Services – to help you make an informed decision specific to your needs.\nOD’s MABD Service is for shipments typically delivering to a retail distribution center or consignee that issues either a Must Arrive By Date (MABD), On Time In Full (OTIF) standards, or a Required Arrival Date (RAD). OD’s MABD Service offers 24/7 monitoring and dynamic in-transit upgrades to ensure your shipment meets stringent delivery requirements.\nEvery MABD shipment at OD is monitored by an appointed MABD Shipment Coordinator who proactively monitors the shipments to prevent issues. All MABD shipments are flagged in our system to show special delivery dates, and the destination OD Service Center receives daily status emails regarding delivery timing while the shipment is in transit. Customers also receive daily updates, preventative issue notifications, and KPI reports to help protect retailer relationships.\nOD’s strong relationship with major retailers, combined with our premium service and national network of over 260 Service Centers gives our MABD customers an advantage over their competition.\nOD’s Expedited On Demand Service is ideal for urgent or high-priority shipments that need faster-than-standard transit, a weekend delivery, or an appointment time outside normal business hours. Your shipment is guaranteed to be delivered within one hour of the pre-scheduled delivery time, or the freight charges will revert to the standard LTL rate.\nEvery Expedited On Demand shipment at OD is scheduled with an Expedited Coordinator and notated at the time of pickup. The freight is physically wrapped in our OD Expedited red tape for visibility to ensure it is handled with high priority and is monitored as it moves through the OD network.\nWith nationwide coverage and competitive standard transit times, OD’s service will help you keep your promises to your customers. Our Expedited On Demand service will go even further to ensure that the most demanding shipment schedules are met with customer satisfaction.\nOD’s Guaranteed Services or Guaranteed by Noon Service ensures your shipment is delivered on the day of standard transit by 5 PM or 12 PM or the freight charges revert to the standard LTL rate. Every Guaranteed shipment at OD is a simple upgrade that the shipper or driver can do at the time of pickup by notating the BOL and using a Guaranteed PRO label.\nThe freight is wrapped in our OD Expedited red tape for maximum visibility as it moves throughout our system. When loading the freight, our team knows to keep a careful watch for marked guaranteed freight and take measures to keep it moving, such as loading it on the back of the trailer so it’s unloaded first.\nWith industry-leading on-time delivery and low claims records, OD goes the extra mile to deliver the best customer experience. Our Guaranteed Services are an excellent option for added peace of mind at a minimal cost that your shipment will deliver as expected.\nFor logistics managers and freight decision-makers, selecting the right OD service comes down to your specific needs:\nChoose MABD if you have fixed delivery dates that are crucial for your business operations. This option helps maintain strong retail partnerships while minimizing the risk of costly penalties and chargebacks, ensuring that your deliveries align perfectly with your retail commitments.\nChoose Expedited On Demand if you require flexible, time-specific deliveries that can adapt to changing circumstances. This choice offers competitive rates and personalized service, making it ideal for businesses that value responsiveness and customer satisfaction.\nChoose OD Guaranteed Services if speed is of the essence for your shipments. This option provides the assurance that your delivery will arrive within a guaranteed time frame, helping you meet tight deadlines and deliver on your customer’s shipping promises.\nYou’ve made promises, and it’s our job to help you keep them. Let Old Dominion partner with you to develop the fastest, most efficient strategy to deliver your shipments on time and damage-free. Whether it’s a guaranteed delivery time, reduced transit days, or a retailer’s delivery window, OD Expedited has you covered. High-priority shipments shouldn’t be stressful for you, and at OD, our people do whatever it takes to make sure they’re not."
    },
    {
        "Ticker": "ODFL",
        "Company": "Old Dominion Freight Line",
        "Source_URL": "http://www.odfl.com/us/en/about/ODFL-news/ODFL-press-releases/od-wins-16th-mastio-award.html",
        "Content_Type": "Website Content",
        "Raw_Text": "THOMASVILLE, N.C. (October 7, 2025) – Old Dominion Freight Line, Inc. (OD), a leading less-than-truckload (LTL) freight shipping company, has been selected as the #1 National LTL Carrier for Quality by Mastio & Company for the 16th consecutive year. Through this comprehensive annual survey, shipping experts selected OD as the top carrier for quality based on performance. This year’s results again puts OD at the top for quality where it has remained since 2010.\nMastio & Company conducts an annual independent survey of logistics professionals to identify the top LTL carriers by measuring 28 service attributes that are the most important to quality performance. The 2025 study polled 1,630 logistics professionals, gathering comprehensive feedback on performance attributes vital to the success of shipping operations. This extensive data collection provides a well-rounded view of industry standards and shipper expectations.\nWhen surveyed, shippers and logistics professionals chose OD as the top national LTL carrier. They recognized OD as #1 in an impressive 23 of the 28 evaluated categories, including “ease of doing business with the carrier,” “carrier is trustworthy,” “customer service personnel respond to my needs in a timely manner,” and “consistent transit times.”\n“The annual Mastio Quality Award recipient is selected based on research conducted directly from LTL shippers,” said Kevin Huntsman, President of Mastio & Company. “Based on the evaluation of their performance across 28 key attributes, we are pleased to recognize that Old Dominion has once again been chosen as the #1 national LTL carrier for Quality in the 2025 Mastio Customer Preference and Carrier Performance Study.”\n“This award is a direct reflection of the dedication and hard work of our OD family of employees. Our commitment to delivering an exceptional customer experience is the focus of everything we do,” said Marty Freeman, President and CEO of OD. “This award means so much to us because it’s chosen by our customers. We're proud to be seen as a trusted shipping partner that ensures their promises are delivered.”\nThe Mastio Quality Award is a testament of why shippers continue to choose OD, because of the company’s performance and commitment to excellence.\nBut this recognition isn’t just a moment of celebration for OD. The data from the Mastio survey is used to identify opportunities for continuous improvement in areas such as investing in new digital tools that allow for improved data management, capacity planning and service center upgrades.\nFor more information, visit ODFL.com/Mastio."
    },
    {
        "Ticker": "ODFL",
        "Company": "Old Dominion Freight Line",
        "Source_URL": "http://www.odfl.com/us/en/about/ODFL-news/ODFL-press-releases/2026-General-Rate-Increase.html",
        "Content_Type": "Website Content",
        "Raw_Text": "THOMASVILLE, N.C. (October 20, 2025) – Old Dominion Freight Line, Inc. (Nasdaq: ODFL) today announced a general rate increase (GRI) of 4.9 percent applicable to rates established under the existing ODFL 559, 670, and 550 tariffs effective November 3, 2025.\nTodd A. Polen, Old Dominion’s Vice President – Pricing Services, commented, \"At Old Dominion, we are committed to delivering our premium value proposition of on-time, claims-free service at a fair price. To satisfy our customers’ expectations and deliver on the promises we have made, we must continue to enhance our high-quality service network and systems. This GRI will affect our class tariffs and is intended to partially offset the rising costs of real estate, new equipment, technology investments, and competitive employee wage and benefit packages. Although the GRI will impact each customer differently based on specific shipment lanes and distance traveled, it is consistent with our long-term yield management philosophy and the overall impact of the increase is anticipated to be approximately 4.9 percent. The GRI also provides for a nominal increase in minimum charges with respect to intrastate, interstate and cross border lanes.”\nAbout Old Dominion Freight Line, Inc.\nOld Dominion Freight Line, Inc. is one of the largest North American LTL motor carriers and provides regional, inter-regional and national LTL services through a single integrated, union-free organization. Our service offerings, which include expedited transportation, are provided through an expansive network of service centers located throughout the continental United States. The Company also maintains strategic alliances with other carriers to provide LTL services throughout North America. In addition to its core LTL services, the Company offers a range of value-added services including container drayage, truckload brokerage, and supply chain consulting."
    },
    {
        "Ticker": "ODFL",
        "Company": "Old Dominion Freight Line",
        "Source_URL": "http://www.odfl.com/us/en/about/ODFL-news/ODFL-press-releases/2025-general-rate-increase.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Old Dominion Freight Line, Inc. (Nasdaq: ODFL) today announced a general rate increase (GRI) of 4.9 percent applicable to rates established under the existing ODFL 559, 670, and 550 tariffs, effective December 2, 2024.\nTodd A. Polen, Old Dominion Freight Line’s Vice President – Pricing Services, commented, “The general rate increase is based on the Company’s economic forecast and expectations for the operating environment. We must continue enhancing our high-quality service network and systems to meet and exceed our customers’ expectations and deliver on our promises. At Old Dominion, we are committed to delivering our premium value proposition of on-time, claims-free service at a fair price. This GRI will affect our class tariffs and is intended to partially offset the rising costs of real estate, new equipment, technology investments, and competitive employee wage and benefit packages. Although the GRI will impact each customer differently based on specific shipment lanes and distance traveled, it is consistent with our long-term yield management philosophy and the overall impact of the increase is anticipated to be approximately 4.9 percent. The GRI also provides for a nominal increase in minimum charges with respect to intrastate, interstate and cross border lanes.”\nAbout Old Dominion Freight Line, Inc.\nOld Dominion Freight Line, Inc. is a leading, less-than-truckload (“LTL”), union-free motor carrier providing regional, inter-regional and national LTL services through a single integrated organization. Our service offerings, which include expedited transportation, are provided through an expansive network of service centers located throughout the continental United States. Through strategic alliances, the Company also provides LTL services throughout North America. In addition to its core LTL services, the Company offers a range of value-added services including container drayage, truckload brokerage and supply chain consulting."
    },
    {
        "Ticker": "ODFL",
        "Company": "Old Dominion Freight Line",
        "Source_URL": "http://www.odfl.com/us/en/about/ODFL-news/ODFL-press-releases/folds-of-honor-partnership.html",
        "Content_Type": "Website Content",
        "Raw_Text": "OD Supports Military and First Responder Families Through Collaboration with Folds of Honor Scholarship Program\nOld Dominion Freight Line (OD) is proud to announce its partnership with Folds of Honor, a non-profit organization dedicated to providing educational scholarships to families of fallen or disabled US service members and first responders. OD’s corporate donation will be directed to providing scholarship funding for students pursuing education in supply chain management, operations, transportation, or obtaining their commercial driver’s license (CDL).\nIn aligning with Folds of Honor, OD aims to enhance its commitment to supporting the nation’s heroes. This partnership will amplify the mission and increase scholarship funding for the families of military and first responder heroes across America.\n“We're proud to partner with Folds of Honor and help with their meaningful mission,” said Marty Freeman, President and CEO of Old Dominion Freight Line. “We really appreciate the sacrifices made by service members and first responders. This partnership shows our commitment to supporting their families and boosting their educational opportunities.”\nBy investing in education for students pursuing careers in supply chain management and transportation or obtaining their commercial driver’s license, OD hopes to inspire future leaders and support the continued growth of these vital industries.\n“Folds of Honor is proud to team up with OD,” said Folds of Honor founder and CEO, Lt Col Dan Rooney. “We believe the partnership will be a force multiplier to the mission and awareness of Folds of Honor and increase scholarship funding to the families of American military and first responder heroes.”\nFounded in 2007 by Lt Col Dan Rooney, a decorated F-16 Viper Fighter Pilot, Folds of Honor has awarded about 62,000 scholarships totaling nearly $290 million. In 2022, the organization expanded its mission to include first responders such as police, fire, EMTs, and paramedics.\nFor more information or to donate in support of a Folds of Honor scholarship, visit foldsofhonor.org.\nAbout Folds of Honor\nFolds of Honor is a 501(c) (3) nonprofit organization that provides educational scholarships to the spouses and children of US military service members and first responders who have fallen or been disabled while serving our country and communities. Our educational scholarships support private school tuition or tutoring in grades K-12, tuition for college, technical or trade school and post-graduate work, including a master’s degree, doctorate, or professional program. Funds for a second bachelor’s degree or trade/technical program certification are also available. Since its inception in 2007, Folds of Honor has awarded nearly 62,000 scholarships totaling about $290 million in all 50 states. Among the students served, 45 percent are minorities. A total of 91 percent of every dollar raised directly funds scholarships. It is rated a four-star charity by Charity Navigator and Platinum on Candid. It was founded by Lt Col Dan Rooney, the only-ever F-16 fighter pilot (with three combat tours in Iraq) and PGA Professional. He is currently stationed at Headquarters Air Force Recruiting Service at Joint Base San Antonio-Randolph, Texas. For more information or to donate in support of a Folds of Honor scholarship visit foldsofhonor.org.\nAbout Old Dominion Freight Line, Inc.\nOld Dominion Freight Line, Inc. is a leading, less-than-truckload (“LTL”), union-free motor carrier providing regional, inter-regional and national LTL services through a single integrated organization. Our service offerings, which include expedited transportation, are provided through an expansive network of service centers located throughout the continental United States. Through strategic alliances, the Company also provides LTL services throughout North America. In addition to its core LTL services, the Company offers a range of value-added services including container drayage, truckload brokerage and supply chain consulting."
    },
    {
        "Ticker": "ODFL",
        "Company": "Old Dominion Freight Line",
        "Source_URL": "http://www.odfl.com/us/en/about/ODFL-news/ODFL-press-releases/od-wins-15th-mastio-award.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Comprehensive industry study recognizes OD’s premium service for an unprecedented fifteenth consecutive year.\nOld Dominion Freight Line, Inc. (OD), a leading less-than-truckload (LTL) motor carrier, has been named the #1 National LTL Carrier for Quality by Mastio & Company for an unprecedented 15th consecutive year. The comprehensive industry study of LTL carriers ranked OD as the top carrier for quality according to logistics professionals surveyed on carrier performance for 15 straight years, dating back to 2010.\nMastio & Company conducts an annual independent survey of logistics professionals to identify the top national LTL carrier by measuring 28 service attributes important to customer satisfaction. Shippers and logistics professionals consistently responded with OD as their top carrier, ranking OD #1 in an impressive 23 of the 28 evaluated categories, including “carrier is trustworthy,” “shipments delivered when promised,” and “ease of doing business with the carrier.” The ability to consistently meet these high standards sets OD apart in a competitive market.\n“Winning the Mastio Quality Award for the 15th consecutive year is the result of the dedication and hard work of the entire OD Family of employees. Looking back on achieving this honor for 15 years straight, we’re most proud of our consistent commitment to quality,” said Marty Freeman, President and CEO of OD. “We are determined to provide our customers with the highest standards of service and exceed their expectations time after time.”\nThe 2024 study engaged over 1,600 logistics professionals, gathering comprehensive feedback on performance attributes vital to the success of shipping operations. This extensive data collection provides a well-rounded view of industry standards and shipper expectations.\nThe Mastio Quality Award is a testament to customers’ trust and satisfaction in OD’s services, further solidifying its reputation as a leader in the freight industry.\n“The evaluation of carrier performance is derived from feedback collected from LTL shippers on a comprehensive array of 28 attributes,” said Kevin Huntsman, President of Mastio & Company. “These performance criteria calculate the Mastio Quality Award recipient. For the 15th consecutive year, we are pleased to recognize Old Dominion as the #1 national LTL carrier based on their performance in the 2024 Mastio Customer Preference and Carrier Performance Study.”\nAbout Old Dominion Freight Line, Inc.\nOld Dominion Freight Line, Inc. is a leading, less-than-truckload (“LTL”), union-free motor carrier providing regional, inter-regional and national LTL services through a single integrated organization. Our service offerings, which include expedited transportation, are provided through an expansive network of service centers located throughout the continental United States. Through strategic alliances, the Company also provides LTL services throughout North America. In addition to its core LTL services, the Company offers a range of value-added services including container drayage, truckload brokerage and supply chain consulting.\nAbout Mastio & Company\nMASTIO, celebrating 34 years in business, specializes in providing an independent third-party perspective for clients who want to truly assess their corporate image, discover their perceived level of customer value, find new customers, understand the strengths and weaknesses of the competition, and supplement their market intelligence. Our strength is in helping clients re-think established norms, eliminate internal biases, collect and analyze data and transform market research into actions that achieve superior business results."
    },
    {
        "Ticker": "ODFL",
        "Company": "Old Dominion Freight Line",
        "Source_URL": "http://www.odfl.com/us/en/about/ODFL-news/media-resources.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Please send the completed agreement to marketing@odfl.com, as well as which logo or image shown below that you would like to use, including the specific file type required. A representative will email you the logo/image upon receipt of the completed usage agreement.\nPlease fill out the logo usage agreement provided below."
    },
    {
        "Ticker": "ODFL",
        "Company": "Old Dominion Freight Line",
        "Source_URL": "http://www.odfl.com/us/en/about/technology/benefits-of-an-account.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Registering for an ODFL.com account is simple and only takes a few minutes. Depending on your account status, you may be provided access immediately. If needed, an ODFL customer service agent will contact you to confirm your account details before setting up your account.\nFor more information, contact your local service center or reach out to the Customer Service team at 1-800-235-5569. Customer Service representatives are available to take your call from Monday-Friday, 7 a.m. – 8 p.m. ET."
    },
    {
        "Ticker": "ODFL",
        "Company": "Old Dominion Freight Line",
        "Source_URL": "http://www.odfl.com/us/en/about/technology/electronic-data-interchange.html",
        "Content_Type": "Website Content",
        "Raw_Text": "At Old Dominion Freight Line, our 90 years in the freight shipping business has taught us to leverage the technologies needed to manage shipments more efficiently every day. We utilize EDI-Electonic Data Interchange as a means to facilitate the electronic exchange of business data through our systems. Using a standardized format, EDI provides a method of transmitting business data from one computer to another, without the need to re-key data. The use of this electronic data transfer link results in a more effective business transaction process. With our B2B software, Cleo Clarify, we can translate to and from the following data formats: EDI, XML, Spreadsheet, Flatfile, Database Table, & SAP iDocs. E-mail our EDI team for more information.\nOld Dominion's EDI platform utilizes the Cleo Clarify Business Integrator software tool set for both secure AS2 communications and document translation. OD is capable of communicating with our Business Partners using several communication protocols: FTP, sFTP (secure FTP), AS2 or any of the following Value Added Network (VAN) services.\nWith interconnects to most other VAN services."
    }
]