[
    {
        "Ticker": "PYPL",
        "Company": "PayPal",
        "Source_URL": "https://www.paypal.com/",
        "Content_Type": "Website Content",
        "Raw_Text": "Geld senden, wann und wie du willst.5\nJetzt mit Freude einkaufen.\nIn 30 Tagen bezahlen.\nAutomatisch und kostenlos später zahlen mit Bezahlung nach 30 Tagen.1\nWie und wann du\nzahlst? Flexibel.\nSofort oder später, online oder offline: Mit den flexiblen Zahlungsoptionen entscheidest du, wie und wann du zahlst – jetzt auch im Laden.\nBeim Online-Kauf nach 30 Tagen bezahlen\nMit PayPal kannst du 30 Tage nach dem Kauf bezahlen – und deine Zahlung gegen Gebühr sogar um weitere 30 Tage oder alternativ um 54 Tage verschieben.1\nPayPal Ratenzahlung\nBei Online-Käufen hast du noch mehr Optionen: Mit PayPal Ratenzahlung kannst du bequem in 3, 6, 12 oder 24 monatlichen Raten zahlen. Wir buchen die Raten automatisch von deiner Zahlungsquelle ab.2\nPayPal Ratenzahlung To Go\nWähle PayPal Ratenzahlung To Go für mehr Flexibilität bei Käufen an der Kasse. Nach der Bewilligung zahlst du für deinen Einkauf kontaktlos mit dem Handy. PayPal bucht später die von dir gewählten Raten automatisch ab.3\nBequem\nshoppen.\nOnline und\nim Laden.\nWeltweit shoppen, sicher und entspannt, wie du es kennst und liebst. Jetzt auch im Laden, kontaktlos mit dem Handy. Überall, wo es ein Kartenlesegerät gibt.4\nSicher ist sicher\nOb online oder an der Kasse: Deine Zahlungen sind optimal geschützt und verschlüsselt.\nSchnell und sicher Geld senden – an fast alle, fast überall5\nAlles\nin der\nPayPal-\nApp.\nGeld senden und Zahlungen verwalten – einfach, sicher und alles an einem Ort. Hol dir die App auf dein Handy."
    },
    {
        "Ticker": "PYPL",
        "Company": "PayPal",
        "Source_URL": "https://www.paypal.com/de/webapps/mpp/about",
        "Content_Type": "Website Content",
        "Raw_Text": "PayPal steht seit mehr als 25 Jahren an der Spitze der Revolution des digitalen Handels. Durch das Schaffen innovativer Erlebnisse, die das Bewegen von Geld, Verkaufen und Shopping einfach, persönlich und sicher machen, ermöglicht PayPal Verbraucher:innen und Unternehmen in rund 200 Märkten, erfolgreich an der Weltwirtschaft teilzunehmen.\nWeitere Informationen finden Sie unter https://about.pypl.com/ und https://investor.pypl.com/.\nPayPal (Europe) S.à r.l. et Cie, S.C.A. ist ein Kreditinstitut (oder eine Bank), das von der luxemburgischen Aufsichtskommission des Finanzsektors zugelassen und beaufsichtigt wird. Sitz der Aufsichtskommission: 283, route d’Arlon, L-1150 Luxembourg.\nWenn du uns kontaktieren möchtest, kannst du dich in dein PayPal-Konto einloggen, um uns eine Nachricht zu senden. Diese wird direkt an ein geeignetes Teammitglied gesendet, das dir antwortet.\nLogin nicht möglich? Wenn Sie sich nicht in Ihr PayPal-Konto einloggen können, können Sie sich telefonisch an uns wenden, um Unterstützung zu erhalten. Aus Gründen der Kontosicherheit können wir leider keinen Login-Support per E-Mail anbieten.\nWenn Sie kontospezifische Fragen haben, besuchen Sie bitte die Seite „Kontakt“, um uns eine Nachricht zu senden, oder rufen Sie uns an, damit wir Ihre Identität bestätigen können."
    }
]