[
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/",
        "Content_Type": "Website Content",
        "Raw_Text": "Press releases for investors and media\nWe aim to push the bounds of science to make\nLIFE-CHANGING MEDICINES\nWe're guided by our philosophy of\ndoing well by doing good\nWe’re dedicated to responsible business practices, integrating the highest standards of integrity into every facet of our operations. Our responsibility strategy addresses the issues that matter most to our business and our stakeholders — because we understand that our actions have a profound impact on the world around us.\nJoin the brightest, most passionate innovators in science. Find your next opportunity by applying for jobs and internships at Regeneron today.\nOur journey of discovery continues as we strive to transform the lives of people with serious diseases. Discover more about our clinical trials or locate a relevant trial near you."
    },
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/about/leadership",
        "Content_Type": "Website Content",
        "Raw_Text": "Dr. Bassler has been a director of the company since 2016. She has been the chair of the Department of Molecular Biology and the Squibb Professor in Molecular Biology at Princeton University since 2003 and is a Howard Hughes Medical Institute investigator. Dr. Bassler previously served as the president of the American Society for Microbiology, as well as on the boards for the American Association for the Advancement of Science, the National Science Foundation and the American Academy of Microbiology. She previously served as a director of Kaleido Biosciences, Inc. She is a member of the National Academy of Sciences, the National Academy of Medicine, the American Academy of Arts and Sciences, the Royal Society of London and the American Philosophical Society. She has received many scientific honors, including a MacArthur Foundation Fellowship, the Lounsbery Award, the Shaw Prize for Life Science and Medicine, the Gruber Prize in Genetics and the Wolf Prize in Chemistry and the Canada Gairdner International Award. Dr. Bassler currently serves on the board of directors of Cidara Therapeutics, Inc. and Royalty Pharma plc.\nMeet our Leadership Team\nOur leadership team possesses deep and diverse industry knowledge, a passion for science and a shared commitment to help transform lives. Made up of our founding scientists, industry experts, Nobel Laureates and members of the National Academy of Sciences, we consistently push the boundaries of scientific excellence and discovery.\nLeonard S. Schleifer, MD, PhD\nBoard co-Chair, President and Chief Executive Officer\nGeorge D. Yancopoulos, MD, PhD\nBoard co-Chair, President and Chief Scientific Officer\nBonnie L. Bassler, PhD\nChair, Department of Molecular Biology, and Squibb Professor in Molecular Biology, Princeton University\nMichael S. Brown, MD\nDistinguished Chair in Biomedical Sciences, Regental Professor of Molecular Genetics and Internal Medicine, and Director, Erik Jonsson Center for Molecular Genetics, The University of Texas Southwestern Medical Center at Dallas\nDr. Brown has been a director of the company since 1991. He serves as the Distinguished Chair in Biomedical Sciences at the University of Texas (UT) Southwestern Medical Center, a position he has held since 1989. He is also a regental professor of molecular genetics and internal medicine and the director of the Erik Jonsson Center for Molecular Genetics at the UT Southwestern Medical Center at Dallas, positions he has held since 1985. Drs. Brown and Goldstein jointly received the Nobel Prize for Physiology or Medicine in 1985 and the U.S. National Medal of Science in 1988. Dr. Brown is a member of the National Academy of Sciences, the National Academy of Medicine and the Royal Society of London.\nTony Coles, MD\nChair and former CEO, Cerevel\nDr. Coles has been a director of the company since 2017. He served as the president and chief executive officer of Cerevel Therapeutics Holdings, Inc., the parent entity of Cerevel Therapeutics, Inc. from 2019 to 2023, and has served as chair of Cerevel Therapeutics Holdings, Inc. since 2018 and continues in this role. He has also served as chair and chief executive officer of TRATE Enterprises LLC, a privately held company, since 2013. He is the former chief executive officer of Yumanity Therapeutics, Inc. Dr. Coles is also the former president, chief executive officer and chair of the board of Onyx Pharmaceuticals, Inc., and the former president, chief executive officer, and member of the board of directors of NPS Pharmaceuticals, Inc. He previously held various leadership positions in the biopharmaceutical and pharmaceutical industries, including at Merck & Co., Inc., Bristol-Myers Squibb Company and Vertex Pharmaceuticals Incorporated. In addition, he was a former director of Laboratory Corporation of America Holdings, Campus Crest Communities, Inc., CRISPR Therapeutics AG and McKesson Corporation.\nJoseph L. Goldstein, MD\nProfessor of Molecular Genetics and Internal Medicine and Chair, Department of Molecular Genetics, The University of Texas Southwestern Center at Dallas\nDr. Goldstein has been a director of the company since 1991. He has been a professor of molecular genetics and internal medicine and the chair of the Department of Molecular Genetics at the University of Texas Southwestern Medical Center at Dallas since 1977. Dr. Goldstein is a member of the National Academy of Sciences, the National Academy of Medicine and the Royal Society of London. He also is a member of the boards of trustees of The Rockefeller University and the Howard Hughes Medical Institute. Drs. Goldstein and Brown jointly received the Nobel Prize for Physiology or Medicine in 1985 and the U.S. National Medal of Science in 1988.\nKathryn Guarini, PhD\nFormer Chief Information Officer, IBM\nDr. Guarini has been a director of the company since 2023, joining the company after serving as Chief Information Officer of IBM from 2021 to 2023 with specific focus on information technology, data security and artificial intelligence. Prior to assuming her role as CIO, Dr. Guarini served in multiple executive leadership roles at IBM over more than 20 years, including Chief Operating Officer of IBM Research and Vice President of Product Management for IBM Systems. Dr. Guarini has been included on the Top 100 Leader list (#2 in 2022) from Technology Magazine and Forbes’ CIO Next list (2022), and she is a member of the United States Patent & Trademark Office’s National Council for Expanding American Innovation. She earned her Bachelor of Science and Ph.D. in Applied Physics from Yale University and Stanford University, respectively.\nChristine A. Poon\nFormer Executive-in-Residence in the Department of Management and Human Resources, Max M. Fisher College of Business, The Ohio State University\nChristine A. Poon is lead independent director. She has served on the board of the company since 2010. She is a former executive-in-residence in the Department of Management and Human Resources and former dean and John W. Berry, Sr. Chair in Business at the Max M. Fisher College of Business at The Ohio State University. Prior to joining Fisher, Ms. Poon was vice chair, worldwide chair of pharmaceuticals, member of the executive committee and director at Johnson & Johnson. Prior to joining Johnson & Johnson, Ms. Poon held senior leadership positions at Bristol-Myers Squibb Company, including president of international medicines and president of medical devices. She serves on the boards of directors of Prudential Financial, Inc. and the Sherwin-Williams Company. She is a former member of the supervisory board of Royal Philips Electronics and the board of directors of Decibel Therapeutics, Inc.\nArthur F. Ryan\nFormer Chief Executive Officer and Chair of the Board, Prudential Financial, Inc.\nMr. Ryan has been a director of the company since 2003. He is the former chief executive officer and chair of the board of Prudential Financial, Inc. and served as president and chief operating officer of Chase Manhattan Bank from 1990 to 1994. Mr. Ryan managed Chase’s worldwide retail bank between 1984 and 1990. From 2008 until 2013, Mr. Ryan served as a non-executive director of the Royal Bank of Scotland Group plc. From 2009 to 2019, Mr. Ryan served as a director of Citizens Financial Group, Inc.\nDavid P. Schenkein, MD\nGeneral Partner and co-Lead, Life Sciences Team at GV\nDr. Schenkein has been a director of the company since 2023 and is a General Partner and Co-lead of the Life Sciences team at GV (Google Ventures). Prior to joining GV in 2019, Dr. Schenkein served as Chief Executive Officer for Agios Pharmaceuticals for ten years. He previously served in clinical leadership roles at major biotechnology companies including Senior Vice President, Clinical Hematology/Oncology at Genentech and Senior Vice President, Clinical Research at Millennium Pharmaceuticals. Since 2009, Dr. Schenkein has also served as Adjunct Clinical Professor of Medicine, Hematology/Oncology at Tufts Medical Center. He is currently a Board Member of Prime Medicine, Denali Therapeutics and Agios. Dr. Schenkein earned his M.D. at the State University of New York Upstate Medical School in Syracuse and completed his medical training at the Tufts University School of Medicine.\nGeorge L. Sing\nChief Executive Officer, GanD, Inc.; Chair, Grace Science, LLC\nMr. Sing has been a director of the company since 1988. He has served as chief executive officer of GanD, Inc. since 2016, and chair of Grace Science, LLC since 2017. Mr. Sing has extensive venture capital and leadership experience in the biotechnology sector and high technology.\nCraig B. Thompson, MD\nFormer President and Chief Executive Officer, Memorial Sloan Kettering Cancer Center\nDr. Thompson has been a director of the company since 2022. He served as president and chief executive officer of Memorial Sloan Kettering Cancer Center (MSK) and continues to oversee the Craig Thompson Lab, which studies cellular metabolism and its role in disease. Prior to his time at MSK, Dr. Thompson made significant contributions to cancer research as a physician and clinical investigator. He co-founded Agios Pharmaceuticals and also serves as a director of Charles River Laboratories International, Inc. He previously served as a director of Merck & Co., Inc. Dr. Thompson is a member of the National Academy of Sciences, the National Academy of Medicine, the American Academy of Arts and Sciences, the American Society for Clinical Investigation and the Association of American Physicians.\nHuda Y. Zoghbi, MD\nProfessor, Departments of Pediatrics, Molecular and Human Genetics, and Neurology and Neuroscience, Baylor College; Director, Jan and Dan Duncan Neurological Research Institute, Texas Children's Hospital\nDr. Zoghbi has been a director of the company since 2016. Since 1994, she has been a professor in the Departments of Pediatrics, Molecular and Human Genetics, and Neurology and Neuroscience at Baylor College of Medicine. Dr. Zoghbi is the director of the Jan and Dan Duncan Neurological Research Institute at Texas Children’s Hospital, and is a Howard Hughes Medical Institute investigator. She has been awarded numerous recognitions for her work, including the Breakthrough Prize in Life Sciences, the Gairdner Award, the Brain Prize, and the Kavli Prize in Neuroscience. Dr. Zoghbi is a member of the National Academy of Medicine, National Academy of Sciences, the Institute of Medicine, the American Academy of Arts and Sciences, and the National Academy of Inventors.\nZoran Berkovic\nSenior Vice President, Financial Planning and Analysis\nZoran Berkovic joined Regeneron in 2017 and is senior vice president, financial planning & analysis, where he has grown the scope of the group and fostered a culture of accountability. He previously served as the regional CFO for Japan, Australia and New Zealand at Mylan, as well as in other roles, and he worked at Cephalon in financial roles. Mr. Berkovic earned his B.S. and BBA in finance and economics abroad and his MBA at Temple University.\nMaya Bermingham\nSenior Vice President, Public Policy and Government Affairs\nMaya Bermingham joined Regeneron in 2015 and serves as senior vice president, public policy and government affairs. Ms. Bermingham and her Washington, DC-based team play a critical role in helping Regeneron shape and maintain its industry-leading reputation among governmental stakeholders. In 2020, Ms. Bermingham stepped forward to also serve as the company’s interim head of diversity, equity and inclusion (DEI). Prior to joining Regeneron, Ms. Bermingham held roles of increasing responsibility at PhRMA over a 12-year tenure, following earlier positions at legal firms, and she worked for U.S. Senator Moynihan and the Senate Finance Committee. She received her B.A. from Harvard University and her J.D. from New York University.\nLeonard Brooks\nSenior Vice President, Treasurer\nLeonard (Len) Brooks joined Regeneron in 2013 and serves as senior vice president, treasurer. Mr. Brooks leads a team responsible for optimizing liquidity and use of capital resources, safeguarding Regeneron’s cash and investment portfolio, handling corporate risk management and maintaining strong relationships with financial institutions, insurance providers and rating agencies. Prior to joining Regeneron, Mr. Brooks worked in public accounting at Deloitte before moving to treasury, where he held various positions of increasing responsibility at both mid- and large-sized companies, including Wyeth, Medco Health Solutions, Reliant Pharmaceuticals, The Children’s Place and Hayward Industries. Mr. Brooks received both a B.S. and an MBA from Rutgers University.\nJohn Calabro\nSenior Vice President, Internal Audit\nJohn Calabro joined Regeneron in 2005 and serves as senior vice president, internal audit. Mr. Calabro leads a team responsible for providing independent and objective assurance and consulting by bringing a systematic, disciplined approach to evaluating and improving the effectiveness of Regeneron’s risk management, control and governance processes. Prior to joining Regeneron, Mr. Calabro spent 18 years at UST, Inc., where he held positions of increasing responsibility within internal audit, ultimately serving as director. He also previously served on the internal audit teams at Phillip Morris, General Foods and Bowater, Inc. Mr. Calabro received a B.S. from the University of Connecticut.\nChristina Chan\nSenior Vice President, Corporate Affairs\nChristina Chan joined Regeneron in 2021 and serves as senior vice president, corporate affairs, leading a multidisciplinary team responsible for communication, corporate brand, patient advocacy, corporate responsibility, social impact and ESG reporting. Prior to joining Regeneron, Christina held communication and public affairs leadership roles within the pharmaceutical and enterprise divisions of Johnson & Johnson. In her last role at Johnson & Johnson, she served as Vice President of Global Finance Communications and previously led executive communications for the Chairman and CEO. Prior to Johnson & Johnson, Christina led financial and corporate communications at Biogen and held pharmaceutical sales and communications roles at Boehringer Ingelheim. Christina holds an MBA in finance and strategy from the Stern School of Business at New York University and a B.A. in international relations and Chinese from Tufts University.\nLarry Coury, PhD\nSenior Vice President, Associate General Counsel\nDr. Larry Coury joined Regeneron in 2014 and serves as senior vice president, associate general counsel. In his role, Dr. Coury adeptly navigates the complex intersection of law, science, patents and business. His strategic expertise, particularly in biosimilar litigation, has significantly bolstered Regeneron's mission through effective litigation strategies and global intellectual property protection. He and his group also oversee general litigation matters and government investigations. Prior to joining Regeneron, Dr. Coury held roles of increasing responsibility at various legal firms and was a postdoctoral researcher at the University of Pittsburgh Medical Center. He received his B.S. from the Massachusetts Institute of Technology, his Ph.D. from Harvard University, and his J.D. from Fordham University School of Law.\nRyan Crowe\nSenior Vice President, Investor Relations & Strategic Analysis\nRyan Crowe joined Regeneron in 2022 and serves as senior vice president, investor relations and strategic analysis. In this role, he is primarily responsible for communicating Regeneron’s key value-creation opportunities to the investment community, while leading the strategic analysis team that is focused on informing and influencing Regeneron’s pipeline and commercial strategy. In 2023, under Mr. Crowe’s leadership, Regeneron was named among the top three investor relations teams in the biotech sector by Institutional Investor magazine. Prior to joining Regeneron, Mr. Crowe served as vice president of investor relations at Myovant Sciences and held roles of increasing responsibility on the investor relations and corporate tax teams at Pfizer. Mr. Crowe holds B.S. in commerce and engineering from Drexel University and an MBA from the Stern School of Business at New York University.\nMatthew Everett\nSenior Vice President, Global Procurement\nMatthew Everett joined Regeneron in 2023 and serves as senior vice president, global procurement. Mr. Everett leads a team responsible for Regeneron’s supplier engagements that is accountable for accelerating innovation, business process efficiency and return on investment across these relationships and in alignment with environmental, social and corporate governance (ESG) priorities. Most recently, Mr. Everett served as vice president, global procurement at GSK. Mr. Everett previously worked at Allergan, Forest Laboratories, Flex and Lucent Technologies, where he led diverse procurement and supply chain functions. Mr. Everett earned his M.S. from Columbia University, MBA from Fordham University and BBA from the University of San Diego.\nChris Fenimore\nExecutive Vice President, Finance and Chief Financial Officer\nChris Fenimore joined Regeneron in 2003 and serves as executive vice president, finance and chief financial officer. He previously served as Regeneron’s senior vice president, head of accounting and controller; vice president, controller; and vice president, financial planning and analysis. Prior to joining Regeneron, he was vice president of finance at Mojave Therapeutics, Inc. He has prior experience in healthcare industry-focused venture capital and investment banking roles, as well as serving as an audit senior at KPMG. Mr. Fenimore holds an M.A. in biotechnology from Columbia University, an MBA in professional accounting from Rutgers Business School and a B.A. in economics from Rutgers University. Mr. Fenimore is a Certified Public Accountant in the state of New York.\nGeorge Fraley\nSenior Vice President, Associate General Counsel\nGeorge Fraley joined Regeneron in 2009 and serves as senior vice president, associate general counsel. In his role, Mr. Fraley has built a dedicated, adaptive, and expert team responsible for Regeneron’s transactional needs, including support for business development, global procurement, strategic alliances, intellectual property licensing, the Regeneron Genetics Center, real estate and facilities, and Regeneron’s international operations. Prior to joining Regeneron, Mr. Fraley was the vice president of legal affairs, associate general counsel and assistant secretary at Renovis, Inc., served as senior counsel at Abgenix, Inc., and worked at two prominent international law firms. He received a J.D. from American University, Washington College of Law and a B.A. from Tulane University.\nRick Hall\nSenior Vice President, Human Resources\nRick Hall joined Regeneron in 2022 and serves as senior vice president, human resources for the sciences and international HR. In this role, Mr. Hall has strategic functional oversight for Regeneron’s HR business partner organizations outside of IOPS. He has been pivotal in shaping the design and capabilities of Regeneron’s global development (GD) organization, and his tenure has been marked by significant contributions in the selection, onboarding and development of key talent. He has also been a strong advocate for establishing and achieving people and culture goals within GD. Prior to joining Regeneron, Mr. Hall held positions of increasing responsibility within the human resources divisions of Johnson & Johnson and Merck. He earned his B.A. from Susquehanna University and his M.A. in information technology project management.\nJustin Holko\nSenior Vice President, Global Oncology/Hematology Commercial Business Unit\nJustin Holko joined Regeneron in 2019 and serves as senior vice president, global oncology/hematology commercial business unit. Previously, he served as vice president, investor relations at Regeneron. In his current role, Mr. Holko and his team focus on maximizing the growth of Regeneron’s commercial oncology/hematology business globally. This includes attracting best-in-class talent and developing key opinion leader (KOL) advocacy, alongside enhancing Regeneron brand awareness. Prior to joining Regeneron, Mr. Holko held roles of increasing cross-functional responsibility at Merck over a 19-year tenure. Mr. Holko received his B.E. from Vanderbilt University and his MBA from Rutgers University.\nNouhad Husseini\nSenior Vice President, Business Development\nNouhad Husseini joined Regeneron in 2011 and serves as senior vice president, head of business development, overseeing the company’s efforts to execute new strategic collaborations and licensing agreements. He has nearly 20 years of experience in the biopharmaceutical industry, where he has held a variety of strategic, business development and finance roles, including in Genentech’s Business Development and Corporate Finance departments and in investment banking and equity research at Morgan Stanley and Robertson Stephens. Mr. Husseini received his undergraduate degree in molecular biology from Princeton University and MBA from the Wharton School at University of Pennsylvania.\nJoseph J. LaRosa\nExecutive Vice President, General Counsel and Secretary\nJoseph J. LaRosa joined Regeneron in 2011 and is currently executive vice president, general counsel and secretary. Prior to joining Regeneron, Mr. LaRosa was senior vice president, general counsel and secretary at Nycomed U.S., Inc. He also previously served as vice president, global compliance and legal affairs at Avon Products, Inc., and held a number of senior legal positions at Schering-Plough Corporation, where he was a corporate officer and served as vice president, legal affairs, and a member of the operations management team. Mr. LaRosa currently serves on the board of directors and executive committee of the Biotechnology Innovation Organization (BIO). He received his J.D. degree from New York University.\nMelissa Lozner\nSenior Vice President, Chief Compliance Officer\nMelissa Lozner joined Regeneron in 2022 and serves as senior vice president, chief compliance officer. Ms. Lozner oversees all aspects of Regeneron’s corporate compliance program. Since joining the company, she has focused her efforts on evolving the compliance program and organizational structure to better support global expansion, as well as creating a new compliance risk navigation and advisory services group to better integrate compliance across the business. Prior to joining Regeneron, Ms. Lozner served as chief compliance officer and special counsel at Rafael Holdings, where she was responsible for building a compliance program for a start-up biotechnology company. She also held a number of roles within Novartis Oncology, including head of U.S. ethics, risk and compliance; head of global integrity and compliance, ad interim; and senior legal counsel. Prior to joining the industry, Ms. Lozner was a litigation attorney and served as a law clerk for Hon. Boyce F. Martin, Jr., Chief Judge Emeritus, U.S. Court of Appeals for the Sixth Circuit. Ms. Lozner earned a B.S. from Cornell University and a J.D. from Boston University School of Law.\nMarion McCourt\nExecutive Vice President, Commercial\nMarion McCourt joined Regeneron in 2018 and serves as executive vice president and head of the commercial organization. Prior to joining Regeneron, Ms. McCourt worked at Axovant, a clinical-stage biopharmaceutical company, where she was president and chief operating officer. She served as chief operating officer of Medivation until it was acquired by Pfizer Inc. in 2016, and before that, she held commercial leadership roles at Amgen, including vice president in U.S. commercial operations and vice president and general manager responsible for the company’s bone health and primary care business unit. Ms. McCourt began her career at AstraZeneca and spent 12 years there, ultimately becoming chief operating officer for AstraZeneca U.S. She received her B.S. from Lafayette College.\nBob McCowan\nSenior Vice President, IT and Chief Information Officer\nBob McCowan is senior vice president and chief information officer at Regeneron. With over 30 years of global experience, Mr. McCowan leads the company’s IT organization and is responsible for global IT strategy supporting research, commercial, cyber security and enterprise operations. He has driven an enhanced company focus on big data, innovation and strategic IT investments that support Regeneron’s mission. Mr. McCowan previously worked at international organizations including Amgen, Artemis International, Computer Science Corporation and Lockheed. He earned his MBA with the UK Open University and holds a degree in electrical engineering.\nSally A. Paull\nExecutive Vice President, Human Resources\nSally A. Paull joined Regeneron in 2016 and now serves as executive vice president, human resources. She was previously executive vice president, chief human resources oﬃcer at Inova Health System. Prior to Inova, Ms. Paull was senior vice president, chief human resources oﬃcer at Forest Laboratories. Earlier in her career, Ms. Paull served in progressively senior human resources roles at DENTSPLY International. She received her B.S. from the United States Air Force Academy and her M.A. in international relations from the University of Delaware.\nSmita Pillai\nSenior Vice President, Talent Development, Inclusion and Innovation Culture\nSmita Pillai joined Regeneron in 2021 and serves as senior vice president, talent development, inclusion and innovation culture. Ms. Pillai has an accomplished global DE&I career spanning life sciences, technology, financial services and media sectors. Most recently, she was vice president, global head of DE&I at Zendesk. Prior to that she was chief diversity officer for Dow Jones, including its flagship brand, The Wall Street Journal. She has also led global marketing research, corporate strategy and DE&I efforts at Fortune 50 companies such as Prudential Financial, Johnson & Johnson, and ACNielsen. A certified DE&I professional, Ms. Pillai received her BBA from KS School of Management, India and her MBA from Symbiosis International Business School, India.\nGeorge Poth\nSenior Vice President, Real Estate & Facilities Management\nGeorge Poth joined Regeneron in 2015 and serves as senior vice president, real estate and facilities management. In his role, Mr. Poth manages the company’s global, non-IOPS facilities, demonstrating strategic, long-term thinking while ensuring sound planning, execution and delivery. He and his team also navigate the facility, environmental and safety requirements of operating in countries outside the U.S. In his time at Regeneron, Mr. Poth also developed, and is now overseeing, the multiyear, multibillion-dollar Tarrytown expansion project. Prior to joining Regeneron, Mr. Poth held leadership roles of increasing responsibility in real estate and facilities management at Daiichi Sankyo, Inc. and AT&T. He received his B.A. and his MBA from Fairleigh Dickinson University.\nAlessandra Ravetti\nSenior Vice President, Associate General Counsel\nAlessandra Ravetti joined Regeneron in 2012 and serves as senior vice president, associate general counsel. Ms. Ravetti leads the global pharmaceutical legal operations team, a multidisciplinary team providing legal advice on the clinical development and commercialization of Regeneron’s products, including advice on R&D, regulatory matters, market access, product launches, lifecycle planning and healthcare law compliance. Prior to joining Regeneron, Ms. Ravetti spent 10 years at Pfizer in various positions of increasing responsibility. She was also an associate at the law firm of Sullivan and Cromwell. She received a J.D. from New York Law School, an M.A. from Boston College and a B.A. from Binghamton University.\nKerry Reinertsen, PhD\nSenior Vice President, Strategic Alliances\nDr. Kerry Reinertsen joined Regeneron in 2011 and serves as senior vice president, strategic alliances. Prior to joining Regeneron, Dr. Reinertsen was chief business officer of Constellation Pharmaceuticals, and she also previously served as the vice president of corporate development at Vertex Pharmaceuticals. She started her biotech career at Millennium Pharmaceuticals (now Takeda Oncology), where she held positions of increasing responsibility in business development. Dr. Reinertsen received her Ph.D. in biological chemistry and molecular pharmacology from Harvard University and her Sc.B. in molecular biology and A.B. in economics from Brown University.\nDon Sawyer\nSenior Vice President, Global Market Access\nDon Sawyer joined Regeneron in 2024 and serves as senior vice president, global market access. Most recently, Mr. Sawyer was senior vice president, market access, for Stemline Therapeutics, part of the Menarini Group. Mr. Sawyer has also led Market Access functions at AstraZeneca, Celgene and Bayer, along with startup companies Ironwood Pharmaceuticals and Acceleron Pharma. He received a J.D. from Widener University’s Delaware Law School and a B.A. from the University of Delaware.\nMark Volpe\nSenior Vice President, Tax\nMark Volpe joined Regeneron in 2012 and is senior vice president, tax. He previously held roles on the tax teams at Arthur Anderson, Ernst & Young, and Diageo, and he currently serves as secretary and member of the board of trustees at Intensive Therapeutics, a 501c3 nonprofit organization that provides therapy services to children with special needs. Mr. Volpe received an A.S. in accounting from Suffolk County Community College, followed by a B.A. at the State University of New York at Albany and a J.D. at Saint John’s University.\nBolanle Akinlade, MD\nSenior Vice President, Medical Affairs\nDr. Bolanle Akinlade joined Regeneron in 2015 and serves as senior vice president, medical affairs. Prior to Regeneron, Dr. Akinlade held medical director roles of increasing seniority at Astellas Pharma and Abbott Laboratories (now AbbVie). He earned his B.S. and M.D. in Nigeria before moving to the U.S. for his residency at the University of Connecticut. He received his MBA from Northwestern University Kellogg School of Management.\nHanne Bak, PhD\nSenior Vice President, Preclinical Manufacturing and Process Development\nDr. Hanne Bak joined Regeneron in 2004 and serves as senior vice president, preclinical manufacturing and process development (PMPD). She started her career at Regeneron as a research engineer working in the purification development group within PMPD and has subsequently held roles of increasing responsibility. Dr. Bak received her B.S., M.S. and Ph.D. in chemical engineering from Danmarks Tekniske Universitet (Technical University of Denmark).\nAris Baras, MD\nSenior Vice President, Head of Regeneron Genetics Center®, Co-Head of Regeneron Genetic Medicines\nDr. Aris Baras joined Regeneron in 2011 and helped found the Regeneron Genetics Center (RGC™), where he now serves as senior vice president, head of Regeneron Genetics Center and co-head of Regeneron genetic medicines. Previously, he held roles and responsibilities at Regeneron across R&D and business development. Prior to joining Regeneron, Dr. Baras contributed to other biotechnology ventures and conducted research spanning antibody-based therapeutics, cancer research and nanotechnology applications in drug development. Dr. Baras received his B.S., MBA and M.D. from Duke University.\nNed Braunstein, MD\nExecutive Vice President, Regulatory Affairs, Global Patient Safety & Development Quality\nDr. Ned Braunstein joined Regeneron in 2009, and serves as executive vice president, regulatory affairs, global patient safety & development quality. Prior to joining Regeneron, he worked at Columbia University College of Physicians and Surgeons for 13 years as assistant and then associate professor of medicine, and at Merck & Co., Inc. for 9 years in positions of increasing responsibility in clinical research, regulatory aﬀairs and global human health. Dr. Braunstein received his B.S. in medicine and his M.D. from Northwestern University.\nGang Chen, PhD\nSenior Vice President, Protein Expression Sciences\nDr. Gang Chen is the head of protein expression sciences (PES) in his role as senior vice president. Having joined the company in 1999, Dr. Chen has held scientific roles of increasing responsibility over his 23 years with Regeneron. He received his B.S. in biology from the University of Science and Technology of China and his Ph.D. in cell biology from the University of Washington.\nThomas DiCioccio, PhD\nSenior Vice President, Pharmacometrics\nDr. Thomas DiCioccio joined Regeneron in 2010 and serves as senior vice president, pharmacometrics. Dr. DiCioccio leads a team for four integrated functions: preclinical and translation pharmacokinetic/pharmacodynamic (PK/PD), and clinical and quantitative pharmacology with supporting efforts from a group of data scientists. Collectively, through integration of pharmacology with modeling and other quantitative methods, the functions within pharmacometrics play a central role in dose selection from first-in-human studies through global market applications as well as post-approval activities. The pharmacometric functions are also responsible for the associated documentation needed to support clinical protocols, as well as the nonclinical PK and clinical pharmacology summaries for the global regulatory filings. Prior to joining Regeneron, Dr. DiCioccio spent 14 years with a biotechnology start-up, after previously working with Lederle Laboratories for 14 years. Dr. DiCioccio earned a B.S. from SUNY Stony Brook, an M.S. at New York Medical College and a Ph.D. from Saint John’s University.\nBenjamin Drosman\nSenior Vice President, Global Development Quality & Regulatory Compliance\nBenjamin Drosman joined Regeneron in 2010 and serves as senior vice president, global development quality and regulatory compliance. Mr. Drosman leads a team that strategically aligns various quality functions and oversees an integrated quality management system (QMS). In addition, his team oversees regulatory functions, including labeling and advertising/promotion and compliance. Prior to joining Regeneron, Mr. Drosman worked at Pfizer for 12 years, holding various positions of increasing responsibility in pharmacovigilance, quality assurance and regulatory strategy. Mr. Drosman earned a B.S. in pharmacy from Long Island University and an MBA from the University of Phoenix.\nGregory Geba, MD, PhD\nSenior Vice President, Global Development Scientific Council\nDr. Gregory Geba joined Regeneron in 2013 and serves as senior vice president of the global development scientific council, a group that provides senior scientific input to Regeneron’s therapeutic portfolio of programs. He is a physician-scientist with decades of experience in design, execution and analysis of clinical trials. Previously, Dr. Geba worked at Sanofi, AstraZeneca, Novartis, Merck and at Yale University as an assistant professor of medicine. He received his B.A. in biology from Brown University and his M.D. from the University of Navarra in Spain. He completed a fellowship in immunology/pulmonary and critical care at Yale University, received an MPH in epidemiology from The Johns Hopkins University, and received his Ph.D. in molecular toxicology from Columbia University.\nPhilip Gregory\nSenior Vice President, Regeneron Cell Medicines\nPhilip Gregory, DPhil, joined Regeneron in 2024, following Regeneron’s acquisition of 2seventy bio’s research and development pipeline, and serves as senior vice president, Regeneron Cell Medicines. In his current role as head of Regeneron’s new unit dedicated to cell therapy programs, Dr. Gregory oversees Regeneron’s unique advantage of combining the best of cell therapy and biologics expertise to create compelling opportunities to develop potentially transformative approaches for cancer and other serious diseases. Previously, Dr. Gregory served as chief scientific officer at 2seventy bio and served in the same role at Bluebird Bio for 6 years, as well as in multiple leadership positions at Sangamo Therapeutics for almost 15 years. He received his B.Sc from the University of Sheffield and his DPhil from the University of Oxford.\nGary Herman, MD\nSenior Vice President, Clinical Development Unit Head, Genetic Medicines\nDr. Gary Herman joined Regeneron in 2015 and serves as senior vice president, clinical development unit head, genetic medicines. Previously, he served in roles of increasing responsibility at Merck, most recently as the vice president and head, early-stage development. From 2008 to 2015, Dr. Herman was one of only three pharmaceutical industry members on the executive committee of the Biomarkers Consortium, a program within the Foundation for the National Institutes of Health. Prior to that, Dr. Herman completed his residency and postdoctoral training at University of California, San Francisco and was an assistant professor there before joining the pharmaceutical industry. He received his B.S. in biochemistry and cell biology from the University of California, San Diego, and his M.D. from Harvard Medical School.\nBoaz Hirshberg, MD\nSenior Vice President, Clinical Development Unit Head, Internal Medicine\nDr. Boaz Hirshberg joined Regeneron in 2021 and serves as senior vice president, clinical development unit head, internal medicine, leading strategic program direction and late-stage clinical development for a broad range of therapeutic areas including ophthalmology, cardiovascular and metabolic, pain and neurology, and infectious and rare diseases. Before joining Regeneron, Dr. Hirshberg was executive vice president, chief medical officer and head of global development at BOL Pharma, a biotech developing medical cannabis therapeutics, where he directed preclinical and clinical development, regulatory, pharmacovigilance and medical affairs. Prior to BOL, he spent 12 years at AstraZeneca/MedImmune in roles of increasing responsibility, ultimately building and overseeing the cardiovascular renal and metabolism clinical therapeutic area at MedImmune. Dr. Hirshberg completed his undergraduate and medical degrees at the Hebrew University and is board certified in internal medicine, following his residency at Hadassah Medical Center in Jerusalem. He received his MBA in healthcare administration from Wilmington University.\nDiana Hughes\nSenior Vice President, Global Patient Safety\nDr. Diana Hughes joined Regeneron in 2019 and serves as senior vice president, global patient safety. Under Dr. Hughes’ leadership, Regeneron’s pharmacovigilance and risk management function has evolved to global patient safety (GPS), and she has reorganized the safety function in a scalable manner, integrating science, operations and technology advancement to support Regeneron’s global pipeline, while aligning with the external regulatory landscape. Dr. Hughes worked for Sunovion Pharmaceuticals, FORUM Pharmaceuticals, and spent 14 years at Pfizer, where she held various roles of increasing responsibility. Before joining the pharmaceutical industry, Dr. Hughes worked as a medical practitioner in the U.K. and U.S. Dr. Hughes earned a medical degree (MBBS) from The Royal Free Hospital and School of Medicine, London University, and an M.Sc. from Hibernia College.\nBari Kowal\nSenior Vice President, Development Operations, Portfolio Management & Biostatistics Data Management\nBari Kowal joined Regeneron in 2015 and became head of global clinical operations in 2017. She currently serves as senior vice president, development operations, portfolio management & biostatistics data management and is responsible for clinical trial strategy and execution, along with overseeing our development shared services functions. She was previously at Pfizer, where she held the positions of vice president, business operations and analytics and, prior to that, vice president, strategic alliance and development operations lead. Ms. Kowal also served as vice president, clinical operations, on the clinical research organization side of the industry at a number of biotech organizations in a variety of clinical research roles early in her career. She holds a B.S. in biology from the State University of New York at Binghamton and an M.S. in neuroscience from New York University.\nChristos Kyratsous, PhD\nSenior Vice President, Co-Head, Regeneron Genetic Medicines\nDr. Christos Kyratsous joined Regeneron in 2011 and serves as senior vice president, co-head, Regeneron genetic medicines. He leads the development of our next-generation genetic therapeutics platforms and is the head of the infectious diseases therapeutic focus area. Dr. Kyratsous previously worked at the Howard Hughes Medical Institute and was a postdoctoral fellow at New York University. He received his B.S. from the Aristotle University of Thessaloniki in Greece and then received his Ph.D. in microbiology at Columbia University.\nJohnathan Lancaster, MD, PhD\nSenior Vice President, Global Medical Affairs\nDr. Johnathan M. Lancaster joined Regeneron in 2019 as a vice president and now serves as senior vice president and head of global medical affairs. Prior to joining Regeneron, Dr. Lancaster served as chief medical officer at Myriad Genetics, Inc., following more than a decade in academics at Moffitt Comprehensive Cancer Center in Tampa, where he serves as a gynecologic oncologist, molecular genetics researcher and ultimately, president of the Moffitt Medical Group Corporation. Dr. Lancaster received his B.Sc in pharmacology and his M.D. and Ph.D. from the University of Wales in the UK. He received postgraduate clinical training in obstetrics and gynecology and gynecologic oncology at the University of Cambridge and Duke University Medical Center.\nJohn Lin, MD, PhD\nSenior Vice President, Immuno-Oncology and Head of Bispecifics\nDr. John Lin joined Regeneron in 2016 and oversees the preclinical bispecific antibody research work in research and development across all disease areas. Previously, he worked at Pfizer for 10 years, focusing on research and early development of biologics, and before that he worked at Rinat Neuroscience Corporation after completing his postdoctoral fellowship at Genentech. Dr. Lin received his M.D. from National Taiwan University and his Ph.D. from Harvard University.\nIsrael Lowy, MD, PhD\nSenior Vice President, Clinical Development Unit Head, Oncology\nDr. Israel Lowy joined Regeneron in 2010 as vice president, and now serves as senior vice president, clinical development unit head, oncology. He is a primary architect of Regeneron’s cancer immunotherapy program. Prior to joining Regeneron, Dr. Lowy was at Medarex for eight years. Before that, he was an assistant professor of medicine and microbiology at Mount Sinai School of Medicine. Dr. Lowy is a licensed physician and has been board certified in internal medicine and infectious diseases. He received his A.B. in biochemical sciences from Princeton University and his M.D. and Ph.D. in biochemistry and molecular biophysics from Columbia University.\nLynn Macdonald, PhD\nSenior Vice President, Research\nDr. Lynn Macdonald joined Regeneron in 1999 and serves as senior vice president, research. Dr. Macdonald is responsible for heading the VelocImmune®-NEXT technology development group, neuroscience group, molecular profiling and data sciences group, and DNA core and automation group. She has been a key contributor in developing Regeneron’s groundbreaking VelociSuite® of genomics technologies, including playing a critical role in developing VelociGene®, and subsequently working as part of a team that developed the VelocImmune® mouse. Prior to joining Regeneron, Dr. Macdonald worked for Cadus Pharmaceuticals after completing a postdoctoral fellowship at Columbia University. She earned a B.S. from the University of Rochester and a Ph.D. from State University of New York.\nLori Morton, PhD\nSenior Vice President, Research\nDr. Lori Morton joined Regeneron in 2002 and serves as senior vice president, research. During her tenure, Dr. Morton has established cardiovascular, renal and fibrosis research at Regeneron. In her role, Dr. Morton has led the discovery and development of a highly innovative and diverse portfolio across disease areas. In addition to a robust portfolio of antibody therapeutics, she has been a company leader in the application of novel nucleotide and gene therapies. As well as serving as an R&D leader, Dr. Morton also sponsors Women in Industry, Science & Engineering at Regeneron (WISER), an employee resource group. Prior to joining Regeneron, Dr. Morton completed postdoctoral fellowships at Pfizer and Sloan Kettering Cancer Center. Dr. Morton earned a B.S. from Douglass College of Rutgers University and a Ph.D. from the University of North Carolina at Chapel Hill.\nAndrew Murphy, PhD\nExecutive Vice President, Research and Co-Chief Scientific Officer\nDr. Andrew Murphy joined Regeneron in 1999 as director of genomics and bioinformatics and is now co-Chief Scientific Officer and executive vice president of research. In his time at the company, he has led the gene discovery and bioinformatics and target discovery groups. Dr. Murphy is a co-inventor of Regeneron's key technologies VelociGene® and VelocImmune® and continues to lead several technology centers and therapeutic focus areas. Prior to joining Regeneron, Dr. Murphy worked for seven years at Cadus Pharmaceuticals. He received his B.S. in molecular biology at the University of Wisconsin, and his Ph.D. in human genetics from Columbia University, College of Physicians and Surgeons.\nMuriel O'Byrne, PhD\nSenior Vice President, International Regulatory Affairs & Head, European Business Office\nDr. Muriel O'Byrne joined Regeneron in 2014 and serves as senior vice president, international regulatory affairs and head, European business office. In her role, Dr. O’Byrne leads a team that interfaces with international regulatory authorities, including those in the European Economic Area (EEA) and Japan. Her team is instrumental in enabling the success and expediency of Regeneron's regulatory actions globally by effectively articulating the company's innovations to key regulators in critical regions. Dr. O'Byrne also heads Regeneron's European Business Office based in Dublin, Ireland. Prior to joining Regeneron, Dr. O’Byrne held various regulatory affairs roles of increasing responsibility at Elan Pharmaceuticals, AstraZeneca and GSK. With a career spanning over 25 years, she has been pivotal in delivering successful global regulatory strategies for products across the development lifecycle through to commercialization. She also has a proven track record in building and leading regulatory functions. Dr. O'Byrne received her B.Sc (Honours) from University College Cork – National University of Ireland and her Doctorate from Trinity College Dublin.\nWilliam Olson, PhD\nSenior Vice President, Therapeutic Proteins\nDr. William Olson joined Regeneron in 2013 as vice president and now serves as senior vice president of therapeutic proteins, where he is responsible for antibody generation, a key component of drug discovery, through innovative technologies. Before joining Regeneron, Dr. Olson was at Progenics Pharmaceuticals for 19 years. He was also a scientist at MicroGeneSys and at Johnson & Johnson’s RW Johnson Pharmaceutical Research Institute. Dr. Olson received his B.S. in chemical engineering at the University of North Dakota, and his Ph.D. in biochemical engineering from Massachusetts Institute of Technology.\nJamie Orengo, PhD\nSenior Vice President, Research\nDr. Jamie Orengo joined Regeneron in 2008 and serves as senior vice president, research. Dr. Orengo leads the Immunology and Inflammation research and discovery group responsible for developing multiple approaches to treat allergic, respiratory, inflammatory and autoimmune disorders that span early to late stages of development and has co-authored multiple key scientific journal and media articles featuring Regeneron’s research. She previously served as Regeneron’s vice president of research for allergy and immunity. Prior to joining Regeneron, Dr. Orengo was a postdoctoral fellow at New York University School of Medicine, where she also received her Ph.D. in parasitology. Dr. Orengo also received a Master of Public Health degree from Yale School of Public Health and a B.A. in biology from Columbia College, Columbia University.\nMohammed Shameem, PhD\nSenior Vice President, Formulations Development\nDr. Mohammed Shameem joined Regeneron in 2016 and serves as the senior vice president of formulation development. Dr. Shameem leads the formulation development group (FDG) at Regeneron, expanding its capabilities in delivering safe and effective drug products across various therapeutic modalities, dosage forms and administration routes. He is also instrumental in guiding FDG's growth into new areas such as fixed-dose combination products, drug product manufacturing process development and drug delivery system development. Dr. Shameem is a recipient of the Heroes of Chemistry and Industrial Biotechnology awards from the American Chemical Society in 2021 and 2016, respectively. Prior to coming to Regeneron, Dr. Shameem held roles of increasing responsibility at Merck, and was a senior principal scientist at Purdue Pharma L.P. He earned his B.Pharm and M.Pharm from the University of Dhaka, Bangladesh, and his Ph.D from Kumamoto University, Japan.\nL. Andres Sirulnik, MD, PhD\nSenior Vice President, Clinical Development Unit Head, Hematology\nDr. L. Andres Sirulnik joined Regeneron in 2020 and serves as senior vice president, clinical development unit head, hematology, leading strategic program direction and clinical sciences work for our early- and late-stage oncologic hematology and late-stage non-oncology hematology portfolios. Before joining Regeneron, Dr. Sirulnik was chief medical officer at Merus N.V., a clinical-stage immuno-oncology company. Prior to that, he spent a decade at Novartis in various roles of increasing responsibility, ultimately overseeing clinical strategy for their immuno-oncology portfolio. Dr. Sirulnik is a licensed physician, formerly practicing at Dana-Farber Cancer Institute and Brigham and Women’s Hospital and was a fellow in hematology/oncology at Mount Sinai Health System. He completed his medical residency at North Shore Long Island Jewish (LIJ) Health System and conducted post doctorate work at Columbia University. He received his Ph.D. in medicine and molecular biology from King’s College, University of Cambridge in the U.K. and his M.D. from the University of Buenos Aires, Argentina.\nRandy Soltys, PhD\nSenior Vice President, Drug Safety and Pharmacometrics\nDr. Randy Soltys joined Regeneron in 2011 and now serves as senior vice president, drug safety and pharmacometrics, where he is responsible for the toxicology, pathology, preclinical pharmacokinetic/pharmacodynamic (PK/PD) and clinical and quantitative pharmacology organizations. Prior to joining Regeneron, he held senior leadership positions in drug safety assessment at Genentech and Bristol-Myers Squibb. Dr. Soltys received his B.S. in microbiology from Rutgers University and his Ph.D. in pharmacology/toxicology jointly from Rutgers and the University of Medicine and Dentistry of New Jersey, and has been board certified in toxicology.\nBrian Zambrowicz, PhD\nExecutive Vice President, Functional Genomics and Chief VelociGene® Operations\nDr. Brian Zambrowicz joined Regeneron in 2015 and serves as executive vice president, functional genomics and chief of VelociGene® operations. Prior to joining Regeneron, Dr. Zambrowicz held roles of increasing responsibility from 1996 to 2015 at Lexicon Pharmaceuticals, Inc., ultimately serving as executive vice president and chief scientific officer. Dr. Zambrowicz received his B.S. from the University of Wisconsin-Madison and his Ph.D. from the University of Washington.\nRajesh Ahuja\nSenior Vice President, Quality Assurance and Operations\nRajesh Ahuja joined Regeneron in 2013 and serves as senior vice president, quality assurance and operations for the IOPS Supply group. Mr. Ahuja leads the teams responsible for external manufacturing (drug substance and drug product) and is currently overseeing the development and licensing of the company’s first fill and finish manufacturing facility. During his tenure at Regeneron, Mr. Ahuja has led the drug product quality, external quality, IT quality, material and supplier quality, and quality assurance (QA) validation teams, and oversaw the start-up, qualification, validation and risk management of global expansion projects and the QC labs at Regeneron’s production facility in Limerick, Ireland. Prior to joining Regeneron in 2013, Mr. Ahuja held positions of increasing responsibility at Alexion, Amgen, Eli Lilly and Merck. He holds a B.E. in Chemical Engineering from RV College of Engineering, India, and a master’s degree in chemical engineering from Villanova University.\nFrederick Austin\nSenior Vice President, Quality Control, Raheen\nFrederick Austin joined Regeneron in 2012 and serves as senior vice president, quality control, Raheen. Mr. Austin leads a team responsible for Raheen quality control laboratory and contract laboratories functions. Prior to joining Regeneron, Mr. Austin worked for 14 years at Amgen in various roles of increasing responsibility, including assisting in starting operations at the company’s Longmont, Colorado and Juncos, Puerto Rico sites, and spent time working at both Novartis and Abbott Laboratories. Mr. Austin earned a B.S. from Colorado State University.\nChristine Childrose\nSenior Vice President, Human Resources and HR Operations\nChristine Childrose joined Regeneron in 2014 and serves as senior vice president, IOPS human resources and HR operations. Ms. Childrose leads workforce development to support IOPS’ rapidly growing operations, new fill and finish capabilities, and emerging technologies. She oversees global HR systems and processes, and is expanding HR operations to support employees in a growing number of countries outside the U.S. Prior to joining Regeneron, Ms. Childrose worked at Albany Molecular Research Inc., and spent almost two decades at General Electric (GE) in positions of increasing responsibility. She earned a B.S. from the University at Albany and is a graduate of GE’s Financial Services Leadership program.\nDavid Crenshaw\nSenior Vice President, Associate General Counsel\nDavid A. Crenshaw joined Regeneron in 2018 and serves as senior vice president, associate general counsel. Mr. Crenshaw is the law department’s lead attorney for the IOPS organization, and also oversees the company’s global privacy and export controls/trade regulation groups. Prior to joining Regeneron, Mr. Crenshaw held positions of increasing responsibility at several law firms (including as partner and chief operating officer for a global AmLaw 100 law firm) and at Schering-Plough Corporation, where he provided legal counsel to the international commercial and regulatory teams. He holds a B.A. from Colgate University and a J.D. from Syracuse University College of Law.\nTikiri Dissanayake\nSenior Vice President, IOPS Technical Operations\nTikiri Dissanayake joined Regeneron in 2000 and currently serves as the senior vice president, IOPS technical operations, a role in which he oversees facilities; engineering; environmental health, safety and security; and automation and technical training. Mr. Dissanayake holds a B.S. in biology and physical anthropology from the State University of New York at Potsdam.\nJenny McNay, PhD\nSenior Vice President, CMC Regulatory Sciences and Industrial Affairs\nDr. Jennifer McNay joined Regeneron in 2000 and serves as senior vice president of chemistry, manufacturing and controls (CMC) regulatory sciences and industrial affairs. She previously held roles at Regeneron in preclinical manufacturing and process development, process sciences and combination products. Prior to joining Regeneron, she worked at Procter and Gamble. Dr. McNay earned her B.S. in chemical engineering from the University of Delaware and her M.S. and Ph.D. in chemical engineering from the University of Virginia.\nNiall O’Leary\nSenior Vice President and Site Head, IOPS Raheen\nNiall O’Leary joined Regeneron in 2012 and serves as senior vice president and site head of IOPS Raheen. He has held leadership positions of increasing responsibility in quality, regulatory affairs, program management and manufacturing across biological, small molecule and medical device platforms. Prior to joining Regeneron, Mr. O’Leary worked as an independent consultant and at Pulmatrix, Alkermes, Organogenesis and Merck Serono. Mr. O’Leary received his B.S. in biotechnology from Dublin City University, Ireland and his MBA from the Williams College of Business at Xavier University in Cincinnati, Ohio.\nDavid Simon\nSenior Vice President, IOPS Finance and Business Operations\nDavid Simon has been with Regeneron since 1998 and serves as senior vice president, industrial operations and product supply (IOPS) finance and business operations. Prior to his decades at Regeneron, he managed finances at Freihofer Baking Company. He earned his B.S. from Siena College and his MBA from State University of New York at Albany.\nDaniel Van Plew\nExecutive Vice President and General Manager, Industrial Operations and Product Supply\nDaniel Van Plew joined Regeneron in 2007 and has served as executive vice president and general manager, industrial operations and product supply since January 2016. From 2006 to 2007, he served as executive vice president, R&D and technical operations of Crucell Holland B.V., a global biopharmaceutical company. Between 2004 and 2006, Mr. Van Plew held positions of increasing responsibility at Chiron Biopharmaceuticals, most recently as senior director, Vacaville operations. From 1998 until 2004, he held various managerial positions in the health and life sciences practice at Accenture, Ltd., a management consulting business. Mr. Van Plew received his M.S. in chemistry from Penn State University and his MBA from Michigan State University.\nJames Wolfe\nSenior Vice President, Process Sciences and Drug Product Engineering\nJim Wolfe joined Regeneron in 1998 and currently serves as senior vice president, process sciences and drug product engineering for IOPS. Mr. Wolfe oversees the teams driving late-stage process characterization, process validation, device development, drug product engineering, manufacturing science and technology, and modeling simulation and analysis. He earned a B.A. in biological sciences from the State University of New York at Plattsburgh.\nBenjamin Yocum\nSenior Vice President, Manufacturing Operations\nBenjamin Yocum joined Regeneron in 2000 and serves as senior vice president, manufacturing operations. Mr. Yocum’s broad knowledge and expertise in Good Manufacturing Practices (GMP) and processes have contributed to the successful launch of every Regeneron commercial product. In addition to leading manufacturing operations in New York’s capital region, Mr. Yocum’s sphere of influence extends beyond manufacturing to encompass all aspects of our quality culture. Prior to joining Regeneron, Mr. Yocum worked in the chemistry department at Seattle Pacific University. He earned an M.S. from the University at Albany."
    },
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/about/collaborations",
        "Content_Type": "Website Content",
        "Raw_Text": "Joining forces with Roche in the fight against COVID-19\nIn the early days of the pandemic, Roche and Regeneron came together to develop, manufacture and distribute Regeneron’s investigational monoclonal antibody cocktail to treat and prevent COVID-19 to as many people as possible in record time.\nWhile successfully completing the clinical development program, Regeneron and Roche moved swiftly to start producing the medicine at manufacturing sites around the globe — a herculean effort to increase the supply and reach more patients at a crucial and devastating time during the pandemic. The Roche collaboration more than tripled manufacturing capacity, and ultimately millions of doses of the antibody cocktail were supplied around the world.\n\"This major collaboration with Roche provided important scale in record time, enabling our medicine to reach millions of patients in the United States and around the globe. Together, we delivered when the world needed it most and provided an important option for those suffering from, or at high-risk for, COVID-19,\" said Kerry Reinertsen, PhD, Senior Vice President, Strategic Alliances at Regeneron."
    },
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/about/grants",
        "Content_Type": "Website Content",
        "Raw_Text": "Our investment in The Future of Medicine\nWe proudly support a broad range of programs that offer support and resources to researchers, healthcare providers, patients and their advocates, as well as our local communities.\nCorporate funding application\nNonprofit patient advocacy groups, national medical society, STEM education and community-based organizations seeking charitable contributions, patient advocacy-related sponsorships, and national-level corporate memberships.\nEducational funding\nEducational providers of CME, non-CME, academic fellowship programs or conference organizers for scientific, clinical, or medical congresses seeking funding for independent medical education grants, research conference funding, global clinical development conference funding, or regulatory affairs and global patient safety conference funding.\nSponsorships & exhibits\nMedical associations, society and healthcare professional organizations, or academic institutions seeking funding for exhibits, sponsorships, or state-level corporate memberships.\nThird-party research requests\nThird-party investigators or clinicians seeking funding for investigator-initiated studies or research collaborations.\nRegeneron is committed to conducting business in compliance with all Regeneron policies, American Medical Association (“AMA”) Guidelines on Gifts to Physicians, the AMA Ethical Opinion on Continuing Medical Education, the Pharmaceutical Research and Manufacturers of America (PhRMA) code on Interactions with Healthcare Professionals, the Accreditation Council for Continuing Medical Education (ACCME) Standards for Integrity and Independence in Accredited Continuing Education, the U.S. Food and Drug Administration (FDA) regulations and guidance, the U.S. Department of Health and Human Services’ Office of Inspector General (OIG) guidance and all applicable federal and state laws and regulations."
    },
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/stories/featured",
        "Content_Type": "Website Content",
        "Raw_Text": "Featured Stories Regeneron and our leaders discuss our drive, innovations and the science behind our mission as well as the programs that matter most to us.\nUnwavering Hope in the Face of NSCLC\nCelebrating the strength and determination of patients living with advanced lung cancer.\nOctober 15, 2025\nVolunteer Project Leaders Share Their WhyOur ninth annual Day for Doing Good (D4DG) week of global volunteerism kicks off later this week. Learn about a few of our colleagues who are stepping up as project leaders to champion causes they care about.\nResponsibility & Culture\nJune 09, 2025\nUnlocking the Next Generation of Cancer-Fighting TreatmentsRegeneron’s proprietary VelociVax™ platform enables development and validation of potential new mRNA-based immunotherapies.\nClinical Research & Medicines\nMarch 31, 2025\nWhat's Your Legacy? How Clinical Trials Bridge Science to MedicineDiscover a campaign celebrating the power of clinical research — helping us answer more questions, develop potential treatments and unlock new possibilities — because legacies aren’t just meant to be left, they’re meant to be lived\nClinical Research & Medicines\nFebruary 04, 2025\nUnlocking Precision Medicine: Big Data, Artificial Intelligence and Genetic BreakthroughsDiscover how cutting-edge genetic research and population representation have the potential to transform precision medicine at Regeneron.\nGenetics\nOctober 24, 2024\nFueling Future Innovation: Cultivating Tomorrow’s STEM LeadersLearn how Regeneron transforms curiosity into lifelong scientific legacies and supports the next scientific generation through investments in STEM education.\nResponsibility & Culture\nOctober 01, 2024\nLet’s Get Real About Skin CancerLearn how Regeneron educates people on the risks of nonmelanoma skin cancers like BCC and CSCC and promotes early detection.\nResearch & Preclinical Development\nAugust 29, 2024\nApplying Emerging AI and Machine Learning Tools to Find Equitable Solutions to Scientific DiscoveryRead about Applying Emerging AI and Machine Learning Tools to Find Equitable Solutions to Scientific Discovery\nResearch & Preclinical Development\nMay 28, 2024\nA Compliance Program With Science and Patients at the CoreWhen your motivation is advancing science and helping as many people as possible, ethics and integrity come naturally.\nResponsibility & Culture"
    },
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/stories/library",
        "Content_Type": "Website Content",
        "Raw_Text": "Stories Library\nWe proudly offer support and resources to researchers, healthcare providers, patients and their advocates as well as our local communities.\nOctober 15, 2025\nVolunteer Project Leaders Share Their WhyOur ninth annual Day for Doing Good (D4DG) week of global volunteerism kicks off later this week. Learn about a few of our colleagues who are stepping up as project leaders to champion causes they care about.\nResponsibility & Culture\nJune 09, 2025\nUnlocking the Next Generation of Cancer-Fighting TreatmentsRegeneron’s proprietary VelociVax™ platform enables development and validation of potential new mRNA-based immunotherapies.\nClinical Research & Medicines"
    },
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/about/our-company",
        "Content_Type": "Website Content",
        "Raw_Text": "We move science to medicine because our world is MEANT FOR MORE\nAbout Regeneron\nOur mission is to use the power of science to bring new medicines to patients ... over and over again.\nWe are a leading biotechnology company that invents, develops and commercializes life-transforming medicines for people with serious diseases. Founded and led by physician-scientists, our unique ability to repeatedly and consistently translate science into medicine has led to numerous approved treatments and product candidates in development, almost all of which were homegrown in our laboratories. Regeneron's medicines and pipeline are designed to help patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, neurological diseases, hematologic conditions, infectious diseases and rare diseases.\nRegeneron pushes the boundaries of scientific discovery and accelerates drug development using our proprietary technologies, such as VelociSuite®, which produces optimized fully human antibodies and new classes of bispecific antibodies. We are shaping the next frontier of medicine with data-powered insights from the Regeneron Genetics Center® and pioneering genetic medicine platforms, enabling us to identify innovative targets and complementary approaches to potentially treat or cure diseases.\nPress releases\nOur leadership\nFounded and led by physician-scientists, our leadership team includes Nobel Laureates and eight members of the National Academy of Sciences who guide our science-first approach.\nA look back\nDeveloping life-transforming treatments is no small feat. Decades of investment and perseverance have brought us to where we are today.\nRegeneron at a glance\nHonors and recognitions\nRead more about our\nRelentless Innovation\nEye on the Experts: Regeneron Perspectives on Ophthalmology Innovation\nSharing our scientific approach and lessons learned as we look toward the future.\nHitting the “On Switch” in Hearing Loss\nA novel gene therapy approach to genetic hearing loss\nThe RGC Effect: A Decade in the Making\nReflecting on the first 10 years of the Regeneron Genetics Center® (RGC), with impact far beyond what we could have imagined.\nOur pursuit of scientific innovation continues to push the boundaries of science and improve our world. Hear our leaders reflect on our progress and vision for the future.\nView our annual materials\nOur locations worldwide\nMore than 15,100 of our colleagues work across the globe with offices in 12 countries and clinical trials underway in more than 50 countries."
    },
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/about/our-company/history",
        "Content_Type": "Website Content",
        "Raw_Text": "A 35+ year journey with a relentless Focus on Science\nOur commitment to patients extends well beyond our labs. We are proud to support the communities we serve, to embrace a culture and business model of patients over profits, and to hold the highest ethical standards when it comes to patient well-being.\n2025\n- Regeneron awarded the 2025 Prix Galien USA Best Biotechnology Product for our medicine for allergic and atopic conditions.\n- The European Commission approves our myeloma cancer treatment.\n-\nWe announce a significant expansion of our manufacturing capacity through a $3 billion agreement with FUJIFILM Diosynth Biotechnologies, bringing Regeneron’s planned investments in the United States to more than $7 billion.\n2024\n-\nRegeneron acquires 2seventy bio, Inc’s pipeline of investigational novel immune cell therapies, and announces the formation of Regeneron Cell Medicines.\n-\nThe FDA and European Union approve new indications for our treatment for certain type 2 allergic conditions.\n-\nThe European Union approves our treatment for lymphoma cancers, marking Regeneron’s first approved bispecific antibody.\n2023\n- Industry luminary P. Roy Vagelos, MD, retires as board chair.\n- Drs. Leonard S. Schleifer and George D. Yancopoulos become co-Chairs of the board.\n- We receive approval for our 11th FDA-approved medicine, a complement inhibitor indicated for CHAPLE disease.\n- We receive approval for our 12th FDA-approved medicine, a VEGF inhibitor for certain retinal diseases.\n-\nWe increase and extend our commitment as lead sponsor of Regeneron International Science and Engineering Fair (ISEF), the world’s largest pre-college STEM competition, with an additional $34 million over five years.\n-\nRegeneron acquires long-standing collaborator, Decibel Therapeutics, Inc., strengthening our gene therapy and auditory programs.\n2022\n- The FDA and European Commission approve new indications for our treatments for certain type 2 allergic conditions and cancer.\n- Regeneron takes full ownership of its cancer treatment, with exclusive worldwide development, commercialization and manufacturing rights.\n- Regeneron acquires Checkmate Pharmaceuticals, deepening its immuno-oncology portfolio.\n2021\n- We receive our ninth FDA approval for our ANGPTL3 inhibitor for a rare genetic cardiometabolic disease.\n- The FDA approves new indications for our treatments in certain type 2 allergic conditions and cancer; European Commission approves a new indication for our cancer treatment.\n- The European Commission authorizes Regeneron’s COVID-19 antibody cocktail.\n- Regeneron and Intellia announce first-ever clinical data supporting the safety and efficacy of in vivo CRISPR genome editing.\n- Regeneron Genetics Center discovers GPR75 gene mutations that protect against obesity.\n2020\n- The FDA approves an expanded indication for our treatment for certain type 2 allergic conditions.\n- The FDA approves our Ebola treatment, our eighth FDA-approved medicine.\n- Regeneron discovers and develops novel COVID-19 antibody cocktail in record time; FDA authorizes for emergency use.\n- Regeneron named Science magazine’s #1 biopharma company for the seventh time.\n2019\n- Regeneron and Cold Spring Harbor Laboratory unveil new dedicated laboratories for student science education. Society for Science announces Regeneron as new sponsor of the International Science and Engineering Fair.\n- The FDA and European Commission approve new indications for our various treatments in certain eye diseases, type 2 allergic conditions, cancer and cardiovascular diseases.\n- Regeneron debuts on the prestigious Dow Jones Sustainability World Index.\n2018\n- The FDA approves a new indication for our treatment for type 2 allergic conditions.\n- The FDA approves our PD-1 inhibitor antibody for certain type of cancers, our seventh FDA-approved medicine.\n2017\n- We achieve our fifth FDA-approved medicine — an IL-4 antagonist for certain type 2 allergic conditions.\n- We achieve our sixth FDA-approved medicine, indicated for certain inflammatory diseases, marking our second fully human monoclonal antibody.\n- Recognized on the Civic 50 list of most community-minded companies in the United States.\n2016\n- We are named as the new title sponsor for the Science Talent Search (just the third in the prestigious competition's 80+ year history).\n2015\n- The FDA approves our fourth medicine, marking our first FDA-approved fully human monoclonal antibody.\n- We launch a major new immuno-oncology collaboration with Sanofi.\n2014\n- We initiate the STEM Teaching Fellowship, a joint effort with the STEM Leadership Center, to develop a highly trained science teacher community, and Sci2Med Academy, in collaboration with Yonkers Partners in Education, to broaden career horizons for students who are underrepresented in the science fields. Learn more about our initiatives.\n- We begin building our first ex-U.S. IOPS site in Limerick, Ireland.\n2013\n- We announce the first recipients of our annual Regeneron Prize for Creative Innovation.\n- Our European business office opens in Dublin, Ireland.\n- Scrip Intelligence names Len and George as the \"Management Team of the Year.\"\n2012\n- The Science Top Employer survey names us the #1 employer in the global biopharmaceutical industry.\n- Scrip Intelligence names us Biotech Company of the Year.\n2011\n- The FDA approves our treatment for certain eye diseases.\n- Our President and CEO, Leonard S. Schleifer, is named Ernst & Young's 2011 New York Entrepreneur Of The Year®.\n2010\n- We begin sponsorship of the BioBus, a mobile laboratory, to drive hands-on science education in underserved school districts.\n2009\n- We expand and extend our antibody collaboration with Sanofi.\n- Our investigational PCSK9 inhibitor for cardiovascular disease begins clinical development.\n- We hire our 1,000th employee and move into new buildings on our Tarrytown campus.\n2008\n- The FDA approves our first medicine.\n2007\n- A collaboration with Sanofi focuses on developing fully human antibodies using our VelocImmune® technology platform.\n2006\n- Our first fully human antibody, an IL-6R antagonist for certain inflammatory diseases, enters clinical development.\n- A collaboration with Bayer HealthCare focuses on developing our treatment for certain eye diseases outside the U.S.\n2004\n- Our investigational VEGF inhibitor for certain eye diseases begins clinical development.\n2003\n- Our first paper on VelociGene® is published, introducing the world to our proprietary Veloci technologies.\n- We become one of the original sponsors of the Westchester Science & Engineering Fair (WESEF) to support and reward scientific excellence in promising high school students.\n2000\n- Our IL-1 inhibitor for a rare inflammatory disease begins clinical exploration.\n1999\n- George Yancopoulos becomes the decade's 11th most highly cited scientist in the world.\n1997\n- The phase 3 trial of our first neurotrophic factor does not achieve its primary endpoint, and though the team is disappointed, we regroup to focus on new therapeutic solutions.\n1995\n- Industry legend P. Roy Vagelos, MD, becomes chairman of the board.\n- Dr. Vagelos, a businessman-scientist who had previously led Merck's R&D division, encourages us to focus our research on disease settings where the biological profile can be fully characterized and the clinical benefit evaluated more quickly.\n1993\n- We acquire space for a drug manufacturing facility in Rensselaer, NY, years before having an FDA-approved medicine.\n1992\n- Clinical development of our first investigational drug, a neurotrophic factor, begins.\n1991\n- REGN stock begins trading publicly on the NASDAQ; the initial public offering (IPO) raises $91.6 million.\n1990\n- Science publishes our first paper, which becomes the most highly cited neurobiology paper of the year.\n- We announce a collaboration to develop neurotrophic factors.\n1989\n1988\n- Regeneron is founded by Leonard S. Schleifer, MD, PhD, a young neurologist and assistant professor at Cornell University Medical College.\n\"There may be no other thing you can do that is more rewarding than to really move the human condition forward.\"\nGeorge D. Yancopoulos, MD PhD\nBoard co-Chair, President and Chief Scientific Officer"
    },
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/about/our-company/locations",
        "Content_Type": "Website Content",
        "Raw_Text": "Our Locations\n15,100+ employees in 12 countries\nMore than 15,100 of our colleagues work across the globe, with offices in 12 countries and clinical trials underway in more than 50 countries.\nTo request specific product information, report an adverse event or report a product complaint for a Regeneron product, please refer to our Medical Inquiries page.\nBengaluru, India\nTower C, 6th floor\nDr Puneeth Rajkumar Road\nBellandur, Bengaluru\nKarnataka 560103\nIndia\nDublin 2, DO2 HH27\nIreland\nLimerick, V94 Y7Y3\nIreland\nVine Street\nUxbridge, Middlesex, UB\n81JG United Kingdom\nPettenkoferstrasse. 18\n80336 Munich, Germany\nTarrytown, NY 10591\nUnited States\nNew York Industrial Operations and Product Supply\nRensselaer, NY 12144\nUnited States"
    },
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/science/technology",
        "Content_Type": "Website Content",
        "Raw_Text": "Innovative Technologies Lead to Medical Progress\nTechnology for now and the future\nTechnology is foundational to our work inventing new medicines, regardless of modality. By combining the deep scientific expertise of our team with our proprietary VelociSuite® technologies, as well as other complementary technologies, we accelerate the way medicines are traditionally discovered and developed. Building on our portfolio of primarily homegrown medicines, we continue to evolve our approach to antibody discovery and development, while also exploring new methods of addressing human disease, like gene editing and cell therapy.\nOur VelociSuite® technology platform\nOverview\nOur industry-leading capabilities for antibody target discovery and validation are enabled by a series of Regeneron-invented technologies that accelerate, improve and disrupt the traditional process. VelociSuite includes some of the most valuable biotechnologies ever created and has enabled the development of a substantial proportion of all original, FDA-approved or authorized fully human monoclonal antibodies currently on the market.\nThese tools ultimately allow us to help more patients around the world, faster. Regeneron also provides the VelociSuite technologies to its collaborators as vital services to assist in the drug discovery and development process.\nVelociGene®\nVelociGene facilitates the rapid, automated and high-scale manipulation of mouse DNA, with almost no limitations on the size and sophistication of these modifications. This enables unprecedented speed and capacity for the validation of therapeutic targets and the creation of animal models of human disease – critical first steps in the process of developing new medicines.\nVelocImmune®\nVelocImmune is our unique technology for producing optimized fully human monoclonal antibodies. It utilizes a proprietary mouse platform engineered with a genetically humanized immune system. VelocImmune creates a multitude of antibody drug candidates efficiently and directly from immunized mice, overcoming limitations of traditional platforms by rapidly creating fully human antibodies that tightly bind to therapeutic targets and avoid potential negative immune responses that may occur in patients receiving antibodies that contain nonhuman (typically mouse) components.\nVelocImmune stems from Chief Scientific Officer George D. Yancopoulos’ work as a graduate student, when he was the first to envision making such a genetically humanized mouse.\nVelociMab®\nVelociMab is a group of technologies that allow us to move with unprecedented speed from identification of a therapeutic antibody into clinical studies. VelociMab enables the high-throughput screening of potential therapeutic antibodies and the rapid generation of cell lines for recombinant human antibodies. This allows us to select the best candidates and prepare them for initial manufacturing in record time – going from mouse immunization to production cell line bioreactor harvest within eight months.\nVelociMouse®\nVelociMouse is a breakthrough technology that enables the immediate generation of genetically altered mice directly from modified embryonic stem cells, thereby avoiding the need to breed multiple generations of mice. This technology has dramatically shortened the time needed to engineer genetically modified mice, while at the same time reducing costs and improving precision.\nVeloci-Bi®\nVeloci-Bi allows for the generation of full-length bispecific antibodies similar to native antibodies that are amenable to being made through standard antibody manufacturing techniques and are likely to have favorable, antibody-like pharmacokinetic properties.\nVelociVax™\nVelociVax enables us to generate and validate potential messenger RNA-based therapeutics in-house to support the preclinical advancement of vaccine and immune-modulating technologies for Regeneron and its partners. Our proprietary platform and service allow our teams to iterate quickly, combine new mRNA candidates with our broader oncology toolkit (including bispecific antibodies and checkpoint inhibitors) and explore future applications in other therapeutic areas.\nVelociT®\nVelociT is our service for producing genetic sequences for our partners and collaborators to assist in the creation of fully human therapeutic T-cell receptors (TCR) against tumor and viral antigens.\nVelociHum®\nVelociHum is our immunodeficient mouse platform that can be used to accurately test human therapeutics against human immune cells and to study human tumor models. Through genetic humanizations, VelociHum mice have been optimized to allow for better development of human immune cells in vivo, as well as to allow for engraftment of primary patient-derived tumors that do not take in other commercially available mice.\nVelocinator™\nVelocinator is a technology used to make molecules that induce modulation of a therapeutic target while bridged to an antigen-binding domain. This technology enables our drug discovery process with the identification of suitable therapeutic target pairings and optimization of the antigen-binding domains that bridge them.\nRegeneron is applying this technology to research new therapeutics in areas including targeted enzyme replacement therapies (ERTs), oncology and genetic medicines. Regeneron also provides Velocinator to collaborators to support drug discovery and development.\nRegeneron’s deep scientific expertise across modalities\nWe continually push the bounds of science to discover new ways to make a positive impact on human health – and this also applies to our technologies. Just as we have continued to develop the VelociSuite platform over decades, like with the addition of Veloci‑Bi, we are also pursuing other innovative ways to address diseases, including with genetic medicine approaches.\nBispecific antibody clinical progress thanks to advancing technologies\nTo solve the human body’s most complex mysteries, we must continually build upon our existing technologies, just as we have done with Veloci-Bi. We developed the platform to overcome common issues seen with other bispecific creation methods, such as undesired immune responses or instability in vivo. By addressing these hurdles, we can create high quality bispecific antibodies at fast speeds.\nAs our bispecific antibody pipeline matures, we are encouraged by progress to address solid tumors and hematological conditions. Check out our clinical pipeline to see our bispecific antibody candidates.\nTraps are one of our innovative protein therapeutic approaches\nOur Trap technology was motivated by a dissatisfaction with the specificity and binding affinity of human antibodies that could be developed using the most advanced antibody technologies at the time. Building on insights into the basic mechanisms of receptor action discovered at Regeneron, our scientists developed a general approach to create high-affinity blockers for many different types of signaling molecules. This novel Regeneron Trap technology creates circulating “decoy receptors” capable of reducing or eliminating the harmful effects of a signaling protein.\nExpertise in cell production\nOur EESYR®, FASTR® and NICE® technologies and services significantly increase protein-production yields in cell-line development for our research and clinical programs, as well as for our partners:\n- EESYR provides site-specific integration into a transcriptional hot spot in the eukaryotic cell genome, resulting in rapid isolation of cells capable of high-level expression of recombinant therapeutic proteins\n- FASTR is a quantitative cell-surface display technology that enables the use of flow cytometry to select eukaryotic cells that secrete the highest levels of recombinant therapeutic proteins\n- NICE enables the control of the expression of secreted, recombinant therapeutic proteins in eukaryotic cells\nOur rapid response to infectious diseases\nWe are always looking for ways to make the drug discovery process faster and more efficient, especially when help is desperately needed in a short amount of time. To address emerging or rapidly spreading infectious diseases, Regeneron has applied our VelociSuite technologies in a “rapid response” manner that parallel tracks certain steps and speeds hand-offs between groups in order to advance novel antibody treatments faster than ever. We’ve been proud to apply our homegrown technologies and novel scientific approach to respond to public health challenges like Ebola, Middle Eastern Respiratory Syndrome (MERS) and COVID-19."
    },
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/science/technology/antibodies",
        "Content_Type": "Website Content",
        "Raw_Text": "Pioneers in Antibody Research\nAntibodies at work\nAntibodies are Y-shaped proteins produced by the human body as part of a normal immune response to foreign molecules. Molecules from invading organisms – such as viruses, bacteria and other harmful organisms – are called “antigens” and prompt the body’s B-cells to make antibodies by the billions. Each antibody has two antigen-binding sites (one on each arm of the Y) and works to neutralize these invaders.\nAntibody medicines are designed to emulate this natural disease-fighting process and, with the help of scientific innovation, do much, much more.\nAntibodies as medicines\nAntibody medicines are based on key principles of biology and mimic the natural defenses and pathways of the human body and immune system. Scientists look at how antibodies work in order to replicate and optimize them against specific disease targets. Now antibody medicines can be created in a lab and given to people who need them for a specific medical purpose. These antibody medicines are derived from living organisms, not from chemical processes like most pills. Because antibody medicines specifically target disease-causing antigens, they are designed to avoid unwanted effects on other cells in the body.\nAntibody medicines have been proven to change lives and have altered the course of the treatment of serious diseases like asthma, cancer, heart disease, severe eczema, Ebola and COVID-19 over the past several decades.\nAntibody creation: The Regeneron approach\nAt Regeneron, we know that not all antibody medicines are created equal. Antibody medicines are discovered, developed and tested through a rigorous process that can take up to 20 years, and require special expertise. At Regeneron, our innovative technologies have accelerated and improved this traditional process. We are antibody pioneers. Our deep scientific expertise has allowed us to discover, develop and manufacture many antibody medicines – and antibody-targeted medicines – from beginning to end.\nFollow each step to see our approach in action\nTarget discovery and validation\nThrough researching human biology, our scientists identify targets that can be linked to the onset, progression or even prevention of a disease. After a target is identified, it is often validated through further research in animal models.\nRegeneron’s process starts with our deep belief in the power of genetics and our fundamental understanding of basic biology. In the early 2000s, we generated one of the first “knockout” mice in biotech history, which allowed us to study how certain genes (or the absence of certain genes) affect health and disease.\nOur continued leadership in mouse genetics capabilities – a key stepping stone for the development of antibody medicines – resulted in the development of our VelociSuite® technologies, starting with VelociGene® and VelociMouse® for superior disease modeling and target exploration.\nWe continue to push the frontiers of genetics research with the Regeneron Genetics Center® – one of the largest and most ambitious efforts to pair human DNA sequences with deidentified health records to find rare people who are resistant to disease so that we can identify new drug targets and facilitate better treatments.\nVelociGene rapidly tests and validates drug targets in mice and, in 2006, was selected as the technology of choice by the National Institutes of Health in the “Knockout Mouse Project,” an unprecedented effort to determine the function of thousands of unknown genes.\nVelociMouse dramatically shortens the timeframe needed to engineer genetically modified mouse models, while reducing cost and improving precision.\nTherapeutic development and preclinical research\nOnce a target is validated, a specific antibody is identified, developed and optimized. After a viable antibody is discovered, it is tested in preclinical disease models to measure its effects and safety. In order to test the medicine, it’s necessary to find a way to increase production of the antibody in small but consistent batches.\nRegeneron's core capabilities for the discovery and development of antibody medicines are enabled by VelociMab® and VelocImmune®, which efficiently produce a multitude of optimized fully human antibody medicine candidates.\nVelociMab enables high-throughput screening of potential therapeutic antibodies and the rapid generation of cell lines for recombinant human antibodies, a necessary step to arrive at the production scale needed for clinical testing.\nVelocImmune is the leading platform for the efficient production of fully human antibodies. The genetically modified VelocImmune mouse is extraordinarily productive at generating antibodies that can be rapidly reformatted into medicines.\nWhile VelocImmune mice have been genetically modified to produce human antibodies, their immune systems have been precisely maintained to operate as those in normal mice. This enables a process of natural selection to produce optimized antibody candidates that are well-suited to become medicines, thereby increasing overall efficiency in the drug-development process.\nClinical development\nOnly the safest, most precise and effective antibody medicines move on for testing in people. Researchers work with regulatory authorities to design clinical trials that answer specific questions related to a medicine’s safety, optimal dosing and efficacy. Clinical trials typically follow a three-phased process and grow in scale over each phase. This process can take several years to complete. The resulting data are shared with regulatory authorities around the globe who will independently assess the safety and efficacy of the antibody medicine.\nOur innovative mindset extends beyond the labs, as we seek to make clinical trials safer, more efficient and more informative.\nLearn more about our robust pipeline of investigational product candidates that strive to address a broad range of serious medical conditions.\nManufacturing for commercial use\nAntibody medicines must be manufactured on a large scale in order for them to be available for appropriate patients. This is a highly integrated bioengineering process that requires consistency and reliability to meet regulatory requirements.\nAt Regeneron, we don’t believe that all antibody medicines are created equal. We take pride in our superior manufacturing processes, facilities and Industrial Operations and Product Supply (IOPS) team, which enable the reliable, safe and consistent creation of antibody medicines. We are constantly seeking improvements to enhance the elegance and efficiency of these processes.\nAntibodies of the future\nAntibody medicines are an established class of treatment that are only getting better with the help of cutting-edge science. Regeneron is leading the way, developing new technologies to help discover better and novel antibody medicines. While most of our approved medicines are fully human monoclonal antibodies, we are exploring newer types of antibody medicines, including bispecific antibodies and antibody drug conjugates (ADCs).\nAdvancing the science of bispecific antibodies\nBispecific antibodies are engineered to bind two different molecular targets – meaning each arm of the “Y” reaches out to attach to something different. For example, one arm may attach to a tumor cell while the other captures a T-cell. The antibody medicine activates the T-cell to attack and destroy the harmful tumor cell.\nWe are applying our powerful development platforms to design minimally engineered, fully human bispecific antibody medicines that resemble naturally occurring antibodies as closely as possible. Veloci-Bi® allows for the generation of full-length bispecific antibody medicines that can be made via standard manufacturing techniques with the goal of having favorable properties similar to natural antibodies.\nRetargeted antibodies\nTapping into our deep expertise in antibodies, Regeneron is uniquely suited to select exquisitely specific antibodies paired with genetic editing tools to deliver the tools directly to the tissue. Delivery of genetic editing tools – gene editing like CRISPR, gene silencing or siRNA, and gene therapy – is a particularly challenging part of genetic medicines, making our retargeted antibodies a useful delivery mechanism for this approach."
    },
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/science/technology/genetic-medicines",
        "Content_Type": "Website Content",
        "Raw_Text": "The Future of Medicine is Now\nUnlocking the potential of genetic medicines\nWe drive the innovation and the discovery of life-changing medicines by being open to multiple approaches, combining existing technologies and finding connection points in new and exciting places. Genetic medicines aim to modify genomes, enabling the expression, silencing or editing of genes. These techniques offer promising solutions for addressing various diseases and medical conditions.\nIn pursuing genetic medicines research, we’re always making connections. Leveraging a versatile approach, we utilize and combine existing technologies in new and exciting ways, which means we don’t just stop at the use of antibodies. Because now, we’re creating antibody-retargeted adeno-associated viruses (AAVs) to deliver any gene such as for editing or silencing, expanding Regeneron’s tool kit of therapeutic modalities.\nWith multiple genetic medicines-based technologies at our fingertips, we now have the potential to address the most promising genetic targets, driving forward scientific progress to change lives.\nOur commitment to exploring multiple strategies leverages our antibody, biology, genetics and technology development expertise, all under one roof, to bring new medicines to people in need. Additionally, we have the capability to utilize the Regeneron Genetics Center® (RGC™) for target identification, ensuring innovative and targeted treatments for improved patient outcomes.\nGenetic technologies at work\nGenetic medicines allow Regeneron to pursue important targets and programs beyond what we can with antibodies alone. We are advancing best-in-class genetic medicine technologies by applying our existing industry-leading technology platforms, like VelociSuite®. We are also continuing to build in-house expertise and leverage industry collaborations, all to pursue therapeutic targets with the best-suited modalities.\nNext generation delivery and payloads\nRegeneron’s distinctive approach to tackling difficult-to-treat diseases centers around combinations of novel payloads, viral vectors and antibodies to enhance target specificity and reduce doses for improved safety and efficacy.\nBy synergistically combining these technologies with VelociGene®, our landmark mouse model platform, we can test and validate antibody targeting of genetic medicines to achieve precise delivery to target tissues — offering a versatile, highly effective approach to treating diverse diseases.\nGene editing\nWe utilize gene editing to disrupt genes and rethink conventional gene replacement therapy. We’re developing a targeted gene insertion platform combining gene delivery using adeno-associated viruses (AAVs) with CRISPR technologies to enhance the durability of genetic medicines for the treatment of several disorders where early intervention may be key, like hemophilia B and Pompe disease.\nOur external collaborations facilitate the exchange of knowledge and innovative treatment approaches, while our genetics expertise and genomics foundation serve as the backbone of these partnerships. Regeneron, along with Intellia, were the first to successfully use CRISPR for transthyretin amyloidosis in a single dose in a clinical trial. These successes open up the possibility for providing potential lifelong treatments for serious diseases.\nGene silencing\nRegeneron is at the forefront of siRNA drug discovery and development. With access to a vast database of exome sequencing data and genetic target insights collected by our Regeneron Genetics Center (RGC), along with state-of-the-art humanized mouse models, complemented by our commitment to collaboration with RNAi leader Alnylam, we are equipped with the tools to advance multiple siRNA programs, many of which are currently in preclinical and clinical testing.\nUsing a multipronged approach to deliver oligonucleotide therapies across tissues and cell types, we’re tapping into our understanding of antibody delivery to transport genetic medicines to difficult-to-reach tissues and organs, including the central nervous system.\nDisease areas in focus\nWith our deep understanding of human biology and genetics, our rigorous, science-led approach to discovery is poised to inform the next wave of medicines, life-changing medicines, for the most difficult-to-treat diseases. By uniquely understanding the breadth and depth of genetic abnormalities through RGC insights, we are able to translate near-term results into long-term gains, increasing accuracy in the way we select accessible targets for genetic medicines.\nNeurological diseases\nIn the pursuit of breakthroughs in neurological diseases, genetic medicines play a vital role in transforming the landscape of treatment options. Regeneron is pioneering the application of siRNA technology in addressing life-altering diseases like Alzheimer's disease, Huntington’s disease, amyotrophic lateral sclerosis and pain, paving the way for innovative and potentially transformative therapies for patients and their families.\nCardiometabolic disorders\nCardiometabolic disorders comprise a broad spectrum of diseases like heart failure and liver diseases, and represent a significant healthcare challenge. Genetic medicines represent a promising solution to address this diverse array of conditions. Regeneron is already making strides in the field of obesity by investigating gene silencing technology, reflecting our commitment to pioneering innovative therapies in the field.\nLysosomal storage disorders\nRegeneron’s precision antibody-targeting technology has paved the way for a novel method of delivering replacement enzymes. Our successful invention of an array of antibodies specifically designed to target enzyme replacement therapies to their intended target tissue provides a promising treatment approach for lysosomal storage disorders. This approach may offer new possibilities for more effective therapies in the field of genetic medicines.\nHearing loss\nBy focusing on places where local delivery is an option, like the inner ear, we can easily assess novel therapies without the complications of systemic delivery. Having a well-defined genetic lesion instills greater confidence in inner ear drug delivery, making it a crucial preliminary step before addressing more complex hearing loss disorders.\nRegeneron’s pioneering AAV technology and knowledge of the inner ear is enabling rapid advancement of therapeutic candidates. By identifying patients with specific genetic mutations related to hearing loss and utilizing cutting-edge mouse models, we can gain deeper insights into the intricate biology of hearing disorders and bring life-changing medicine to the clinic.\nEye diseases\nRegeneron aims to restore vision by targeting age-related macular degeneration, diabetic retinopathy and glaucoma, leveraging our existing technology to ensure safety and efficacy through genetics-based approaches.\nOur goal is to create interventions using siRNA technologies that allow for reduced dosing frequency, thereby minimizing the need for repeated administration. Furthermore, we aspire to extend this technology to cure individuals with current blindness, employing breakthrough techniques, such as optogenetics.\nMusculoskeletal disorders\nWith approximately 1.7 billion people worldwide affected by musculoskeletal disorders and significant unmet needs persisting, gene therapy stands out as a crucial solution, particularly for inherited diseases like myasthenia gravis. Regeneron is uniquely positioned to take on this challenge and revolutionize the treatment landscape for musculoskeletal disorders by tapping into our understanding of antibody targeting to transport genetic medicines beyond the liver and redirect viral particles to skeletal muscle to deliver therapy."
    },
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/stories/stem-fueled-student-programs",
        "Content_Type": "Website Content",
        "Raw_Text": "STEM-Fueled™: Our Future Depends on the Next Generation of Innovators\nRegeneron\nNovember 05, 2025\nSTEM is driving progress across every part of society — from the technologies that help us work smarter and faster, to the breakthrough medicines that help us lead healthier lives, to the innovations that help our planet thrive. In the U.S. alone, one in four1 workers has a STEM-related role, and the demand is only rising. Employment in STEM fields is projected to grow more than 8% by 20342, adding nearly 900,000 new jobs in the U.S. — triple the pace of other fields.\nYet even as the world is counting on the next generation of innovators, many students are underprepared, and their teachers lack the resources to nurture future STEM leaders. Fewer than one third3 of U.S. high school graduates meet college readiness benchmarks in STEM subjects, and more than half4 of U.S. states report a deficit in qualified STEM teachers. As a science-led company, we at Regeneron know we have a responsibility to ensure future innovators have the opportunity, tools, and support to solve the world’s greatest challenges.\n“At Regeneron, we believe the future of science depends on sparking curiosity, cultivating potential, and unlocking opportunities for the next generation of innovators,” said Christina Chan, Senior Vice President, Corporate Affairs. “With more than 90% of our community investments dedicated to strengthening the STEM ecosystem, we strive to inspire and fuel bright young minds — including those who haven't always had opportunities within reach — to become tomorrow’s STEM leaders.”\nIntroducing STEM-Fueled™\nFor more than a decade, Regeneron has invested in STEM programs that ignite opportunities for students, teachers, and communities.\nSTEM-Fueled represents our collection of longstanding programs and partnerships that strengthen the STEM ecosystem — fueling future scientific innovators to pursue bold ideas and advance world-changing solutions.\nThis comes to life across three focus areas:\n- Creating pathways by ensuring that students have the resources, mentorship, and real-world experiences to pursue careers in STEM;\n- Championing educators by equipping them with the critical resources needed to empower future scientific innovators;\n- Celebrating science by recognizing and rewarding emerging leaders who have the potential to shape our future.\nWhy is STEM Important to Regeneron?\nFor National STEM Day 2025, we asked Regeneron leaders who help advance this work to share why STEM-Fueled is essential to our company, our communities, and our future.\n“We engage students at every stage of their STEM journey — from elementary school to high school and through to postdoctoral research. We’re not just lighting that initial spark; we’re keeping it burning through mentorship, opportunity, and real-world experience so they can pursue careers in STEM and change the world.”\nLinnea Texin, Executive Director, Corporate Responsibility\n“It requires a village to nurture talent and reach students — including teachers, communities, parents, and beyond. When we invest in this network and in students’ full journey, we can nurture their interest and development in STEM.”\nPotoula Stavropoulos, Senior Director, Social Impact\n“Having experienced the power of STEM programs both as a participant and a mentor, I’ve seen how transformative they can be. They changed my own life, and I’ve made it my mission to open doors for young people and give them the same exposure that inspired me.”\nDavid Glass, Vice President, Research, Aging/Age-Related Disorders\n\"We may not know when or where the next Einstein will emerge, but we do know that brilliance thrives when nurtured. That’s why we are committed to investing in students pursuing STEM fields, providing them with the support and guidance they need to succeed on their journey.\"\nLyndon Mitnaul, Executive Director, Research Initiatives, Regeneron Genetics Center\n\"Success to me is seeing the spark ignite in a student’s eyes as they experience STEM. It’s hearing them say ‘That program was the turning point for me — it opened the door to STEM and gave me the confidence, skills, and passion to chase my dreams.’ It’s about inspiring the next generation to dream big and believe in their limitless potential.\"\nAmanda D’Agnese, Senior Manager, Corporate Communications\n“To me, success means continuing to advance our mission by opening the doors of STEM to more students and ensuring they have access to meaningful experiences that inspire them to become the scientists and innovators who discover what’s next.”\nWanda Sharif, Senior Scientist\nLooking Ahead\nSince 2020, we have brought more than 3 million STEM experiences to students through Regeneron-supported programs, and we aren’t slowing down. As we look ahead, we will continue to advance STEM-Fueled to inspire, equip, and propel the next generation of innovators who will change our world.\nReferences\n- The STEM Labor Force: Scientists, Engineers, and Skilled Technical Workers. U.S. National Center for Science and Engineering Statistics (NCSES). May 30, 2024. Accessed October 14, 2025. https://ncses.nsf.gov/pubs/nsb20245/#utm\n- Employment in STEM Occupations. U.S. Bureau of Labor Statistics. August 29, 2024. Accessed October 14, 2025. https://www.bls.gov/emp/tables/stem-employment.htm\n- Science and Engineering Indicators 2023: The State of U.S. Science and Engineering. National Science Board. 2023. Accessed October 14, 2025. https://ncses.nsf.gov/pubs/nsb202331\n- STEM Teachers Needed. Melanie Olmstead. March 12, 2024. American Board. Accessed October 14, 2025. https://www.americanboard.org/blog/stem-teachers-needed/?utm\nMore Regeneron Stories"
    },
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/stories/celebrating-hope-nsclc",
        "Content_Type": "Website Content",
        "Raw_Text": "Unwavering Hope in the Face of NSCLC\nCelebrating the strength and determination of patients living with advanced lung cancer.\nRegeneron\nNovember 17, 2025\nEvery cancer journey is unique, but stories of resilience and advocacy often resonate universally. At Regeneron, we are inspired by the courage and determination of Jennifer Crowell, a remarkable woman living with stage 4 non-small cell lung cancer (NSCLC).\nCommon Themes: Resilience and Advocacy\nJennifer Crowell’s journey shines a light on two central themes: the strength to persevere through life’s challenges and the importance of advocating for oneself and others. Her experience highlights the power of resilience, advocacy, and gratitude in navigating life with cancer.\nJennifer Crowell with dog\nStrength Through Adversity\nJennifer Crowell's life changed unexpectedly when a routine CT scan revealed a lung nodule. Despite the challenges of her diagnosis, a broken hip and the ups and downs of treatment, her journey has reshaped her perspective, making her more grateful and bold.\nAdvocacy and Gratitude\nAdvocacy and appreciating the positive moments have been a cornerstone of Jennifer’s story and is an important part of any cancer journey. Jennifer emphasizes the importance of self-advocacy, and encourages patients to ask questions, “Never be afraid to advocate for yourself and ask questions. It's your life, your body.” She credits her support system, her family, friends, and caregivers, as essential to her outlook.\nJennifer highlights the importance of gratitude, whether it’s for the people who help along the way or the opportunities to find joy amidst challenges. “The best advice I can offer is to practice gratitude. Find ways to accept all of the feelings that accompany you on your cancer journey but try to be grateful to the people helping you along the way, and that alone may improve your outlook,” she says.\nInspiring Lessons\nThe lessons from Jennifer’s story offer inspiration for anyone facing life’s challenges. Life’s hardships may reshape us, but they don’t have to define us and taking an active role in your care, finding gratitude and leaning on a support system can make all the difference.\nRegeneron’s Commitment to Progress\nJennifer's story reminds us of the importance of ongoing innovation in cancer research. We are dedicated to transforming cancer care and working toward a future where a lung cancer diagnosis is met with treatment options and hope.\nHer journey inspires us to keep pushing boundaries in science and medicine, ensuring that every patient has the opportunity to write their own story of resilience and advocacy.\nMore Regeneron Stories"
    },
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/stories/advancing-copd-care",
        "Content_Type": "Website Content",
        "Raw_Text": "Rethink COPD: Uniting for COPD Care Across the Globe\nDiscover what it means to unite science, collaboration, and advocacy to help advance COPD care\nRegeneron\nNovember 11, 2025\nChronic obstructive pulmonary disease (COPD) affects over 400 million people worldwide, yet the disease remains underdiagnosed, misunderstood and overlooked by the public.1\nStudies have shown that 45% of the public cannot identify COPD as a lung disease, despite the disease claiming more lives annually than lung and breast cancer combined.2 This lack of awareness contributes to stigma, delayed diagnoses and slows progress in treatment and care. Misconceptions about COPD are a serious barrier to appropriate disease management, leaving the COPD community to struggle without adequate support or understanding.\nBecause COPD is a progressive disease, every exacerbation, or an acute worsening of symptoms, may lead to permanent damage to the lungs and may trigger more severe and more frequent exacerbations in the future. Worsening lung function can make people feel breathless and even contribute to difficulty speaking, which may isolate people from their families and communities.\nBut it’s not just the physical symptoms. COPD can also hinder daily routines and diminishes people’s ability to engage in everyday tasks. Activities like household chores can become exhausting, while hobbies that once brought joy, like dancing or gardening, may feel out of reach.\nCaregivers of people with COPD also face their own struggles. Both patients and caregivers can struggle to navigate the complexities of the disease often without sufficient support or understanding from those around them.\nAt Regeneron, we collaborate with the healthcare community to help advance scientific understanding of the underlying role different types of chronic inflammation play in disease progression, which has paved the way for innovative approaches to disease management.\nAt the same time, we’re building bridges between medical professionals, advocacy groups, and policymakers to fuel innovation and help improve patient outcomes. Through our support of the Copenhagen Institute of Future Studies’ COPD Index, we’ve helped create a data-driven tool that evaluates countries’ approaches to COPD, highlighting best practices and areas for improvement. Expanding soon to 43 countries, including regions in Africa and Latin America, the Index serves as a critical resource to help engage decision-makers, address challenges, and drive global policy action to improve care.\nWe advocated for the formal recognition of chronic respiratory diseases like COPD in the United Nations Political Declaration on Non-Communicable Diseases. COPD has historically received less attention compared to other chronic conditions, despite being the fourth leading cause of death globally.3 This recognition by the UN could underscore the significant toll of COPD on patients and healthcare systems as well as the urgency of prioritizing potential solutions.\nThroughout these efforts, it's important to keep in mind the people whose lives are directly shaped by COPD: patients, caregivers, and advocates whose stories drive us to act.\nKaren has been living with COPD for over two decades. She describes herself as once being very active, but now her condition has profoundly changed her daily life, making everything from walking up stairs to visiting friends and family more difficult. Despite these challenges, Karen has become a passionate advocate for the COPD community. With the support of her daughter, Karen continues to raise awareness and push for better resources. \"My daughter enables me to travel so that I can be an advocate. She’s more than willing to help me be the person I am.”\nKaren, United States\nIngo, Germany\nIngo has noticed his COPD has progressed over the past six years. Activities that used to be easy have become more difficult and he’s had to build in more breaks throughout his daily routine to allow himself rest to catch his breath. However, he says he feels lucky to have a partner to navigate the challenges with him. “I have a very dear life partner, and she deserves the utmost respect because she helps me with everything. She tries to adapt her life to my needs and my illness. She fully understands and encourages me.”\nCaregivers like Kazuko play an essential role in navigating the condition. However, few of them feel prepared for the emotional and physical responsibility of supporting a loved one with COPD. “Before my husband was diagnosed, I didn’t know anything about the disease,” she said. Over time, she found support through an advocacy group, which helped her understand COPD better and feel less alone. For Kazuko, this community was an important resource as she navigated caring for the demands of COPD. “I was able to learn a lot, which made a big difference in my life.”\nKazuko, Japan\nAt Regeneron, we are continuing our efforts to advance COPD research and advocacy so that people living with COPD and their communities have the resources they need to navigate the disease.\nLearn more about changing the paradigm in COPD here.\nReferences\n- Boers, E., Barrett, M., Su, J. G., et al. (2023). Global Burden of Chronic Obstructive Pulmonary Disease Through 2050. JAMA Netw Open. 6(12):e2346598. DOI: 10.1001/jamanetworkopen.2023.46598\n- Copenhagen Institute for Future Studies (2024). COPD Index. Accessed September 15, 2025.\n- World Health Organization, Chronic obstructive pulmonary disease (COPD). 6 November 2024. https://www.who.int/news-room/fact-sheets/detail/chronic-obstructive-pulmonary-disease-(copd)\nMore Regeneron Stories"
    },
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/stories/the-future-of-crispr-and-genetic-medicines",
        "Content_Type": "Website Content",
        "Raw_Text": "Rewriting the Code: The Future of CRISPR and Genetic Medicines\nJoin us for the third episode of The Nucleus\nLeah Sabin, PhD\nExecutive Director, Genetic Medicines, Regeneron\nJanice Chen, PhD\nCo-founder and Chief Technology Officer, Mammoth Biosciences\nIn this episode of “The Nucleus” by Regeneron, host Leah Sabin, PhD, Executive Director, Genetic Medicines at Regeneron, is joined by Janice Chen, PhD, co-founder and Chief Technology Officer at Mammoth Biosciences, for an in-depth conversation on the evolution and future of CRISPR technologies, and its impact on genetic medicines. The discussion explores how CRISPR has evolved: from cutting faulty genes to becoming a versatile platform for precision editing. It also touches on Mammoth’s development of ultra-compact nucleases and the ways in which Regeneron and Mammoth are collaborating to solve the challenge of delivery.\nRecorded at the 2025 American Society of Gene & Cell Therapy (ASGCT) annual meeting, the episode dives into emerging trends like epigenetic editing, innovative delivery platforms, and strategies to mitigate immunogenicity. Leah and Janice examine industry challenges like off-target effects and the need for redosing, while emphasizing the importance of expanding gene editing beyond the liver to address a wider range of diseases. Together, they offer a forward-looking perspective on the future of CRISPR and the collaborative breakthroughs shaping tomorrow’s therapies.\nMore Regeneron Stories"
    },
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/science/research-development",
        "Content_Type": "Website Content",
        "Raw_Text": "OUR GREATEST DISCOVERIES\nHAVE YET TO BE MADE\nWe use science to solve the human body’s most complex mysteries. With our deep expertise in genetics, biology and technology, we pursue multiple therapeutic approaches – from biologics to genetic medicines to cell therapies – to revolutionize medicine.\nFollow the path to groundbreaking treatments\nThe path from early research to delivering a new medicine to a patient can be long and circuitous. It rarely goes in a straight line, and instead requires flexibility and iteration as we learn more about the disease, therapeutic interventions and patient needs. We take a data-driven, interdisciplinary, problem-solving approach to identify and develop new treatments. From a bird’s eye view, learn how we tackle our mission of turning science into medicine.\nGain a deep understanding of human biology and genetics\nOur scientific philosophy centers on applying our understanding of biology and human genetics to identifying potential new and effective disease targets. We also tap into genetics to validate existing programs and optimize our clinical trials. By understanding the genetic underpinnings of the disease – when it is genetically-driven – we strive for a more precise approach to discovering and developing a treatment.\nRegeneron Genetics Center® (RGC) enables a deeper understanding of the genetic drivers of human health and disease through large-scale human genomics research.\nFollow the science for unexpected breakthroughs in diverse areas of study\nWe pursue research in a wide range of conditions, from ophthalmology to cancer to inflammation to cardiovascular disease. As we develop new technologies, we look for ways to apply them where there is patient need, opening doors to treating a plethora of diseases through innovative scientific approaches. We also seek ways to expand our existing clinical and commercial medicines to more indications and patients, where appropriate, by exploring the common drivers between different diseases.\nOur research areas of current focus:\nThese pages contain information concerning investigational candidates or uses that have not been reviewed or approved by any regulatory authority.\nEvaluate the appropriate therapeutic mechanism of action for each disease\nNot every therapeutic “tool” or type of medicine works for every disease, so we have built a robust “toolbox” of varied investigational therapeutic approaches that we are researching – sometimes in combination – from which we can draw. These approaches include protein therapeutics (for instance antibodies or our Regeneron Trap technology), genetic medicines (for instance gene therapy, gene editing or gene silencing) and cell therapy. Some programs start with a disease target and others start with the therapeutic approach, either way moving toward matching up the two.\nPioneers in antibody medicine\nOur scientists are leading the way, developing new technologies to help discover better and novel antibodies, including monoclonal, bispecific and costimulatory antibodies. Discover the past, present and future of antibody medicine.\nAdvancing genetic medicines\nWe realize different diseases need different approaches – and by following the science, we expanded our “toolbox” of therapeutic approaches to include genetic medicines. Learn about how we’re combining our viral vector and antibody delivery capabilities with gene editing and more.\nBuilding cell therapies\nTo realize the full potential of cell therapies, we are advancing the next generation of cell therapies by applying deep T-cell therapy technical knowledge and exploring combinations with Regeneron’s proprietary antibodies and bispecifics.\nEmbed innovative technology into drug discovery and development\nWe build proprietary technologies that help identify and advance the best-suited therapeutic approach for each disease. With nearly four decades of technology platform experience, we strive to create efficiencies and repeatability in drug development through the innovative use of groundbreaking technologies.\nRevolutionizing how to make medicine\nOur multiple proprietary technology platforms, including our bottleneck-breaking VelociSuite® technologies, improve and accelerate the way medicines are traditionally discovered and developed. We’ve raised the bar for R&D excellence and productivity in biotech.\nManufacture investigational and approved medicines with excellence and a continual improvement mindset in order to help patients around the world\nOur manufacturing team is similarly grounded in science and technology, and is integrated into our discovery and development process from the start. We invent new and optimize established processes to consistently produce high-quality and stable drugs for clinical trials and approved usage. By applying a deep understanding of the biochemical and biophysical properties of the drug with our proprietary platform technologies, we then produce our medicines for people in need at large scale.\nRigorously study safety and efficacy, with the patient always in mind\nOur pipeline of investigational medicines is comprised of primarily homegrown therapeutics for dozens of diseases and is powered by end-to-end research and development capabilities, from the earliest stages where we identify promising drug compounds through our full clinical development process.\nDeliver our approved or authorized medicines\nOur goal is to address serious medical conditions across multiple and diverse therapeutic areas. Our approved and authorized medicines are manufactured at the highest quality and delivered to patients around the globe."
    },
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/responsibility/our-approach",
        "Content_Type": "Website Content",
        "Raw_Text": "Our responsibility goals\nRegeneron’s 2025 responsibility goals reflect our mission to bring important new medicines to people with serious diseases. We engaged stakeholders and used leading corporate responsibility frameworks, including the United Nations Sustainable Development Goals (SDGs), to help guide the development of our 12 responsibility goals and accompanying environmental targets.\n- Use the power of science to discover and advance important new medicines while continuing to make substantial investments into R&D.\n- Identify genetic insights that will support the discovery and advancement to tomorrow's medicines through our Regeneron Genetics Center®.\n- Support organizations that offer disease prevention, diagnosis and treatment for people touched by serious diseases.\n- Set fair, value-based prices for our medicines and break down barriers to patient access.\n- Cultivate a leading employee experience that is rooted in our unique science-driven culture.\n- Foster a welcoming culture that enables colleagues with different perspectives and backgrounds to thrive.\n- Be vigilant in ensuring integrity remains at the core of how we operate.\n- Implement continuous improvements to uphold our high-quality, safe and reliable product supply.\n- Make Regeneron the safest part of people’s day by focusing on prevention in our drive towards zero incidents.\n- Drive employee volunteer levels above standards.\n- Foster the next generation of scientific innovators by providing STEM experiences to 2.5 million students.\n- Achieve our environmental targets to help protect and restore the planet.\nOperational oversight\nRegeneron’s Board of Directors’ Corporate Governance and Compliance Committee oversees corporate responsibility and reviews progress against our responsibility strategy at least once a year. At the management level, our Responsibility Committee, composed of cross-functional leaders, is accountable for our responsibility strategy, goals and metrics.\nA Compliance Program With Science and Patients at the Core\nWhen your motivation is advancing science and helping as many people as possible, ethics and integrity come naturally.\nInnovating for Good\nApplying a toddler’s mindset to build resiliency and improve our world\nFueling Future Innovation: Cultivating Tomorrow’s STEM Leaders\nLearn how Regeneron transforms curiosity into lifelong scientific legacies and supports the next scientific generation through investments in STEM education.\nOur progress is being recognized\n*As of December 2024"
    },
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/about/leadership/leonard-schleifer",
        "Content_Type": "Website Content",
        "Raw_Text": "The real healthcare problem\nWe are taking the long view by investing in innovation to tackle society's biggest health challenges.\nLen grew up in Queens, New York, with parents and teachers who sparked his passion for science and entrepreneurship from a young age. He earned his M.D. and Ph.D. in pharmacology from the University of Virginia and became a licensed physician certified in neurology. While working as a practicing neurologist and professor at Cornell Medical School, Len became frustrated with the lack of effective treatments for patients with serious neurodegenerative diseases like Parkinson’s and Alzheimer’s. He wondered if new biotechnologies could be harnessed to potentially make an impact for these people, their families and many others.\nLen founded Regeneron in 1988, with the vision of creating a company built entirely on science, where scientists are the heroes, and everyone works toward the common goal of helping patients. He knew he needed a top-notch team and immediately recruited George D. Yancopoulos, a top scientist from Columbia University, as co-Founder, along with Nobel Laureates to the Board of Directors. Len's dream is now a reality, and the Regeneron team is using its scientific prowess to consistently and repeatedly bring new medicines to people in need.\nRegeneron maintains the proud distinction of being one of the most innovative biotechnology companies in the world, with numerous FDA-approved medicines and product candidates in development, almost all of which are homegrown in the company’s laboratories. Regeneron's medicines and pipeline are designed to help patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, neurological diseases, hematologic conditions, infectious diseases, and rare diseases.\nRegeneron is among the few pharmaceutical companies with the expertise and technologies to rapidly respond to global public health emergencies. The company pioneered the first effective antibody cocktail treatments for both COVID-19 and Ebola, collectively benefitting millions of people worldwide. In September 2025, Regeneron demonstrated its commitment to global health by announcing a donation of up to 500 doses of its Ebola treatment to the World Health Organization, specifically for use by governments in low- and lower-middle income countries. Simultaneously, the company rushed a delivery of doses and personal protection equipment (PPE) to the Democratic Republic of the Congo (DRC) to immediately address a rapidly escalating Ebola outbreak. These achievements, according to Len, are the result of decades of strategic investments in technologies that generate antibodies that, when directed toward a virus, could become an effective treatment approach.\nWe are taking the long view by investing in innovation to tackle society's biggest health challenges.\nInspired by his father’s words, “do well by doing good,” Len has consistently championed the integration of corporate responsibility into Regeneron’s core mission. This philosophy drives the company’s efforts to use its unique knowledge and expertise to benefit society, the economy and the environment. Regeneron’s approach prioritizes advancing scientific discovery, fostering a culture of integrity and excellence, and building sustainable communities. Regeneron invests heavily in STEM (science, technology, engineering and math) education efforts that fuel the next generation of scientific leaders.\nUnder Len’s leadership, Regeneron has been lauded as a top company to work for by Science magazine, Fortune, Forbes, Fast Company, and others. It has also been recognized for its commitment to corporate responsibility through inclusion in the Dow Jones Sustainability Index and the Civic 50 list of most community-minded companies, among others. In recent years, Regeneron has also been recognized for its pandemic response by organizations including Fast Company’s World Changing Ideas.\nIn 2019, Len was elected as a fellow by the American Association for the Advancement of Science (AAAS). He has been recognized by Barron’s Best CEOs and as an Ernst & Young’s Entrepreneur of the Year, alongside Dr. Yancopoulos.\nFor over 35 years, our mission has been to use the power of science to bring new medicines to patients. To achieve this, we seek to constantly improve the drug discovery and development process by applying our homegrown technologies, our deep understanding of science and our relentless spirit.\nProfessional Experience\nCo-Founder, President and Chief Executive Officer, Regeneron (1988-Present)\nChairman, Regeneron (1988-1995)\nClinical Professor of Neurology and Neuroscience, Department of Neurology, Weill Cornell Medical College (1992-Present)\nBoard co-Chair (2023-Present)\nEducation\nDoctor of Philosophy in Pharmacology at University of Virginia\nDoctor of Medicine in Pharmacology at University of Virginia\nBachelor of Arts at Cornell University\nHighlights of Honors & Awards\nBiotechnology Heritage Award, Science History Institute and Biotechnology Innovation Organization (2025)\nPrix Galien Roy Vagelos Pro Bono Humanum Award (2021)\nCrain’s New York Notables in Healthcare (2021)\nWalter Reed Distinguished Achievement Award (2020)\nForbes America’s 100 Most Innovative Leaders (2019)\nCornell Entrepreneur of the Year (2019)\nLegends in Leadership Award, Yale School of Management, CEO Institute (2017)\nErnst & Young Life Sciences Entrepreneurs of the Year National Award (2016)\nBarron’s World’s Best CEOs (2016)\nAn Unequivocal Victory for Innovation\nA recent Supreme Court decision helps patients by protecting the scientific innovation emerging from America’s thriving biopharma community.\nDoing Well by Doing Good\nView our Responsibility Report to learn how we address the issues that matter most to Regeneron's business and society in order to build resiliency and improve our world."
    },
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/about/leadership/george-yancopoulos",
        "Content_Type": "Website Content",
        "Raw_Text": "Our board co-Chair, president and chief scientific officer, George Yancopoulos, followed in his grandfather’s footsteps to pursue science. Watch to find out how he works every day to invent and discover the next new medicine that makes a difference in patient lives.\nGeorge D. Yancopoulos, MD, PhD\nEarly Life and Inspiration\nGeorge is a life-long New Yorker and the son of Greek immigrants. He attended New York City public schools and graduated as valedictorian of the Bronx High School of Science. At Bronx Science, he was a top winner of the nation's premier high school science competition, then known as the Westinghouse Science Talent Search, and now known as the Regeneron Science Talent Search. After high school, George attended and became valedictorian of Columbia College, subsequently earning his M.D. from Columbia University's College of Physicians and Surgeons and his Ph.D. in Biochemistry and Molecular Biophysics from Columbia University's Graduate School of Arts and Sciences. He launched his career as an academic scientist with Frederick W. Alt at Columbia, publishing seminal papers in molecular immunology.\nRegeneron Founding\nIn 1989, George left academia to become co-founder and chief scientific officer of Regeneron, alongside Leonard S. Schleifer, the company’s president and chief executive officer. Under their leadership, Regeneron has become one of the world’s premier biotech companies – largely based on his unprecedented record of creating game-changing biotechnologies that have already delivered many important new medicines, all the way from discovery to patients.\nScientific Innovation\nGeorge has been named among the ten most highly cited scientists in the world, making many significant discoveries – from defining underlying principles of antibody gene development, to identifying multiple new families of growth factors, to elucidating the fundamental principles of cytokine and interleukin receptor activation.\nHe, along with key members of his team, is the principal inventor and developer of many of Regeneron’s 14 medicines and important foundational technologies. For example, he is principal inventor and developer of two of the world’s leading medicines, which have collectively helped millions fight blindness and diseases like asthma, atopic dermatitis and eosinophilic esophagitis. In terms of enabling technologies that have delivered these medicines, George’s inventions include Trap (“Soluble Receptor”) technology, VelociGene® (high-throughput and mega-base-scale genetic-humanization technology) and VelocImmune® – a genetically-humanized mouse that efficiently delivers fully-human antibodies and bispecifics, including the first antibody cocktail treatments for Ebola and COVID-19. In addition, George’s team at the Regeneron Genetics Center® is emerging as world leaders in human sequencing, genetics-based target discovery and genetic medicines.\nLooking forward with hope\nWe believe in the importance of supporting young scientists.\nCorporate Responsibility\nInspired by becoming a winner of the Westinghouse Science Talent Search as a high school student, George spearheads many of Regeneron’s STEM efforts to similarly engage the next generation of scientists – leading Regeneron to commit over $100 million to support the world’s leading high school science competitions, including the Regeneron Science Talent Search (formerly Westinghouse and Intel) and the Regeneron International Science and Engineering Fair (formerly the Intel ISEF). Remarkably, more than half the students in these competitions come from immigrant families, just as George did, contributing to America’s long history of uplifting immigrants like Einstein, Tesla, and Larmarr. Regeneron’s focus on STEM is part of its overall Corporate Responsibility strategy, which uses its unique knowledge and expertise for the benefit of society, the economy and the environment.\nAwards & Recognition\nGeorge has received numerous honors, including induction into the National Academy of Sciences and the Biotech Hall of Fame, and being named E&Y’s Entrepreneur of the Year.\nProfessional Experience\nCo-Founder, President and Chief Scientific Officer, Regeneron, Tarrytown, NY (1989-Present)\nProfessor, Department of Microbiology, Columbia University (1996-Present)\nProfessor, Department of Microbiology, New York Medical College (1992-Present)\nBoard co-Chair (2023-Present)\nEducation\nDoctor of Philosophy in Biochemistry and Molecular Biophysics at Columbia University\nDoctor of Medicine in Biochemistry at Columbia University Vagelos College of Physicians and Surgeons\nBachelor of Arts in Biochemistry at Columbia College\nHighlights of Honors & Awards\nPrix Galien USA Best Biotechnology Product (2025)\nBiotechnology Heritage Award, Science History Institute and Biotechnology Innovation Organization (2025)\nCommunity Champion Award, Westchester Medical Center Health Network (2024)\nAtom Award, Bronx High School of Science (2023)\nPrix Galien USA Best Biotechnology Product (2022)\nPrix Galien Roy Vagelos Pro Bono Humanum Award (2021)\nFortune’s World’s 25 Greatest Leaders: Heroes of the Pandemic (2020)\nForbes America’s 100 Most Innovative Leaders (2019)\nLegends in Leadership Award, Yale School of Management, CEO Institute (2017)\nErnst & Young Life Sciences Entrepreneurs of the Year National Award (2016)\nBiotech Hall of Fame, Biotech Meeting at Laguna Niguel (2016)\nGeorge's Five Principles for Radical Innovation\nLearn about George’s approach to radical innovation for humanity.\nProblem Solvers of Tomorrow\nReview Regeneron's perspective on the importance of cultivating the next generation of scientists.\nPrix Galien Best Biotech Product\nRead about Regeneron's recognition for our breakthrough Ebola treatment."
    },
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/science/genetics-center",
        "Content_Type": "Website Content",
        "Raw_Text": "Genetic to Therapeutics, Designed For All\nPurpose-driven genomic research\nAt Regeneron Genetics Center® (RGC™), we are harnessing the power of human genetics to discover important new medicines, validate existing research programs and optimize clinical trials.\nWe tap into our growing database of nearly 3 million sequenced exomes and deidentified health information using proprietary data analytics, technology and human ingenuity to make meaningful biological discoveries at speed and scale.\nOur high-touch integrated model focuses on working closely with our collaborators to build a dataset with meaningful cohorts. We use innovative technologies, such as machine learning, to sequence exomes, align with health information and perform large-scale analyses to make meaningful associations between genes and diseases. As a wholly owned subsidiary of Regeneron, we apply our insights to guide Regeneron’s broader drug discovery and development efforts.\nBuilding a global genetic database\nGenetic databases function best as global resources when they reflect humanity’s broad spectrum of ethnic, racial and genetic diversity. Essential to their creation are global collaborations, which allow us to compile a representative dataset that enables us to uncover meaningful differences, including genetic mutations found only in certain populations that may cause or protect against disease. We are committed to responsibly enhancing representation in genomic research, as reflected in our 150+ global collaborations.\nHistorically, genomic research has over-indexed in studying people of European ancestry,1 creating gaps in our understanding of the genetic drivers of disease for other groups of people. With the ultimate goal of speeding up drug discovery and development for everyone, we are working with collaborators to enable access to more cohorts around the world to better understand the nuances of human genetics and biology while maintaining a high level of transparency and collaboration with local organizations and patients.\nAccess our genomic databases to learn more about the insights that drive our discoveries:\nMexico City Prospective Study Variant Browser\nGenetic variations observed in 9,950 whole genome sequenced individuals and 141,046 exome sequenced and genotyped individuals from the Mexico City Prospective Study (MCPS). Updated as of January 2023.\nHuman genetics guiding actionable discoveries\nGenomics has the potential to revolutionize how we approach drug discovery and development to find better ways to treat and prevent disease. And that is why RGC’s mission — genetics to therapeutics, designed for all — has allowed us to grow and maintain one of the world’s largest, most comprehensive genomic databases.\nGuided by data and analytics, our exploration of human genetics leads us to transformative discoveries and, ultimately, the development of cutting-edge therapeutics.\nExplore the impact of key discoveries:\nRare mutation in GPR75 gene associated with reduced risk for obesity\nThrough the genetic sequencing of nearly 650,000 people, our scientists discovered a rare genetic mutation in the GPR75 gene that is associated with reduced risk for obesity. We are pursuing therapeutic development programs using antibody, RNAi and small molecule approaches.\nMissense mutation in BRCA1 gene linked to breast and ovarian cancer\nBy studying a founder population of Orcadians, we identified a pathogenic missense mutation in the BRCA1 gene, variant V1736A, linked to cases of breast and ovarian cancer.\nRare mutations in CIDEB and HSD17B13 genes found to combat nonalcoholic steatohepatitis (NASH)\nCIDEB: We identified rare mutations in the CIDEB gene and discovered that those with one mutated copy of CIDEB had a 53% lower risk for nonalcoholic steatohepatitis (NASH). We are conducting preclinical research to develop a new medicine using an siRNA (gene silencing) approach.\nInnovative technologies\nOur innovative technologies enable us to quickly and effectively sequence exomes and analyze data. Through human ingenuity, machine learning, artificial intelligence and more, we maintain one of the biggest genome centers in the world.\nData technology\nWhen it comes to our data technology, our goal is to minimize friction between the data and the insights we’re trying to glean.\nOur approach to genetic sequencing\nOur sequencing efforts are growing at a rapid pace, thanks to collaboration amongst teams to streamline the sample preparation and sequencing process.\nPatient impact\nOur ultimate goal is to make a positive impact on patients – both in the short-term through results returned via collaborators, and in the longer term by informing research into new medicines.\nAs we identify interesting findings from our research, we share it with other teams at Regeneron to accelerate our drug discovery and development process. Sometimes this data validates what we've already seen in other ongoing research, and other times it informs new avenues of research for potential therapies. Either way, our genetics research makes us more nimble and targeted when it comes to pursuing new medicines for people with serious diseases.\nMyCode saved my life\nBarbara Barnes is alive today because she contributed her genetic information to a research project. On her doctor's recommendation, the 58-year-old Hazleton, Pennsylvania, homemaker gave a blood sample in April 2016 to a growing biobank called the MyCode Community Health Initiative. Based at Geisinger Health System in Danville, Pennsylvania, its goal is to help health care professionals develop more targeted, effective treatments for patients. Barnes' DNA joined that of over 150,000 volunteers who are notified if genetic changes are found in their information associated with conditions that can then be treated.\nAdditional Resources\nLearn how our team is using genomic approaches to improve patient care.\nReferences\n- Taylor, D.J., Chhetri, S.B., Tassia, M.G. et al. Sources of gene expression variation in a globally diverse human cohort. Nature 632, 122–130 (2024). https://doi.org/10.1038/s41586-024-07708-2"
    },
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/medicines/making-our-medicines",
        "Content_Type": "Website Content",
        "Raw_Text": "Making Our Medicines\nLeaders in Industrial Operations and Product Supply\nGrounded in excellence and driven by innovation, our Industrial Operations and Product Supply (IOPS) team is responsible for the production of Regeneron's medicines.\nIOPS successfully manufactures a range of biopharmaceuticals for patients worldwide, including our approved therapeutic proteins and those involved in clinical studies.\nOur operations follow strict adherence to current Good Manufacturing Practices (cGMP) and use cutting-edge analytical equipment, automated laboratory information management systems and electronic document management systems, all of which are supported by an extensive calibration, validation and preventive maintenance program. Our independent clean-room suites with ultra-modern clean utilities support both single-use and stainless steel cell culture bioreactors and large-scale chromatography systems designed to produce and purify our product candidates.\nSupported by a highly skilled team of professionals, our integrated teams bring an unsurpassed expertise in developing, operating, optimizing, validating and licensing the complex manufacturing processes required for production of biopharmaceuticals.\nTHE REGENERON DIFFERENCE\nOur dedicated IOPS team turns cutting-edge science into innovative biologic medicines to improve the lives of patients worldwide. Our commitment to operational excellence and patient safety ensures we consistently produce the highest quality medicines. Click through the manufacturing process steps below to learn how we turn science into medicine.\nFrom cells to pioneering medicines\nThe manufacturing process starts with a vial of identical cells that grow and multiply under the watchful eye of specialists.\nCells continue to grow for a specified amount of time in the controlled bioreactor environment to produce an optimal amount of the target protein.\nThe harvesting process separates protein and media from cellular debris, first through centrifugation and then by a sequence of increasingly fine filters.\nThe target protein is isolated, purified and concentrated in a multi-step process to ensure it is of the highest quality.\nBuffers are added to maintain the therapeutic protein at a desired concentration. Then, product is dispensed into containers to ensure stability through the entirety of the drug’s shelf life.\nFrom IOPS, the formulated drug substance is filled into the appropriate vials or syringes, labeled and packaged for distribution.\nThe Shingo Prize for operational excellence\nIn 2019, IOPS Rensselaer was recognized by the Shingo Institute with their highest award, the prestigious Shingo Prize, for operational excellence. Learn how we challenge the status quo and foster a culture where continuous improvement is not just a metric — it's a mindset for everyone, every day to do better.\nA long-term global commitment\nIOPS has been manufacturing large-scale biologics since 2003, and has a long-term commitment to manufacturing growth and expanded operations across the globe.\nThe Rensselaer, NY facility has grown at a rapid pace since its acquisition in 1993. In 2018, Regeneron committed to invest up to $800 million and create 1,500 new full-time jobs in the greater Capital Region by the end of 2024.\nSince 2014, Regeneron has invested more than $1 billion to transform a vacant former computer manufacturing factory into the largest bulk biologics production facility in Ireland."
    },
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/stories/volunteer-project-leaders-share",
        "Content_Type": "Website Content",
        "Raw_Text": "Volunteer Project Leaders Share Their Why\nOur ninth annual Day for Doing Good (D4DG) week of global volunteerism kicks off later this week. Learn about a few of our colleagues who are stepping up as project leaders to champion causes they care about.\nRegeneron\nOctober 15, 2025\nDoing well by doing good is central to our mission at Regeneron. That’s why our colleagues take part in numerous volunteer efforts — most notably, the annual Day for Doing Good (D4DG) event. Below, four D4DG project leaders tell us why they got involved.\nBringing Smiles to the Melodies Center for Childhood Cancer & Blood Disorders\nBrian Bourne\nRensselaer, New York\nIn 2023, I was diagnosed with T-cell lymphoblastic lymphoma. I was in my early 20s but still considered a pediatric case, so I was treated at the Melodies Center at Albany Medical Center.\nHere I was in a room covered in superhero decorations with “Paw Patrol” on the TV, but I also saw how they treated every child with such care. I was old enough to understand why treatments made me feel sick to feel better, but try explaining that to a 5-year-old who just wants to play.\nI wanted to give back, so I’ve supported the center’s Holiday Shop each winter. This year, I decided to lead Regeneron colleagues in two D4DG projects for Melodies Center: a STEM kit assembly project and hands-on STEM activities for children undergoing treatment. Together, we can put some smiles on kids’ faces.\nAfter interning at Regeneron, I had a full-time start date lined up when I was diagnosed. Regeneron supported me throughout my illness. Our focus on oncology motivates me at work and in giving back.\nCaring for Animals at Louisa County Animal Shelter\nErin Bragg\nField\nI've helped care for animals for years — dogs and cats but also eagles, bunnies and squirrels. When they wind up in a shelter, they rely on us to nurture them and give them a second chance at finding a family.\nMy boyfriend is a hunter, and we take pride in caring for his hounds. We live in a more rural area, and some hounds are turned out after the hunting season. The shelter gets inundated and needs extra help right around the time of D4DG.\nI’m leading Regeneron colleagues in a remote project that anyone can participate in — baking dog treats they can take to their local shelters.\nRegeneron actively encourages us to be good citizens. I love that we look for problems that need solutions. Wherever I can, I try to make things better.\nReviewing Student Resumés at the CUNY School of Public Health\nKatrina Mateo\nTarrytown, New York\nThe City University of New York (CUNY) School of Public Health (SPH) Foundation supports programming to create a skilled, adaptable and diverse public health workforce. I’m a proud alum of the CUNY SPH doctoral program and serve as an advisory board member on the foundation’s Career Skills Academy, which is committed to professional development, especially for underserved students.\nWhile Regeneron isn’t part of the traditional public health sector, we have a fair number of folks with public health backgrounds who bring a unique lens to our work.\nHaving more public health-trained individuals in biotech/pharma improves how we develop robust studies, reach traditionally underserved populations, create partnerships with community providers, ensure equitable access, and so much more. That’s why I’m hosting a virtual resumé review project supporting students in the Career Skills Academy for the second year in a row.\nI’ve benefited from incredible mentors throughout my career. It’s the reason I am particularly committed to giving back and paying it forward through opportunities like this.\nConnecting Kids with Books at the Friends of Warner Library Book Sale\nJulie Scherrer\nSleepy Hollow, New York\nGiving back to communities that Regeneron directly impacts, like Tarrytown, has long been a passion of mine. I find it extremely fulfilling to participate in opportunities that allow me to support the community and connect with people — so they feel seen and know they matter.\nSince 2021, I’ve supported the Friends of Warner Library book sale, proceeds from which go toward the library’s programs for children, young adults, non-native English speakers and more.\nRegeneron places an emphasis on education, and volunteering at the book sale is a small way for me to be a part of that larger impact.\nSeeing the look on kids' faces when they choose their books reminds me of the power of literacy to inspire and transform lives.\nVolunteers are essential to the success of the book sale! Those who join my D4DG project will help set up the book sale and create a welcoming space where readers of all ages can find their next favorite book. Volunteering is not only fun, but also a wonderful way to meet people outside of your department.\nI’m grateful for the numerous opportunities Regeneron provides employees to make a difference and contribute to meaningful causes such as promoting literacy and fostering community connections.\nMore Regeneron Stories"
    },
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/stories/the-next-obesity-era",
        "Content_Type": "Website Content",
        "Raw_Text": "The Next Obesity Era\nPursuing potential improvements in quality of weight loss and associated conditions of obesity\nChiedza Kaitano, PhD\nVice President, Global Program Head, Obesity\nSeptember 17, 2025\nOver the last few years, it has become clear we are in a new era for treating obesity, a complex, multifaceted chronic disease affecting over a billion people globally.\nAlmost everyone today is familiar with GLP-1 receptor agonists, therapies that have caused an explosion in available weight-management options and marked an important shift in how we think about, and treat, obesity. These treatments have provided clinicians with highly effective and proven options for weight-management, in addition to lifestyle modifications and surgery.\nObesity is one of the most prevalent diseases of our time, but recent scientific advancements have made significant weight loss a reality. However, much of the focus has been on the amount of weight loss rather than the quality of the weight loss itself and other associated health benefits. It’s important we understand that the amount of weight lost is not the full story.\nOngoing research has shown that the quality of the weight lost can matter just as much as the amount. The current generation of GLP-1s are highly effective for accelerated weight loss compared to earlier generation products, but can lead to significant lean mass loss as well as fat loss. Our ongoing Phase 2 clinical trial confirmed approximately 35% of GLP-induced weight loss was due to lean mass loss.\nThis loss in muscle can negatively affect people’s metabolic health and overall physical fitness, as muscle mass is an important element of long-term health.\nAdditionally, obesity is associated with several conditions, including Type 2 diabetes, hypertension, knee osteoarthritis, sleep apnea, coronary artery disease, heart failure, cardiac arrhythmia, stroke, MASH and certain types of cancer. Weight loss among people affected by obesity may improve existing conditions and reduce the risk of developing these health issues in the future.\nThe quality of weight loss and long-term health are key elements that have not been at the forefront—until now.\nTwenty Years of Research Supports Our Future\nAt Regeneron, we’re taking a different approach to obesity. Building on a foundation of research in muscle and metabolism, with clinical studies for obesity dating back to 2003, we are focused on exploring new therapeutic approaches for obesity. Through a multi-pronged research approach that includes both monotherapy and combinations, our goal is to develop a pipeline focused on improving the quality of weight loss with the potential to serve as tools for clinicians to help their patients achieve sustainable weight-management for people living with obesity.\nTo that end, we are investigating unimolecular, or single molecule, solutions that can target multiple pathways responsible for weight loss. These assets in our portfolio are being evaluated to enhance the weight loss seen within the class, as well as help address conditions that can accompany obesity.\nBeyond this, we are conducting a clinical trial exploring the combination of a GLP-1 therapy with muscle-preserving antibodies for the treatment of obesity. Interim results demonstrated that this approach not only helped maintain lean mass but also increased the reduction of fat mass. Compared to GLP-1 therapy alone, the addition of muscle-preserving antibodies led to a significant improvement in muscle preservation.\nResearching Quality of Weight Loss, Conditions Associated with Obesity and Long-term Health\nThese efforts are increasing the versatility of our clinical programs for obesity and accelerating our mission to support an overall healthier life and quality, sustained weight loss—as well as the associated long-term benefits.\nObesity is a multifactorial disease shaped by genetics, environment and metabolism—deeply interconnected with overall health. That’s why these therapies must go beyond weight loss alone to support true, long-term well-being. Current treatments are an exciting new frontier and have come so far, so fast—but we must ensure the full picture isn’t lost in the excitement.\nMore Regeneron Stories"
    },
    {
        "Ticker": "REGN",
        "Company": "Regeneron Pharmaceuticals",
        "Source_URL": "https://www.regeneron.com/stories/unlocking-the-next-generation-of-cancer-vaccines",
        "Content_Type": "Website Content",
        "Raw_Text": "Clinical Research & Medicines\nUnlocking the Next Generation of Cancer-Fighting Treatments\nJune 09, 2025\nRegeneron’s proprietary VelociVax™ platform enables development and validation of potential new mRNA-based immunotherapies.\nBy: Johanna Hansen, PhD, Senior Director of Vaccine Technology\nMessenger RNA (mRNA) is the biological blueprint that instructs cells to produce proteins—the essential building blocks that power nearly every process in the body. It stands for messenger ribonucleic acid and is a molecule that carries genetic information from DNA to the part of a cell that makes proteins. This capacity to swiftly deliver precise instructions has made mRNA a groundbreaking tool in drug development, enabling rapid design and manufacturing of targeted therapies. From enhancing cancer treatments to combating infectious diseases, mRNA’s adaptability is redefining what’s possible in medicine. For cancer therapeutics, the aim is to design mRNA to match the genetic signature of a patient’s tumor, enabling a more personalized treatment that could potentially result in a positive reaction from the body’s immune system.\nBuilding on this transformative potential, we developed VelociVax™—a novel mRNA-backbone technology that provides a flexible foundation for designing and producing targeted proteins, and the latest technology to join our VelociSuite® technology platform. By enabling more agile combination testing and accelerating preclinical research, VelociVax sets the stage for potential breakthroughs in immune-modulating therapies.\nJohanna Hansen,\nPhD, Senior Director of Vaccine Technology\nStrengthening Our In-House mRNA Capabilities\nAt Regeneron, we have long recognized the immense potential of tapping into genetics to address human health. While external collaborations remain an important part of our research ecosystem, we also saw an opportunity to accelerate our work by building an in-house platform. By doing so, we could design, produce, and validate mRNA constructs more rapidly, enabling our teams to pivot quickly based on emerging data and tailor our efforts to a wide range of research programs. This vision ultimately led to the creation of VelociVax, an internal platform that strengthens our capabilities and positions us to explore the full promise of mRNA technology. When you hear “vax,” people often think of preventative vaccines, however, this platform enables us to develop potential treatments. We use the term “vax” or “vaccine” here because, like preventative vaccines, the investigational treatments produced by our platform stimulate the body’s own immune system to fight cells with abnormal growth – in this case, cancer cells that are already present in the body.\nAt its core, VelociVax focuses on generating mRNA constructs that encode key antigens, cytokines, or antibody fragments to spark or strengthen an immune response. The term “mRNA” may be familiar because of its recent use in infectious disease vaccines, but in fact this naturally-occurring biological component has been used for decades in treatments for multiple conditions. Using our standardized mRNA backbone—which serves as a foundational template our scientists can quickly customize to express proteins that stimulate a beneficial immune response—we have achieved greater flexibility and efficiency.\nBut, this is not just about faster turnaround; it’s about reimagining how we develop and optimize immunotherapies. Our platform empowers us to test multiple iterations in parallel, thereby identifying the most potent lead for further development.\nVelociVax also offers the flexibility to combine mRNA-based agents with other potential strategies within our oncology portfolio—such as checkpoint inhibitors and bispecific antibodies—enabling rapid evaluation of potential synergies. By seamlessly layering new mRNA constructs onto other immunotherapy regimens, we can more swiftly pinpoint combinations with the greatest promise.\nAdvancing Research & Preclinical Development\nVelociVax’s strength lies in its end-to-end approach. From the moment a gene of interest is identified—be it a tumor neoantigen uncovered by advanced sequencing techniques or an immune modulator that could enhance T cell activation—the process begins with cloning this sequence into our unique mRNA backbone. The subsequent in-house in vitro transcription reaction transforms the DNA template into high-quality mRNA, which is then rigorously validated for both integrity and protein expression using cell-based assays.\nThis streamlined workflow means that what once took months can now be accomplished in weeks. This rapid cycle reduces cost and resource expenditures while creating a dynamic environment where new data can swiftly be incorporated and acted on.\nVelociVax is designed to integrate seamlessly with our broader oncology portfolio. In preclinical models, our mRNA constructs are being evaluated in combination with our bispecific antibodies and checkpoint inhibitors. The idea is simple yet powerful: by priming the immune system to target tumor-specific neoantigens and then release the brakes on immune cells with checkpoint blockade, our goal is to orchestrate a more robust antitumor response.\nLooking Ahead\nThe implications of VelociVax extend beyond its immediate applications. While our initial focus has been on oncology, VelociVax’s utility is not limited to cancer alone. We can also use the technology to design mRNA vaccines with the potential to promote immune tolerance—training the immune system not to attack the body’s own cells—in hopes of helping prevent autoimmune diseases or other immune-related conditions like chronic hepatitis. This versatility is key to our long-term vision, as it positions Regeneron to respond quickly to emerging health challenges by generating custom-tailored mRNA solutions.\nThough VelociVax is currently a research tool, its impact is already being felt across Regeneron’s research and preclinical pipelines. Our goal is to continuously refine this platform, using the insights gained from each study to drive further innovation. In time, we expect VelociVax to not only support but also accelerate the translation of groundbreaking mRNA-based immunotherapies from the lab bench to the clinic.\nVelociVax represents more than just an mRNA generation tool—it is a critical enabler, one that empowers our teams to innovate faster and smarter as we work to move science to medicine.\nAll therapies discussed herein are investigational and have not been evaluated by any regulatory authority.\nMore Regeneron Stories"
    }
]