[
    {
        "Ticker": "SBUX",
        "Company": "Starbucks",
        "Source_URL": "https://www.starbucks.com/",
        "Content_Type": "Website Content",
        "Raw_Text": "Hello holidays, Hello Kitty®!\nGrab these exclusive Hello Kitty® Starbucks Cards at participating coffeehouses while supplies last. Can't wait to celebrate a friend? Send them an eGift now.\nSend an eGiftBest brewed together\nFeaturing beans from the world’s most distinctive coffee regions, and with notes of candied pecan and sage, Starbucks® Thanksgiving® Blend whole bean coffee is perfect to gift, share and savor.\nOrder now*Valid for new Starbucks Rewards members for 7 days from sign up. Coupon will be available in the offers tab of your Starbucks app following sign up and may take up to 48 hours to arrive. Good at participating U.S. stores for a handcrafted menu-sized beverage ($8 max value) with qualifying purchase. Qualifying purchase excludes alcohol, Starbucks Card and Starbucks Cards reloads. Limit one. Cannot be combined with other offers or discounts. Excludes delivery services. Sign up by 1/5/2026."
    },
    {
        "Ticker": "SBUX",
        "Company": "Starbucks",
        "Source_URL": "https://www.starbucks.com/account/history",
        "Content_Type": "Website Content",
        "Raw_Text": "Sign in or create an account\nJoin Starbucks® Rewards\nAs a member, start earning free food and drinks, unlock our best offers and celebrate your birthday with a treat from us. Best of all, it's free to join.\nAs a member, start earning free food and drinks, unlock our best offers and celebrate your birthday with a treat from us. Best of all, it's free to join."
    },
    {
        "Ticker": "SBUX",
        "Company": "Starbucks",
        "Source_URL": "https://www.starbucks.com/about-us/",
        "Content_Type": "Website Content",
        "Raw_Text": "Our Company\nOur Heritage\nOur story begins in 1971 along the cobblestone streets of Seattle’s historic Pike Place Market. It was here where Starbucks opened its first store, offering fresh-roasted coffee beans, tea and spices from around the world for our customers to take home. Our name was inspired by the classic tale, “Moby-Dick,” evoking the seafaring tradition of the early coffee traders.\nTen years later, a young New Yorker named Howard Schultz would walk through these doors and become captivated with Starbucks coffee from his first sip. After joining the company in 1982, a different cobblestone road would lead him to another discovery. It was on a trip to Milan in 1983 that Howard first experienced Italy’s coffeehouses, and he returned to Seattle inspired to bring the warmth and artistry of its coffee culture to Starbucks. By 1987, we swapped our brown aprons for green ones and embarked on our next chapter as a coffeehouse.\nStarbucks would soon expand to Chicago and Vancouver, Canada and then on to California, Washington, D.C. and New York. By 1996, we would cross the Pacific to open our first store in Japan, followed by Europe in 1998 and China in 1999. Over the next two decades, we would grow to welcome millions of customers each week and become a part of the fabric of tens of thousands of neighborhoods all around the world. In everything we do, we are always dedicated to Our Mission: With every cup, with every conversation, with every community - we nurture the limitless possibilities of human connection.\nCoffee & Craft\nIt takes many hands to craft the perfect cup of coffee – from the farmers who tend to the red-ripe coffee cherries, to the master roasters who coax the best from every bean, and to the barista who serves it with care. We are committed to the highest standards of quality and service, embracing our heritage while innovating to create new experiences to savor.\nOur Partners\nWe like to say that we are not in the coffee business serving people, but in the people business serving coffee. Our employees – who we call partners – are at the heart of the Starbucks experience. We are committed to making our partners proud and investing in their health, well-being and success and to creating a culture of belonging where everyone is welcome.\nWe Believe in the Pursuit of Doing Good\nAs it has been from the beginning, our purpose goes far beyond profit. We believe Starbucks can, and should, have a positive impact on the communities we serve."
    },
    {
        "Ticker": "SBUX",
        "Company": "Starbucks",
        "Source_URL": "https://www.starbucks.com/about-us/accessibility/",
        "Content_Type": "Website Content",
        "Raw_Text": "Commitment to inclusion and accessibility\nStarbucks mission is “With every cup, with every conversation, with every community – we nurture the limitless possibilities for human connection.”\nIn support of our mission, we’re committed to upholding a culture where inclusion, diversity, equity and accessibility are valued and respected. Together with our community partners, we are increasing accessibility resources and supporting the development of evolving employer practices on access and disability inclusion. If you have questions, please visit our customer service page.\nIn support of our mission, we’re committed to upholding a culture where inclusion, diversity, equity and accessibility are valued and respected. Together with our community partners, we are increasing accessibility resources and supporting the development of evolving employer practices on access and disability inclusion. If you have questions, please visit our customer service page.\nInclusive spaces\nStarbucks is committed to expanding accessibility in the store experience across its store portfolio through an Inclusive Spaces Framework. Building on the company’s commitment to inclusion, the new design framework defines how Starbucks will help expand independence, choice and ease for all people across physical and digital spaces. The Inclusive Spaces Framework was created in partnership with a diverse community of customers, partners and accessibility experts to develop scalable solutions for retail spaces (more details available here).\nThe first store to be built using the inclusive design framework opened in Washington, D.C. in February 2024 (press release available here). Moving forward, all newly built and renovated Starbucks company-operated stores in North America will begin to incorporate the framework, a key milestone in ensuring Starbucks continues to expand accessibility and inclusion. The framework is an openly available tool and will be further developed with other companies to help expand accessibility across the retail industry. The framework is currently downloadable at www.designinclusivespaces.com.\nThe first store to be built using the inclusive design framework opened in Washington, D.C. in February 2024 (press release available here). Moving forward, all newly built and renovated Starbucks company-operated stores in North America will begin to incorporate the framework, a key milestone in ensuring Starbucks continues to expand accessibility and inclusion. The framework is an openly available tool and will be further developed with other companies to help expand accessibility across the retail industry. The framework is currently downloadable at www.designinclusivespaces.com.\nDigital accessibility\nWe are working to ensure that all Starbucks digital properties are accessible for all partners and customers. Starbucks efforts to improve digital usability and accessibility are guided by recommendations established by the World Wide Web Consortium (W3C), which includes the currently approved Web Content Accessibility Guidelines (WCAG) Levels A and AA. We are also firmly dedicated to complying with the Americans with Disabilities Act (ADA) 2010, U.S. Section 508 of the Rehabilitation Act of 1973 (or “Section 508” 36 CFR 1194), the Accessible Canada Act (ACA), and the Accessibility for Ontarians with Disabilities Act (AODA).\nOur efforts are ongoing as we continue to develop our digital accessibility program, which includes coordination with internal and external accessibility partners, as well as designing, developing, and testing Starbucks digital properties for accessibility.\nOur efforts are ongoing as we continue to develop our digital accessibility program, which includes coordination with internal and external accessibility partners, as well as designing, developing, and testing Starbucks digital properties for accessibility.\nDigital accessibility feedback\nDigital Accessibility requests are managed by the Digital Accessibility team during business hours (Pacific time) and weekdays only. For general concerns such as trouble signing into your Starbucks account, quality of your Starbucks store experience, or any other feedback or issues not related to digital accessibility, please visit our customer service page where you’ll find quicker support options.\nIf you are a customer with a disability, or are an individual assisting someone with a disability, and you are experiencing issues accessing any Starbucks digital content, please select the contact form link below. You may also use this form to request information about Starbucks digital accessibility efforts, or share any accessibility questions or feedback:\nDigital accessibility contact formIf you are a customer with a disability, or are an individual assisting someone with a disability, and you are experiencing issues accessing any Starbucks digital content, please select the contact form link below. You may also use this form to request information about Starbucks digital accessibility efforts, or share any accessibility questions or feedback:\nDisclaimer\nPlease be aware that our efforts to maintain accessibility and usability are ongoing. While we strive to make the Starbucks website and mobile apps as accessible as possible some issues may be encountered by different assistive technology as the range of assistive technology is wide and varied. We appreciate your understanding.\nLast updated: [2024-12-17]\nLast updated: [2024-12-17]"
    },
    {
        "Ticker": "SBUX",
        "Company": "Starbucks",
        "Source_URL": "https://www.starbucks.com/about-us/business-ethics-and-compliance",
        "Content_Type": "Website Content",
        "Raw_Text": "Ethics & Compliance\nWe believe that conducting business ethically and striving to do the right thing are vital to the success of the company.\nStarbucks Ethics & Compliance supports our mission and values and helps protect our culture and our reputation by fostering a culture that is committed to ethical leadership and conducting business with integrity by providing resources that help partners make ethical decisions at work.\nWe do this by advising and enabling leaders to drive ethical business practices, partnering with the business to ensure effective legal risk management and encouraging partners to speak up if they have questions or concerns.\nThe majority of reports we receive involve employee relations issues. This trend is consistent with other companies – retail or otherwise – that provide alternative reporting mechanisms as part of a comprehensive ethics and compliance program.\nStandards of Business Conduct\nAs a global company, we are subject to the highest standards of ethical conduct and behavior. The Standards of Business Conduct help us make decisions in our daily work and demonstrate that we take our legal and ethical responsibilities seriously."
    },
    {
        "Ticker": "SBUX",
        "Company": "Starbucks",
        "Source_URL": "https://www.starbucks.com/about-us/corporate-governance",
        "Content_Type": "Website Content",
        "Raw_Text": "Corporate Governance\nAs part of the Starbucks mission we are committed to maintaining our uncompromising principles while we grow.\nIn this regard, our Board of Directors has adopted governance principles, committee charters and policies to lead Starbucks governance practices. Currently, our board has 9 directors, a substantial majority of whom meet all of the independence requirements of NASDAQ® and the U.S. Securities and Exchange Commission.\nCorporate Governance Materials\nBoard Committee Charters\nStandards of Business Conduct\nThe Standards of Business Conduct booklet is a resource distributed to all partners to help them make appropriate decisions at work.\nThe Standards are a brief statement of some of the company’s expectations of how we are all to conduct Starbucks business, consistent with our Guiding Principles. View all versions of the Standards of Business Conduct."
    }
]