[
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/",
        "Content_Type": "Website Content",
        "Raw_Text": "Transform teamwork with human-AI collaboration\nTeams across the globe run on Atlassian\n300000+\ncompanies power team collaboration with Atlassian\n200+\ncountries and territories have companies that use Atlassian\n80%\nof Fortune 500 companies use Atlassian products\nEmpower everyone, on every team\nSupercharge dev productivity\nPlan, track, and release world-class software with the number one software development tool for agile teams\nGet started with a template\nScrum\nEasily plan, track, and manage work across sprints\nBug Tracking\nSeamlessly report, track, and prioritize bugs to address development issues\nDevOps\nDevelop, deploy, and manage applications with an open tools approach\nFor teams of all sizes\nEveryone from start-ups to large enterprises prefer Atlassian\nLarge enterprise\n“With Atlassian cloud, everything regarding server maintenance is done for us, and there’s less downtime and better performance.”\nMehmet Sari\nModern Collaboration Platform Team, Mercedes Benz"
    },
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/software/jira/service-management",
        "Content_Type": "Website Content",
        "Raw_Text": "Jira Service Management is now more powerful than ever as part of Service Collection. Unlock exceptional service experiences with Rovo, Assets, and our new Customer Service Management app.\nPART OF\nUnlock high-velocity service management\nEnd bad service management for good. Unite teams on a single AI-powered platform to deliver service at scale.\nService management for all teams\nScale experiences across service teams including IT, HR, facilities, and more.\nUnite your teams with Service Collection\nJira Service Management is now part of Service Collection! Unlock teams across the enterprise to deliver exceptional experiences for employees and customers.\nDeliver exceptional service experiences with AI\nProvide always-on support\nInstantly answer employee questions with AI agents that draw on existing knowledge. Plus, AI is always spotting knowledge gaps and drafting new articles so your front-line support keeps getting better.\nSupercharge collaboration by connecting Dev and Ops teams\nAccelerate deployments, minimize risk\nSay goodbye to bottlenecks. Increased visibility on one platform enables Dev teams to ship fast, while Ops teams have the oversight to quickly approve changes and minimize service disruptions.\nDetect fast, resolve faster\nCut through alert noise and help responders act on the highest-priority incidents. Use AI to group related alerts, escalate them to an incident, and access relevant resources, SMEs, and remediation steps.\nImprove service resilience\nLeave post-incident reviews to AI. Generate an incident summary quickly so Ops teams can save time, learn from past incidents, and pass along critical insights to prevent similar incidents in the future.\n60,000+ customers trust Jira Service Management\nDon’t just take our word for it. Learn how our customers are delivering high-velocity service management.\n“With our prior tool, procurement requests would get stuck with manager approval. With Jira Service Management, the biggest win is transparency. People know where their issue is and when it's being resolved.”\nBill Hall\nDirector of IT\n“Full visibility and tracking are at the fingertips of all agents and customers alike. Everyone knows exactly where they or their songs stand at any given time.”\nAlison Wood\nDirector, Global Copyright Administration\n“In no time, we had a single point of contact for all support across Breville.”\nRoni Nestorovski\nGlobal Service Delivery Manager\n“The virtual agent is like a global, 24/7 helping hand. When you’re in a leadership position, it helps you rest easy knowing that some resolutions can be handled even when we're not available.”\nChris Bocage\nDirector of IT Operations\n“For 24 Hour Fitness, Jira Service Management is no longer an IT solution — it’s an enterprise service management tool.”\nJames Gambrill\nSenior Manager, Engineering Governance and Operations\nResources\nJira Service Management vs. Competitors\nSee how Jira Service Management’s modern, AI-powered ITSM stacks up against our competitors.\nThe Total Economic Impact™ of Jira Service Management\nEnterprises see a 275% ROI in three years after switching to Jira Service Management.\nGet started with Jira Service Management\nNo complex deployments here. Get started fast with our step-by-step guide."
    },
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/collections/service",
        "Content_Type": "Website Content",
        "Raw_Text": "Built on a platform that connects all teams, tools, and data\nFlexible and intelligent by design, Atlassian’s Cloud Platform is the foundation of connection between tools, teams, and the vital data that underpins your system of work.\nFlexible and intelligent by design, Atlassian’s Cloud Platform is the foundation of connection between tools, teams, and the vital data that underpins your system of work."
    },
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/software/jira/product-discovery",
        "Content_Type": "Website Content",
        "Raw_Text": "Join the 10,000+ customers who build products with Jira Product Discovery\nDiscover your next great product idea\nBetter product decisions are made as a team\nBring structure to chaos\nLeverage data and customer insights to help your team prioritize ideas that will make the biggest impact.\nGet everyone on the same page\nSpend less time updating and persuading with custom roadmaps that give your stakeholders the information they need.\nConnect discovery and delivery in Jira\nReduce context switching, add visibility, and move faster by seamlessly connecting your ideas to the delivery work happening in Jira.\nTransform teamwork with human-AI collaboration\nHow it works\nCapture ideas and insights\nThere’s now a home for all the unstructured work that happens before you start building software. Gather and organize your product opportunities, user feedback, and feature requests all in one place.\nJira Product Discovery is helping us do the right things, in the right order, and at the right time, focusing on work that will deliver on benefits.\nJohn Sayers\nPMO Lead, Renaissancere\nJira Product Discovery is helping us do the right things, in the right order, and at the right time, focusing on work that will deliver on benefits.\nJohn Sayers\nPMO Lead, Renaissancere\nConnect your entire workflow with Jira\nFrom strategy and ideation through planning and delivery, bring your entire software lifecycle together in Jira\nJoin us in the Atlassian Community\nAsk questions, give app feedback, and connect with our team and other users to learn best practices."
    },
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/customers",
        "Content_Type": "Website Content",
        "Raw_Text": "Director of Digitalization\nMigrating to the cloud was the next logical step for us when it comes to significantly reducing downtime and, therefore, costs.\nProcess Engineer\nSecurity and compliance are really critical in the financial industry… Atlassian cloud met all of the needs that we have.\nLead Portfolio & Architecture Management\nWe have grown so much in recent years that we had over 10,000 users on-premise. We have, therefore, made a clean sweep to the cloud.\nProduct Manager, Digital Workspace & Solutions\nWe found we could save $2.5M annually on tooling by centralizing on Atlassian Cloud and adding governance. That’s an annual cost savings of 36%.\nLead Atlassian Administrator\nThe big win that we've seen through Confluence Cloud is definitely collaboration. More teams can work together and collaborate. It's a very open way of working.\nHow Sun Life saved $250k in 10 months, increased efficiency by 80%, and achieved 97% CSATs with Confluence Cloud Enterprise\nHow the State of Utah’s Atlassian Cloud Enterprise migration unleashed cross-functional collaboration; 90% faster changes; and better, leaner delivery\nVP of Collaboration, Workplace, and Support\nWe trust Atlassian to take care of security, availability, and scalability, freeing up time for us to focus on more strategic topics. Moving to the cloud has been a chance to improve today and prepare for our future.\nInterpark improved user management and company-wide collaboration in 4.5 months by migrating to Atlassian Cloud Premium\nSenior System Engineer\nWe're saving over $300,000 per year by moving from other tools to Jira and Confluence.\nShowing 10 of 103 stories\n300000+\ncompanies power team collaboration with Atlassian\n200+\ncountries and territories have companies that use Atlassian\n80%\nof Fortune 500 companies use Atlassian products"
    },
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/platform",
        "Content_Type": "Website Content",
        "Raw_Text": "The intelligent teamwork platform uniting your system of work\nThe Atlassian Cloud Platform connects teams with all the curated data, context, and goals they need as they work across their favorite Atlassian and third-party applications.\nThe Atlassian Platform is the foundation of intelligent connection that empowers Atlassian’s 300K+ customers to do their most impactful work.\nThe power of AI, everywhere\nRovo transforms teamwork with AI-driven apps and experiences powering knowledge discovery, collaboration, and agents across Atlassian apps and collections.\nAutomation that powers productivity\nUnleash the true capacity and velocity of your organization by automating manual tasks across teams and tools with Atlassian Automation.\nIntelligent experiences to streamline work\nMinimize context switching and improve collaboration with platform experiences across all Atlassian Applications.\nFoundations built for success\nScale confidently with a platform that is purpose-built to meet current and future enterprise requirements"
    },
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/company/contact/general-inquiries",
        "Content_Type": "Website Content",
        "Raw_Text": "Have a general question for us?\nOur team can help answer questions about your account, privacy and security, or product advice.\nOur Billing and Licensing Team is currently experiencing a high volume of calls and tickets. This may result in longer response times, but we commit to prioritizing critical requests and resolving your question as soon as possible. In the meantime, we invite you to have a look at our FAQ page. Appreciate your patience!\nOur team can help answer questions about your account, privacy and security, or product advice.\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising.\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance."
    },
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/company/contact/product-evaluator-advice",
        "Content_Type": "Website Content",
        "Raw_Text": "Have a question about evaluating our products?\nOur team can provide advice for pre-sales product and migration questions that best suit your team’s needs.\nOur team can provide advice for pre-sales product and migration questions that best suit your team’s needs.\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising.\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance."
    },
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/company/contact/purchasing-licensing",
        "Content_Type": "Website Content",
        "Raw_Text": "Have a question on pricing, billing and licensing?\nOur team can help answer questions about your account, privacy and security, or product advice.\nImportant changes to our Data Center products\nWe’re making changes to our Data Center products, including the end of sale for new Data Center licenses on March 30, 2026 and the end of life for Data Center on March 28, 2029. Learn what this means for you.\nOur team can help answer questions about your account, privacy and security, or product advice.\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising.\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance."
    },
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/blog/it-service-management/reimagining-service-management-with-dominos-and-nrma",
        "Content_Type": "Website Content",
        "Raw_Text": "Reimagining service management with Atlassian customers the NRMA and Domino’s Pizza Enterprises Ltd\nLearn how a modern, unifying ITSM platform can help enterprises deliver consistently elevated service\nRecently, Atlassian held High Velocity: ITSM, an event covering ways to reimagine service management to include teams beyond IT. Atlassian customers joined in to discuss their journeys to digital transformation by way of Jira Service Management.\nDuring High Velocity’s keynote address, Atlassian Co-Founder Scott Farquhar sat down for a chat with Domino’s Pizza Enterprises Ltd (Domino’s) Group Chief Technology Officer Matthias Hansen and the NRMA’s General Manager of Technology Engineering Andy McCarthy to discuss their ITSM journey.\nLet’s walk through key findings from these customer journeys to Jira Service Management, the benefits they’ve found from their new approach to service management, and their advice for other teams kicking of a digital transformation.\nNRMA’s journey to Jira Service Management\nFast facts:\n- 100-year-old Australian member-owned roadside assistance network\n- 2.8 million members, 2000 employees, and handles 1.4 million calls per year\n- Leader in sustainability\nThough the NRMA had been using Jira Software and Confluence as the backbone of their software delivery, they had still been using ServiceNow as an ITSM platform. According to Andy McCarthy, the lack of integrability created challenges across the organization, “it never hooked into what we needed it to hook into” and ended up becoming “a bubble by itself.” Since data silos and obstacles to collaboration can permeate into a slowed service delivery, the NRMA which is an emergency roadside service, needed to make a change.\nWe had good knowledge of what [ServiceNow] could do, but we didn’t know how it worked. It was very much ‘we can see it but we can’t touch it, and if we had to touch it, we had to get someone in to touch it for us.’ So the run costs were quite substantial, and we had no in-house skill to run it.”\n– Andy McCarthy, General Manager of Technology Engineering, the NRMA\nGiven their familiarity with Atlassian products, Andy and his team chose Jira Service Management for their ITSM solution. Jira Service Management was uniquely suited to plug into their existing work streams while being easy to scale without third-party support.\nDomino’s journey to Jira Service Management\nFast facts:\n- Largest pizza company in the world – 3800 stores across 12 markets with 100,000 employees\n- Last fiscal year Domino’s cooked 8 pizzas per second or 256 million pizzas\n- Visual AI to ensure right toppings\nThe sun never sets on Domino’s – with locations across the globe, Domino’s has to deliver consistent service every second of every day. This takes a lot of moving pieces such as live GPS tracking of delivery drivers or visual AI to ensure orders are made correctly.\nUnfortunately, before finding their way to Jira Service Management, Domino’s had to juggle 6 different ITSM tools globally. Matthias Hansen’s team was already using Jira Software, and decided to unify their dev and ops teams on one connected platform with Jira Service Management.\nThe Jira Software and Jira Service Management integration has been instrumental to really have this end-to-end view on the technology side”\n– Matthias Hansen, Group Chief Technology Officer, Domino’s Pizza Enterprises Ltd\nHow the NRMA benefits from Jira Service Management\nWith Jira Service Management in place, it is much easier to communicate and collaborate across departments. Andy’s team was also pleased to find unanimously warm feedback from his teams due to its user-friendly interface which empowered employees to get more from their tools and take control. Teams now had the power to build and develop workflows themselves without having to learn any specialized skills or leverage an expensive vendor.\nAndy also found that his business teams were happy with the standardized nature of the platform for its increased level of dialogue and resolution speed. The savings also ended up being a big win as the NRMA was able to reduce its ITSM run costs by 50%.\nWe can actually play with it ourselves and build our own workflows without having to bring in the third parties that then would talk to [ServiceNow] and charge us a big bill. So being able to scale up in-house internally and build those workflows was very important to us”\n– Andy McCarthy, General Manager of Technology Engineering, the NRMA\nHow Domino’s benefits from Jira Service Management\nAfter transitioning to Jira Service Management, Domino’s was able to use one service desk for all 12 markets and 3,800 stores across the globe. Matthias also notes that having the same platform for both the engineering and business teams drives efficiency and end-to-end visibility. Back when there were different ITSM tools across regions, there would be gaps between IT information gathering and engineering team work.\nDomino’s has since found Jira Service Management easy to use and extend. As they continue to standardize processes it allows them to automate the backend of these processes easily, further improving speed, quality, and removing repetitive manual work.\nMatthias is also excited about new features such as Atlassian Intelligence and has already seen improvements to productivity. Matthias already sees its use for report summaries, sharing that his knowledge manager had already been saving roughly 2.3 hours in the first week that they enabled the feature. Domino’s support teams have also seen results using the Virtual Agent feature, allowing them to elevate service when issues arise and avoid tickets in the first place.\nI can just click Summary and I got this five page long PIR report and I’ve got five sentences summarizing it for me”\n– Matthias Hansen, Group Chief Technology Officer, Domino’s Pizza Enterprises Ltd\nStreamlining digital transformation: Advice for customers embarking on digital transformation\nTowards the end of the fireside chat, Scott asked both customers if they had any advice for enterprises looking to embark on their digital transformation process. Here’s what they had to say:\nNRMA:\nI would recommend [Jira Service Management] if you’re looking for something to bring things together internally and halve your costs, that’s what we did”\n– Andy McCarthy, General Manager of Technology Engineering, the NRMA\nDomino’s:\nMy advice would be to standardize on one platform, one thing I’ve noticed since the pandemic is that there are lots of good SaaS platforms but the challenge is you end up with the legal team using one set of tools, another team in another country using another tool, and [previously] I never had the critical mass to actually support the business properly.”\n– Matthias Hansen, Group Chief Technology Officer, Domino’s Pizza Enterprises Ltd\nLooking forward\nTo get more details from Scott’s chat with Atlassian customers the NRMA and Domino’s, make sure to check out the keynote from High Velocity: ITSM, End Bad Service Management (BSM) Now. This keynote session not only has deeper Jira Service Management findings but also interesting facts about these very nuanced customers – from their very specific uses of AI to fun pranks using Jira.\nIn the meantime, if you’re looking to unlock high-velocity service teams, take a free test drive of Jira Service Management. See how you can use the power of ITSM beyond IT to empower support and business teams alike. Jira Service Management is always adding new applications and features to help you scale with ease."
    },
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/teams/software-development",
        "Content_Type": "Website Content",
        "Raw_Text": "Empower engineers, inspire productivity\nSurface context whenever and wherever developers need it\nImprove engineering standards and reduce risk\nGive developers a golden path and make the easy way the right way\nBuild the right thing\nValidate ideas, make data-driven product decisions, and rally teams around a common roadmap\nOver 300K organizations run on Atlassian\nFind context\nFind what you need to move work to done, with AI that surfaces everything from team plans and technical suggestions to company goals and customer insights – wherever you are.\nUnderstand ownership\nEasily identify who owns specific software components, and every piece of work your team needs to release.\nAccess metrics\nGet easy access to DORA, SPACE, flow and other metrics so your teams are always able to prioritize the right work.\nAutomate across the SDLC\nSet it and forget it. Automate anything you need across the software lifecycle with your toolchain integrated on the Atlassian platform.\nCommunicate async\nCommunicate when and however it works best for you with async video chat, whiteboards, wiki pages and more.\nEmbed Atlassian into your workflows\nBring the power of the Atlassian platform to wherever you work, with Rovo, Jira and other tools embedded right into VSCode, GitHub Copilot, and Slack.\nWe’re a DevOps Platform leader\nAtlassian has been named a Leader in The Forrester Wave™: DevOps Platforms, Q2 2025. Discover why we received the highest scores possible, earning (5/5) ratings across the Vision, Innovation, and Roadmap criteria.\nThe State of DevEx report\nAtlassian surveyed 2100+ developers and managers to get their perspectives on points of friction getting in the way of satisfaction and productivity–and what they're planning to do about it.\n3X a DevOps Leader\nFor the third year in a row, Atlassian was named a Leader in the Gartner® Magic Quadrant™ for DevOps Platforms. Learn why we received the highest placement both in Ability to Execute and Completeness of Vision in the 2025 report."
    },
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/company",
        "Content_Type": "Website Content",
        "Raw_Text": "12,000+ Atlassians\nPresence in 14 countries\n300,000+ customers\n1% donated of all profit, employee time, and equity\n$132 million donated in Community licenses\n5,700+ apps in our Marketplace\n4.6M+ community members\n2 planets with our software on them\nA brief history\nArmed with a credit card and a dream, two college friends, Mike Cannon-Brookes and Scott Farquhar set out to create Atlassian. In 2002, they didn't know what kind of company Atlassian was going to be, but they knew exactly what it shouldn't be—an environment where they had to conform rather than be who they authentically are.\nNow 20 years in, we’ve grown into a global company with employees all over the world, but those early ambitions hold true. Here’s our story:\nMike and Scott, both 18, land in the same scholarship course at the University of New South Wales.\n1998\nAtlassian, inspired by the Greek Titan, is registered as a business name.\n2001\nAtlassian becomes real with the launch of Jira 1.0.\n2002\nConfluence 1.0 is born and released to the world.\n2003\nWe get our 1,000th customer.\n2005\nWe co-found Pledge 1% and Atlassian Foundation is created.\n2006\nOur five core values come to life.\nOpen company, no bullshit.\nBuild everything with heart and balance.\nDon’t #@!% the customer.\nPlay as a team.\nBe the change you seek.\n2007\nWe open our first European office in Amsterdam.\n2009\nAtlassian ships first cloud versions of Confluence and Jira.\n2011\nAtlassian celebrates its 10th anniversary.\nWe hit $100 million dollars of revenue.\n2012\nWe open offices in Yokohama and Manila.\nJira Service Desk (a former ShipIt project!) joins Atlassian's suite of tools.\n2013\nAtlassian goes public! We are listed on NASDAQ as TEAM.\n2015\nTrello joins our growing family of tools.\n2017\nOpsgenie joins our product family.\nWe opened our Bengaluru office.\n2018\nWe launched Jira Service Management, the next generation of Jira Service Desk.\nAtlassian announces TEAM Anywhere, a distributed work policy that allows employees to work from (almost) anywhere.\n2020\nLaunched Jira Work Management.\n2021\nCelebrating 20 years!\n2022\nIntroduced AI to Atlassian cloud platform.\nAtlassian acquires Loom.\n2023\nAnnounced Rovo, our AI teammate.\nJira Software and Jira Work Management unite into Jira.\n2024\nDebut Strategy and Teamwork Collections.\n2025\nWe :heart: teams\nOver 300,000 customers use Atlassian to empower their teams and drive their missions forward.\nWe take 'Don't #@!% the Customer' seriously because our customers are the reason why we do what we do. It's even why we price our products so every company can afford them. They inspire us, challenge us, and in turn, help us build better products.\nTaking the 1% Pledge\nWe've joined forces with leading companies around the world to donate 1% of equity, profit, employee time, and software licenses to the community.\nA vision for foundation\nWe created the Atlassian Foundation to help make the world a better place by partnering with local organizations and global ones like Room to Read.\nJoin the ultimate team\nEvery Atlassian is encouraged to bring their truest, most authentic selves to work. We're building a 100-year company and are committed to building an inclusive workplace where each Atlassian feels a sense of belonging.\nCorporate social responsibility\nAtlassian is built to be open, inclusive, fair, and just. When we face tough questions about ethics, people, or the planet, we let those principles guide us\nHow we work\nWorking Open\nWe believe all teams have the potential to do amazing things when work is Open.\nMuch of the world works, often unwittingly, in a closed way. Information is hidden or lost, bonds between teams and teammates are weak, and perspectives are withheld. The result? People burn out. Knowledge is wasted. Potential is left on the table. Forward progress is halted. This is why Open matters. This is why we do what we do at Atlassian.\nOpen work has always been central to our values. It's in the DNA of our products and we bring it to life through our practices. But it doesn't just happen. Our teams make an effort to work, communicate, and collaborate openly every day to lead by example.\nOpen unlocks new opportunities. Open brings us together. Open unleashes potential.\nOpening work up\nSee how our philosophy of open work inspires and influences everything we do.\nChanging the way teams work together\nOpen work isn't just a philosophy, it's a practice. Take a deep dive into our original research and thinking around teamwork."
    },
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/company/events",
        "Content_Type": "Website Content",
        "Raw_Text": "Catch the most recent and upcoming Atlassian events\nNovember 25, 2025\nBengaluru, India\nTeam on Tour: Bengaluru\nThe conference for better teamwork in heading back to Bengaluru! Reserve your seat for this exclusive opportunity to connect with industry leaders and experience Atlassian’s products and features created with you in mind.\nDecember 9, 2025\nBerlin, Germany\nDeveloper Day: Berlin\nExplore the latest advancements in AI and developer experience, get hands-on with Atlassian Rovo Dev and Forge in practical workshops, and connect directly with Atlassian engineers, product teams, leaders and fellow builders shaping the future of software development.\nDecember 9, 2025\nDenver, Colorado\nConnect: High Velocity Denver\nJoin your community of business leaders for an unforgettable day. Network, grow, and learn how Atlassian unites development, IT, and business teams on an AI-powered platform to deliver exceptional service at scale.\nFebruary 11, 2026\nWashington, DC\nTeam on Tour: Government\nAtlassian’s conference for government agencies, is back. This free, 1-day event is designed to empower every team within your agency–from IT and Software to Product and Business teams and beyond–to align work to goals, unlock knowledge, and build better teamwork.\nNovember 25, 2025\nBengaluru, India\nTeam on Tour: Bengaluru\nThe conference for better teamwork in heading back to Bengaluru! Reserve your seat for this exclusive opportunity to connect with industry leaders and experience Atlassian’s products and features created with you in mind.\nNovember 25, 2025\nBengaluru, India\nTeam on Tour: Bengaluru\nThe conference for better teamwork in heading back to Bengaluru! Reserve your seat for this exclusive opportunity to connect with industry leaders and experience Atlassian’s products and features created with you in mind.\nCatch Atlassian at these events or conferences near you\nNovember 18 - 21, 2025\nSan Francisco, California\nMicrosoft Ignite\nDecember 1 - 5, 2025\nLas Vegas, Nevada\nAWS re:Invent\nDecember 9 - 11, 2025\nLas Vegas, Nevada\nGartner IT Infrastructure, Operations & Cloud Strategies Conference\nAtlassian Community Events\nFind your people at an event near you\nAtlassian Community Events are free, user-led meetups happening all over the world, connecting community members virtually and in-person.\nGet first access to the latest event info\nBe the first to know about our events. Sign up for special announcements, information about event registration, and more right to your inbox.\nSave more during early registration\nKnow exactly when registration opens and take advantage of the best price.\nSee the speaker lineup\nTake a peek at who is taking the stage and see how you can sign up yourself!\nKnow before you go\nPrepare and make the most of every event with tips and tricks."
    },
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/blog",
        "Content_Type": "Website Content",
        "Raw_Text": "- Topics\n- Communication 17 scripts for difficult conversations at work Never heard of restorative conflict resolution? Catch up quick How to avoid “emotional overhead” at work (hint: emojis are 👍 ) 5 tips for employee surveys that actually make a difference More in Communication\n- Distributed Work How to excel at asynchronous communication with your distributed team RTO’d? Take these distributed practices back to the office with you An intentional solution for worker loneliness Atlassian’s distributed work glossary More in Distributed Work\n- Leadership Great managers meet uncertainty with curiosity and confidence Good people management begins with self-understanding How to minimize the impact of manager changes Advice for first-time managers, from leaders who’ve been there More in Leadership\n- Productivity 6 ways to prevent AI fatigue The 5 commandments of information discoverability 5 skills teams need to thrive in the age of AI (and how to build them) Everything you learned in school and forgot – all in one printable More in Productivity\n- Strategy Less noise, more signal: Atlassian’s responsible AI journey continues Find stuff fast: How to end the endless hunt for information Atlassian’s approach on Enterprise strategy and planning Control the chaos: a smarter approach to planning your work More in Strategy\n- Teamwork Avoiding the broadcast trap: A simple ritual for effective adoption 5 skills teams need to thrive in the age of AI (and how to build them) The consulting industry’s human-powered renaissance What’s your AI collaboration style? Take the quiz to find out! More in Teamwork\n- Collections\n-\nEarnings Reports“Open company, no bullshit” isn’t just one of our values. It’s a way of life at Atlassian. Here’s what we’re sharing with our investors and stakeholders each quarter.\n-\nWellbeing | Well-doingLaying the groundwork for better employee health and happiness.\n-\nCompany CultureEmbrace transparency, foster a sense of belonging, form connections – and have fun along the way.\n-\nWays of WorkingHow you work is just as important as the work you’re doing.\n-\nYour Personality at WorkNavigating and celebrating the complexities of our individuality.\n-\nThe Flywheel Growth ModelThere are loads of ways to grow a company – learn about our approach here.\n-\n- Resources\n- About\nAbout Work Life\nWork Life is Atlassian’s flagship publication dedicated to unleashing the potential of every team through real-life advice, inspiring stories, and thoughtful perspectives from leaders around the world.\nLearn more about Work LifeContributorsContributing Writer\nContributing Writer\nHead of the Teamwork Lab\nContributing Writer\nContributing Writer\nContributing Writer"
    },
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/company/news/press-kit",
        "Content_Type": "Website Content",
        "Raw_Text": "Press Kit\nA one-stop resource for your Atlassian media needs\nExecutives\nHeadshots and biographies for Atlassian’s leadership team and board of directors.\nFounder headshots\nHeadshots of our co-founder and CEO Mike Cannon-Brookes.\nLogos\nAtlassian’s official logos and lockups for all programs, properties, and products.\nAtlassian products\nGet to know the latest news about our products and solutions.\nCompany overview\nLearn more about the history of Atlassian, including our company mission, values, key milestones, and our latest facts and figures.\nPress releases\nCheck out the latest company news."
    },
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/company/contact",
        "Content_Type": "Website Content",
        "Raw_Text": "Our teams are here to help\nQuestions, bug reports, feedback — we’re here for it all.\nOur offices around the world\nWe are a truly global team with offices in amazing cities. Explore the world of Atlassian.\nQuestions, bug reports, feedback — we’re here for it all.\nWe are a truly global team with offices in amazing cities. Explore the world of Atlassian."
    },
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/software/jira/service-management/features",
        "Content_Type": "Website Content",
        "Raw_Text": "Premium\nConfidently scale your IT service management\nFuture-proof your ITSM practices with powerful AI capabilities and modern incident, change, asset, and configuration management that scales.\nEverything teams need to deliver value fast\nWhether you’re just getting started, or looking to switch to a more fast, flexible ITSM solution, Jira Service Management comes with the features you need to unlock your teams.\nSupercharge your productivity with Atlassian Intelligence\nCut down on tedious tasks and empower any team to deliver exceptional service with AI-powered ITSM.\nSupercharge your service management with our robust API\nTake advantage of Jira Service Management Connect and integrate with your favorite software tools. Build custom add-ons with our REST API and open platform to supercharge your service desk. Learn more.\nDon’t just take our word for it\nIndustry analysts, consultants, and customers agree that Jira Service Management is exceptional ITSM software\nForrester\nGartner"
    },
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/software/jira/service-management/pricing",
        "Content_Type": "Website Content",
        "Raw_Text": "Service management that scales\nIncludes:\nEverything from Free plus:\nEverything from Premium plus:\nThe prices shown are estimates and aren't binding for either you or Atlassian. The amount you are billed may be different if you change your scope of use, including by updating your agent count or exceeding your base plan usage of Assets or Virtual Service Agent.\nCompare features\nFree | Standard | Premium | Enterprise | |\n|---|---|---|---|---|\n| Collection features | ||||\nApps | Free Jira Service Management Free, Customer Service Management | Standard Jira Service Management Standard, Customer Service Management, Rovo Agents | Premium Jira Service Management Premium, Customer Service Management, Rovo Agents, Assets | Enterprise Jira Service Management Enterprise, Customer Service Management, Rovo Agents, Assets |\n| Free 3 agents, unlimited customers | Standard 20,000 agents, unlimited customers | Premium 20,000 agents, unlimited customers | Enterprise 20,000 agents, unlimited customers | |\n| Free One | Standard One | Premium One | Enterprise Multiple, up to 150 | |\n| Free 2 GB file storage | Standard 250 GB file storage | Premium Unlimited file storage | Enterprise Unlimited file storage | |\n| Free 100 emails per day | Standard Unlimited | Premium Unlimited | Enterprise Unlimited | |\n| Free 500 rule runs per month | Standard 5,000 rule runs per month | Premium 1,000 rule runs per user per month | Enterprise Unlimited rule runs | |\n| Free Unlimited service portals | Standard Unlimited service portals, Custom branding with your company URL | Premium Unlimited service portals, Custom branding with your company URL, multiple help centers | Enterprise Unlimited service portals, Custom branding with your company URL, multiple help centers | |\n| Free Default and customizable reports | Standard Default and customizable reports | Premium Default and customizable reports | Enterprise Advanced analytics and data connectors | |\n| Free Atlassian Community | Standard 9/5 regional support | Premium 24/7 support for critical issues | Enterprise 24/7 dedicated senior support for all issues | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Jira Service Management: Request Management | ||||\n| Free Not included | Standard Not included | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Jira Service Management: Incident and Problem Management | ||||\n| Free Not included | Standard Related resources, similar alerts, incident suggestions panel | Premium Related resources, similar alerts, incident suggestions panel, alert grouping, AI incident creation, PIR generation, Slack incident summary and timeline generation | Enterprise Related resources, similar alerts, incident suggestions panel, alert grouping, AI incident creation, PIR generation, Slack incident summary and Slack timeline generation | |\n| Free Unlimited alerts, unlimited alert email notifications, and 200 SMS per month | Standard Unlimited alerts, unlimited alert email notifications, and SMS | Premium Unlimited alerts, unlimited alert email notifications, SMS, and voice | Enterprise Unlimited alerts, unlimited alert email notifications, SMS, and voice | |\n| Free Schedules, escalation policy | Standard Schedules, escalation policy | Premium Schedules, advanced escalation and routing | Enterprise Schedules, advanced escalation and routing | |\n| Free 1 month | Standard 1 year | Premium 3 years | Enterprise 5 years | |\n| Free Not included | Standard Not included | Premium Manual, automatic, and API | Enterprise Manual, automatic, and API | |\n| Free Not included | Standard Not included | Premium ChatOps tools, monitoring, and advanced alert integrations | Enterprise ChatOps tools, monitoring, and advanced alert integrations | |\n| Free Not included | Standard Not included | Premium Invite, update, and email internal and external stakeholders, and create stakeholder groups. | Enterprise Invite, update, and email internal and external stakeholders, and create stakeholder groups. | |\nPost-incident reviews | Free | Standard | Premium | Enterprise |\n| Free | Standard | Premium | Enterprise | |\n| Jira Service Management: Change Management | ||||\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Assets: Asset and Configuration Management | ||||\n| Free Not included | Standard Not included | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Customer Service Management | ||||\n| Free | Standard Included. $1 per resolution. | Premium Included. $1 per resolution. | Enterprise Included. $1 per resolution. | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Jira Service Management: Security and Controls | ||||\nUptime SLA | Free Not included | Standard Not included | Premium 99.9% | Enterprise 99.95% |\n| Free Requires Atlassian Guard Standard subscription | Standard Requires Atlassian Guard Standard subscription | Premium Requires Atlassian Guard Standard subscription | Enterprise Included | |\n| Free Requires Atlassian Guard Premium subscription | Standard Requires Atlassian Guard Premium subscription | Premium Requires Atlassian Guard Premium subscription | Enterprise Requires Atlassian Guard Premium subscription | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise | |\n| Free | Standard | Premium | Enterprise |\nGet more details\nHow to calculate your subscription cost\nPayment options\nFree trial period, refunds, & subscription plan details\nDefinitions of agent and customer\nAbout licenses and billing by user type\nCloud and self-managed options\nSAML SSO\nActive Directory\nChoosing Premium Plan or Standard\nAtlassian Guard and Premium plan\nAssets pricing\nVirtual service agent pricing\nQuestions?\nWe have answers. Read our full list of common questions and answers for general cloud pricing and licensing or Service Collection pricing and licensing."
    },
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/software/jira/service-management/itsm-software",
        "Content_Type": "Website Content",
        "Raw_Text": "Jira Service Management is purpose-built for ITSM\nJira Service Management helps IT support, operations, and business teams deliver exceptional service experiences to employees and customers.\nSupercharge your service\nDeliver valuable service experiences on one platform without the burden of heavy, rigid processes that create siloes. Tap into the power of Atlassian Intelligence to optimize the flow of work so you can focus on work that matters.\nIncrease collaboration and visibility\nImprove productivity by tracking work across the enterprise through an open, collaborative platform. Link issues across Jira and connect data from other software development tools, so your IT support and operations teams can rapidly respond to requests, incidents, and changes.\nScale efficiently\nAs markets become more competitive, speed is the name of the game. Create value streams that eliminate repetitive tasks and manual processes with the help of artificial intelligence. Provide efficient service by using no-code forms, workflows, and automations.\nDeliver on SLAs\nGet the important things done first with prioritized queues. Configure, click, and get going in minutes.\nRespond to issues, fast\nBring your development, IT support, and operations teams together to rapidly respond to, resolve, and continuously learn from incidents.\n400+ forms and templates\nUse pre-designed forms and customizable templates that make it easy to get started and provide service faster.\nAutomated workflows\nLet automation do the work for you by linking related Jira tickets to provide better support, or auto-assigning issues to streamline processes.\nDeploy with confidence\nEmpower your IT teams with contextual information around changes from software development tools so they can make better decisions and minimize risk.\nLearn about Atlassian’s approach to ITIL with Jira Service Management\nTEMPLATES\nITSM templates to help you get started fast\nGive the right people the context they need to take action. Manage requests, incidents, and changes to deliver great service, fast.\nAUTOMATION\nAutomation library for improved efficiency\nScale your IT service management by automating repetitive tasks. Automation enables you to provide outstanding customer support with a lean team, helping distributed teams thrive. Below are some of the most commonly used automation rules for Jira Service Management.\nGet improved IT service management\nChoose Jira Service Management to deliver exceptional service experiences and accelerate the flow of work."
    },
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/software/jira/service-management/it-operations",
        "Content_Type": "Website Content",
        "Raw_Text": "AI-powered Modern IT Operations\nConnect software development and IT in Jira Service Management, an AI-powered solution that helps teams detect, resolve, and prevent service disruptions while enabling change velocity and innovation.\nImprove service resilience and responsiveness to change\nDetect, resolve, and prevent incidents with AIOps\nReduce alert fatigue and swarm on incidents more efficiently. Make data-driven decisions quickly to resolve issues and deliver high-performing services at scale.\nAccelerate the flow of work between Dev and IT Operations\nSeamlessly collaborate across Dev and IT Operations teams with AI-powered incident, problem, and change management workflows - united on the Atlassian cloud platform.\nThe Atlassian platform transforms how teams collaborate on work, share knowledge, and drive decisions\nPowered by the teamwork graph, Atlassian’s data layer connects teams, tools, and data combined with AI to deliver personalized suggestions and related resources to help teams be more productive.\nMake data-driven IT decisions\nJira Service Management Assets provides a flexible data structure for managing Configuration Items (CIs) and their relationships, enabling teams to assess change risks and troubleshoot incidents quickly to prevent business outages.\nFeatured capabilities in Jira Service Management for IT Operations Management (ITOM)\nEnd-to-end incident resolution\nJira Service Management provides a comprehensive solution for incident management. Keep critical services always-on and high performing with a single AI-powered platform that integrates alerting and on-call with incident detection, investigation, and resolution.\nComplete visibility into your IT infrastructure\nJira Service Management service mapping connects Dev and IT teams so they can visualize relationships and dependencies between IT components, applications, and cloud services to accelerate incident, change, and problem management workflows.\nOperations assistants with specialized skills\nRovo agents in Jira Services Management are ready to assist your team to detect, resolve, and prevent incidents. Instantly surface related incidents & subject matter experts, create Post Incident Reviews (PIRs), and conduct a root cause analysis (RCA) of every major incident.\nMitigate risk & accelerate change\nAutomated change risk assessments and advanced approval workflows keep Dev and IT Ops teams in sync - speeding up software delivery while managing risk and staying compliant.\nAccelerate the flow of work with automation & playbooks\nAutomation in Jira Service Management keeps work flowing across teams. Get started quickly with pre-defined templates or build your own with the low-code/no-code rule builder, and launch playbooks that guide agents through complex, repeatable processes."
    },
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/software/jira/service-management/features/enterprise-service-management",
        "Content_Type": "Website Content",
        "Raw_Text": "Jira Service Management for Enterprise Service Management\nIT isn’t the only part of your business that can benefit from a service mindset. With Jira Service Management, teams across the enterprise can deliver great service, fast.\nEnsure anyone can get help quickly\nAllow teams such as human resources, marketing, legal, finance, facilities, and more to create their own service portal to manage requests. Enable every team to shape workflows to fit their needs while unlocking collaboration and maintaining alignment across the enterprise.\nGet started fast\nWith templates and automations for every use case, teams can easily spin up service desks that fit their unique requirements. Set up workflows with a drag-and-drop editor. Customize forms to collect the information you need without the back and forth.\n200+ form templates\nUse pre-designed forms and customizable templates that make it easy to get started and provide service faster.\nAutomated workflows\nLet automation do the work for you by linking related Jira tickets to provide better support, or auto-assigning issues to streamline processes.\nReporting\nFull visibility across the whole organization enables business teams to make better judgement.\nKnowledge management\nEmpower employees to find answers to common questions using a self-service portal. Leverage a knowledge base that surfaces relevant articles to deflect requests.\nDelegated permissions\nDemocratize service management by delegating administration permissions to project owners. Increase autonomy while maintaining visibility and control.\nIntegrate your chat service\nCapture and track tickets in Slack or Microsoft Teams, a critical operational solution across all business teams.\nTEMPLATES\nBusiness team templates to help you get started\nGive the right people the context they need to take action. Manage requests, incidents, and changes to deliver great service, fast.\nINTEGRATIONS\nAll your favorite apps in one place\nNeatly integrate Jira Service Management with leading third-party tools. Connect your favorites with the 5,000+ apps in our marketplace, or build your own custom apps with Atlassian’s Forge.\nGet improved enterprise service management\nChoose Jira Service Management to deliver exceptional service experiences and accelerate the flow of work."
    },
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/software/jira/service-management/customer-service-software",
        "Content_Type": "Website Content",
        "Raw_Text": "Reimagine customer service together\nAn AI-powered customer service solution that gives your team the context to deliver smarter service and improve with every interaction.\nAlways see the full picture\nWith the power of the Teamwork Graph, data from across your business comes together so both AI and support agents have the context they need to resolve requests faster and deliver service that feels personal.\nUnite teams around the customer\nGet rid of silos from disparate tools and bring support, dev, product, and ops together on one platform. Share customer requests across teams, get access to feedback and ideas, and deliver customers fixes faster.\nGet started fast\nWith access to your organization’s knowledge, teams, and customer data, AI gets started instantly. No long setup or consultants needed – just faster resolutions and happier customers from day one."
    },
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/software/jira/service-management/hr",
        "Content_Type": "Website Content",
        "Raw_Text": "High-velocity HR service management\nProvide an exceptional employee experience\nCustomize your help center to offer employees one intuitive place to get the support they need. With a hub for announcements, knowledge base articles, and request intake, you can share information, deflect common issues, and handle sensitive cases with care.\nStreamline processes across your projects\nEasily connect your HR tools and create end-to-end employee journeys that span projects and departments. Synchronize data and automate workflows to streamline complex, multi-team processes like onboarding.\nImpactful service, fast\nMeasure what matters\nGenerate insights with powerful reporting. Identify opportunities to improve productivity and deliver better employee support with CSAT reports and request data.\nChat and email support\nEnable employees to submit requests through Slack, Microsoft Teams, and email. Provide support where they work and ensure you never miss a request.\nVirtual service agent\nConfigure the virtual service agent to automate employee FAQ resolution, deflect incoming requests, and save agents' time.\nSecurity and controls\nLimit access to who can initiate certain requests and lock down sensitive information, including data from third-party tools.\nKnowledge base\nUse the knowledge base to surface relevant articles and deflect requests. Empower employees to find answers to common questions using a self-service portal.\nMultiple help centers\nCreate and customize multiple help centers for different audiences like new hires, managers, and former employees.\nIntegrations\nIntegrate with trusted applications and integrations and sync data across systems.\nAutomation\nAutomate tasks to improve processes like onboarding. For instance, route requests to the right approver or auto-assign issues to teammates.\nReporting\nAnalyze reports that share the volume of incoming requests, how many employees successfully onboarded, your team’s workload, and more.\nDynamic forms\nCollect important context with forms that adapt based on employee inputs. Reduce back-and-forth and streamline information gathering.\nFeatured resources\nProduct guide"
    },
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/software/jira/service-management/help-desk-software-small-business-software",
        "Content_Type": "Website Content",
        "Raw_Text": "A high-powered help desk built for growing teams\nSmall growing teams are able to stay lean and move at high velocity without the high cost by ditching email, spreadsheets, and reminders, and switching to Jira Service Management’s ticketing solution.\nEase the chaos with ticket management\nDitch spreadsheets and emails and gain control over incoming requests. With a service desk requests can be prioritized, routed, and assigned based on your unique workflows. Nothing falls through the cracks, resolutions are faster, and you and your customers are more productive.\nSave time with low/no code configurations\nGet started fast with templates and automations for all kinds of teams. Making spinning up service desks to fit any team’s unique requirements a breeze. Teams can even customize forms to collect the information they need without the back and forth and set up workflows with a drag-and-drop editor.\nMake it easy to get help and provide support\nTake your assistance to the next level by extending beyond email or portal support and instead, offer help from the applications that your users are currently communicating in - like Slack or Microsoft Teams. Provide support agents one central location to manage and respond to all those requests.\nChat Support\nProvide support where the conversation starts, in your in Slack or Microsoft Teams chat platform.\n400+ forms and templates\nUse pre-designed no-code forms and templates to start providing service faster. Customize as much or as little as you like to fit your team’s needs.\nAutomated workflows\nLet automation do the work for you by auto-replying with canned responses or auto-assigning issues to streamline processes.\nKnowledge Management\nEnable self-service, deflect more requests, and manage knowledge articles - all while fostering team collaboration.\nDeliver on SLAs\nGet the important things done first with prioritized queues. Configure, click, and get going in minutes.\nFlexible asset and configuration management\nTrack assets, configuration items, and resources and get visibility into critical relationships between applications.\nMULTI-CHANNEL SUPPORT\nCapture requests from your chat tools\nSupport happens in real-time between a support professional and a user on chat platforms like Slack or Teams, in email, or via the portal. Make getting help easier with fast, human, and easy-to-submit requests for your customers.\nAUTOMATION\nAutomations for Jira Service Management\nStreamline processes and workflows with a few clicks using no-code automation. By automating your processes and workflows, you remove the need for you and your team to perform manual, repetitive tasks – and you can focus on the work that matters.\nDeliver excellent service as your team scales\nChoose Jira Service Management to deliver exceptional service experiences and accelerate the flow of work."
    },
    {
        "Ticker": "TEAM",
        "Company": "Atlassian",
        "Source_URL": "https://www.atlassian.com/software/jira/service-management/premium",
        "Content_Type": "Website Content",
        "Raw_Text": "Jira Service Management Cloud Premium\nConfidently scale and modernize service management\nTransform service management with a complete ITSM solution from request intake to incident resolution with Jira Service Management Cloud Premium\nModernize end-to-end service management\nDeliver exceptional service experiences with advanced capabilities to streamline request intake, accelerate incident response, deploy changes faster, and more – all on a single platform.\nAccelerate incident resolution with AIOps\nEnable Dev and Ops teams to intelligently detect, resolve, and prevent incidents to deliver high-performing services at scale. Reduce alert fatigue and swarm on incidents more efficiently with AI-powered alert grouping, incident creation, and PIR generation.\nSecurely scale service management\nEmpower your admins with added controls and security safeguards. Provide teams with the keys to build and customize their own services using no-code capabilities within an IT-regulated environment.\nRecognized by industry experts\nAtlassian is a Leader in the 2025 Forrester Wave: DevOps Platforms\nAtlassian is a Leader in the 2024 IDC MarketScape for worldwide ITSM software\nJira Service Management awarded G2 Top 50 IT Management Products in Best Software Awards 2023\nChange management\nAutomatically create change records for standard changes with deployment tracking. Use deployment gating to allow or prevent deployments at specific points in the change management process, with seamless integrations to CI/CD tools such as Bitbucket, Jenkins, and GitLab.\nAdvanced incident management\nUse alert grouping, incident data, service and infrastructure health analysis to detect and resolve incidents faster. See all deployments and commits leading up to an incident and gain insights into code changes with the incident investigative view.\nAIOps\nAccelerate incident resolution with AI-driven alert grouping, incident creation, and PIR generation. Make data-driven decisions quickly to resolve issues and deliver high-performing services at scale.\nAssets\nTrack assets, configuration items, and resources and get visibility into critical relationships between applications.\nAdmin controls\nGain a better understanding of your product usage and security practices with admin insights. Test and control the rollout of updates and new apps in a sandbox copy of your environment. Use release tracks to manage when and how changes are released to end users.\n24/7 support for critical issues\nBolstered security safeguards\n99.9% uptime SLA\nNot sure which plan is right for you? Get help from a product expert.\nLearn more about Jira Service Management\nVideo\n6 Reasons to Upgrade to Premium\nVideo\nJira Service Management Premium: Feature Highlights\nVideo\nAsset & Configuration Management Highlights\nSee how Cloud Premium stacks up\nJira Service Management Cloud Premium is equipped with the advanced capabilities you need for modern service IT service management. Compare with our other plans to see which is right for you.\nFeatures | Standard Plan | Premium Plan | Enterprise Plan |\n|---|---|---|---|\n| General Service Management | |||\n| Rovo | Standard Plan\n| Premium Plan\n| Enterprise Plan\n|\n| Virtual service agent | Standard Plan\n| Premium Plan Includes 1,000 assisted conversations per month or 12,000 assisted conversations per year with the option to purchase more via add-on at volume discounts. | Enterprise Plan Includes 1,000 assisted conversations per month or 12,000 assisted conversations per year with the option to purchase more via add-on at volume discounts. |\n| Asset & Configuration Management | |||\n| Asset discovery | Standard Plan\n| Premium Plan\n| Enterprise Plan\n|\n| Object schemas | Standard Plan\n| Premium Plan\n| Enterprise Plan\n|\n| Object types | Standard Plan\n| Premium Plan\n| Enterprise Plan\n|\n| Schema templates | Standard Plan\n| Premium Plan\n| Enterprise Plan\n|\n| Incident Management | |||\n| Incident command center | Standard Plan\n| Premium Plan\n| Enterprise Plan\n|\n| Incident investigation review | Standard Plan\n| Premium Plan\n| Enterprise Plan\n|\n| Heartbeat monitoring | Standard Plan\n| Premium Plan\n| Enterprise Plan\n|\n| Alerts/major incidents data visualization & analytics | Standard Plan\n| Premium Plan\n| Enterprise Plan\n|\n| Service subscriptions | Standard Plan\n| Premium Plan\n| Enterprise Plan\n|\n| External services | Standard Plan\n| Premium Plan\n| Enterprise Plan\n|\n| Service & infrastructure health analysis | Standard Plan\n| Premium Plan\n| Enterprise Plan\n|\n| Major incidents per month | Standard Plan 100 | Premium Plan Unlimited | Enterprise Plan Unlimited |\n| Incident creation | Standard Plan Manual | Premium Plan Manual, Auto, API, and Template | Enterprise Plan Manual, Auto, API, and Template |\n| Postmortems | Standard Plan 5 | Premium Plan Unlimited | Enterprise Plan Unlimited |\n| Alerts & Notifications per month | Standard Plan Unlimited alerts, emails, and SMS | Premium Plan Unlimited alerts, emails, SMS, and voice | Enterprise Plan Unlimited alerts, emails, SMS, and voice |\n| Change Management | |||\n| Risk assessment through automation | Standard Plan\n| Premium Plan\n| Enterprise Plan\n|\n| Multi-user/group approvals | Standard Plan\n| Premium Plan\n| Enterprise Plan\n|\n| Keep track of CI/CD changes | Standard Plan\n| Premium Plan\n| Enterprise Plan\n|\n| Change gating in CI/CD tools | Standard Plan\n| Premium Plan\n| Enterprise Plan\n|\n| AIOps | |||\n| Standard Plan\n| Premium Plan\n| Enterprise Plan\n| |\n| Standard Plan\n| Premium Plan\n| Enterprise Plan\n| |\n| Standard Plan\n| Premium Plan\n| Enterprise Plan\n| |\n| Standard Plan\n| Premium Plan\n| Enterprise Plan\n| |\n| Standard Plan\n| Premium Plan\n| Enterprise Plan\n| |\n| Standard Plan\n| Premium Plan\n| Enterprise Plan\n| |\n| Standard Plan\n| Premium Plan\n| Enterprise Plan\n| |\n| Standard Plan\n| Premium Plan\n| Enterprise Plan\n| |\n| Problem Management | |||\n| Problem queues | Standard Plan\n| Premium Plan\n| Enterprise Plan\n|\n| Problem work category | Standard Plan\n| Premium Plan\n| Enterprise Plan\n|\n| Platform, Support, Admin | |||\n| Admin insights | Standard Plan\n| Premium Plan\n| Enterprise Plan\n|\n| IP allowlisting | Standard Plan\n| Premium Plan\n| Enterprise Plan\n|\n| Sandbox | Standard Plan\n| Premium Plan\n| Enterprise Plan\n|\n| Release tracks | Standard Plan\n| Premium Plan\n| Enterprise Plan\n|\n| Org-level billing | Standard Plan\n| Premium Plan\n| Enterprise Plan\n|\n| Data residency | Standard Plan\n| Premium Plan\n| Enterprise Plan\n|\n| Uptime SLA | Standard Plan\n| Premium Plan 99.9% | Enterprise Plan 99.95% |\n| Global/multi-use automation | Standard Plan\n| Premium Plan 1,000 rules per agent | Enterprise Plan Unlimited automation rules |\n| SSO, SCIM, Active directory sync | Standard Plan Requires Atlassian Guard subscription | Premium Plan Requires Atlassian Guard subscription | Enterprise Plan Included |\n| Storage | Standard Plan 250 | Premium Plan Unlimited | Enterprise Plan Unlimited |\n| Support team | Standard Plan Cloud support (regional business hours) | Premium Plan Cloud support team (24/7 premium support, <1 hour support for critical issues) | Enterprise Plan Dedicated senior support team (24/7 Enterprise support) |"
    }
]