[
    {
        "Ticker": "TMUS",
        "Company": "T-Mobile US",
        "Source_URL": "https://www.t-mobile.com/",
        "Content_Type": "Website Content",
        "Raw_Text": "iPhone 17—Get 4 On Us . Plus, 4 lines for $25/line/mo.\niPhone 17—Get 4 On Us . Plus, 4 lines for $25/line/mo.\nNo trade-in needed when you bring your number on our Essentials promo plan."
    },
    {
        "Ticker": "TMUS",
        "Company": "T-Mobile US",
        "Source_URL": "https://www.t-mobile.com/news/category/network",
        "Content_Type": "Website Content",
        "Raw_Text": "By turning the toggle ON (blue), you Accept the use of this tool when you visit our sites. By turning the toggle OFF (gray), you Reject the use of this tool when you visit our sites.\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nFor GPC reporting purposes"
    },
    {
        "Ticker": "TMUS",
        "Company": "T-Mobile US",
        "Source_URL": "https://www.t-mobile.com/dialed-in/wireless/how-satellite-phone-service-works",
        "Content_Type": "Website Content",
        "Raw_Text": "Whether you’re hiking through the mountains, road-tripping through remote stretches of land, camping off the grid, or just trying to stay in touch during a natural disaster, connectivity dead zones can be a frustrating (and sometimes dangerous) issue. That’s where satellite technology steps in. Let’s take a closer look at how this powerful technology works, and how it’s changing the way we stay connected.\nIn this article we’ll cover the following topics:\n- What is a satellite and what can it do?\n- Satellite history: Then vs. Now\n- How do satellites work?\n- Does satellite connectivity work anywhere?\n- Satellite vs. terrestrial networks: Connectivity differences\n- 4 different options for satellite direct-to-device connectivity\n- How these different options keep you connected\n- 4 ways to get satellite phone connectivity: Comparison chart\nWhat is a satellite and what can it do?\nA satellite is defined as anything in space that orbits another larger object (e.g., the moon orbiting the earth). However, when you hear the word \"satellite\" today, it’s likely referring to the thousands of human-made satellites orbiting Earth. Right now, there are about 10,000 active satellites in orbit, a number that has quadrupled in the past five years, and one that is only expected to grow. These satellites provide us with everything from GPS navigation and weather information to internet coverage and phone service, which we’ll discuss in detail later.\nSatellite history: Then vs. now\nWhile the United States launched its first-ever satellite back in 1958, it could only transmit a simple, pre-recorded holiday message from President Dwight D. Eisenhower. Just four years later, a satellite with rechargeable solar panels was able to transmit the first ever live telecast, transmitting data, voice, TV, and facsimile between the U.S. and Europe, making satellite history and jumpstarting a communications revolution.\nToday, satellite technology is literally in the palm of your hand, ready to keep you connected via dedicated satellite phones, smartphones with specialized satellite hardware, accessories, and even an innovative new satellite-to-mobile service. Before we get into those details, let’s take a look at how satellite connectivity works and how it’s different from terrestrial networks, like 5G, and then go from there.\nHow do satellites work?\nSatellite technology works by sending signals from space to antennas on earth, reaching areas that 5G can’t, such as mountaintops, oceans, or distant national parks.\nSatellite technology has four important factors to consider:\n- Orbit 101: Communication satellites can sit in various orbits, closest to earth being low‑Earth orbit (LEO) and furthest away being geosynchronous orbit (GEO). LEO is a few hundred miles up, while GEO is roughly 22,000 miles above Earth. LEO fleets surround the planet with many fast‑moving craft, while a handful of GEO satellites hover over the same spot to provide broad, fixed coverage.\n- Signal path: When your device transmits, the radio waves travel to an overhead satellite, down to a ground station, then enter the regular phone or internet network. Replies make the same trip in reverse.\n- Latency trade‑offs: Since GEO satellites sit very far away, voice or data packets take longer to complete the round trip.\n- Constellation size: LEOs, being closer to Earth, require more satellites to cover the geography. They are constantly on the move, and they have to move quickly to avoid the pull of earth’s gravity.\n- Line‑of‑sight matters: Dense forests, mountains, tall buildings, or even heavy storms can block or weaken the signal, so the clearest connections happen in open spaces with an unobstructed view of the sky. Let’s take a closer look at why location matters.\nDoes satellite connectivity work anywhere?\nSatellite service is incredibly useful for filling gaps in coverage, and it works especially well in open areas like plains, deserts, and open water, where it typically offers the best performance. However, it isn’t without limitations. Sometimes the satellites fly at a lower elevation angle and are not directly above you, in which case obstructions can block the signal even if part of the sky is visible. For example:\n- Deep canyons, dense forests, and tall structures, as mentioned, can reduce the line of sight to the sky, potentially leading to delays or lost connections.\n- Certain regions may have limited or no coverage due to international regulations or restrictions. These can include zones dedicated to scientific research, radio astronomy observatories where radio silence is essential, or areas near national borders where satellite operations are limited by cross-border coordination agreements.\n- There can be a noticeable delay, particularly with voice communications, due to the distance signals must travel.\nKnowing these potential limitations can help you set the right expectations and get the most out of your satellite-enabled device.\nSatellite vs. terrestrial networks: Connectivity differences\nBoth terrestrial and satellite networks are designed to keep people connected but they do it in very different ways. One big difference is the capacity per area covered. For example, satellites cover a lot of geography but have limitations on how much spectrum they can transmit. Terrestrial networks, like 5G for example, can use more spectrum over a smaller geography, offering super-fast speeds and low latency, but it’s still dependent on a dense network of ground-based towers. This works great in urban and suburban areas and, increasingly, in many rural locations. However, there are areas that technology can’t reach, causing gaps in coverage.\nSo, when comparing a terrestrial network like 5G to satellite, the key difference is location. 5G is ideal for high-speed urban, suburban, and even some rural areas, while satellite technology fills in the gaps and provides coverage in places where cell towers can’t reach. Now that you understand more about satellite technology, let’s take a closer look at the different types of phones, accessories, and services that can keep you connected.\n4 different options for satellite direct-to-device connectivity\n- Dedicated satellite phones: These are built specifically to connect to satellites instead of land-based cell towers, making them a good choice for those living (or working) full-time in very remote areas with virtually no cell coverage. These phones aren’t your standard, everyday smartphones. They’re stripped-down versions typically with bulkier antennas and rugged designs, made to withstand harsh conditions. While some newer satellite phones are capable of basic data services, this is still limited compared to traditional mobile broadband. Most people living in populated (or semi-populated) areas probably don’t need this type of specialty phone, since standard smartphones will likely have access to cell towers most of the time.\n- Smartphones with specialized satellite hardware: On occasions where your connectivity is spotty (e.g., camping trips, rustic backroads, or during major outages) these types of smartphones can play a role in keeping you connected. Newer devices from brands like Apple, Samsung, Google, and Motorola now offer emergency satellite messaging or limited satellite service when no cell signal is available. These peace-of-mind features are becoming increasingly common in new devices and are expected to grow in the coming years. However, unless you happen to own one of these newer phones, they tend to be pricey. Plus, availability depends on the brand and carrier.\n- Satellite accessories: Some companies offer satellite communication devices like dongles that pair with your existing smartphone via Bluetooth or a cable, adding satellite functionality. However, with advances in smartphone technology and new satellite-to-mobile service, this is becoming a less common option, unless you have an old phone that you want to hang on to.\n- Satellite-to-mobile service: This is a new type of service that doesn’t require a special satellite phone, accessory, or even a brand-new smartphone with satellite hardware. T-Mobile partnered with SpaceX’s Starlink to bring you T-Satellite, the only satellite + mobile network that automatically connects with the satellite-compatible phone in your pocket during those times you’re off the grid. It works with most modern smartphones from the last four years. Plus, you don’t have to switch your main service to connect. People using any major carrier can sign up for service for a fee*.\n*With T-Satellite, texting & select satellite-ready apps with compatible device in most outdoor areas in the U.S. where you can see the sky. Satellite service, including text to 911, may be delayed, limited, or unavailable. T-Satellite is included with T-Mobile’s Experience Beyond plan or can be added as a monthly subscription for $10 per month.\nHow these different options keep you connected\n- Dedicated satellite phones. As mentioned earlier,these pared-down, rugged phones are built specifically for satellite communication and are generally used in very remote areas. You can purchase or rent brands like Iridium, Inmarsat, Thuraya, and Garmin, to name a few, from specialty retailers or service providers. They aren’t intended to rely on cell towers at all – so they do NOT work on regular cell phone networks like 4G and 5G. In fact, they bypass them entirely. When you make a call, the phone connects directly to a satellite overhead using a built-in, often visible antenna. Here’s how it works, step by step:\n- Connecting to the sky: Your voice gets turned into a radio signal and sent from the phone to a nearby satellite. For this to work, the phone needs a clear view of the sky, no buildings, dense trees, or mountains blocking the way.\n- Routing through space: That satellite either sends the signal straight down to a ground station, or (depending on the network) passes it along to another satellite until it finds a ground connection.\n- Back to earth: Once the signal reaches the ground, it’s routed through traditional phone networks so it can reach whoever you’re calling.\nThe same process happens in reverse when someone calls you. These phones are used by emergency crews, explorers, sailors, and others who regularly travel beyond the reach of cell networks.\n- Smartphones with specialized satellite hardware. Smartphones with satellite support work a little differently, as these devices are designed to connect to satellites only when you lose cell service and are off the grid. Since satellite technology needs to be built into these types of phones, availability is usually limited to the newest devices. Here's how that works:\n- Finding a satellite: When you try to send a message via satellite, the phone walks you through pointing it toward the sky so it can \"see\" a satellite, because it needs a direct line of sight, just like a dedicated sat phone.\n- Short messages only: Because smartphones use smaller antennas and less powerful radios, they typically send only short bits of information, like text messages and GPS coordinates, not voice calls. Plus, you need to manually connect to satellite service when you want to send or receive a text messages.\n- Relaying your message: That message gets sent to a satellite, relayed to a ground station, and then passed on to emergency services or a response center that can help you.\nWhile these smartphones can’t do everything (yet) that a satellite phone can when you’re off the grid, they still provide a critical safety net in remote areas. As phones continue to improve, you’ll see more features and broader coverage over time.\n- Satellite accessories. As mentioned, these are entirely separate devices that work with your phone via a Bluetooth connection or a cable. While it will vary depending on the device, prior to use you’ll generally need to:\n- Download and install an app.\n- Pair your phone with your satellite device (it should automatically pair after the initial setup).\n- Set up any contacts.\n- A satellite subscription may also be required.\nDepending on the device, you’ll send messages through the app when you’re off the gird. Keep in mind, you’ll need a clear view of the sky, just like with the other two options above.\n- Satellite-to-mobile service (T-Satellite): Only available from T-Mobile, this service lets you connect when you’re off the grid using most modern smartphones from the last four years. Here’s how it works:\n- Just use your phone like you normally do. Send and receive texts, share your location, and use core features on select apps. No setup. No stress.\n- No need to point your phone at the sky to find a connection.\n- Since satellites are moving, your phone will disconnect and automatically reconnect to the next available satellite until a message is sent.\nYou don’t have to switch your main service provider to use the service. It’s included for free on T-Mobile’s best plans, or as a low-cost add-on for all other plans, even if T-Mobile isn’t your main carrier.\n4 ways to get satellite phone service: Comparison chart\nThis helpful chart below gives you a quick look at all of the options we’ve covered, including the add-on accessories.\n| Option | Satellite-to-Mobile Service (T-Satellite) | Dedicated Satellite Phones | Smartphones with specialized satellite hardware | Add-On Accessories (Dongles) |\n|---|---|---|---|---|\n| Device Required | Most modern smartphones from the last 4 years | Specialized satellite phone (e.g., Iridium, Inmarsat) | New Android smartphones (Galaxy S25, Pixel 9) and iPhone 14 or newer (eSIM compatible) | Existing smartphone + external device |\n| Hardware Needed | None | Entirely different device | Requires built-in satellite hardware | Requires separate dongle paired via Bluetooth or cable |\n| Carriers Supported | T-Mobile (and as an add-on for other major U.S. carriers) | Independent of cell carriers | Dependent on manufacturer and carrier | Typically carrier-agnostic |\n| Device Cost | N/A | $500–$1,500+ | $800–$1,300+ (flagship phone prices) | $250–$500+ for the dongle |\n| Ongoing Cost | Free on some plans or $10/month at launch (regularly $15/month) | $30–$100+/month service plans | Often free for emergency use (Apple), varies for others | $10–$30+/month subscriptions |\n| Ease of Use | Seamless: text directly from normal messaging app | Requires separate number and app interface | Integrated emergency messaging UI; Must point phone to the sky to “find” a satellite | Use via app + pairing setup |\n| Supports Voice/Calls | Voice and video chatting is only supported through WhatsApp today | Yes | No (texts, SOS, and location sharing for now) | No (usually text-only or SOS features) |\n| Data Capability | Access to T-Satellite-ready apps available for designated devices | Limited (slow-speed email/web in some models) | No data over satellite yet | No data over satellite |\n| Coverage Area | Anywhere with clear sky view (Continental U.S. & parts of AK & HI + international coming soon) | Global (depends on provider & satellite constellation) | Varies by region & manufacturer (mostly U.S./Europe) | Global (depends on dongle’s network) |\n| Use Case Ideal For | Everyday users, hikers, travelers, first responders, remote field workers, emergency prep | Professionals, remote field workers, explorers, maritime use | Occasional backcountry/emergency users | Casual users, travelers, temporary remote needs |\n| Best Feature | Just use you phone like you normally do. Send and receive texts, share your location and use core features on select apps. No setup. No stress. | Reliable voice service globally | Built in (if you’re on a newer device) | Flexibility with existing device |\n| Limitations | Voice and video chatting is only supported through WhatsApp today | Expensive, bulky, overkill for most users; Requires a separate device to carry & service to pay for; won’t work on regular cell phone networks like 4G and 5G | Only works on select phones, text-only, requires learning new interface, may miss incoming messages, smaller satellite constellation | Separate device to charge/carry, can be slow |\nSatellite technology is reshaping how we think about staying connected. From reducing dead zones to providing emergency communication in the world’s most remote places, satellites are becoming a powerful addition to modern mobile service.\nWhether you're an outdoor explorer, frequent traveler, or just want the peace of mind of knowing your loved ones are within reach, understanding how satellites work and how they can work for you can help keep you calm, connected, and prepared, no matter where life takes you.\nWant to learn more about T-Satellite? Click here.\nYou might also be interested in:\n- 4 Best Satellite Phones for 2025, Our Picks\n- T-Mobile Travel Benefits: Customer Discounts, Deals & Perks\n- Check 4G, 5G & T-Satellite Coverage\n*Product pricing and availability are subject to change. Visit our website for the latest offers on phones, devices, and accessories.\nSources:\n- https://www.sciencelearn.org.nz/resources/271-natural-satellites\n- https://www.forbes.com/sites/ericmack/2024/07/19/theres-now-10000-active-satellites-in-orbit-most-belong-to-elon-musk/\n- https://www.nasa.gov/directorates/space-operations/space-communications-and-navigation-scan-program/scan-outreach/fun-facts/#satellite\n- https://motivss.com/how-leo-satellites-are-driving-a-more-connected-world/\n- https://blog.apollosatellite.com/how-to-optimize-your-satellite-phone-for-better-signal-reception/\n- https://internationalsatelliteservices.com/is-your-smartphone-a-satellite-phone/\n- https://www.zdnet.com/article/best-satellite-phone/\n- https://www.szmidjammer.com/blog/satellite-jammer/\n- https://www.fierce-network.com/tech/bullitt-dongle-allows-android-ios-phones-connect-satellite\n- https://www.t-mobile.com/news/network/from-big-cities-to-small-towns-and-places-in-between-t-mobile-customers-are-getting-a-massive-5g-boost\n- https://www.t-mobile.com/support/coverage/satellite-support\n- https://www.cbo.gov/publication/59175\n- https://www.tridon.com/the-importance-of-satellite-phones\n- https://www.satphonestore.com/satellite-phones-and-devices-everything-you-need-to-know\n- https://www.cnet.com/tech/mobile/how-to-use-your-iphones-emergency-sos-via-satellite-to-contact-911/\n- https://electronics.howstuffworks.com/gadgets/travel/satellite-phone.htm"
    },
    {
        "Ticker": "TMUS",
        "Company": "T-Mobile US",
        "Source_URL": "https://www.t-mobile.com/news",
        "Content_Type": "Website Content",
        "Raw_Text": "By turning the toggle ON (blue), you Accept the use of this tool when you visit our sites. By turning the toggle OFF (gray), you Reject the use of this tool when you visit our sites.\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nFor GPC reporting purposes"
    },
    {
        "Ticker": "TMUS",
        "Company": "T-Mobile US",
        "Source_URL": "https://www.t-mobile.com/about-us",
        "Content_Type": "Website Content",
        "Raw_Text": "Giving back while looking ahead.\nOur responsibility extends beyond the boardroom. Through community projects, disaster relief efforts, and green initiatives, the planet and our fellow human beings are always top of mind.\nJoin the team.\nWorking for T‑Mobile is like working with a big, crazy, innovative family. We’re always looking for driven, passionate team members who want to have fun and grow within our organization."
    },
    {
        "Ticker": "TMUS",
        "Company": "T-Mobile US",
        "Source_URL": "https://www.t-mobile.com/our-story/un-carrier-history",
        "Content_Type": "Website Content",
        "Raw_Text": "We changed wireless for our customers.\nUn-carrier has become synonymous with 100% customer commitment. We set out to change the game, and the results speak for themselves. See the moves that got us to where we are today.\nUn-carrier has become synonymous with 100% customer commitment. We set out to change the game, and the results speak for themselves. See the moves that got us to where we are today.\nA re-invention of the old, broken customer service model. We provide a total experience that includes best-in-class, personalized support from\nWe set out to relieve our customers' pain points and ended up changing the wireless industry for good. Look back and at how the Un-carrier grew with each industry-shattering move.\nNo more surprise charges on your monthly bill. We included all sales taxes, surcharges, and regulatory fees on select plans. What you see is what you pay.\nWe introduced a signature unlimited plan that abolished data limits forever.\nUnlimited data on our network. During congestion, the small fraction of customers using >50GB/mo. may notice reduced speeds.\nLoyalty programs usually mean you have to spend more to get rewarded. At\nQualifying plan required.\nGiving customers more of what they crave, we offered unlimited streaming video from top services.\nDetectable video typically streams at DVD quality (480p).\nCustomers were paying extra when in Canada and Mexico. We got rid of that by eliminating high-speed data roaming charges and added unlimited talk and text roaming.\nWe removed upgrade pain, again! We expanded JUMP! to let customers upgrade their phones whenever they want, up to once every 30 days.\nQualifying JUMP! On Demand device required; payments must be current.\nBusiness customers deserve the same treatment as consumers. It’s why we introduced simplified pricing and 24/7 support.\nWe were never fans of \"use it or lose it\" and neither were our customers. So we let unused high-speed data carry over month to month for up to one year.\nInstead of adding charges, we removed them! We introduced\nWanted to break up with your current carrier? We decided to pay off ETFs or outstanding device payments for qualified customers who switched.\nWe set music free from data constraints! Our customers rock, so we decided streaming music from top services should no longer count against data usage.\nQualifying plan required.\nStaying connected abroad shouldn't be another travel expense. We offered our customers unlimited data at 2G speeds and texting in 215+ countries and destinations.\nUpgrades for all! We decided to let customers upgrade as soon as they paid off half their device.\nQualifying JUMP! On Demand device required; payments must be current.\nNo contracts. No Limits. No overages. Customers were no longer locked into their carrier.\nOn all\nStay up to date with notifications - including offers just for you"
    },
    {
        "Ticker": "TMUS",
        "Company": "T-Mobile US",
        "Source_URL": "https://www.t-mobile.com/news/category/devices",
        "Content_Type": "Website Content",
        "Raw_Text": "By turning the toggle ON (blue), you Accept the use of this tool when you visit our sites. By turning the toggle OFF (gray), you Reject the use of this tool when you visit our sites.\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nFor GPC reporting purposes"
    },
    {
        "Ticker": "TMUS",
        "Company": "T-Mobile US",
        "Source_URL": "https://www.t-mobile.com/news/category/un-carrier",
        "Content_Type": "Website Content",
        "Raw_Text": "By turning the toggle ON (blue), you Accept the use of this tool when you visit our sites. By turning the toggle OFF (gray), you Reject the use of this tool when you visit our sites.\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nFor GPC reporting purposes"
    },
    {
        "Ticker": "TMUS",
        "Company": "T-Mobile US",
        "Source_URL": "https://www.t-mobile.com/news/category/community",
        "Content_Type": "Website Content",
        "Raw_Text": "By turning the toggle ON (blue), you Accept the use of this tool when you visit our sites. By turning the toggle OFF (gray), you Reject the use of this tool when you visit our sites.\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nFor GPC reporting purposes"
    },
    {
        "Ticker": "TMUS",
        "Company": "T-Mobile US",
        "Source_URL": "https://www.t-mobile.com/news/category/offers",
        "Content_Type": "Website Content",
        "Raw_Text": "By turning the toggle ON (blue), you Accept the use of this tool when you visit our sites. By turning the toggle OFF (gray), you Reject the use of this tool when you visit our sites.\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nFor GPC reporting purposes"
    },
    {
        "Ticker": "TMUS",
        "Company": "T-Mobile US",
        "Source_URL": "https://www.t-mobile.com/news/category/business",
        "Content_Type": "Website Content",
        "Raw_Text": "By turning the toggle ON (blue), you Accept the use of this tool when you visit our sites. By turning the toggle OFF (gray), you Reject the use of this tool when you visit our sites.\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nFor GPC reporting purposes"
    },
    {
        "Ticker": "TMUS",
        "Company": "T-Mobile US",
        "Source_URL": "https://www.t-mobile.com/news/press",
        "Content_Type": "Website Content",
        "Raw_Text": "By turning the toggle ON (blue), you Accept the use of this tool when you visit our sites. By turning the toggle OFF (gray), you Reject the use of this tool when you visit our sites.\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nFor GPC reporting purposes"
    },
    {
        "Ticker": "TMUS",
        "Company": "T-Mobile US",
        "Source_URL": "https://www.t-mobile.com/news/stories",
        "Content_Type": "Website Content",
        "Raw_Text": "By turning the toggle ON (blue), you Accept the use of this tool when you visit our sites. By turning the toggle OFF (gray), you Reject the use of this tool when you visit our sites.\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nFor GPC reporting purposes"
    },
    {
        "Ticker": "TMUS",
        "Company": "T-Mobile US",
        "Source_URL": "https://www.t-mobile.com/news/media-library",
        "Content_Type": "Website Content",
        "Raw_Text": "Media Library\nBrand Assets\nDownload Media Asset for LAFD Station 69 – Palisades-4 – 011025\nLAFD Station 69 – Palisades-4 – 011025\nType: Image\nResolution: 4284 x 5712\nDownload Media Asset for T‑Mobile support vehicle\nT‑Mobile support vehicle\nType: Image\nResolution: 3000 x 2740"
    },
    {
        "Ticker": "TMUS",
        "Company": "T-Mobile US",
        "Source_URL": "https://www.t-mobile.com/news/fact-sheets",
        "Content_Type": "Website Content",
        "Raw_Text": "Get informed.\nJournalists, investors, and prospective employees need look no further. We’ve got all the Un-carrier information you need right here.\nT-Mobile Company Fact Sheet\nLooking for a quick, digestible list of company facts? We got it right here.\nT-Mobile Leadership Team\nThey’re visionaries. They’re leading the way. They personify the Un-carrier spirit."
    },
    {
        "Ticker": "TMUS",
        "Company": "T-Mobile US",
        "Source_URL": "https://www.t-mobile.com/news/contact-us",
        "Content_Type": "Website Content",
        "Raw_Text": "Media contact\nFor media inquires, please contact us at:\nT-Mobile US Media Relations\nMediaRelations@T-Mobile.com\nBy turning the toggle ON (blue), you Accept the use of this tool when you visit our sites. By turning the toggle OFF (gray), you Reject the use of this tool when you visit our sites.\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nFor GPC reporting purposes"
    },
    {
        "Ticker": "TMUS",
        "Company": "T-Mobile US",
        "Source_URL": "https://www.t-mobile.com/news/network/t-mobile-puts-5g-innovation-in-the-drivers-seat-at-lvgp",
        "Content_Type": "Website Content",
        "Raw_Text": "BELLEVUE, Wash. — Nov. 13, 2025 — Helmet on. Visor down. Let’s go! T-Mobile (NASDAQ: TMUS) is once again bringing its 5G horsepower to the FORMULA 1 HEINEKEN LAS VEGAS GRAND PRIX (LVGP), unveiling an expanded lineup of 5G-connected technologies that blend speed and cutting-edge innovations on America’s Best Network. From 5G-powered broadcast cameras and drone coverage to mission-critical systems and app-exclusive race content, the Un-carrier is elevating the fan experience and on-the-ground operations at one of the biggest spectacles in sports and entertainment — while giving T-Mobile customers exclusive benefits and access throughout race week. Here’s everything fans can expect Nov. 20-22:\n- 5G-Connected Cameras Unlock New Broadcast Views. For the first time at LVGP, T-Mobile 5G is powering a 360-degree camera — along with live drone feeds — delivering immersive views from the track and the sky from high above the Las Vegas Strip.\n- Enhanced 5G Connectivity for First Responders. For the first time at LVGP, first responders will use T-Priority to unlock dedicated network slicing to support critical operations. The Las Vegas Metropolitan Police Department will also use a 5G-connected drone to enable faster response times.\n- Streamlined 5G-Powered Event Operations. T-Mobile is using 5G network slicing to power all of LVGP’s point-of-sale and ticketing transactions so fans can seamlessly get into the event and make purchases without delay. The Un-carrier is also deploying SuperMobile — a business phone solution with optimized network slicing and satellite connectivity — to help keep LVGP staff reliably connected across the circuit, even in high-traffic or hard-to-reach areas. Photographers will also use network slicing for rapid content delivery so they can upload and share shots from anywhere across the circuit at race speed.\n- F1 Las Vegas App Returns as the Ultimate Trackside Companion. Fans can explore the Las Vegas Strip Circuit™ in the official F1 Las Vegas app, featuring a 360-degree track tour and instant race replays. And with Magenta Status, only T-Mobile customers unlock exclusive in-app views of the action, from high-stakes overtakes to spinouts.\n- T-Mobile Zone at Sphere and Magenta Status VIP Access for T-Mobile Customers. With 25,000 visitors last year, the T-Mobile Zone at Sphere is back and will feature performances from T-Pain, mgk, Zedd and more at the T-Mobile Stage. Plus, T-Mobile customers can enjoy VIP vibes with the best views of all the entertainment and live action on the track at Club Magenta — and meet F1 driver Lando Norris during a special appearance at the T-Mobile Store on the Las Vegas Strip.\n“In our third year partnering with the Las Vegas Grand Prix, we’re once again pushing the limits of innovation, powering real-time race operations, a 360-degree broadcast camera, immersive fan experiences and more, all with the strength of America’s Best Network,” said Mike Katz, President of Marketing, Strategy and Products, T-Mobile. “And, as always, T-Mobile customers get VIP treatment all weekend long — from front-row views at Club Magenta to exclusive replays in the F1 Las Vegas app and seamless 5G connectivity across the entire circuit. It’s just one more way we’re showing up for customers and redefining what’s possible with our partners.”\n5G-Connected Cameras Unlock New Race Views\nFans tuning into the LVGP broadcast will get closer to the action thanks to 5G-connected cameras. A 5G drone will deliver aerial views of the track and Las Vegas Strip, while roaming trackside cameras capture immersive first-person angles across the circuit. The broadcast will also connect fans to the action with a 360-camera positioned at Turn 9. Powered by T-Mobile Advanced Network Solutions (ANS) and a private 5G network, the camera will deliver immersive, 360-degree views of the track as cars race past the T-Mobile Zone at Sphere.\nFans onsite will get even closer to the action with the return of the Las Vegas Grand Prix Campus Show — a daily broadcast across the circuit featuring a dynamic team of reporters and analysts. Powered by T-Mobile’s 5G ANS and the first-ever commercial deployment of Edge Control, fans will get views from immersive, ultra-low latency camera feeds from across the venue, including the Paddock Club™ Rooftop, the T-Mobile Zone at Sphere and nightly performances on the T-Mobile Stage — all with broadcast-grade quality and next-gen connectivity.\nEnhanced 5G Connectivity for First Responders\nAmerica’s Best Network is powering critical event operations behind the scenes across LVGP, including:\n- T-Mobile’s T-Priority for first responders, used by the Las Vegas Metropolitan Police Department (LVMPD), LVGP and other agencies. Built on T-Mobile’s 5G Standalone network and powered by network slicing, T-Priority allocates up to five times more network resources to keep essential voice and data communications moving — even in the most congested areas.\n- A first-of-its-kind 5G-connected drone for first responders, deployed in partnership with LVMPD. Embedded with T-Mobile 5G, the drone provides real-time aerial overwatch and HD video streaming, allowing first responders to quickly identify and respond to incidents across the circuit.\nStreamlined 5G-Powered Event Operations\nThis year, key LVGP staff will use SuperMobile, a business phone solution that combines nationwide network slicing, enterprise-grade security and satellite-to-mobile coverage into one powerful tool for event staff. From the Paddock to the race perimeter, SuperMobile will help keep teams seamlessly connected — even in high-traffic or remote zones — providing essential, operational continuity throughout race weekend.\nT-Mobile will also leverage network slicing on its 5G Standalone network to support critical race operations throughout the weekend, including:\n- Fast, reliable payment processing and ticket scanning, allowing fans to quickly enter ticketed zones and grab concessions and merchandise without delay.\n- Real-time content transmission for photographers and media partners, using 5G instead of hard-wired connections to deliver race-day imagery at speed.\nOperations teams will also use T-Mobile Mission Critical Push to Talk for real-time, on-demand communication for event staff on and off the course from set up through checkered flag.\nThe F1 Las Vegas App Returns as the Ultimate Trackside Companion\nWith nearly 200,000 downloads, the popular F1 Las Vegas app presented by T-Mobile returns. Once again, fans can explore the Las Vegas Strip Circuit™ with an interactive 360-degree tour featuring high-definition views captured by 5G-connected cameras. Fans on-site can also catch up on key race moments with replays right from the app — so they never miss a second of the action. And T-Mobile customers get access to exclusive replays of the action thanks to Magenta Status.\nThe F1 Las Vegas app, available on Android and iOS devices, provides fans with everything they need for race weekend, including tickets, schedules, navigation, detailed team and driver information and more.\nT-Mobile Zone at Sphere Returns with Exclusive Access for T-Mobile Customers\nBack for another high-octane race weekend, the T-Mobile Zone at Sphere will once again be one of the hottest spots on the circuit. This year’s lineup at the T-Mobile Stage includes three nights of A-list performances from T-Pain, mgk, Zedd and more. And T-Mobile customers get front-row access to the action at Club Magenta — a VIP lounge with unbeatable views of the track and T-Mobile Stage, plus private bars, silent disco sets, daily giveaways, complimentary phone charging and more.\nAll T-Mobile customers have access to Club Magenta through Magenta Status and can bring up to two guests to share the experience. Just download the Club Magenta pass in T-Life and enjoy the action.\nMore for Fans Around Las Vegas\nLocals and visitors can stop by the T-Mobile Store on the Strip (3791 Las Vegas Blvd South) from Nov. 17–23, 9 a.m. to 9 p.m. PT, to:\n- Take a lap in an interactive driving simulator, experience top speeds in a multi-sensory F1 wind tunnel and grab exclusive daily giveaways.\n- Enter for a chance to win race tickets (Nov. 17–19).\n- Meet F1 driver Lando Norris on Nov. 18 at 3:20 p.m. PT.\n- Score exclusive merch at the T-Mobile X Quadrant drop — available to the first 500 T-Mobile customers in line at the store on Nov. 19–20 at 11 a.m. PT.\nT-Mobile customers can also snag a free T-Mobile X McLaren F1 hat through T-Mobile Tuesdays in the T-Life app starting Nov. 18 and redeem at participating T-Mobile stores in the area, while supplies last.\nTo learn more about T-Mobile at the Las Vegas Grand Prix, visit https://www.t-mobile.com/LVGP.\nFollow the T-Mobile Newsroom on X and Instagram to catch the latest company updates.\n# # #\nBest Network based on analysis by Ookla® of Speedtest Intelligence® data 1H 2025. Ookla trademarks used under license and reprinted with permission. SuperMobile Slice: Features available on our 5G SA network; not available while roaming, via satellite, or while tethering. Slice features (data prioritization and latency optimization) available in areas of Ultra Capacity 5G coverage with capable device and 5G Standalone settings. Coverage not available in some areas. T-Satellite: Texting & select satellite-ready apps with compatible device in most outdoor areas in the U.S. where you can see the sky. Satellite service, including text to 911, may be delayed, limited, or unavailable. Free hat: Ltd-time offer while supplies last. Qual’g plan req’d. See T-Mobile Tuesdays app for details. Driving challenge is limited to registered participants on a first-come, first-served basis as space allows.\nAbout T-Mobile US, Inc. As the supercharged Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is powered by an award-winning 5G network that connects more people, in more places, than ever before. With T-Mobile’s unique value proposition of best network, best value and best experiences, the Un-carrier is redefining connectivity and fueling competition while continuing to drive the next wave of innovation in wireless and beyond. Headquartered in Bellevue, Wash., T-Mobile provides services through its subsidiaries and operates its flagship brands, T-Mobile, Metro by T-Mobile and Mint Mobile. For more information, visit https://www.t-mobile.com."
    },
    {
        "Ticker": "TMUS",
        "Company": "T-Mobile US",
        "Source_URL": "https://www.t-mobile.com/news/network/t-mobile-text-to-911-available-for-everyone",
        "Content_Type": "Website Content",
        "Raw_Text": "BELLEVUE, Wash. — Nov. 5, 2025 – Because emergencies don’t care who your wireless provider is, T-Mobile (NASDAQ: TMUS) is making sure 911 access is available to as many people as possible. Starting today, anyone with a compatible phone can sign up to use T-Mobile Text to 911 through satellite in the 500,000 square miles of the U.S. not reached by traditional cell towers. Now, along with Text to 911 services available via terrestrial cell towers, wireless users in remote areas without traditional coverage can now reach emergency services nearly anywhere with a view of the sky.\n“There’s a good chance you’ve had that moment in your life at some point. Badly rolled ankle deep into a backcountry hike. Stuck in a tree well while skiing. Flat tire on a backcountry road. Or a million other situations that require access to emergency services in a place without cell service. It’s an absolutely terrifying feeling that we don’t want anyone to have ever again,” said Mike Katz, President, Marketing, Strategy & Products, T-Mobile. “T-Mobile Text to 911 with T-Satellite gives peace of mind. It’s there when you need it the most. And it’s too important to keep gated. Now all wireless users with a compatible phone can sign up for T-Mobile Text to 911 for absolutely free.”\nHow It Works\nThis past July, T-Mobile rolled out T-Satellite with Starlink, a service that connects the compatible phone in your pocket to an array of 650+ Starlink satellites orbiting the Earth more than 200 miles up in space. The satellite network gives wireless users a lifeline when they’re way off grid and can’t connect to earth-bound cell towers because, perhaps, the tower is too far away or there’s an obstruction or, heaven forbid, a natural disaster has taken down the local wireless network. In that case, the phone’s signal goes up, up, up to a satellite instead of up and over to a cell tower. The phone automatically connects to the satellite network when a terrestrial signal drops. No special settings, no pointing your phone at the sky — it just works. T-Mobile’s vision is that if you can see the sky, you’re connected.\nIn just its first few months, T-Satellite users have connected for all manner of reasons: from adventuring to off-grid work to simple peace of mind. And, on rare occasion, to reach 911 for emergency services. It was a no-brainer to take the Text to 911 feature that T-Mobile built within T-Satellite and make it available — for free — to any person that enrolls with a satellite-compatible smartphone.\nPlacing a Text to 911 via T-Satellite is just like sending a normal text message. Simply pull up the phone’s native messaging app, enter the message, enter 911 in the phone number field and hit send.\nT-Satellite Service Options\nBecause T-Satellite is the only game in town of its kind, T-Mobile has opened up the full service to all wireless users, not just T-Mobile customers. Here’s the full range of satellite connectivity options available to make sure everyone has the right level of peace of mind for their individual preference:\nT-Mobile customers\n- T-Satellite — including messaging, Text to 911, data and location services, among others — is included with Go5G Next and Experience Beyond plans, plus T-Priority (for individuals and businesses) and SuperMobile\n- T-Satellite with all its services can also be added a la carte to any other T-Mobile plan for $10 /month\n- T-Mobile Text to 911 is available for free as a standalone option to all T-Mobile customers, including business customers, with a compatible device\nNon T-Mobile customers\n- T-Satellite can be purchased a la carte for $10 / month for those with a compatible device\n- All wireless users with a compatible device can now enroll for free access to T-Mobile Text to 911\nEnrolling in free T-Mobile Text to 911 service involves just a few steps for both T-Mobile customers as well as those with another wireless provider:\n- T-Mobile customers can add the service under “Manage Data & Add-Ons’” in their account online or in T-Life\n- Non-T-Mobile customers can enroll here\n- New business customers contact 866-380-7511\nSatellite Emergency Service Options\nWhile T-Satellite with Starlink is the only service of its kind, two other satellite-based messaging services offer access to emergency services on select iPhone and latest Google Pixel models. T-Mobile Text to 911 automatically defers to those device-native services.\nFor more information, visit the T-Satellite web page here.\nFor information on device compatibility, visit here.\n###\nT-Satellite: Texting & select satellite-ready apps with compatible device in most outdoor areas in the U.S. where you can see the sky. Satellite service, including Text to 911, may be delayed, limited, or unavailable. Included with Experience Beyond plans or $10/mo.; auto renews monthly. Cancel anytime in T-Life App.\nAbout T-Mobile\nT-Mobile US, Inc. (NASDAQ: TMUS) is America’s supercharged Un-carrier, delivering an advanced 4G LTE and transformative nationwide 5G network that will offer reliable connectivity for all. T-Mobile’s customers benefit from its unmatched combination of value and quality, unwavering obsession with offering them the best possible service experience and undisputable drive for disruption that creates competition and innovation in wireless and beyond. Based in Bellevue, Wash., T-Mobile provides services through its subsidiaries and operates its flagship brands, T-Mobile, Metro by T-Mobile and Mint Mobile. For more information please visit: https://www.t-mobile.com\nMedia Contact\nT-Mobile US, Inc. Media Relations\nMediaRelations@t-mobile.com\nInvestor Relations Contact\nT-Mobile US, Inc.\nInvestor.Relations@t-mobile.com\nhttps://investor.t-mobile.com"
    },
    {
        "Ticker": "TMUS",
        "Company": "T-Mobile US",
        "Source_URL": "https://www.t-mobile.com/news/community/t-mobile-activates-customer-relief-during-typhoon-kalmaegi",
        "Content_Type": "Website Content",
        "Raw_Text": "We are heartbroken by the devastating impact of Typhoon Kalmaegi — known locally in the Philippines as Typhoon Tino — which made landfall today with deadly force. The storm has claimed many lives and left behind catastrophic flooding and widespread destruction. Hundreds of thousands have been displaced, and many areas are without power as people begin to cope with the aftermath.\nIn moments like this, staying connected with loved ones is more important than ever. To support our customers in the US and travelling in the region, T-Mobile is waiving international long-distance calls, text and roaming charges in the Philippines across all our brands — T-Mobile Postpaid and Prepaid, Metro, Assurance Wireless, UScellular, Mint and Ultra — from tomorrow, Wednesday, Nov. 5, until Wednesday, Nov. 12.\nWe will continue to closely monitor the situation and provide updates as the storm moves toward Vietnam.\nFor more information on disaster preparedness and T-Mobile’s response capabilities, visit the company’s Emergency Response hub and follow @TMobileNews on X and Instagram."
    },
    {
        "Ticker": "TMUS",
        "Company": "T-Mobile US",
        "Source_URL": "https://www.t-mobile.com/news/community/t-mobile-keeping-loved-ones-connected-hurricane-melissa",
        "Content_Type": "Website Content",
        "Raw_Text": "Free international long-distance, texts and roaming across Jamaica and nearby islands available to support customers and communities until November 12\nOur thoughts are with everyone affected by Hurricane Melissa which made landfall yesterday as a devastating Category 5 storm across Jamaica and neighboring islands, the most powerful storm ever recorded to strike Jamaica. The hurricane brought widespread damage and power outages, leaving many communities to begin recovery.\nWe understand how important it is to stay connected right now. To help customers reach family, loved ones and friends, T-Mobile is waiving charges for customers on our network for international long-distance calls, texts and roaming in Jamaica, as well as the surrounding islands of Turks and Caicos and the Bahamas across all our brands — T-Mobile Postpaid and Prepaid, Metro, Assurance Wireless, UScellular, Mint and Ultra — from today Wednesday, Oct. 29, until Tuesday, Nov. 12.\nWe will continue to closely monitor the storm’s aftermath and provide updates.\nFor more information on disaster preparedness and T-Mobile’s response capabilities, visit the company’s Emergency Response hub and follow @TMobileNews on X and Instagram.\n###"
    },
    {
        "Ticker": "TMUS",
        "Company": "T-Mobile US",
        "Source_URL": "https://www.t-mobile.com/news/business/t-mobile-launches-edge-control-and-t-platform",
        "Content_Type": "Website Content",
        "Raw_Text": "BELLEVUE, Wash. — Oct. 20, 2025 — T-Mobile’s nationwide 5G Advanced network has already set a new standard for business phone connectivity and now it’s time to help enterprises seamlessly embrace the new era of real-time data, AI and innovation. Today, T-Mobile (NASDAQ: TMUS) is enhancing its Advanced Network Solutions (ANS) portfolio with capabilities purpose-built for mission-critical operations where data is sensitive, work happens in real time, and uptime and network control are non-negotiable: Edge Control and T-Platform. Industry leaders like the PGA of America, Formula 1 Heineken Las Vegas Grand Prix and the military are exploring the groundbreaking capabilities of Edge Control and T-Platform to enhance operations.\n“Networks should accelerate ambition, not hold it back,” said Mo Katibeh, Chief Marketing Officer, T-Mobile Business Group. “With Edge Control and T-Platform, we’re giving businesses tools to work faster, safer and smarter — while making network management as simple as it should be. This is what the future of connectivity looks like and it’s here today.”\nEdge Control: 5G Advanced + Local Breakout = Private Network–Like Performance Minus the Overhead\nFrom hospitals and factories to supply chain operations and smart cities, businesses need connectivity built for high-performance, data-driven use cases. In healthcare, for example, AI is reshaping how doctors and nurses deliver care — powering real-time patient monitoring, predictive analytics, faster diagnostics and more informed clinical decisions. In 2024, 71% of hospitals reported using predictive AI integrated with Electronic Health Records, up from 66% in 2023.\nAs this type of technology adoption accelerates, traditional connectivity solutions like Wi-Fi can struggle to keep pace — often leading to reliability issues, patchy coverage and growing concerns around data sovereignty. The stakes are high. Imagine the reputational damage or costly remediation a healthcare provider could face if delayed real-time monitoring data jeopardizes a critical care patient, or if sensitive health records were exposed. And while private networks can help organizations overcome latency, security and data jurisdiction challenges, realizing these benefits at scale demands higher costs and complex orchestration across multiple sites.\nWith Edge Control, organizations get the benefits of a private network — minus the overhead of deploying and managing one at every location. Edge Control enables seamless data routing between endpoints, servers and compute — delivering ultra-low latency, data sovereignty and simplified scalability.\nAdditionally, Edge Control enables organizations to process data directly within their existing infrastructure for ultra-low latency — whether on private cloud platforms or on-premises systems like those from Dell Technologies. This flexibility allows customers to operate Edge Control in environments tailored to their unique operational, compliance and performance needs while processing data closer to where it’s generated.\nAnd because Edge Control is built on T-Mobile’s 5G Advanced network, it offers an industry-first advantage — traffic is routed precisely where an organization wants it to go with fewer “hops,” even if users are across the country. This means faster data delivery, avoiding the delays of traditional VPN tunnels. Even remote users and endpoints maintain low-latency performance and meet data sovereignty requirements through optimized intra-network routing. Instead of detouring traffic through multiple checkpoints, Edge Control creates a secure local “on/off ramp” that gives data a direct, efficient path.\nT-Platform: Because Managing Your Network Shouldn’t Be a Scavenger Hunt\nTo unlock the full potential of T-Mobile network investments at scale, businesses need visibility and control across their entire connected ecosystem. This is where T-Platform comes in. T-Platform is a unique 5G portfolio platform that delivers seamless access and centralized control of all T-Mobile for Business solutions, including Edge Control, through a single unified management portal.\nFrom 5G Business Internet to IoT deployments to detailed network performance insights, T-Platform is already empowering tens of thousands of customers by simplifying what was once a fragmented set of tools into one powerful interface. Imagine a transportation logistics company with operations spanning thousands of vehicles, sensors and connected devices across hundreds of locations. Instead of juggling multiple systems to track usage, monitor performance and manage resources, the entire network now lives in one place. Every service, every device, every location — fully visible and under control. The result: real-time decision-making, streamlined operations, and scalability without complexity.\nWith these new Advanced Network Solutions, T-Mobile continues to transform 5G from promise into practice — setting a new standard for business connectivity and proving once again why it leads the 5G era.\nEdge Control and T-Platform are ready to power businesses today.\nVisit Edge Control to see how 5G Advanced and Local Breakout deliver private network–like performance without the overhead.\nGo to T-Platform to discover how businesses can manage every T-Mobile for Business solution through one unified dashboard.\nAnd to explore the entire portfolio of products and services, visit Advanced Network Solutions.\nFollow the T-Mobile Newsroom on X and Instagram to catch the latest company updates.\n# # #\nSee 5G device, coverage & access details at T-Mobile.com.\nAbout T-Mobile\nAs the supercharged Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is powered by an award-winning 5G network that connects more people, in more places, than ever before. With T-Mobile’s unique value proposition of best network, best value, and best experiences, the Un-carrier is redefining connectivity and fueling competition while continuing to drive the next wave of innovation in wireless and beyond. Headquartered in Bellevue, Wash., T-Mobile provides services through its subsidiaries and operates its flagship brands, T-Mobile, Metro by T-Mobile, and Mint Mobile. For more information, visit https://www.t-mobile.com."
    },
    {
        "Ticker": "TMUS",
        "Company": "T-Mobile US",
        "Source_URL": "https://www.t-mobile.com/news/network/t-mobile-unveils-new-cyber-defense-briefing-centers",
        "Content_Type": "Website Content",
        "Raw_Text": "BELLEVUE, Wash. — Oct. 15, 2025 — T-Mobile (NASDAQ: TMUS) today unveiled its new Cyber Defense Center, a purpose-built facility that is designed to enable its security teams to better detect, disrupt and respond to cyber threats in real time, and its new Executive Briefing Center, a gateway for enterprise customers and partners to explore T-Mobile’s technology in action. These two state-of-the-art facilities join T-Mobile’s existing Business Operations Center to create an integrated program for cybersecurity, innovation and resilience at T-Mobile.\n“Our new Cyber Defense Center is the heartbeat of T-Mobile’s cybersecurity operations and an embodiment of all the investments we’ve made to better safeguard our customers and their data,” said Mark Clancy, T-Mobile’s SVP of Cybersecurity. “We’re not waiting for attackers to show up — we’re actively hunting them down around the clock, 24/7. Our teams think like them, experiment like mad scientists and learn from every threat to improve our defenses and give customers more peace of mind when they choose T-Mobile.”\n“We built the Executive Briefing Center to break through the noise — to give businesses a front-row seat to how innovation at T-Mobile drives real-world impact,” said Mo Katibeh, Chief Marketing Officer, T-Mobile Business Group. “From powering connected healthcare, to delivering mission-critical connectivity to first responders every story inside the Executive Briefing Center is rooted in a customer challenge we’ve helped solve. This is where technology transforms into business outcomes.”\nCyber Defense Center\nThe new Cyber Defense Center is the result of T-Mobile’s significant strategic investment in proactive threat defense and continuous security improvement, and features specialized environments where security teams work together to protect customers around the clock:\n- Cyber Command Center — Always Watching, Always Protecting\nThe Cyber Command Center operates around the clock, with experts continuously monitoring real-time digital displays showing global threat maps, network flows, security alerts and more. Using advanced analytics, machine learning and years of expertise, teams have the ability to detect threats and anomalies early, stop attacks before they spread and adapt quickly as threats evolve — maintaining a constant cycle of monitoring, defense and improvement to keep customers’ data protected. - Cyber Lab — Where We Think Like the Adversary\nThe Cyber Lab is a dedicated space where T-Mobile’s security experts unleash innovation to try to stay ahead of adversaries. Here, teams test tools like SIM dialers, rigorously inspect hardware and software for vulnerabilities and develop creative defenses — including honeypots that safely attract cyber threats that teams can study. This space isn’t about reacting to attacks; it’s about anticipating them and fortifying defenses before risks emerge. - Incident Response War Room & Digital Forensics Room — Where Cyber Battles Are Fought\nThese are where T-Mobile’s cybersecurity, engineering, operations and other teams unite to act fast — analyzing threats, coordinating countermeasures and repelling bad actors when discovered and active attacks when they occur. These teams can use the War Room as a debriefing hub after a response, and the Digital Forensics Room to dissect hardware and software to learn about adversaries, understand attack vectors and strengthen future defenses.\nThe Cyber Defense Center also includes amenities like conference rooms, a kitchen, quiet spaces and a game room — all designed to keep teams energized, focused and ready for anything.\nExecutive Briefing Center\nThe Executive Briefing Center serves as T-Mobile’s front door for enterprise customers and partners, allowing them to experience the company’s business solutions and products firsthand. Featuring five immersive zones — Connected Individual, Connected Building, Connected Complex, Borderless Connectivity and Network & Innovation Showcase — the Executive Briefing Center demonstrates how T-Mobile’s technology solves real-world business challenges across industries.\nBusiness Operations Center\nT-Mobile’s existing Business Operations Center is its always-on command hub for network health and critical operations, ensuring resilience, reliability and continuity for customers. It serves as watchtower for retail locations, customer care and employee safety, and acts as the command center for coordinated incident and crisis response during natural disasters and other events. Data-driven dashboards and visualizations enable rapid response and decision-making to keep customers connected when they need it most.\nGrand Opening Ceremony\nT-Mobile will mark the official opening of the Cyber Defense Center and Executive Briefing Center with a ribbon-cutting ceremony at its Bellevue headquarters, attended by employees, customers, industry analysts and government and community officials.\nTo read more about online safety, cybersecurity and tools that we have for customers, head to our Newsroom, Trust Center and Privacy Center.\nFollow the T-Mobile Newsroom on X and Instagram to catch the latest company updates.\n# # #\nAbout T-Mobile US, Inc.\nAs the supercharged Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is powered by an award-winning 5G network that connects more people, in more places, than ever before. With T-Mobile’s unique value proposition of best network, best value and best experiences, the Un-carrier is redefining connectivity and fueling competition while continuing to drive the next wave of innovation in wireless and beyond. Headquartered in Bellevue, Wash., T-Mobile provides services through its subsidiaries and operates its flagship brands, T-Mobile, Metro by T-Mobile and Mint Mobile. For more information, visit https://www.t-mobile.com.\nForward-Looking Statements\nThis communication includes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. All statements other than statements of historical fact, including information concerning T-Mobile US, Inc.’s planned use of the new Cyber Defense Center and the expected results of its cybersecurity operations, are forward-looking statements. These forward-looking statements are generally identified by the words “anticipate,” “believe,” “estimate,” “expect,” “intend,” “may,” “could” or similar expressions. Forward-looking statements are based on current expectations and assumptions, which are subject to risks and uncertainties and may cause actual results to differ materially from the forward-looking statements. Important factors that could affect future results and cause those results to differ materially from those expressed in the forward-looking statements include, among others, the risks as disclosed in our most recent annual report on Form 10-K, and subsequent Forms 10-Q and other filings with the Securities and Exchange Commission. Given these risks and uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements. We undertake no obligation to revise or publicly release the results of any revision to these forward-looking statements, except as required by law.\nMedia Contact\nT-Mobile US, Inc. Media Relations\nMediaRelations@t-mobile.com\nInvestor Relations Contact\nT-Mobile US, Inc.\nInvestor.Relations@t-mobile.com\nhttps://investor.t-mobile.com"
    },
    {
        "Ticker": "TMUS",
        "Company": "T-Mobile US",
        "Source_URL": "https://www.t-mobile.com/news/network/t-challenge-2026-submissions-now-open",
        "Content_Type": "Website Content",
        "Raw_Text": "BONN, Germany and BELLEVUE, Wash. — Sept. 29, 2025 — Deutsche Telekom AG and T-Mobile US (NASDAQ: TMUS) are proud to launch the sixth edition of T Challenge. For the sixth year in a row, the companies are inviting innovators and disruptors from around the world to compete with cutting-edge AI solutions that will transform telecommunications and its integration into everyday life by building the AI-native telco: autonomous, customer-focused, and intent-based.\nThis year’s competition focuses on four key areas where AI can make the biggest impact in achieving this vision:\n- Autonomous Networks\n- Energy Efficiency & Zero-bit Zero-watt\n- Supply Resilience\n- Security\nThe submission phase is now open and will close on December 5, 2025.\nFollowing the review process, up to 12 teams will be invited to showcase their innovations on April 28 and 29, 2026, at Deutsche Telekom’s headquarters in Bonn, Germany. A panel of judges from Deutsche Telekom and T-Mobile will select the winners.\nAwards include:\n- First Place: €150,000 (or equivalent)\n- Second Place: €75,000 (or equivalent)\n- Third Place: €50,000 (or equivalent)\n- Special Award: Up to €25,000 (or equivalent)\nWinners will receive cash prizes as well as the opportunity to further develop their technology in close collaboration with Deutsche Telekom in Europe and T-Mobile in the U.S.\nSubmit your ideas now and become part of the future of telecommunications."
    },
    {
        "Ticker": "TMUS",
        "Company": "T-Mobile US",
        "Source_URL": "https://www.t-mobile.com/news/network/oscar-winning-adventurer-jimmy-chin-on-staying-connected-with-t-satellite-total-game-changer",
        "Content_Type": "Website Content",
        "Raw_Text": "When Jimmy Chin shot the world’s first free solo climb of El Capitan in Yosemite National Park in 2017, staying easily connected to his family wasn’t an option. On expeditions like that one, it could take days to reach them. Fast forward just a few years, and things look very different. Not only has T-Mobile been named America’s Best Network, it now has one that delivers data from space with T-Satellite with Starlink.\nAnd that means Chin can stay connected in places no terrestrial network can reach.\nA pro climber and Oscar-winning filmmaker, Chin first put T-Satellite to the test this summer with science YouTuber Mark Rober in a video for T-Mobile. Shot deep in a remote area of Washington State, Chin said he found the service to be a “total game changer.”\n“Part of the nice thing about being in a remote area is that sometimes you can’t communicate. It allows you to be 100% present and in the moment, which is really important,” Chin says. “Now that I am a father, though, I always make sure I have some way to communicate with the outside world. As life changes, so does what you need — and just being able to communicate with my family in ways and places never possible before is a huge deal!”\nWith T-Satellite now powering satellite-optimized apps like WhatsApp and AccuWeather, that means being able to check the weather or send a quick voice note even in the most remote of places in the U.S.\nWe talked with Chin about a life of adventure — and how T-Satellite, the largest satellite-to-mobile service, is helping him stay closer to the people who matter most wherever the climb takes him.\nYou’ve lived a life full of adventure as a professional climber, skier and filmmaker. You were even among the first three Americans to ski down Mt. Everest! How would you describe yourself in your own words?\nThat is definitely an answer that has evolved over time! First and foremost, I describe myself as a father. My kids mean the world to me. Beyond that, I would say I am an adventure enthusiast. There is no place I feel more at home than out in the wild — whether surfing a great swell, skiing down a mountain with fresh snow or climbing a rock wall with my friends. And of course, I love doing all of this with a camera in my hands!\nYou’ve been at the helm of movies such as Free Solo, which won the Academy Award for Best Documentary in 2019, and you’re a world-class athlete often on to the next big mountain with fellow elite athletes — including the climber profiled in Free Solo, Alex Honnold. What is it about adventure that draws you in?\nEach day is different and unexpected things happen. I think that’s why I’m drawn to it. Our world also moves so fast, I love being in nature and reminding myself we really aren’t always in charge!\nWhat was it like to be on an expedition before T-Satellite?\nEven a small injury from anyone on an expedition requires attention by the whole team, and without this technology, you couldn’t call for help. Or if something happened at home and they needed to reach you, it could sometimes take days.\nWhat’s a way technology like T-Satellite can play a role in your future adventures?\nThe great thing about technology is that it allows us to push limits in a more safe and informed way — and T-Satellite makes that possible. Not only does it allow me to remain in contact with my loved ones, but it also can provide a further safety net for me and for the entire team out on an expedition. It’s vital.\nThat’s why I am incredibly excited by T-Satellite. It really elevates our ability to communicate on all levels. I learned that over 500,000 square miles in the U.S. aren’t covered by cell towers. That’s nearly twice the size of Texas! And I probably spend more time than most in those areas. So to have a provider like T-Mobile that prioritizes communication virtually everywhere in the country is really appealing to adventurers like me.\nRecently, you were in a video with Mark Rober about T-Satellite. Can you give us the behind the scenes scoop on that experience?\nWe met in one of the most beautiful and remote places in the lower 48. We also had the most perfect day! As I think most people know, I love being in wild, remote areas that are rarely explored — so to experience that with Mark was a thrill. I have long been an admirer of his. And then to have him show up and say he had been texting his dad the whole time and let me communicate with my family through T-Satellite was a total game changer. It was really fun to experience this with Mark and to see how this technology is going to really help me on my future expeditions.\nLearn more about T-Satellite and the next era of connectivity here."
    }
]