[
    {
        "Ticker": "TRI",
        "Company": "Thomson Reuters",
        "Source_URL": "https://www.thomsonreuters.com/en.html",
        "Content_Type": "Website Content",
        "Raw_Text": "These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nThese cookies enable the website to provide enhanced functionality and personalization. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising."
    },
    {
        "Ticker": "TRI",
        "Company": "Thomson Reuters",
        "Source_URL": "https://www.thomsonreuters.com/en-us/help.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Transform your work with the only AI legal solution uniting research, drafting, and document analysis in a single experience. Designed by legal experts and built on trusted content and advanced AI, CoCounsel Legal accelerates multistep work so you can better serve your clients and grow your business.\nConduct legal research efficiently and confidently using trusted content, proprietary editorial enhancements, and advanced technology.\nAccelerate your impact with trusted corporate software and solutions that help legal, tax, trade, and risk professionals work efficiently and accurately. Cut through complexity and automate workflows while making confident, faster decisions.\nMove faster and accomplish more with a professional-grade, generative AI assistant that transforms the way you work. Thomson Reuters CoCounsel is with you every step of the way, backed by authoritative content and industry-leading expertise.\nCreate a seamless process through automated and accurate corporate tax software and services. Ensure smooth workflows from tax determination through to tax and trade compliance for companies and large accounting firms.\nAccelerate your impact with trusted corporate software and solutions that help legal, tax, trade, and risk professionals work efficiently and accurately. Cut through complexity and automate workflows while making confident, faster decisions.\nAutomate your company's sales and use tax, GST, and VAT compliance and expedite your global indirect tax compliance obligations. Move beyond complicated, country-specific spreadsheets to stay compliant across the globe.\nComply with global e-invoicing mandates by leveraging a fully integrated, electronic invoice compliance solution — one solution spanning the globe, simplifying complexity for tax, e-invoicing, and continuous transaction controls.\nAccelerate your impact with trusted corporate software and solutions that help legal, tax, trade, and risk professionals work efficiently and accurately. Cut through complexity and automate workflows while making confident, faster decisions.\nPowerful software designed for law enforcement, compliance, risk, and fraud investigators. Conduct thorough investigations with ease using our intuitive online investigation software. Efficiently, prevent, detect, and solve crime.\nDetect, prevent, and mitigate fraud with this online fraud prevention tool for government. Gain a holistic view of identity-based risk within an agency’s program population.\nAccelerate your impact with trusted corporate software and solutions that help legal, tax, trade, and risk professionals work efficiently and accurately. Cut through complexity and automate workflows while making confident, faster decisions.\nAround the globe, with unmatched speed and scale, Reuters Connect gives you the power to serve your audiences in a whole new way.\nReuters Plus, the commercial content studio at the heart of Reuters, builds campaign content that helps you to connect with your audiences in meaningful and hyper-targeted ways.\nReuters.com provides readers with a rich, immersive multimedia experience when accessing the latest fast-moving global news and in-depth reporting.\nExplore additional help options.\nEngage with other users and share product experiences in a secure platform.\nManage billing and payments, users, reports, and admin access.\nCheck on system outages and scheduled maintenance.\nDevelop your product expertise with flexible learning options, including a library of interactive e-learning courses and live, instructor-led training.\nLearn how to be more efficient using tips and tricks shown in our training videos.\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nThese cookies enable the website to provide enhanced functionality and personalization. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising."
    },
    {
        "Ticker": "TRI",
        "Company": "Thomson Reuters",
        "Source_URL": "https://www.thomsonreuters.com/en/press-releases/2025/november/thomson-reuters-launches-core-print-solutions-reaffirming-150-year-legacy-of-print-excellence",
        "Content_Type": "Website Content",
        "Raw_Text": "November 13, 2025\nThomson Reuters Launches Core Print Solutions, Reaffirming 150-Year Legacy of Print Excellence\nCore Print Solutions continues its trusted role in the book printing business, providing tailored runs for publishers with advanced technology that ensures speed, accuracy, and scale.\nEagan, MN, November 13, 2025: Thomson Reuters (TSX/NYSE: TRI), a global content and technology company, today unveiled a new brand identity and name for its book printing and fulfillment business. Part of the company’s Global Print Segment, Core Print Solutions provides high quality digital and offset printing, binding, warehousing, inventory management, and reliable distribution services to customers. The updated brand reflects its strategic growth, ongoing commitment to customer excellence, and continued investment in innovation and technology.\n\"Core Print Solutions is more than a name, it's a renewed promise to our customers,\" said Jennifer Prescott, President of the Global Print segment. “With over a century of expertise and the latest innovations in end-to-end book printing solutions, we stand committed to being a trusted partner, helping our customers deliver with speed, accuracy and scale.”\nWhile the name has changed, Core Print Solutions' legacy of excellence remains. For over 150-years we’ve built a reputation for reliability, partnership, and quality. That tradition continues, now with a refreshed digital presence, including a redesigned website, updated advertising, and modernized marketing materials, that makes it easier than ever for customers and partners to discover Core Print Solutions' capabilities, engage with its services, and experience the same trusted partnership in a more connected and accessible way.\nThe move comes as Core Print Solutions continues to invest in innovation and technology. Named Printing Impressions Innovator of the Year in 2024, the business has been recognized for its leadership in operational transformation and print innovation. Its 1.3‑million‑square‑foot facility in Eagan, Minnesota stands as a state-of-the-art printing and fulfillment hub, designed to support the needs of publishers.\nCore Print Solutions delivers over 17 billion pages in print capacity annually, powered by six web offset and four web digital inkjet presses. With capabilities spanning monochrome, 2-color, and full-color book printing, the business holds a market-leading position in short-run book production. This is driven by investments in Timsons zero make-ready offset web presses, high-speed wide-web digital inkjet presses, and automated binding lines.\n“Our new brand and name represent who we are today and where we’re headed,” added Todd Matuska, Vice President of Commercial Print. “Core Print Solutions is built on service, and everything we do is designed around our customers’ needs—from order to delivery. As publishers navigate a rapidly shifting landscape, we’re committed to building solutions that help them thrive. From offset to digital, from long runs to short, we’re equipped to serve publishers across their entire portfolio.”\nThis evolution marks the next chapter in Core Print Solutions journey. Core Print Solutions is committed to continuing to be a trusted partner, leveraging our expertise and cutting-edge technology to help our customers succeed.\nThomson Reuters\nThomson Reuters (TSX/Nasdaq: TRI) informs the way forward by bringing together the trusted content and technology that people and organizations need to make the right decisions. The company serves professionals across legal, tax, accounting, compliance, government, and media. Its products combine highly specialized software and insights to empower professionals with the data, intelligence, and solutions needed to make informed decisions, and to help institutions in their pursuit of justice, truth, and transparency. Reuters, part of Thomson Reuters, is a world leading provider of trusted journalism and news. For more information, visit tr.com.\nContact\nRamisa Tasnim\nRamisa.Tasnim@thomsonreuters.com"
    },
    {
        "Ticker": "TRI",
        "Company": "Thomson Reuters",
        "Source_URL": "https://www.thomsonreuters.com/en/press-releases/2025/november/thomson-reuters-to-present-at-jp-morgan-ultimate-services-investor-conference",
        "Content_Type": "Website Content",
        "Raw_Text": "November 12, 2025\nThomson Reuters to Present at JP Morgan Ultimate Services Investor Conference\nTORONTO, November 12, 2025 – Steve Hasker, president and chief executive officer of Thomson Reuters (TSX/Nasdaq: TRI) will present at the JP Morgan Ultimate Services Investor Conference on Tuesday, November 18, 2025, at 11:00 a.m. ET. The presentation may include forward-looking information.\nA live audio webcast will be available in the Investor Relations section of tr.com 24 hours prior to the start of the program. Additionally, an archive of the webcast will be available following the presentation.\nThomson Reuters\nThomson Reuters (TSX/Nasdaq: TRI) informs the way forward by bringing together the trusted content and technology that people and organizations need to make the right decisions. The company serves professionals across legal, tax, accounting, compliance, government, and media. Its products combine highly specialized software and insights to empower professionals with the data, intelligence, and solutions needed to make informed decisions, and to help institutions in their pursuit of justice, truth, and transparency. Reuters, part of Thomson Reuters, is a world leading provider of trusted journalism and news. For more information, visit tr.com.\nCONTACTS\nMEDIA\nGehna Singh Kareckas\nSenior Director, Corporate Affairs\n+1 613 979 4272\ngehna.singhkareckas@thomsonreuters.com\nINVESTORS\nGary E. Bisbee, CFA\nHead of Investor Relations\n+1 646 540 3249\ngary.bisbee@thomsonreuters.com"
    },
    {
        "Ticker": "TRI",
        "Company": "Thomson Reuters",
        "Source_URL": "https://www.thomsonreuters.com/en/press-releases/2025/november/law-firms-reach-new-heights-amid-historic-demand-surge",
        "Content_Type": "Website Content",
        "Raw_Text": "November 10, 2025\nLaw Firms Reach New Heights Amid Historic Demand Surge\nTechnology investment continues to skyrocket, with the pace accelerating\nTORONTO, November 10, 2025 –Thomson Reuters (Nasdaq/TSX: TRI), a global content and technology company, issued a new report today showing the legal industry experienced unprecedented growth in the third quarter of 2025, marking its fourth-highest quarter for demand in the past two decades.\nAccording to the Q3 2025 Thomson Reuters Law Firm Financial Index (LFFI), powered by Financial Insights, demand within the legal sector surged 3.9% compared to Q3 2024. Unlike prior peak quarters for demand, which occurred in 2021 as law firms recovered from early pandemic declines, Q3 2025 reflects sustained and robust client activity, signifying genuine expansion beyond merely returning to baseline pre-pandemic level.\nTransactional practices were the primary drivers of this growth, with Midsize law firms posting a 6.1% increase in demand compared to the previous year. All transactional segments reported heightened activity, led by mergers & acquisitions (M&A), which saw a 7.6% year-over-year increase. Other key practice areas also contributed, with litigation up 4.9%, corporate law rising 4.3%, real estate advancing 4.2%, and labor & employment increasing 4.0%.\nReflecting this strong performance, law firms boosted average revenue per lawyer by 6.6% year-over-year and are on track to achieve double-digit profit growth for the full year.\nDirect expenses continued to grow at a steady pace, while overhead expenses rose more rapidly – primarily due to notable investments in technology. On a rolling 12-month average, technology spending jumped to 11.2% in Q3 2025, marking the third consecutive year of significant investment and an ongoing acceleration in the rate of technology adoption across the industry.\n\"The third quarter was extraordinary with a significant surge in demand, especially for transactional work, reflecting an active corporate environment despite global uncertainties,\" said Raghu Ramanathan, president, Legal Professionals, Thomson Reuters. \"Law firms are sensibly balancing this tremendous growth by making strategic investments in technology and talent, taking advantage of current conditions to ensure their firms remain competitive and continue providing high-level service to clients.\"\nA copy of the Q3 2025 LFFI report can be downloaded here.\nThe LFFI, produced by the Thomson Reuters Institute, is a composite index of law firm market performance using Financial Insights data drawn from major law firms in the United States and key international markets.\nThomson Reuters\nThomson Reuters (Nasdaq/TSX: TRI) informs the way forward by bringing together the trusted content and technology that people and organizations need to make the right decisions. The company serves professionals across legal, tax, accounting, compliance, government, and media. Its products combine highly specialized software and insights to empower professionals with the data, intelligence, and solutions needed to make informed decisions, and to help institutions in their pursuit of justice, truth, and transparency. Reuters, part of Thomson Reuters, is a world-leading provider of trusted journalism and news. For more information, visit tr.com.\nContact\nJeff McCoy\n+1.763.326.4421\njeffrey.mccoy@tr.com"
    },
    {
        "Ticker": "TRI",
        "Company": "Thomson Reuters",
        "Source_URL": "https://www.thomsonreuters.com/en/press-releases",
        "Content_Type": "Website Content",
        "Raw_Text": "Filters are applied when selected.\npressreleases\nAnd we'll keep writing. Every search you do helps us figure out what you're looking for.\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nThese cookies enable the website to provide enhanced functionality and personalization. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising."
    },
    {
        "Ticker": "TRI",
        "Company": "Thomson Reuters",
        "Source_URL": "https://www.thomsonreuters.com/en/about-us",
        "Content_Type": "Website Content",
        "Raw_Text": "Thomson Reuters\nClarifying the complex so professionals can act with confidence Thomson Reuters is an AI and technology company empowering professionals with trusted content and workflow automation to know now and navigate what’s next\nIn times of constant change, the world looks to professionals to lead. But as complexity grows, even professionals risk being overwhelmed.\nThomson Reuters clarifies today’s complex landscape with AI and technology, deep subject-matter expertise, and content the world has trusted for over 150 years — giving professionals the confidence to know today, navigate tomorrow, and lead a fast-evolving world.\nWe empower professionals to reduce inefficiencies so they can do more of the work that matters, act decisively to add greater value for critical stakeholders, and anticipate future challenges to face the unexpected.\nAs the future arrives faster than ever, we’re standing alongside professionals, ready to fulfill our purpose: to inform the way forward.\nPurpose driven, trusted expertise, continuous innovation\nReinventing the way professionals work\nWe are constantly experimenting, innovating, and applying cutting-edge technologies to customer challenges.\nThomson Reuters Labs\nOur global network of labs explore new business opportunities for Thomson Reuters, working with customers and partners to create quick, agile and collaborative experiments and proofs-of-concept.\nThomson Reuters Institute\nBringing together people from across the legal, corporate, tax & accounting, and government communities to ignite conversation and debate, make sense of the latest events and trends, and provide essential guidance on the opportunities and challenges facing their world today.\nBuilt on trust\nAt a time when the virtues of objectivity, accuracy, fairness, and transparency are under attack, we consider it our duty to pursue them — just as we have for more than 100 years."
    },
    {
        "Ticker": "TRI",
        "Company": "Thomson Reuters",
        "Source_URL": "https://www.thomsonreuters.com/en/about-us/our-purpose",
        "Content_Type": "Website Content",
        "Raw_Text": "Our purpose\nInform the way forward\nWhat does it mean to inform the way forward?\nTogether with the professionals and institutions we serve, we help uphold the rule of law, turn the wheels of commerce, catch bad actors, report the facts, and provide trusted, unbiased information to people all over the world.\nOur role at Thomson Reuters is to serve our customers, pursuing justice, truth, and transparency.\nPurpose experienced #WorkingAtTR\nOur impact\nHow we make an impact, where we make an impact, and why it matters\nProfessionals\nPowering professionals to act with confidence.\nWe believe that well-informed professionals find greater success in their calling and are essential to help society function and adapt.\nWe equip them with the tools, content, trusted information, and data they need to excel today and navigate change tomorrow. We support them to maximize value and minimize risk for their organizations, drive competitive advantage, and transform the way they work.\nInstitutions\nAdvancing critical institutions and systems\nWe believe that in an increasingly complex world, dependable and accountable institutions are more important than ever. Cracks in this bedrock lead to unfairness, injustice, and exploitation; they weaken the systems upon which we all depend.\nThrough our customers, we support valued institutions to help them modernize and keep pace with today’s world, strengthening the foundations society sorely needs - and helping us build a future we can all believe in.\nSociety\nPursuing justice, truth and transparency.\nWe believe justice, truth, and transparency are essential to advancing the human condition for all.\nWe pursue these simple, timeless ideals because they underpin the history of progress, of equality, of peace and freedom. And they are essential guideposts that inform the way forward to a more understanding, trusting world for all.\nTogether we ...\nCombat misinformation\nModernize institutions\nSupport small businesses\nTackle fraud\nPower professionals\nFight human trafficking\nCatch bad actors\nDefend the truth"
    },
    {
        "Ticker": "TRI",
        "Company": "Thomson Reuters",
        "Source_URL": "https://www.thomsonreuters.com/en/about-us/social-impact",
        "Content_Type": "Website Content",
        "Raw_Text": "Social Impact Institute\nWatch this video to learn more about our Purpose.\nThomson Reuters is one of the only companies in the world that helps its customers pursue justice, truth, and transparency. Together with the professionals and institutions we serve, we help uphold the rule of law, turn the wheels of commerce, catch bad actors, report the facts, and provide trusted, unbiased information to people all over the world.\nAt heart, we are a content-driven technology company powering the world’s most informed professionals, institutions, and society.\nThis work is reinforced at the Thomson Reuters Social Impact Institute and with our people and partnerships, creating opportunities for innovation, community investment, volunteer impact, and sustainable corporate citizenship. Through our customers, we lay the foundations upon which value is created, advancing the integrity and resilience of critical institutions and systems. Together, we inform the way forward to a more understanding, trusting world for all. This is our purpose.\nFind Purpose-driven careers at Thomson Reuters\nSafe Settings campaign: Empowering adults and communities to protect children online\nThe internet is an essential part of children’s lives — offering opportunities to learn, connect, and play — but it also presents risks that have never been more urgent. Online child exploitation is a growing threat, fueled by increased connectivity, rapidly evolving technology, and online anonymity. As abusers find new ways to target children, it’s essential for parents, caregivers, and communities to have practical tools and information to keep kids safe.\nRecognizing this critical need, the Thomson Reuters Social Impact Institute launched the Safe Settings campaign, a comprehensive initiative designed to equip adults with the knowledge and resources to help protect children from online exploitation. Through clear guidance and up-to-date information, Safe Settings empowers families and communities to foster open conversations with children, use privacy and safety controls on digital platforms, and recognize the warning signs of online grooming, sextortion, and abuse.\nThe Safe Settings campaign draws on the expertise of Thomson Reuters and its partners in child protection to deliver actionable advice for everyday situations. Resources cover how to spot risky behavior online, steps to set up device and app privacy settings, and strategies for building trust so children feel safe disclosing concerns. The campaign also highlights the importance of ongoing dialogue and collective action, emphasizing that safeguarding children online requires the involvement of parents, educators, organizations, and policymakers.\nBy working together and staying informed, we can create safer online environments for every child. Join us in supporting Safe Settings and help make a difference in the fight against online child exploitation.\nAddressing the crisis of Missing and Murdered Indigenous Women: Thomson Reuters takes action on human trafficking\nThe crisis of Missing and Murdered Indigenous Women (MMIW) in Canada represents a profound human rights challenge. Despite comprising only 5% of the population, Indigenous women and girls account for over 50% of human trafficking victims and are tragically six times more likely to be murdered than other women. This horrific over-representation points to deeper, systemic issues, often leading to a swift and alarming transition from disappearance to exploitation in online sex-ad ecosystems.\nIn response, Thomson Reuters has launched new research to illuminate these urgent connections. Utilizing sophisticated geospatial analysis, this research uncovers critical trends, identifying urban hotspots like Winnipeg and Edmonton, where MMIW cases tragically correlate with human trafficking activity. This data-driven approach highlights the need for integrated efforts and stronger cross-border collaboration. As Heather C. Panton, Senior Advisor, Social Impact & Human Rights, states, \"Technology plays a critical role in prevention, detection and prosecution efforts to tackle human trafficking.\" Thomson Reuters is committed to leveraging its expertise to inform action and protect vulnerable women and girls.\nSpotlighting the nexus of sextortion and forced scamming\nThomson Reuters is proud to support groundbreaking research by the International Justice Mission (IJM) exploring the intersection of two emerging global threats: the financially motivated sextortion of children and forced scamming operations. This study, funded in part by the Thomson Reuters Social Impact Institute, reveals the methods used to coerce trafficking victims in Southeast Asia into online scams that may also involve child exploitation.\nBy analyzing CyberTipline data and internet infrastructure, IJM identified hundreds of cases potentially linked to scam compounds. The findings provide actionable insights for law enforcement and tech platforms to more effectively detect and disrupt these crimes, advancing our shared mission to protect vulnerable populations and promote justice worldwide.\nClosing the Gap: AI for Justice\nMillions of low-income Americans face civil legal challenges without the support they need. At Thomson Reuters, we believe technology can help bridge this gap. That’s why we launched the AI for Justice Legal Aid program, providing nonprofit legal organizations with access to CoCounsel, our revolutionary AI legal assistant, through the Legal Innovators Incubator.\nThe inaugural Incubator class brought together nine nonprofit organizations, including The Innocence Center, the National Center for Missing and Exploited Children, and Lawyers Alliance for New York. For one year, these organizations received complimentary access to CoCounsel, empowering them to tackle complex legal workstreams faster and more efficiently. Using our advanced tool, they were able to dramatically streamline time-intensive tasks, such as identifying inconsistencies in witness statements, fact-checking, and drafting legal documents.\nMike Semanchik, Executive Director of The Innocence Center, shared how CoCounsel transformed their case review process, stating, “When we review cases, we must go page-by-page, and often you might miss something. CoCounsel is capturing it all and citing back to it.” This level of efficiency means more individuals can receive the legal help they desperately need.\nIn addition to technology, our program offers hands-on training and support, ensuring organizations can maximize the benefits of generative AI for their unique needs. The knowledge and playbooks developed through the Incubator will be shared broadly to amplify impact across the legal aid sector.\nAt Thomson Reuters, we are committed to harnessing the power of AI to make the justice system more efficient, effective, and equitable. By empowering legal aid organizations with innovative tools and support, we are helping to close the justice gap — one case at a time.\nOur approach\nOur approach, guided by our Trust Principles and underpinned by the Thomson Reuters Code of Business Conduct & Ethics, is at the core to our purpose and values, and is articulated through our Social Impact Policy.\nThomson Reuters is dedicated to upholding the Trust Principles and to preserving its independence, integrity and freedom from bias in the gathering and dissemination of information and news.\nWe report annually on our progress and performance related to responsible business practices in our annual report.\nWe are members of the United Nations Global Compact, this commitment makes us accountable to the Ten Principles and also informs how we are supporting the Sustainable Development Goals.\nOur people\nWe believe strength is derived from the talents, ideas, and experiences of our people. We know that an inclusive workplace where all employees are valued and have the opportunity to reach their full potential is also a successful one. Providing our employees with tools and support to give back to causes important to them is a core belief.\nOur markets\nWe help create the backbone of legal and tax systems, providing accurate information that supports objective and fair outcomes. We are a free press that seeks to inform and empower people around the world, sharing our skills and knowledge to support journalism’s sustainable future.\nOur world\nWe know that supporting the communities in which we live and work is fundamental to our business; so too is managing our environmental impacts through our own sustainable business practices and by working with suppliers who share our values.\nOur foundation\nThe Thomson Reuters Foundation\nAs an independent charity, registered in the UK and the USA, the Thomson Reuters Foundation works to advance media freedom, foster more inclusive economies, and promote human rights. Through news, media development, free legal assistance, and convening initiatives, we combine our unique services to drive systemic change.\nOur policies and resources\nLearn more about our policies and resources for employees:\nCode of Business Conduct and Ethics\nData and AI ethics principles\nDigital accessibility\nEnvironment, Health, and Safety Policy\nModern Slavery Act Transparency Statement\nProduct Sheet\nSocial Impact Policy\nThomson Reuters California AB1305 Carbon Market Disclosure\nThomson Reuters Environmental Verification Statement\nThomson Reuters Human Rights Policy\nThomson Reuters Institute Resource Centers\nThomson Reuters Supply Chain Ethical Code"
    },
    {
        "Ticker": "TRI",
        "Company": "Thomson Reuters",
        "Source_URL": "https://www.thomsonreuters.com/en/products-services/news-media",
        "Content_Type": "Website Content",
        "Raw_Text": "News & media\nAward-winning\ncontent and coverage\nfor today’s newsroom\nAt a time when the truth has never been more important, Reuters delivers real stories with depth, breadth, and speed\nWith unmatched coverage in over 16 languages, and reaching billions of people worldwide every day, we provide trusted intelligence that powers humans and machines to make smart decisions. Founded in 1851, Reuters has remained true to the Trust Principles of independence, integrity, and freedom from bias, working relentlessly to bring news from the source and from every corner of the world.\nAccess the most comprehensive multi-media coverage\nIn the digital era, video is king. We are the leading global news agency for video content.\nOur award-winning photography covers every topic and corner of the world.\nSpeak to readers everywhere with enriched facts and context from our text newswires.\nInteractive and creative graphics that bring data to life, created by us and customizable by you.\nServices we offer\nHow to access Reuters content\nOur experts provide trusted insights on news & media.\nBring your passion\nWe believe strength is derived from the talents, ideas, and experiences of our people. We know that an inclusive workplace where all employees are valued and have the opportunity to reach their full potential is also a successful one."
    },
    {
        "Ticker": "TRI",
        "Company": "Thomson Reuters",
        "Source_URL": "https://www.thomsonreuters.com/en/about-us/trust-principles",
        "Content_Type": "Website Content",
        "Raw_Text": "The Trust Principles\nThomson Reuters is dedicated to upholding the Trust Principles and to preserving its independence, integrity, and freedom from bias in the gathering and dissemination of information and news.\nTrust Principles – the history\nThe Trust Principles were created in 1941, in the midst of World War II, in agreement with The Newspaper Proprietors Association Limited and The Press Association Limited (being the Reuters shareholders at that time). The Trust Principles imposed obligations on Reuters and its employees to act at all times with integrity, independence, and freedom from bias.\nReuters Directors and shareholders were determined to protect and preserve the Trust Principles when Reuters became a publicly traded company on the London Stock Exchange and Nasdaq. A unique structure was put in place to achieve this. A new company was formed and given the name 'Reuters Founders Share Company Limited', its purpose being to hold a 'Founders Share' in Reuters.\nThe legal structure has evolved over time and the Founders Share and other contractual arrangements now confer a number of special rights upon the Thomson Reuters Founders Share Company. For example, (i) the Thomson Reuters Founders Share Company has enhanced voting rights in circumstances where someone is seeking to obtain a significant shareholding in, or acquire control of, Thomson Reuters and (ii) the prior consent of the Thomson Reuters Founders Share Company must be sought prior to undertaking any sale of, or other material transaction involving, the Reuters news business unit.\nThomson Reuters itself is obliged and committed to apply the Trust Principles to its operations. The charter documents of Thomson Reuters Corporation include provisions to safeguard the Trust Principles as they apply to the Thomson Reuters business and require Thomson Reuters Directors, in the performance of their duties, to have due regard to the Trust Principles, by the proper exercise of their powers and in accordance with their other duties as Directors.\nThe Trust Principles are:\n- That Reuters shall at no time pass into the hands of any one interest, group, or faction;\n- That the integrity, independence, and freedom from bias of Thomson Reuters shall at all times be fully preserved;\n- That Reuters shall supply unbiased and reliable news services to newspapers, news agencies, broadcasters, and other media subscribers and to businesses, governments, institutions, individuals, and others with whom Reuters has or may have contracts;\n- That Thomson Reuters shall pay due regard to the many interests which it serves in addition to those of the media; and\n- That no effort shall be spared to expand, develop, and adapt the news and other services and products of Thomson Reuters so as to maintain its leading position in the international news and information business\nThomson Reuters Founders Share Company was established in 1984 when Reuters became a public company. The directors of Thomson Reuters Founders Share Company (known as ‘Trustees’) have a duty to ensure, to the extent possible, that the Trust Principles are complied with.\nThe Trustees are experienced and eminent people from diverse arenas in politics, diplomacy, media, public service and business. The Trustees are selected by a nomination committee and proposed to the board of the Thomson Reuters Founders Share Company for appointment. The nomination committee assists in scrutinizing candidates’ suitability and its members include two persons appointed by the chairman after consultation with the European Court of Human Rights and representatives of certain press associations. The Thomson Reuters Corporation board has two representatives on the nomination committee. The Chairman and Deputy Chairman of the Thomson Reuters Founders Share Company Board are members of the nomination committee, and the Chairman appoints three other directors of the Thomson Reuters Founders Share Company as members of the nomination committee. The Chairman of the Thomson Reuters Founders Share Company acts as chairman of the nomination committee.\nThe number of Trustees has to be at least 14 and not more than 18. Trustees have a minimum of two meetings per year, and receive reports on our activities in the different fields in which we operate (including Reuters news). The Trustees meet with both the Thomson Reuters Board and representatives of senior management. Through Thomson Reuters Founders Share Company's Chairman, regular contact is maintained with our company. The relationship is one of trust and confidence.\nIndependence of Thomson Reuters\nCustomers across the world depend on us to provide them with reliable and objective news and information.\nThis means that we have a special need to safeguard our independence and integrity and avoid any bias which may stem from control by specific individuals or interests.\nThe Thomson Reuters Trust Principles were adopted in 1941 and include the preservation of integrity, reliability of news, development of the news business, and related principles.\nToday, the Trust Principles are fundamental to our entire business."
    },
    {
        "Ticker": "TRI",
        "Company": "Thomson Reuters",
        "Source_URL": "https://www.thomsonreuters.com/en/contact-us/media-contacts",
        "Content_Type": "Website Content",
        "Raw_Text": "Media relations contacts\nContact a member of our public relations team\nBuilt on trust\nAt a time when the virtues of objectivity, accuracy, fairness, and transparency are under attack, we consider it our duty to pursue them — just as we have for more than 100 years"
    },
    {
        "Ticker": "TRI",
        "Company": "Thomson Reuters",
        "Source_URL": "https://www.thomsonreuters.com/en/press-releases/2024/september/thomson-reuters-core-publishing-solutions-named-printing-impressions-2024-innovator-of-the-year",
        "Content_Type": "Website Content",
        "Raw_Text": "September 10, 2024\nThomson Reuters Core Publishing Solutions Named Printing Impressions 2024 \"Innovator of the Year\"\nMINNEAPOLIS, September 10, 2024 – Thomson Reuters (TSX/NYSE: TRI), a global content and technology company, proudly announces that its Core Publishing Solutions book manufacturing and fulfilment business, part of the Global Print segment, has been honored with Printing Impressions’ 2024 Innovator of the Year Award. This prestigious recognition showcases Core Publishing Solutions’ successful transformation from a legacy book manufacturer into a cutting-edge printing and fulfilment leader.\nFor over 150 years, Thomson Reuters has served as a powerhouse in publishing and manufacturing books for the legal and tax sectors. However, as customer preference evolved towards digital media, Core Publishing Solutions strategically embarked on a reinvention. The transformation of its 1.3 million-square-foot facility in Eagan, Minnesota, into a modern book manufacturing, warehousing, custom kitting, and fulfillment leader is a testament to this evolution.\n“It’s an honor for Core Publishing Solutions to receive the Printing Impressions’ Innovator of the Year award for 2024. This recognition underscores our team’s dedication, resilience, and unwavering commitment to provide an industry-leading customer experience,” said Jennifer Prescott, president, Global Print, Thomson Reuters. “By embracing technological advancements and constantly striving for improvement, we are proud to continue pushing boundaries in the world of commercial print.”\nThe journey began prior to Thomson Reuters’ acquisition of West Publishing in 1996, which led to the diversification into digital media and software solutions. Recognizing the growing need for shorter-run printing capabilities, the company invested in Timsons Zero-Makeready (ZMR) web offset presses and early digital printing technologies.\nIn 2013, Core Publishing Solutions was launched as a brand, and has since grown to extend its services to over 100 publishers outside Thomson Reuters. This strategic expansion required the addition of over 100 employees, bringing the total workforce to 500 and enabling a 24-hour operation.\nAdditionally, Core Publishing Solutions has been at the forefront of high-speed inkjet printing technology. The installation of the first HP PageWide T360 monochrome inkjet web press in 2015 marked the beginning of its l digital inkjet evolution. Subsequent installations of additional mono and T485 four-color presses with Magnum FlexBook and Muller Martini SigmaLine III machines have enabled the company to meet increasing demands for shorter press runs, reprint orders, and faster turnaround times. The facility also features Canon varioPRINT iX-3200 inkjet presses, Kodak Nexpress digital cut-sheet machines, and a Komori sheetfed offset press for longer-run book covers, ensuring flexibility and efficiency in production. The technology doesn’t stop with printing, as binding and finishing plays a critical role in efficient short run production. Investments in technology that incorporates automated make-readies, touchless workflows and reduced material handling can be seen throughout the facility.\n\"This award is a remarkable acknowledgement of the journey we have been on to pursue innovation and excellence,\" said Steve Zweber, Vice President of Global Print Manufacturing & Operations, Thomson Reuters. \"Our team at Core Publishing Solutions has worked tirelessly to adapt and thrive in an evolving industry landscape – and we are proud to not only have met but exceeded the expectations of our diverse clientele.\"\nCore Publishing Solutions’ culture of continuous improvement and Lean manufacturing initiatives has driven significant value and efficiency. The business, and customers, also benefits from a long-tenured workforce, with many staff members boasting over 20 years of industry experience. Despite an industry-wide skilled worker shortage, the company has successfully maintained and attracted skilled workers through a strong culture of teamwork, training, advancement opportunities, and competitive benefits.\nLooking ahead, Core Publishing Solutions continues to invest in collaborative robotics and workflow automation, further enhancing its production efficiencies and shortening lead times. These advancements will play a crucial role in delivering innovative solutions, high quality products and outstanding service to customers, further solidifying Thomson Reuters Core Publishing Solutions’ position as a leader in the printing industry.\nThomson Reuters\nThomson Reuters (TSX/NYSE: TRI) (“TR”) informs the way forward by bringing together the trusted content and technology that people and organizations need to make the right decisions. The company serves professionals across legal, tax, accounting, compliance, government, and media. Its products combine highly specialized software and insights to empower professionals with the data, intelligence, and solutions needed to make informed decisions, and to help institutions in their pursuit of justice, truth, and transparency. Reuters, part of Thomson Reuters, is a world leading provider of trusted journalism and news. For more information, visit tr.com.\nContact\nDenise Lam\nCorporate Communications\ndenise.lam@thomsonreuters.com"
    },
    {
        "Ticker": "TRI",
        "Company": "Thomson Reuters",
        "Source_URL": "https://www.thomsonreuters.com/en/press-releases/2025/november/onesource-esg-reporting-for-sap-sustainability-control-tower-an-sap-endorsed-app-available-on-sap-store",
        "Content_Type": "Website Content",
        "Raw_Text": "November 18, 2025\nONESOURCE ESG Reporting for SAP® Sustainability Control Tower, an SAP Endorsed App Available on SAP Store\nThomson Reuters and SAP offer an integrated solution that streamlines the process of collecting, organizing, and accurately disclosing ESG data, to comply with European Sustainability Reporting Standards (ESRS) reporting requirements.\nNovember 18, 2025 – TORONTO, ON – Thomson Reuters (TSX/Nasdaq: TRI), a global content and technology company, announced today that its ONESOURCE ESG Reporting for SAP® Sustainability Control Tower solution is an SAP Endorsed App, available for online purchase on SAP Store. SAP Endorsed Apps are a distinct category of solutions within SAP's partner ecosystem. These apps solve key customer challenges that provide additional value to offer holistic business solutions and bring out the best in every business.\n\"We are excited that ONESOURCE ESG Reporting for SAP® Sustainability Control Tower is an SAP Endorsed App,\" said Ray Grove, Head of Product, Tax and Trade at Thomson Reuters. \"This integrated solution fundamentally simplifies ESG compliance for multinational companies. By combining Thomson Reuters reporting expertise with SAP's sustainability tools, we've created a powerful offering that automates and streamlines ESG data gathering and reporting. This ensures businesses can efficiently meet the requirements of the EU's European Sustainability Reporting Standards (ESRS), providing accurate, real-time data to monitor and report on their sustainability performance under ESRS with confidence and ease.\"\nSAP Endorsed Apps are premium certified by SAP with added security, in-depth testing and measurements against benchmarks results. ONESOURCE ESG Reporting for SAP® Sustainability Control Tower automatically pulls ESG data from SAP Sustainability Control Tower through a purpose-built API, reducing errors and improving accuracy. It creates one source of truth with review tools and audit logs for better collaboration and accountability. Together, SAP and Thomson Reuters cut manual work and prep time, helping organizations stay compliant with ESRS and file ESG reports more efficiently.\n“Ecosystem innovations are essential to SAP’s vision and delivery of the intelligent enterprise for SAP customers,” said Darryl Gray, Global Vice President, Software Partner Solution Monetization & Success at SAP. “We applaud Thomson Reuters on achieving SAP Endorsed App status for its ONESOURCE ESG Reporting for SAP® Sustainability Control Tower solution. Partners like Thomson Reuters are positioned to help us deliver a cloud-first strategy with integrated innovations, proven to provide value while solving key business challenges.”\nThe ONESOURCE ESG Reporting for SAP® Sustainability Control Tower solution is available for digital discovery and purchase at SAP Store, the digital marketplace for solutions from SAP and its partners. SAP Store provides customers with real-time access to more than 2,000 innovative solutions from SAP as well as partner solutions that complement and extend their SAP applications, enabling digital transformation of their business.\nThis integrated solution highlights Thomson Reuters role as a leading technology company, leveraging its expertise and innovative tools to empower businesses at the critical intersection of commerce and compliance, enabling them to confidently manage ESG reporting requirements and stay ahead of evolving regulations.\nAbout Thomson Reuters:\nThomson Reuters (TSX/Nasdaq: TRI) informs the way forward by bringing together the trusted content and technology that people and organizations need to make the right decisions. The company serves professionals across legal, tax, accounting, compliance, government, and media. Its products combine highly specialized software and insights to empower professionals with the data, intelligence, and solutions needed to make informed decisions and help institutions pursue justice, truth, and transparency. Reuters part of Thomson Reuters, is a world leading provider of trusted journalism and news. For more information, visit tr.com.\nMedia Contact:\nDenise Lam\nCorporate Communications\ndenise.lam@thomsonreuters.com"
    },
    {
        "Ticker": "TRI",
        "Company": "Thomson Reuters",
        "Source_URL": "https://www.thomsonreuters.com/en/press-releases/2025/november/thomson-reuters-honors-industry-innovators-at-annual-synergy-2025-conference",
        "Content_Type": "Website Content",
        "Raw_Text": "November 17, 2025\nThomson Reuters Honors Industry Innovators at Annual SYNERGY 2025 Conference\nCelebrating visionary organizations advancing Tax, Audit and Accounting, Legal, and Corporate practices through innovation\nORLANDO, FL, November 17, 2025 – Thomson Reuters (TSX/Nasdaq: TRI), a global content and technology company, proudly announces the 2025 winners of the Luca Pacioli Accounting Awards, SYNERGY Awards for Legal Professionals, and Corporates Excellence Awards. These honors were presented at SYNERGY 2025, the largest annual user conference hosted by Thomson Reuters, held from November 5-12 in Orlando, Florida.\nLuca Pacioli Accounting Awards\nThe Luca Pacioli Awards honor tax, audit, and accounting leaders who fuse breakthrough technology with deep professional expertise. These awards spotlight firms and individuals elevating client value and team experience, underscoring how innovation is reshaping the future of work.\nElizabeth Beastrom, President of Tax and Accounting Professionals at Thomson Reuters says: \"Our profession is evolving fast. AI and modern workflows are transforming how work gets done, and how firms deliver greater value to their clients year-round. Technology plays a big role in this transformation, but leadership and motivation to evolve are also essential. The firms we recognize with our Luca Pacioli Awards pair innovation and transformation with deep expertise, and rigorous standards. They put their clients at the center of their investments, and they are moving the profession to a place where clients see their accountants as strategic partners.\"\nThe 2025 Luca Pacioli Accounting Award winners are:\n- Advisory Accelerator Award – GarciaHasler LLC\n- Audit Vanguard – Kemper CPA\n- Impact Award – West & Company CPAs\n- Firm of the Year (Mid-Market) – Lyons & Lyons CPAs\n- Firm of the Year (Large) – Crowe LLP\nSYNERGY Awards for Legal Professionals\nThe SYNERGY Awards honor legal innovators who use Thomson Reuters technology to redefine practice, deliver measurable improvements, and elevate client outcomes – celebrating organizations and professionals who pair legal expertise with innovation to advance access to justice, foster community engagement, and turn AI into practical, team-wide solutions.\n“It is an honor to celebrate the achievements of our SYNERGY Legal Awards winners,” said Raghu Ramanathan, president, Legal Professionals, Thomson Reuters. “Through their innovation, navigating transformation and impacting their communities, these organizations embody the very spirit of these awards. They are setting new standards of excellence and shaping the future of the legal profession.”\nThe 2025 SYNERGY Award winners are:\n- Innovator of the Year (law firm) – Morgan, Lewis & Bockius LLP\n- Innovator of the Year (public sector) – Law Offices of Carlos J. Martinez, Miami Dade Public Defender\n- Impact Award – Hale Law\n- Change Champion – Gibson Dunn\nCorporates Excellence Awards\nIn addition, the 2025 Corporates Excellence Awards, recognize exceptional legal, tax and trade departments and professionals who have added significant value to their organizations by embracing technology and leveraging Thomson Reuters products to maximize effectiveness.\n“We are thrilled to honor these visionary leaders who continue to redefine excellence across legal, tax, trade, and risk, and enterprise collaboration,” said Laura Clayton McDonnell, President, Corporates, Thomson Reuters. “By harnessing the power of our platforms and partnering to solve complex challenges, these recipients are accelerating transformation, scaling impact, and setting new benchmarks for innovation and customer-centricity.”\nThe 2025 Corporates Excellence Award winners are:\n- Legal Innovator - AtriCure\n- Trade Innovator - Trade Forward\n- Risk Innovator - Beacon Bank & Trust\n- Partner of the Year - CERTifyTax\n- Innovation Partner of Year - Oracle\nThomson Reuters\nThomson Reuters (TSX/Nasdaq: TRI) informs the way forward by bringing together the trusted content and technology that people and organizations need to make the right decisions. The company serves professionals across legal, tax, accounting, compliance, government, and media. Its products combine highly specialized software and insights to empower professionals with the data, intelligence, and solutions needed to make informed decisions, and to help institutions in their pursuit of justice, truth, and transparency. Reuters, part of Thomson Reuters, is a world-leading provider of trusted journalism and news. For more information, visit tr.com.\nContact\nDenise Lam\nCorporate Communications\ndenise.lam@thomsonreuters.com"
    },
    {
        "Ticker": "TRI",
        "Company": "Thomson Reuters",
        "Source_URL": "https://www.thomsonreuters.com/en/press-releases/2025/november/thomson-reuters-advances-ai-market-leadership-with-new-agentic-ai-solutions",
        "Content_Type": "Website Content",
        "Raw_Text": "November 5, 2025\nThomson Reuters Advances AI Market Leadership with New Agentic AI Solutions\nEnabling professionals to delegate complex, multi-step tasks and transform workflows across Tax, Audit, Legal and Compliance.\nTORONTO — November 5, 2025 — Thomson Reuters (TSX/Nasdaq: TRI), a global content and technology company, today unveiled new agentic AI solutions purpose-built for professionals. The expanded offering introduces ONESOURCE+ - an intelligent compliance network powered by new agentic AI capabilities - alongside next-generation agentic functionality for both CoCounsel Tax, Audit and Accounting and CoCounsel Legal.\n\"Today we're announcing new agentic AI solutions across multiple critical business functions—something few companies can deliver,\" says David Wong, Chief Product Officer at Thomson Reuters. \"Thomson Reuters is the only company with the complete foundation required for professional grade agentic AI—advanced reasoning models, comprehensive content, thousands of domain experts, and the trusted tools professionals already use daily. We're not just launching products, we're enabling our customers to delegate complex work, reduce manual tasks, and focus their expertise where it matters most.”\nToday's announcements build on Thomson Reuters momentum after launching CoCounsel Legal with Deep Research, and CoCounsel Tax, Audit and Accounting earlier this year, underscoring the company's rapid pace of innovation in delivering agentic AI solutions to customers globally.\nIntroducing ONESOURCE+: The AI-powered Intelligent Compliance Network\nONESOURCE+ is the only Intelligent Compliance Network that brings together tax, trade, legal, and risk solutions to help organizations drive efficiency, reduce risk, and unlock growth. ONESOURCE+ is fueled by new AI innovation including:\n- ONESOURCE Sales and Use Tax AI - Automates the entire sales and use tax filing process, enabling companies to generate signature-ready returns across thousands of jurisdictions while reducing preparation time by 40-60% and minimizing audit risk.\n- ONESOURCE Global Classification AI - Accelerates product classification for global trade teams by suggesting accurate HS codes, normalizing product data into a unified master, and continuously learning from expert decisions to produce audit-ready documentation with transparent rationales.\nTo learn more about ONESOURCE+ and other product innovation for corporate professionals, visit the news page.\nCoCounsel Tax, Audit and Accounting Adds Agentic AI Capabilities for Automated Return Preparation and Audit Workflows\nThomson Reuters is further advancing the capabilities of CoCounsel Tax, Audit and Accounting with several significant AI-powered developments designed to transform tax preparation and audit workflows:\n- Ready to Review - By processing source documents and prior-year returns, this agentic AI tax workflow application automates U.S. 1040 Form tax return preparation, generating returns that are ready for professional review.\n- CoCounsel Document Analysis - Coming January 2026, auditors and accounting professionals will be able to automate complex audit workflows at scale. Professionals will be able to delegate client document review to this agentic AI solution, which extracts critical data for vouching and substantive testing, produces cited workpapers, and frees professionals to focus on judgment-intensive work.\nIndiana-based CLH CPAs & Consultants had the opportunity to try Ready to Review and it offered transformative time savings for the firm. “Reducing return preparation time by approximately an hour on each simple 1040 is significant in terms of efficiency gains. For firms like ours, these time savings will be a game changer,” says Bob Lange, Partner at CLH.\nThe company has also expanded CoCounsel Tax, Audit and Accounting's knowledge base to include authoritative content from AICPA, FASB, GASB, and IFRS (including sustainability standards) now integrated directly into CoCounsel's single AI-guided workflow.\nTo learn about other new products for tax, audit, and accounting professionals, including Audit Intelligence visit the news page.\nCoCounsel Legal Introduces Next-Generation Agentic AI Capabilities for Complex Legal Workflows.\nThomson Reuters is advancing CoCounsel Legal with three new capabilities now in beta. Each is designed with a next-generation agentic framework to partner with legal professionals to accelerate legal work by:\n- Bulk Legal Document Review\n- Bulk document review of up to 10,000 documents in tabular format to accelerates diligence and risk identification for M&A, litigation discovery, regulatory compliance, and other document-heavy workflows.\n- Customizing agentic workflows\n- Enhancing independent planning and execution of complex, multi-step legal workflows—from analysis to document creation—using Westlaw and Practical Law content and tools.\n- Allowing lawyers to create, save, and share customized workflow plans that combine Thomson Reuters trusted legal content and tools with firm knowledge, so practice groups can share and refine their approaches.\nThese new CoCounsel Legal capabilities will become available to U.S. customers in early 2026.\nAcross all solutions, Thomson Reuters agentic AI delivers consistent benefits: significant time savings through automation of repetitive tasks, reduced risk through transparent and audit-ready documentation, and enhanced accuracy by combining advanced AI reasoning with trusted professional-grade content. These solutions allow professionals to focus on strategic decision-making while AI handles the routine complexity.\nThomson Reuters will unveil these and other product innovations to more than 5,000 customers during their SYNERGY 2025 Conference held in Orlando, Florida between November 5-12.\nFor more information about recent product launches and enhancements visit the Thomson Reuters Innovation Blog.\nAbout Thomson Reuters\nThomson Reuters (TSX/Nasdaq: TRI) informs the way forward by bringing together the trusted content and technology that people and organizations need to make the right decisions. The company serves professionals across legal, tax, accounting, compliance, government, and media. Its products combine highly specialized software and insights to empower professionals with the data, intelligence, and solutions needed to make informed decisions, and to help institutions in their pursuit of justice, truth, and transparency. Reuters, part of Thomson Reuters, is a world leading provider of trusted journalism and news. For more information, visit tr.com.\nContact:\nAmanda Hossain\nSenior Director, Product and Technology Communications\nAmanda.Hossain@ThomsonReuters.com"
    },
    {
        "Ticker": "TRI",
        "Company": "Thomson Reuters",
        "Source_URL": "https://www.thomsonreuters.com/en/press-releases/2025/november/thomson-reuters-launches-agentic-ai-solutions-to-transform-tax-audit-and-accounting-workflows",
        "Content_Type": "Website Content",
        "Raw_Text": "November 5, 2025\nThomson Reuters Launches Agentic AI Solutions to Transform Tax, Audit and Accounting Workflows\n- New Agentic AI-powered solutions support automated 1040 tax preparation with Ready to Review\n- Improved audit efficiencies with CoCounsel Document Analysis and Audit Intelligence Test\n- CoCounsel platform expansion includes authoritative content from AICPA, FASB, GASB and IFRS\nTORONTO, November 5, 2025 – Thomson Reuters (TSX/Nasdaq: TRI), a global content and technology company, today unveiled three new AI-powered solutions, and the expansion of authoritative content in its CoCounsel platform. These newest innovations from Thomson Reuters expand the company’s agentic AI capabilities to automate routine tasks, increase efficiency, and free professionals to focus on higher-value advisory work – reimagining how accounting professionals handle tax preparation, and audit engagements.\n“The accounting profession is at an inflection point, where AI is no longer just a productivity tool but a fundamental transformation in how work gets done,” said Elizabeth Beastrom, President of Tax and Accounting Professionals at Thomson Reuters. “Our agentic AI solutions are designed to cut down time-consuming tasks that have traditionally consumed so much of professionals' time, freeing them to provide the strategic advisory their clients need. Agentic AI reduces repetitive work so professionals can advise with speed and confidence. With CoCounsel now in use at over 1,300 firms, we’re building on that momentum to help the profession modernize and grow.”\nTransforming Tax Preparation with Agentic AI:\nContinuing its innovation in agentic AI, Thomson Reuters unveils Ready to Review, a cloud-based, advanced agentic AI tax workflow application. Built on the CoCounsel Tax, Audit and Accounting platform, this solution modernizes 1040 tax return preparation by using AI agents to process source documents and prior-year returns, extract and categorize data, and generate returns that are ready for professional review. Firms can handle higher volumes during peak season while maintaining accuracy and quality.\nIndiana-based CLH CPAs & Consultants had the opportunity to try Ready to Review and it offered transformative time savings for the firm. “Reducing return preparation time by approximately an hour on each simple 1040 is significant in terms of efficiency gains. For firms like ours, these time savings will be a game changer,” says Bob Lange, Partner at CLH.\nIn CoCounsel Tax, Audit and Accounting, Thomson Reuters today announced the expansion of the platform’s knowledge base to include rights to authoritative content from AICPA, FASB, GASB, and IFRS (including sustainability standards), integrating directly into CoCounsel's single AI guided workflow. The update builds on the Spring 2025 launch of the platform, which connected firm knowledge, Checkpoint, IRS code, and internal documents.\nCarson Chen, Senior Audit Manager at Sensiba, is a user of CoCounsel Audit and Accounting. “One of the most meaningful impacts of CoCounsel on our firm is to give us the real opportunity to embrace AI in a software responsible way,” he says. “The mindset around AI is just as important as the tool itself, and CoCounsel helps us to shift that mindset.”\nIntroducing New AI-powered Audit Solutions that Increase Efficiency and Accuracy:\nCoCounsel Document Analysis is the new AI-powered grid solution from Thomson Reuters. Deeply integrated with CoCounsel Audit, the solution combines agentic AI with a dynamic, spreadsheet-native grid, automating complex audit workflows at scale. The solution supports professionals to iterate, customize, and collaborate in real time – auditors will also be able to delegate client document review to this solution.\nThomson Reuters customers taking part in the early adopter program saw up to 70% faster preparation and workpaper review thanks to AI automation – cutting down manual effort and complexity and achieving significant time savings across document setup.\nAudit Intelligence Test is the newest addition to Thomson Reuters Audit Intelligence. Powered by AI, it automates the matching and documenting of samples to supporting evidence and quickly validates whether amounts were collected. By dynamically tracing accounting transactions to corresponding banking activity, firms can quickly confirm that recorded transactions have occurred, and document complex situations – such as matching a single customer payment to the multiple invoices it might cover.\nDeveloped in partnership with Valid8 Financial, Audit Intelligence Test brings Thomson Reuters customers technology traditionally used in transaction advisory, litigation support, forensic investigations and financial crime work. Now, this capability is available to auditors within an integrated workflow, helping teams standardize procedures, streamline evidence gathering, and improve documentation quality.\n“We built our technology to solve real problems auditors face every day – reducing the manual, time-consuming work of matching samples to evidence,” said Brett Suchor, CEO of Valid8 Financial. “Through our collaboration with Thomson Reuters, we’re delivering a faster, more reliable testing experience to audit professionals across the industry.”\nBrad Oberlander, Owner of Kentucky-based firm Oberlander Financial Services PLLC, said: “With Audit Intelligence Test, what used to take me two full days—around 16 hours—now takes just five to six hours per engagement. Organizing client materials and running tests is dramatically faster, allowing me to complete work in a fraction of the time. Using Test alongside Audit Intelligence Analyze significantly enhances audit sample selections and testing which boosts our efficiency even more.”\nThomson Reuters will this week unveil these products and more to over 1,600 customers during its Synergy 2025 Conference for Tax, Audit and Accounting Professionals. Attendees will experience the company’s new AI solutions firsthand at the event, which is taking place in Orlando, Florida between November 5 – 8, 2025.\nMore information about recent product launches and enhancements for Tax, Audit and Accounting can be found on the company's Innovation Blog.\n– ENDS –\nThomson Reuters\nThomson Reuters (TSX/Nasdaq: TRI) informs the way forward by bringing together the trusted content and technology that people and organizations need to make the right decisions. The company serves professionals across legal, tax, accounting, compliance, government, and media. Its products combine highly specialized software and insights to empower professionals with the data, intelligence, and solutions needed to make informed decisions, and to help institutions in their pursuit of justice, truth, and transparency. Reuters, part of Thomson Reuters, is a world leading provider of trusted journalism and news. For more information, visit tr.com.\nMEDIA CONTACT\nKirsty Bennett\nCommunications Director, Tax and Accounting Professionals\nkirsty.bennett@thomsonreuters.com\nNOTES TO EDITORS\nAvailability:\n- Ready to Review – Available now as part of an early adopter program in the United States. It will launch with general availability in the region in December 2025.\n- CoCounsel Document Analysis – Available now as part of an early adopter program in the United States. It will launch with general availability in the region in January 2026.\n- Audit Intelligence Test – Available now as part of an early adopter program in the United States. It will launch with general availability in the region in November 2025."
    },
    {
        "Ticker": "TRI",
        "Company": "Thomson Reuters",
        "Source_URL": "https://www.thomsonreuters.com/en/press-releases/2025/november/thomson-reuters-launches-onesource-plus-the-ai-powered-intelligent-compliance-network",
        "Content_Type": "Website Content",
        "Raw_Text": "November 5, 2025\nThomson Reuters launches ONESOURCE+, the AI-powered Intelligent Compliance Network\nTORONTO, ON – November 5, 2025 – Thomson Reuters (TSX/NASDAQ: TRI), a global content and technology company, today introduced ONESOURCE+. ONESOURCE+ is the only AI-powered Intelligent Compliance Network that brings together tax, trade, legal, and risk solutions to help enterprises drive efficiency, reduce risk, and unlock growth. Built as a scalable network—not a single platform—ONESOURCE+ connects data, content, and workflows through an open ecosystem to turn disconnected compliance activities into coordinated, outcome-driven operations for corporations worldwide.\n\"Thomson Reuters stands alone in delivering the only Intelligent Compliance Network connecting tax, trade, legal, and risk domains, powered by CoCounsel—our agentic AI built on deep expertise, trusted content, and proven technology across the compliance ecosystem. Navigating the intersection of commerce and compliance is a business imperative, and modern corporations are looking to AI to transform disconnected compliance functions into a competitive advantage,\" said Laura Clayton McDonnell, President, Corporates, Thomson Reuters. \"It's time to start treating compliance as a way to propel business forward. To address these needs, Thomson Reuters is unveiling ONESOURCE+ to deliver embedded, connected, and intelligent solutions that help corporations thrive in a complex, fast-moving environment.\"\nONESOURCE+ integrates specialized tools from Thomson Reuters for corporate tax, trade, legal, risk, and compliance professionals. It addresses the core challenge many businesses are having developing a collaborative view of their exposures to global tax, regulatory, legal, and supply chain risks, and provides a critical backbone to support AI-powered analytics and workflow management tools. According to the Thomson Reuters Future of Professionals Report, more than half of respondents said their organizations lack the required context to complete tasks that are part of cross-functional corporate governance and compliance workflows. Nearly half said they lacked a continuous, cross-functional view of data and insights and governance for workflows.\n“In today's complex landscape, businesses are facing an unprecedented confluence of forces: rapid digital transformation, the growing adoption of AI, and relentlessly evolving regulatory requirements,” added Clayton McDonnell. “While 80% of C-Suite leaders recognize cross-functional collaboration as critical to business success, these functions often remain isolated, leading to operational inefficiencies, heightened risk exposure, and missed strategic opportunities.”\nThomson Reuters is uniquely positioned to help businesses navigate this evolution toward more cross-functional efficiency. Its portfolio spans the industry’s leading tax, trade, legal, risk, and compliance solutions. By connecting these critical workflows in a single network, Thomson Reuters delivers a truly integrated, intelligent view that no single point solution provider can match.\nNew Product Innovations Fueling Intelligent Compliance :\nBuilding on its unparalleled expertise and AI-powered innovation, ONESOURCE+ offers key product updates designed to drive efficiency, reduce risk, and unlock growth. Key product highlights include:\n- ONESOURCE Sales and Use Tax AI harnesses agentic AI and end-to-end automation to eliminate manual processes, enabling companies to file accurate, signature-ready returns across thousands of jurisdictions, reduce audit risk, and save 40–60% in preparation time—empowering teams to focus on strategic business initiatives.\n- ONESOURCE Global Classification AI adds powerful AI to our proven Classification solution, transforming how global trade teams classify products. It delivers fast, accurate HS code suggestions and normalizes your product data into a single, unified product master. The AI engine continuously learns from your experts' decisions to improve over time, accelerates research with enriched regulatory content, and automatically produces transparent, audit ready rationales.\n- CoCounsel Legal combines advanced AI reasoning models, agentic workflows, and Deep Research capabilities with bedrock content and expertise in Westlaw and Practical Law – two engines that many Corporate Counsel rely on. Furthermore, Legal Tracker AI enables Legal Operations professionals to uncover efficiencies and cost savings through AI-audited, automated invoice review, the ability to answer key spend and matter questions instantly with a built-in AI chatbot, and full conversion of any invoice into the LEDES format.\n- CLEAR Investigate is a purpose-built AI assistant for investigators that transforms questions into comprehensive searches to simplify routine tasks and find hidden connections. It accelerates investigations with direct answers and complete source transparency while maintaining privacy, compliance, and audit trails within the ONESOURCE+ Intelligent Compliance Network.\nThese advancements, combined with the existing comprehensive suite of embedded, connected, and intelligent solutions from Thomson Reuters, reinforce the company's status as the definitive partner for businesses navigating the intricate intersection of commerce and compliance.\nThomson Reuters will showcase the power of Intelligent Compliance and ONESOURCE+ at its upcoming SYNERGY conference for corporate professionals November 9-12, with ongoing thought leadership and market awareness campaigns extending through 2026.\nThomson Reuters\nThomson Reuters (TSX/NASDAQ: TRI) informs the way forward by bringing together the trusted content and technology that people and organizations need to make the right decisions. The company serves professionals across legal, tax, accounting, compliance, government, and media. Its products combine highly specialized software and insights to empower professionals with the data, intelligence, and solutions needed to make informed decisions and help institutions pursue justice, truth, and transparency. Reuters, part of Thomson Reuters, is a world leading provider of trusted journalism and news. For more information, visit tr.com.\nMedia Contact:\nDenise Lam\nCorporate Communications\ndenise.lam@thomsonreuters.com"
    },
    {
        "Ticker": "TRI",
        "Company": "Thomson Reuters",
        "Source_URL": "https://www.thomsonreuters.com/en/about-us/board-of-directors",
        "Content_Type": "Website Content",
        "Raw_Text": "Board of directors\nDavid Thomson\nChairman, Thomson Reuters; Chairman, The Woodbridge Company Limited\nDavid is Chairman of Thomson Reuters. He is also a Chairman of Woodbridge, the Thomson family investment company, and Chairman of The Globe and Mail Inc., a Canadian media company. David is an active private investor with a focus on real estate and serves on the boards of several private companies.\nDavid has an MA from Cambridge University.\nSteve Hasker\nPresident and Chief Executive Officer\nSteve Hasker has been President and Chief Executive Officer and a director of Thomson Reuters since March 2020. Prior to joining Thomson Reuters in February 2020, he was Senior Adviser to TPG Capital, a private equity firm, from August 2019 to February 2020. Prior to that, he was Chief Executive Officer of CAA Global, a TPG Capital portfolio company, from January 2018 to August 2019. Steve served as Global President and Chief Operating Officer of Nielsen Holdings PLC from December 2015 to December 2017 and prior to that served as Nielsen’s President, Global Products from November 2009 to January 2014.\nSteve spent more than a decade with McKinsey & Company as a partner in the Global Media, Entertainment and Information practice from 1998 to 2009. Before joining McKinsey, Steve spent five years in several financial roles in the United States and other countries. Steve started his career with PwC, where he qualified as a chartered accountant. Steve has an undergraduate economics degree from the University of Melbourne and received an MBA and master’s in international affairs from Columbia University.\nSteve is also a non-executive director of Appen Limited and a member of the Australia and New Zealand Institute of Chartered Accountants.\nKirk E. Arnold\nExecutive-in-Residence, General Catalyst Ventures\nKirk E. Arnold is a Corporate Director. She was previously a chief executive officer of Data Intensity, LLC, a cloud-based data, applications, and analytics-managed service provider, from 2013 to 2017. Prior to that, Kirk was chief operating officer of Avid, a technology provider in the media industry, and chief executive officer and President of Keane, Inc., then a publicly traded global services provider. She has also held senior leadership roles at Computer Sciences Corp., Fidelity Investments, and IBM. In addition, Kirk was the founder and chief executive officer of NerveWire, a management consulting and systems integration provider. She is a non-executive director of Ingersoll Rand PLC and Trane Technologies. Kirk also serves on the boards of several private companies, including Housecall Pro and The Predictive Index. In addition, she is a senior lecturer at MIT Sloan School of Management and an advisor to the Center for MIT Entrepreneurship. Kirk received a bachelor’s degree from Dartmouth College.\nLaVerne H. Council\nChief Executive Officer, Emerald One, LLC\nLaVerne Council is the Chief Executive Officer of Emerald One, LLC, an information technology consulting company focused on helping businesses develop innovative methodologies for driving change and transformation. She was the national managing principal of Enterprise Technology Strategy and Innovation for Grant Thornton LLP from 2017 to 2019. She served as the senior vice president and general manager for MITRE Corporation in 2017. LaVerne was assistant secretary for the Office of Information & Technology and chief information officer for the United States Department of Veterans Affairs from 2015 to 2017. She was the chief executive officer of Council Advisory Services, LLC from 2012 through 2015. LaVerne has also held significant corporate leadership roles focused on supply chain, IT centralization, and integration. She served as the corporate vice president and global chief information officer for Johnson & Johnson from 2006 to 2011. Before that, she served in several roles of increasing responsibility at DELL, Inc. from 2000 to 2006, including as the global vice president of Information Technology, Global Business Solutions, and Development Services. She is also a non-executive director of CONMED Corporation and Concentrix Corporation. She received her Master of Business Administration from Illinois State University and her Bachelor of Business Administration in Computer Science from Western Illinois University. LaVerne also holds an honorary Doctor of Business Administration from Drexel University.\nMichael E. Daniels\nCorporate Director\nMichael E. Daniels is a Corporate Director. In 2013, Mike retired as senior vice president and group executive at IBM Services after 36 years with the company, where he directed IBM’s consulting, systems integration, application management, cloud computing, and outsourcing services around the globe. Mike also held a number of senior leadership positions in his career at IBM, including general manager of sales and distribution operations of the Americas, as well as leading global services in the Asia Pacific region. Mike has a bachelor’s degree in political science from Holy Cross College.\nMichael Friisdahl\nCorporate Director\nMichael Friisdahl is a corporate director. He was previously the Executive Chairman of Signature Aviation, a global network of private aviation terminals and services, from January 2022 until October 2023. Prior to that, he was the President and CEO of Maple Leaf Sports & Entertainment (MLSE), a diversified sports and entertainment company based in Toronto. Michael has also served as Chief Executive Officer of Air Canada Leisure Group, as Chief Executive Officer of Thomas Cook North America and on the Group Executive Board of Thomas Cook Group plc. He serves on the board of The Woodbridge Company Limited as lead independent director and also previously served as a non-executive director of Entertainment One Ltd. and SAS AB.\nKirk Koenigsbauer\nChief Operating Officer and Corporate Vice President, Microsoft\nKirk Koenigsbauer has been Chief Operating Officer and Corporate Vice President of the Experiences and Devices Group at Microsoft Corporation since February 2020. From December 2016 to February 2020, he was corporate vice president of Microsoft 365, and from July 2012 to November 2016, he was corporate vice president of Office Apps Engineering at Microsoft. From June 2002 to July 2012, he was corporate vice president of Office Product Management at Microsoft. Kirk worked at Amazon.com from 1998 to 2001, where he held the roles of general manager of Software & Video Games Stores and director of product management of Auctions. Kirk also worked at Microsoft from 1992 to 1998 and as a consultant at Accenture from 1989 to 1991. Kirk has a bachelor’s degree from Colby College.\nDeanna Oppenheimer\nFounder, CameoWorks\nDeanna Oppenheimer is the founder of CameoWorks, LLC, a global firm that advises leaders of early-stage companies and consultancies. Deanna founded CameoWorks in 2012. From 2005 to 2011, she served in a number of roles at Barclays PLC, first as chief executive of UK Retail and Business Banking and then as vice chair of Global Retail Banking. From 1985 to 2005, Deanna served in several positions at Washington Mutual, Inc., with her last role as president of Consumer Banking. She is also the non-executive chair of the board of directors of InterContinental Hotels Group PLC; a director of the King’s Trust UK, a royal charity; a non-executive director of Slalom; and the founder of BoardReady. Deanna received a Bachelor of Arts from the University of Puget Sound.\nSimon Paris\nChief Executive Officer, Unit4\nSimon Paris has been the Chief Executive Officer of Unit4, a company that provides enterprise cloud applications for organizations, since February 2025. Prior to that, he was chief executive officer of Finastra, a global financial technology (fintech) provider, from 2018 to January 2025. Simon joined Finastra (previously Misys) as president in 2015 and served as its chief sales officer before being appointed deputy CEO in 2017 and CEO in 2018. Simon previously worked at SAP from 2007 to 2015, where he held a number of senior leadership positions. Simon was also previously a senior consultant with McKinsey & Company. Simon has a Bachelor of Arts from the European Business School and a Master of Business Administration from INSEAD.\nKim M. Rivera\nChief Legal and Business Affairs Officer, OneTrust\nKim M. Rivera is the Chief Legal and Business Affairs Officer of One Trust, LLC — a privacy, security, and governance-management software company. She was a special advisor to the CEO of HP Inc. from February 2021 to December 2021. From January 2019 to January 2021, Kim was president of Strategy and Business Management and chief legal officer at HP Inc. As president of Strategy and Business Management, she led corporate strategy and development, customer support, indirect procurement, real estate, and workplace functions. In addition, Kim managed HP Inc.’s worldwide legal organization, including all aspects of legal and governmental affairs, brand security, compliance, and ethics. She served as chief legal officer and general counsel of HP Inc. from November 2015 to January 2019. Prior to joining HP Inc., Kim was the chief legal officer and corporate secretary for DaVita HealthCare Partners, where she was employed from 2010 to 2015. Before that, she served as the chief compliance officer and head of international legal services at The Clorox Company, as well as chief litigation counsel for Rockwell Automation and general counsel for its Automation Controls and Information Group. Kim has a bachelor’s degree from Duke University and a Juris Doctor from Harvard Law School.\nPaul Sagan\nCatalyst Advisor at General Catalyst\nPaul Sagan is a Catalyst Advisor at General Catalyst, a venture capital and private equity firm, which he joined in 2013 and became a Managing Director of in 2018. Prior to that, he was Chief Executive Officer of Akamai Technologies, Inc., a company that specializes in content delivery, cybersecurity, DDoS mitigation and cloud services. He has also served as a senior advisor to the World Economic Forum, a senior executive at Time Warner in online services and cable programming, and a news executive with CBS Inc. Paul has extensive experience as a director of public companies and is currently a director of Moderna, Inc. Paul has a B.S. from the Medill School of Journalism at Northwestern University.\nBarry Salzberg\nCorporate Director\nBarry served as the Global Chief Executive Officer of Deloitte Touche Tohmatsu Limited from 2011 until his retirement in 2015. He joined Deloitte in 1977 and his roles included Chief Executive Officer and Managing Partner of the firm’s U.S. operations. Barry has previously served as a board member of New Profit, Inc. and previously served as Chairman of the United Way Worldwide, Chairman of the board of College Summit and Chairman of the board of the YMCA of Greater New York, and as a director at Embark Intermediate Holdings, LLC. From July 2015 until June 2018, he was a Professor at Columbia Business School.\nBarry has a BS in Accounting from Brooklyn College, a JD from Brooklyn Law School, and an LLM in Taxation from the New York University School of Law.\nPeter J. Thomson\nChairman, The Woodbridge Company Limited\nPeter is a Chairman of Woodbridge, the Thomson family investment company. He is an active private equity investor and serves on the boards of several private companies.\nPeter has a BA from the University of Western Ontario.\nBeth Wilson\nCorporate Director\nBeth Wilson has been chair of the Chartered Professional Accountants of Canada since October 2023. Prior to that, she was the vice-chair of the Chartered Professional Accountants of Canada from October 2021 to October 2023. She is the former chief executive officer of Dentons Canada LLP and was a member of the global leadership team, serving on the Global Board and Global Management Committee from July 2017 to January 2022. Before this role, Beth was an audit partner at KPMG from 2000 to 2016 and served as a managing partner at KPMG in the Greater Toronto Area from 2009 to 2016. Between 2005 and 2016, she also served as a member of KPMG’s Management Committee in various leadership positions, including Canadian Managing Partner Community Leadership, Canadian Managing Partner Regions and Enterprise — with responsibility for 24 regional offices across Canada — and chief human resources officer. Beth is currently a director at Traferox Technologies Inc., Woodgreen Foundation, and Woodgreen Community Services and a trustee of Hospital for SickKids. She is also a non-executive director at IGM Financial Inc. and Power Corporation of Canada. Beth has a BComm from the University of Toronto and is a CPA."
    },
    {
        "Ticker": "TRI",
        "Company": "Thomson Reuters",
        "Source_URL": "https://www.thomsonreuters.com/en/about-us/executive-team",
        "Content_Type": "Website Content",
        "Raw_Text": "Thomson Reuters\nExecutive team\nCorporate Leaders\nSteve Hasker\nPresident and Chief Executive Officer\nSteve assumed his role of President and Chief Executive Officer and a director of Thomson Reuters effective March 15, 2020. Previously, Steve served as Senior Adviser to TPG Capital, a private equity firm, Chief Executive Officer of CAA Global, a TPG Capital portfolio company, and global president and chief operating officer of Nielsen, an information, data and measurement firm. Steve spent more than a decade with McKinsey as a partner in the global media, information and technology practice. Before joining McKinsey, Steve spent five years in several financial roles in the United States, Russia and Australia.\nSteve started his career with PwC, where he qualified as a chartered accountant. He then received an MBA and master’s degree in international affairs from Columbia University. He grew up in Australia and during his career he has lived and worked across North America, Europe and Asia. Steve is also a non-executive director of Appen Limited and a member of the Australia and New Zealand Institute of Chartered Accountants.\nMichael Eastwood\nChief Financial Officer\nMichael Eastwood is Chief Financial Officer for Thomson Reuters, based in Toronto.\nMichael joined Thomson in 1998 and has had several senior finance roles, including Senior Vice President and Head of Corporate Finance since January 2016. Prior to that, he was Chief Operations Officer for Thomson Reuters Latin America from April 2014 to December 2015. Michael was also previously Chief Financial Officer of the company’s Intellectual Property & Science business, which was sold in 2016. Prior to joining Thomson, he held various finance and accounting roles at Fleer/SkyBox International and PwC.\nMichael received a BSA in Accounting from East Carolina University and an MBA from the University of North Carolina.\nNorie Campbell\nChief Legal Officer and Company Secretary\nNorie Campbell joined Thomson Reuters in 2023 as the company’s Chief Legal Officer and Company Secretary.\nPrior to joining Thomson Reuters, Norie held a number of executive-level roles at TD Bank Group, including serving as General Counsel for a decade. Her achievements there included leading the legal team that was recognized as Canada Law Department of the Year 2021, as well as being recognized for her leadership by Catalyst Canada and the Women’s Executive Network (WXN) Top 100 Most Powerful Women in Canada.\nNorie is a Board Director for Toronto Metropolitan University and the Rideau Hall Foundation. She is also actively involved in United Way and has served as the Campaign Chair of Major Individual Giving for the United Way Greater Toronto Campaign Cabinet.\nShe received her Bachelor of Laws and Master of Laws degrees from Osgoode Hall Law School.\nKirsty Roth\nChief Operations and Technology Officer\nAs Chief Operations and Technology Officer, Kirsty oversees Thomson Reuters drive for a superior customer and employee experience, leveraging the company’s operations, technology, procurement and real estate teams.\nPrior to joining Thomson Reuters, Kirsty was Global Head of Operations at HSBC, where she led a transformation of the bank's technology, processes and innovation capability, including developing industry-first machine learning solutions for payment screening and scaling robotics to speed up customer processes and improve sustainability. She has also held roles at Credit Suisse, driving change across Finance, Technology and Operations, and at Deloitte as a consulting partner.\nA strong advocate for diversity, Kirsty was named among the Financial Times top 50 HERoes for Women in 2017 and Financial News 100 most influential women in Finance in 2019.\nShe began her career in technology with HBOS plc in the U.K. after graduating with a bachelor’s degree in Chemistry from the University of Bristol.\nKirsty lives with her husband and two daughters in Switzerland, where she likes to spend most of her weekends outdoors on the mountain, or on the water.\nMary Alice Vuicic\nChief People Officer\nMary Alice joined Thomson Reuters in November 2017 and leads both the Human Resources and Communications functions.\nShe has over 20 years of experience working in senior human resources positions at leading international organizations. Previously, she served as the Chief Human Resources Officer for L Brands, a portfolio of retail brands with nearly 90,000 associates. She has also held senior roles at Loblaw Companies Ltd., Shoppers Drug Mart, Walmart Canada, and Chapters/Indigo.\nMary Alice is a Director on the board of the Business Development Bank of Canada where she chairs the Human Resources committee.\nShe has a BA degree from the University of Windsor and an Advanced Human Resources certificate from the University of Toronto, and has completed Harvard Business School’s Advanced Management Program.\nDavid Wong\nChief Product Officer\nDavid leads the product management, editorial, content and digital teams at Thomson Reuters. In this role, he oversees product strategy and delivery for the company’s Legal, Tax & Accounting, Corporate and Government customers.\nDavid has nearly 10 years of experience building business-to-business software and information services. Previously, he served as a senior product leader at Facebook, where he was responsible for building products for marketers to measure the effectiveness of their investments in Facebook’s ads and business products. He has also held senior roles at Nielsen, as SVP of Product Leadership, leading their digital measurement business, and worked at McKinsey & Company as a management consultant.\nHe holds a degree in Engineering Science from the University of Toronto, where he specialized in applied physics and electrical engineering. He and his husband currently live in Toronto.\nTaneli Ruda\nChief Strategy Officer\nTaneli Ruda leads Strategy and Corporate Development at Thomson Reuters. In addition to setting the strategic direction for the company, he is responsible for acquisitions, divestitures, market and competitive intelligence, and the company’s venture fund.\nTaneli joined Thomson Reuters in 2010 where he has held several leadership positions, including Head of Strategy for the Tax & Accounting and Corporates units and General Manager of the Global Trade Management business. Previously, Taneli has served as Chief Strategy Officer at John Wiley & Sons, Vice President of Strategy Development at Nokia, and as a Management Consultant at the Boston Consulting Group.\nTaneli holds a MSc. in Computer Science and Doctorate in Electrical Engineering from Helsinki University of Technology of his native Finland. He is married and has two sons.\nDavid Carrel\nChief Marketing Officer\nAs the Chief Marketing Officer for Thomson Reuters, David is responsible for developing and implementing the marketing strategy to grow Thomson Reuters’ business globally and strengthen the Thomson Reuters brand.\nPrior to joining Thomson Reuters in July 2022, David was Vice President of Marketing at Adobe, Digital Experience Cloud, responsible for all Adobe Experience Cloud (AEC) products for demand generation, events & executive experiences, partner marketing, portfolio strategy, customer & retention marketing, and marketing analytics & operations.\nPrior to joining Adobe, David spent over 6 years at Amazon in multiple marketing and product roles, including Director of Global Growth & Demand for AWS, and as the Director of Global Prime Member Growth for Amazon Prime. Prior to Amazon, David held growth marketing roles at Digitas (part of Publicis) and at IBM. David started his career in start-ups and eCommerce. He holds a B.A. from the University of Michigan and an MBA in Marketing & Strategy from the University of Michigan’s Stephen M. Ross School of Business.\nDavid lives in Seattle, with his wife and three daughters.\nBusiness leaders\nPaul Bascobert\nPresident, Reuters\nPaul Bascobert joined Thomson Reuters as President of Reuters News in September 2022. In this role, he leads all aspects of the company’s media business and operations.\nBascobert has been an operating executive, adviser and entrepreneur for more than 25 years and has deep experience in transformation and growth in news, media and SaaS businesses.\nHe was previously co-founder and CEO of Blue Ocean Acquisition Corp – a special purpose acquisition company focused on media, marketplace and tech platform businesses; CEO of Gannett Co., Inc – one of the largest local media companies, which owns more than 700 daily and weekly publications in the U.S. and UK; President of American media and technology company XO Group; and President of Yodle Inc during the launch of the SaaS marketing platform.\nPrior to this, Bascobert was President of Bloomberg Businessweek and Head of Business Operations for the newly created Bloomberg Media Group, as well as Senior Vice President of Operations and then Chief Marketing Officer at Dow Jones.\nPaul has a degree in electrical engineering from Kettering University and an M.B.A. in Finance from the Wharton School of the University of Pennsylvania and is a member of the Council on Foreign Relations.\nElizabeth Beastrom\nPresident, Tax & Accounting Professionals\nElizabeth is President of Tax & Accounting Professionals. She oversees the company’s full range tax and accounting software, services, and knowledge solutions for accounting firms of all sizes.\nPrior to her current role, Elizabeth served as President of Thomson Reuters Global Print business and Managing Director of FindLaw and Elite after serving in several management positions across the organization. She joined the company in 2004, following senior leadership roles in finance at Honeywell, Valspar and Deloitte.\nShe has a bachelor’s degree in accounting from the University of Minnesota Carlson School of Management and is a CPA.\nLaura A. Clayton McDonnell\nPresident, Corporates\nLaura A. Clayton McDonnell is the President of the Corporates business segment at Thomson Reuters, focused on customer and cultural transformation, driving positive results, growing market share, and developing high performance teams. She has extensive sales management and legal experience and has held executive-level positions at leading companies in the high technology industry including ServiceNow; Microsoft; Aspect Software; IBM; Rational Software; and various senior sales and legal roles at Sun Microsystems, Cisco and Apple. Prior to making the jump to corporate America, Laura was in private corporate and securities law practice.\nLaura has been honored many times for her work including as the 2022 Top 100 Global Sales Leader, sponsored by The Modern Sale and Collective[i]; and as a recipient of the 2008 YWCA Silicon Valley Tribute to Women Award. She is an avid champion of women and is a a member of the Advisory Council of the Center for Equity, Gender and Leadership, University of California at Berkeley and is a member of the Women’s Forum of New York. Laura sits on many boards including as a Board Member at Zuora, Inc. (NYSE: ZUO), the leading cloud-based subscription management platform provider; a Board Member of the private company board of Signal AI, the leading external intelligence company.\nLaura received a Bachelor of Science degree “with distinction” from San Jose State University, and a JD-MBA joint degree, from the University of California, at Berkeley. Laura is licensed to practice law in the District of Columbia and the State of California.\nRagunath (Raghu) Ramanathan\nPresident, Legal Professionals\nRagunath (Raghu) Ramanathan joined Thomson Reuters as President of the Legal Professionals business on February 1, 2024. Previously, Raghu was the Chief Revenue Officer of SAP Business Technology Platform where he drove business growth and customer success in data and analytics, artificial intelligence, application development, automation, and integration solutions.\nWith more than 25 years of experience, Raghu is a recognized business leader in how technology can benefit consumers and businesses. He has a proven track record for introducing innovative commercial models that drive adoption and growth, as well as maintaining a strong reputation for building deep understanding of customer needs. He has lived and worked in 14 countries and across seven industries in roles at SAP, Barclays Group, Bluesoft Inc., and McKinsey & Company.\nRaghu holds a bachelor’s degree in engineering from Coimbatore Institute of Technology in India and an MBA from the Indian Institute of Management in Ahmedabad.\nAlessandra Galloni\nEditor-in-Chief, Reuters\nAlessandra Galloni became editor-in-chief of Reuters in April 2021. She oversees all editorial functions across video, text, pictures, and graphics. She is the first female editor-in-chief in the organization’s 170-year history.\nPreviously, Galloni was global managing editor, overseeing news planning and creation, where she was responsible for overseeing the global dimensions of Reuters coverage and developing stories with a cross-regional focus. She first joined Reuters in 1996 for the Italian-language news service in Rome, later moving to the equities reporting team in London. She re-joined Reuters in September 2013 as editor of the Southern Europe bureau following 13 years at the Wall Street Journal, where she worked as a reporter, economics and business writer and editor, in London, Paris and Rome.\nGalloni is the recipient of the 2020 Lawrence Minard Editor Award from the Gerald Loeb Foundation and the UCLA Anderson School of Management, one of the highest honors a business journalist can receive. She is also the recipient of an Overseas Press Club Award and a UK Business Journalist of the Year Award.\nGalloni is co-author of “From the End of the Earth to Rome,” an e-book on Pope Francis. An Italian national, she is a graduate of Harvard University and has a Master’s degree from the London School of Economics.\nJennifer Prescott\nPresident, Global Print\nJennifer is the President of the Global Print segment, which is a leading provider of critical information, primarily in print format, to legal and tax professionals, government (including federal, state, and local government lawyers and judges), law schools, and corporations.\nJennifer has held several leadership positions on various teams at Thomson Reuters including Reference Staff Attorneys, Client Management and Sales. She is an experienced leader with success in driving organizational growth and designing and implementing creative solutions to changing business needs.\nJennifer holds a Bachelor of Arts from Saint Mary’s College in Notre Dame, Indiana and holds a Juris Doctor from Western Michigan University Thomas M. Cooley Law School in Lansing, Michigan.\nSteve Rubley\nPresident, Government\nSteve leads Thomson Reuters portfolio of business across U.S. Federal, State and Local Government customers. In this role, he is responsible for the company’s strategic direction and execution of new growth initiatives in the Government sector. In addition, Steve is CEO of TRSS, LLC, a U.S. subsidiary of Thomson Reuters.\nPrior to joining Thomson Reuters in 2008, Steve was Vice President and General Manager of the ChoicePoint Government Services division for ChoicePoint, Inc.\nHe has served as an advisory board member of the Homeland Security Philanthropic Council and the Business Executives for National Security (BENS). Previously, he served as a board member with both the Federation for Identity and Cross-Credentialing Systems (FiXs) and the National Coalition for the Prevention of Economic Crime.\nSteve graduated from Denison University and holds an MBA from George Washington University.\nAdrian Fognini\nHead of International\nAs the Head of International since April 2024, Adrian oversees Thomson Reuters operations in Latin America, Canada and Asia and Emerging Markets (EMEA), driving strategic growth, team development and business acceleration across our portfolio.\nWith over 20 years of leadership experience, Adrian has held roles such as General Manager, Vice President, Chief Operating Officer, and Managing Director, overseeing operations in countries including Argentina, Brazil, Chile, and Spain, as well as regions like Ibero-America and Latin America. He has been instrumental in driving growth and innovation in fast-evolving markets and fostering high performance teams across different regions, languages and cultures.\nAdrián holds a 'Cum Laude' Certified Public Accountant from the Universidad de Buenos Aires and an MBA from Universidad de San Andrés."
    },
    {
        "Ticker": "TRI",
        "Company": "Thomson Reuters",
        "Source_URL": "https://www.thomsonreuters.com/en-us/posts/our-purpose/inside-thomson-reuters-a-conversation-with-our-chief-talent-officer/",
        "Content_Type": "Website Content",
        "Raw_Text": "The world of work continues transforming at an unprecedented pace, and few companies are as uniquely positioned to navigate this as Thomson Reuters (TR). We sat down with Jason Williams, our Chief Talent Officer, to discuss what makes this an optimal moment for anyone contemplating their next career move and why they should consider Thomson Reuters. With seven years at Thomson Reuters, Jason has been part of our evolution into an AI technology organization and knows what it takes to succeed here.\nWhy did you choose Thomson Reuters, and can you tell us about your journey here?\nI joined Thomson Reuters seven years ago, right at the cusp of our transformation into an AI technology organization. I thought it was a cool opportunity and a unique time to join because you don’t often get a chance to be part of something that’s more than 150 years old but also going through a massive evolution at the same time. Combining those two things seemed like there would be a chance to do unique and interesting work and have influence on a scale you wouldn’t get at many companies. This has been my experience over the past seven years.\nAs a global organization spanning 70 countries, what are some of the top hiring areas for this year and beyond?\nWe’re in a very exciting space that will continue to offer many opportunities, especially for the skills that are going to define the path forward. This is what makes us a great place to be right now.\nWe continue to build deep expertise across several areas at the forefront of AI, including Data Scientists, Engineers, Product Leaders, in addition to the deep subject matter experts that power our content. That expertise and knowledge are what differentiate Thomson Reuters and make our products market leading.\nWe also continue to build our sales and customer success teams. Customer success has been a big focus for us this year because we know that with a lot of new technology, our customers need support to get the most out of these fantastic tools.\nWhat unique career growth opportunities exist that candidates might not find elsewhere?\nOne of the great parts about my job is that I get to meet a lot of people, both internally and externally. One thing I hear consistently is people saying they want to join or stay at Thomson Reuters because they ‘get to do AI for real’. I hear those words a lot. I think it’s really exciting.\nEverybody is talking about AI or has some idea of what it is in 2025. But at Thomson Reuters, we’ve been building products with AI for 30+ years and making a real difference for our customers and their customers as a result. That’s probably been the most prominent message so far this year, that idea that if you work at Thomson Reuters, you get to do AI for real.\nWhat are some of the key skills Thomson Reuters looks for in candidates overall?\nWe’re focused on a growth mindset and are looking for people who are passionate about tech and are energized about what could be, rather than intimidated by change. But most importantly, new colleagues who are excited to help our customers grow and solve complex problems.\nThe second one is adaptability. Gen AI is having an impact on all of our lives personally and professionally. The pace of change is coming very quickly and continues to speed up. It’s about being able to show adaptability and a willingness to learn in different ways, re-evaluate how work is done, and engage with colleagues and technology in a more integrated way. Not just the willingness to want to do it, but the ability to learn, take risks, and navigate the unknown.\nHow does Thomson Reuters support continuous learning, especially given the rapid pace of AI advancement? And how are you preparing your non-technical workforce for a future where AI plays a key role in daily operations?\nFocusing on a skills-first approach to career development is a priority for us. This year, we’ve dedicated three special days to company-wide global learning, which is a chance to set aside your normal working day to engage and build some new skills.\nWe’ve also introduced a new curriculum in Q3 for all of our directors and managers, our biggest base of people leaders. Thousands of people will be going through this new curriculum focused on leading and coaching through change.\nAnother great example of learning at TR is that all of our colleagues have access to tools like Open Arena, our secure, internal “sandbox where colleagues can experiment with AI across a range of LLMs.” It’s available to all employees, and thousands of our people use it every day. It’s super cool that we have this technology at our fingertips with such amazing companywide adoption.\nWhy do you think it’s an exciting time to join Thomson Reuters?\nI think we’ve got a lot to be proud of, but the market is changing super quickly around us. We have very real competition that we’re facing. If you’re somebody who wants to work for a technology organization focused on transformative AI projects with clear ethical guidelines, transparency, and responsible AI governance – Thomson Reuters is the place for you.\nWe’ve got the momentum of an early start, but there’s still so much more in front of us. We’re not just launching products, our vision and strategy is to enable our customers to delegate complex work, reduce manual tasks, and focus their expertise where it matters most. If you are motivated by meaningful work, that will shape the future of both AI and professional work – we’d love to hear from you. If you are looking for a values-based culture focused on skill development and the opportunity to work with smart, ambitious teammates – it’s a great time to be here at Thomson Reuters.\nInterested in a career at Thomson Reuters?\n- Learn more about our employer story in our digital magazine\n- Check out our career site to explore our 500+ open roles\n- Follow us on LinkedIn for the latest news, updates, and stories"
    },
    {
        "Ticker": "TRI",
        "Company": "Thomson Reuters",
        "Source_URL": "https://www.thomsonreuters.com/en/about-us/social-impact/social-impact-and-esg-report-2024",
        "Content_Type": "Website Content",
        "Raw_Text": "Social Impact and ESG Report 2024 Learn how Thomson Reuters is progressing on key environmental, social, and governance (ESG) activities and advancing justice, truth, and transparency\n- Making a positive impact in the world\n- 1. 2024 at a glance\n- 2. Trust Principles\n- 3. Environmental, social, and governance update\n- 4. Artificial intelligence\n- 5. Justice, truth, and transparency\n- 6. Sustainable future\n- 7. Advancing our workforce\n- 8. Community impact\n- 9. Thomson Reuters Institute\n- 10. Thomson Reuters Foundation\n- 11. Appendix\nAt Thomson Reuters, our purpose is to inform the way forward to a more understanding, trusting world by helping our customers pursue justice, truth, and transparency. We do that while supporting our more than 26,000 global employees in their personal and professional fulfillment and their ability to be contributing members of their communities. We recognize our impact extends far beyond creating new products or increasing sales.\nOur Social Impact and ESG Report for 2024 highlights our progress on key initiatives and celebrates meaningful accomplishments. The report brings to life examples of the powerful impact we’re making globally.\nWe measure our social impact by the positive change our people create through their actions and decisions. To make good on that commitment to our customers, colleagues, and communities, we help uphold the rule of law, turn the wheels of commerce, and catch bad actors.\nWe continuously identify opportunities that align with our purpose and challenge ourselves to improve. Our impact, while quantifiable, is best experienced by the values we champion and the culture we nurture.\nFor example, for more than a decade, we have been deeply involved in efforts to combat human trafficking. In this fight, we leverage partnerships, awareness campaigns, and technology. In 2024, the Thomson Reuters Institute launched the Human Rights Crimes Resource Center to provide invaluable resources for risk and compliance professionals, helping to root out human trafficking in global supply chains. Related efforts include our continued support for the National Center for Missing & Exploited Children with our annual Everyday Heroes Award to recognize the Center’s public service professionals and their critical work to solve some of the most pressing challenges facing their communities.\nWe are a content-driven technology company, and we aspire to be at the forefront of innovation, driven by leading technologies like AI. With the launch of version 2.0 of our generative AI (GenAI) legal tool, CoCounsel, we combined our data, expertise, and trusted content with advanced technology. Partnering with leading large-language model (LLM) providers, we have delivered even more for our customers, enabling them to accomplish what they need to evolve their businesses more quickly and effectively than ever.\nWe’re committed to AI innovations and education initiatives supporting the pursuit of justice, truth, and transparency. In 2024, Thomson Reuters launched the AI for Justice legal aid program, which offers a Legal Innovators Incubator that provides free CoCounsel access to legal nonprofit organizations. Moreover, we prioritize balancing innovation and ethics, including data privacy and trusted customer experience. We also publicly pledged that our customers’ confidential data will not become an output for a third party — and we urged our peers to do the same.\nAdditionally, in 2024, the Thomson Reuters Institute teamed up with the National Center for State Courts (NCSC). This nonprofit organization focuses on improving the administration of justice in the United States and around the world, and together they launched a strategic AI partnership known as the Thomson Reuters Institute and National Center for State Courts AI Policy Consortium for Law and Courts. This joint initiative informs and educates the judiciary about the opportunities and challenges of evolving AI and GenAI solutions, thereby enabling legal professionals to make informed decisions about adoption and use.\nJust as AI is redefining the work of the professionals we serve, new AI tools are also transforming how our colleagues work. Through our annual AI in action challenge, employees from across Thomson Reuters submitted videos highlighting some of the creative ways they’re using AI in their jobs. Winning examples included using Thomson Reuters Open Arena solution as an everyday companion that helps analyze data, refine formulas, and inform monthly reviews.\nIn our continued commitment to purpose and social impact, this report spotlights the growth of our employee pro bono initiatives and volunteer projects. Employees logged more than 51,000 volunteer hours in 2024, benefiting more than 2,300 charitable organizations.\nFinally, as signatories to the United Nations Global Compact, we reaffirm our commitment to responsible business practices on human rights, labor, environment, and anti-corruption across our global operations.\n“I am energized by the work we do every day, and the positive impact we’re purposefully making in the societies we live and work. I’d like to thank our colleagues, customers, and partners who make this possible. I hope you enjoy reading this report and that it inspires you to continue to make a meaningful impact on society.”\nSteve Hasker\nPresident and Chief Executive Officer, Thomson Reuters\nChapter One\n2024 at a glance\nBest Workplaces in Technology 2024, Great Place to Work\nWe sourced 100% renewable energy for all global operations1\n$29M globally facilitated by the Thomson Reuters Foundation’s pro bono legal service TrustLaw in free legal assistance on over 750 projects for non-government organizations (NGOs) and social enterprises2\nEmployees logged over 51,000 volunteer hours, benefiting more than 2,300 charitable organizations\nOver $2.3M donated by the Social Impact Institute through grants and charitable giving\nOver 4,800 employees made an impact in 36 countries through donations and volunteerism\nFor a complete list of awards, please visit Thomson Reuters Awards and Recognitions.\n1 Sourced largely through the use of Renewable Energy Credits.\n2 Pro bono valuation estimated using fees and hours data collected by the Thomson Reuters Foundation from pro bono legal teams.\nOur values\nAt Thomson Reuters, we are committed to solving big challenges for our customers and supporting skill-building for colleagues to thrive in an AI-enabled future. In 2025, we introduced new company values rooted in our purpose to inform the way forward and the Thomson Reuters Trust Principles. These values elevate us to a higher standard of customer excellence, product innovation, teamwork, and success.\nObsess over our customers\nWe put customers' goals, needs, and challenges ahead of our own. We constantly innovate to ensure our customers help their clients succeed. We prioritize investments that drive customer value.\nCompete to win\nWe are relentless about ensuring our solutions are superior to our competitors. We accomplish more by being tenacious, agile, and resourceful.\nChallenge (y)our thinking\nThe best ideas win at Thomson Reuters. We listen and challenge each other, offering alternative viewpoints with facts, candor, and clarity. We have the courage to disrupt the market and ourselves.\nAct fast, learn fast\nWe iterate in days — not weeks or months. We are willing to risk fast failure and we quickly learn from our mistakes. We are decisive and commit to decisions, turning them into actions.\nStronger together\nWe value our global team of talented people who are great at what they do, and even better when working together. We have very high expectations for performance while also caring for each other. We face all challenges with humility, accountability, and ownership.\nChapter Two\nTrust Principles\nWe are dedicated to upholding the Trust Principles and preserving our independence, integrity, and freedom from bias in gathering and disseminating information and news.\nWe are obliged and committed to applying the Trust Principles to our operations. The charter documents of Thomson Reuters Corporation include provisions to safeguard the Trust Principles as they apply to the business.\nThe Trust Principles are:\n- Reuters shall at no time pass into the hands of any one interest, group, or faction.\n- The integrity, independence, and freedom from bias of Thomson Reuters shall at all times be fully preserved.\n- Reuters shall supply unbiased and reliable news services to newspapers, news agencies, broadcasters, and other media subscribers, as well as to businesses, governments, institutions, individuals, and others with whom Reuters has or may have contracts.\n- Thomson Reuters shall pay due regard to the many interests it serves in addition to those of the media.\n- No effort shall be spared to expand, develop, and adapt the news and other services and products of Thomson Reuters so as to maintain its leading position in the international news and information business.\nChapter Three\nEnvironmental, social, and governance update\nOur board and its committees are responsible for overseeing environmental, social, and governance (ESG) initiatives. The Corporate Governance Committee of the board of directors reviews our ESG strategy and progress, receiving quarterly updates from our management team. Management is tasked with informing the board and its committees about ESG topics and evaluating related risks, such as sustainability and climate risks, human rights, human capital management, inclusion and belonging, and social impact. We are dedicated to our values and ethics through our governance practices, including our Code of Business Conduct and Ethics. We focus on long-term business management and view programs that enhance ESG to achieve sustained value creation, ensuring the ongoing health of our company now and into the future.\nOur values\nOur Trust Principles and Code of Business Conduct and Ethics reflect our ethical values as an organization and our approach to doing business. It explains who Thomson Reuters is and what we stand for, and it reinforces what our partners, colleagues, and customers have always known — trust matters.\nResponsible innovation\nIn 2024, Thomson Reuters established the Product Compliance and Responsible AI Hub to create a holistic and unified framework to navigate compliance requirements and mature our AI governance program. The framework promotes responsible product innovation, ensuring that proofs of concept, product builds, and internal use cases are legally and ethically sound. It is anchored on a risk evaluation process that includes assessments by Thomson Reuters compliance and governance experts for mandated compliance actions. In 2024, over 330 use cases were assessed with mitigation plans in place.\nThe Product Compliance and Responsible AI Hub provides significant benefits to product management, technology, security, privacy, accessibility, and compliance functions. For use case owners, it reduces uncertainty in navigating compliance processes. For compliance functions, it increases visibility into internal capabilities development and product roadmaps, enabling early identification and management of potential risks.\nIn 2025, we will continue to mature the framework in response to the evolving regulations and governance landscape. We are also enhancing workflow efficiency, positioning the Product Compliance and Responsible AI Hub as the one-stop shop for supporting tech and non-tech AI governance and product compliance at Thomson Reuters.\nOperationalizing trust\nWe have implemented a range of security policies, standards, technology, and practices, which are integrated in our overall enterprise risk management framework. We have a global team of certified security and privacy subject matter experts dedicated to the security of Thomson Reuters products and services. This extended team is committed to our Information Security Risk Management (ISRM) Program, which is endorsed by the Thomson Reuters Executive Team. Our program and practices are aligned to the National Institute of Standards and Technology (NIST) Cybersecurity Framework (CSF) and are achieved through the application of policies, standards, and security controls at a level appropriate to the service provided and communicating appropriate security protocols to application owners and technology teams across the business to support secure product development and a secure operating environment. These processes help us focus on the confidentiality, integrity and availability of customer data that we store, process, or transmit.\nWe continue to enhance our offerings and participate in industry and government forums and groups demonstrating our proactive approach to understanding and mitigating the threats we encounter while providing robust applications and services to our customers.\nThomson Reuters has an internal policy governance process in place and the ISRM team manages a set of information security policies and standards which outline information security and risk management principles that apply to our people, processes, and technology practices. Additionally, we are focused on continuous improvement. We regularly review and adapt our policies and standards to address changes to our products and services, evolving threats, regulatory changes, and our customers’ information security expectations.\nOur Board of Directors is responsible for overseeing the company’s system of identifying the principal risks facing Thomson Reuters and ensuring that appropriate procedures and systems are in place to monitor, mitigate, and manage those risks. The Board of Directors, through its committees, periodically receives reports from or meets with members of management to discuss material enterprise risks, including cybersecurity risk.\nIn 2024, we declared our investment to secure the Federal Risk and Authorization Management Program (FedRAMP) authorization, which is a government-wide program promoting the adoption of secure cloud services across the federal government by providing a standardized approach to security assessment, authorization, and continuous monitoring for cloud products and services. By harmonizing our operations with FedRAMP's detailed protocol for security evaluation, approval, and ongoing oversight, we're taking a proactive approach to address the complexities of the current digital environment. More recently, Westlaw Precision and Edge AI solutions received ISO/IEC 42001:2023 certification, a globally recognized standard for AI management systems.\nOur Trust Center continues to serve as the primary gateway where customers can learn about our security standards, our approach to information security, data privacy, and more. In line with our commitment to transparency, we have made public our framework for governing how we access and utilize certain data, our detailed approaches to cyber threats, and standards for employee training.\nWe hosted a special three-day event called SecureFest, which featured informational sessions, workshops, and simulations designed to help attendees learn how to spot cyber threats. In addition, Thomson Reuters employees, including contractors with access to our systems, are required to complete an annual, mandatory Thomson Reuters information security and privacy course. The security awareness team also conducts regular enterprise-wide phishing simulation exercises for all employees and contractors We design phishing campaigns to increase secure behaviors within the organization. We also deliver specialized training to specific groups of employees, as needed.\nTrusted AI\nThe most significant AI investment we will make is ensuring we build our technology responsibly. This is not just an industry issue, but a societal imperative. Before we can trust computer-generated guidance, ethical or otherwise, people need to know how an AI system arrives at its conclusions and recommendations and feel confident that the results are explainable. Transparency and data source are key.\nWe have been leading the way in developing standards for responsible AI that will both guide future technology development and safeguard end-users. Our detailed Data and AI Ethical Principles outline the specific priorities governing our development of AI-enabled technologies, and our Ethics Advisory Committee ensures we identify and mitigate the ethical risks of AI products before we develop them in-house or purchase them from third-party vendors.\nThe Responsible AI and Data Trust team’s core function is to engage the company to uplift capabilities in data and model stewardship, AI governance, ethical AI practices, and AI risk management. They accomplish this through policies and standards, derived templates, governance-related tasks, and guidance and training materials. Defining clear accountability structures helps embed the responsible use of data and AI models in existing processes and lifecycles. Training is made available for employees supporting data governance, responsible AI, and data and model ethics. The goal is for employees supporting the design, development, and deployment of AI solutions to have access to educational resources to help ensure that the use of data and AI by Thomson Reuters is informed and guided by the Data and AI Ethics Principles.\nOur use of LLMs is governed by our principles, frameworks, policies, and standards. We maintain governance policies and standards designed to minimize the use of sensitive data in AI models, with escalated reviews by our Model Ethics Committee within Thomson Reuters that evaluates the use of sensitive data within an LLM. We have also built an internal LLM and AI solution for internal utilization and are actively driving employees to use the internal application for product development.\nMoreover, in 2024, we made a commitment to all current and potential customers that their confidential information would not become output for a third party, meaning that we won’t allow a customer’s data to be used to train a third-party LLM. Since it’s our collective duty to help ensure that this powerful technology — with its potential impact on nearly all facets of society, culture, and the economy — is developed and used responsibly, we further called on other companies to make this same commitment.\nAlignment to international frameworks\nThis report highlights our efforts to secure a sustainable future for our business, our employees, and the communities where we operate. However, it's essential to recognize that we are not on this journey alone. Since 2018, we have been signatories of the United Nations Global Compact (UNGC), joining a community of over 25,000 companies worldwide committed to its Ten Principles. These principles emphasize responsible business practices concerning human rights, labor, the environment, and anti-corruption in our global operations.\nAdvancing ESG and human rights initiatives: 2024 materiality and impact assessments\nWe’ve continued to update our ESG materiality assessment to comply with new global regulations. This assessment helps us identify and prioritize the ESG issues that are most likely to impact our business and stakeholders in the short and long term. Furthermore, we are examining how these material ESG topics affect our business and create or erode enterprise value and how material ESG risks and opportunities in our business could positively or negatively impact people, economies, and the environment.\nWe also completed our first three-year human rights impact assessment (HRIA) and roadmap in 2024. This assessment examined potential impacts on relevant stakeholder groups and helped us identify salient human rights risks, which were then mapped against the expectations of the United Nations Guiding Principles on Business and Human Rights (UNGPs). Finally, in March 2023, we released our human rights policy. It informs our colleagues, customers, shareholders, and those in the communities where we operate and do business of our commitment and approach to human rights.\nOur ongoing commitment to respecting human rights throughout our operations guides our work. The recommendations from our comprehensive ESG double materiality assessment help us identify, assess, and proactively respond to salient and material risks across our enterprise.\nChapter Four\nArtificial intelligence\nArtificial intelligence plays a critical role at Thomson Reuters. It remains crucial for business transformation, providing advanced data analysis, process automation, and improved decision-making. In a competitive market, using AI is essential for sustainable growth, enabling businesses to handle complexities efficiently. We continued our commitment to this technology by offering enhanced AI education initiatives for customers and employees, hosting challenges and hackathons, and integrating GenAI into our flagship solutions. In addition, employees utilized AI tools to improve speed and accuracy for coding, drafting communications, and generating responses, saving time for customers and agents.\nAI in action\nIt’s one thing to be a world leader in developing breakthrough AI solutions, transforming the way legal, tax and accounting, risk and compliance, and news and media professionals work every day. It is another thing to transform our own ways of working, too. As AI has quickly evolved from a novelty to a much-valued tool, and as professionals in the industries we serve have started finding new ways to unlock value from the technology, our employees have helped pioneer some important new AI use cases.\nOur philosophy is to support how colleagues learn and provide an environment where innovation is encouraged. Our first enterprise learning day of 2024 focused on AI in action, providing practical guidance, tools, and crowd-sourced suggestions about integrating AI into day-to-day workflows. In the spirit of knowledge sharing, we established an internal prompt library enabling crowdsourcing of AI prompts for the purposes of sharing practices and learning across the company. Through our associated AI in action challenge, employees from across Thomson Reuters were asked to submit videos highlighting some of the creative ways they’re using AI to change the way they work. Winning examples included using Thomson Reuters Open Arena solution as an “everyday companion” that helps analyze data, refine formulas, and inform monthly reviews, and a professional biography builder to help with conference profiles.\nTo keep AI innovation moving forward, we also hosted our second annual Global AI Hackathon, which brought together nearly 1,000 colleagues to build innovative solutions for real-life challenges. A collective of 164 teams competed to develop unique AI approaches to solve a series of 31 challenges put forward by various internal Thomson Reuters departments.\nMany of the challenge owners — who, after the event, become the sponsors for the winning solutions — are currently working on next steps to integrate these innovative outputs into products and services. For example, the sponsors of the accessibility challenge, which won the Gold Award and was the runner-up for the Best Technical Solution, are working with members of the team to expand it beyond the original scope. Similarly, the sponsors of the editorial challenges have incorporated winning ideas into their official 2025 roadmap.\nTaking the pulse on real-world AI\nDisruption. Transformation. Revolution. These are just a few of the words becoming synonymous with virtually every headline about the effect of AI on business. But how do the professionals whose day-to-day lives are influenced by AI really feel about the technology? Is AI something to be feared or embraced? Is it a threat or a force for good? How is this truly affecting the typical workday of the average professional?\nAs part of our ongoing commitment to thoughtful and responsible AI development, we feel it is critical to continually take the pulse of the professionals who are using this technology to see how they interact with it and what they think about its future potential. In 2024, we produced two critical benchmarking studies, our 2024 Generative AI in Professional Services report and our Future of Professionals Report, which serve as the ultimate guides to real-world AI.\nThe common theme in both reports is the widespread agreement that AI will play a major role in the future of professional services. The reports found a sharp uptick in AI interest and growing recognition that, even though many firms are still refining their approaches to AI, it will positively impact the workplace. Overall, 77% of professionals predicted AI will have a high or transformational impact on their work over the next five years, up 10 percentage points from last year, and 79% said they expect AI to drive innovation at their companies. Perhaps most interesting of all, the research found that professionals expect AI to free up 12 hours per week within the next five years, giving them time to tackle more complex and rewarding work in the process.\nProfessional-grade AI solutions\nThe most disruptive technologies typically do so quietly by gradually tweaking and improving the way we do things. The internet, the iPhone, and the cloud all became ubiquitous by meeting people where they were and evolving along with them as familiarity, sophistication, and trust grew over time.\nThat was the philosophy behind our CoCounsel 2.0 launch. Instead of creating an overnight disruption suddenly changing how our clients work, we focused on building powerful AI capabilities directly into our core solutions, so our clients would have the same interface and familiar workflow — just better. Our supercharged GenAI assistant, CoCounsel, is now built into core products like Westlaw and Checkpoint Edge. It is seamlessly integrated into Microsoft 365 applications such as Microsoft Teams, Outlook, Word, and SharePoint, allowing our customers to draft, compare documents, and conduct research leveraging the power of AI and our proprietary content.\nThese new enhancements underscore two critical aspects of our unique approach to developing professional-grade AI. First, they show that everything starts with our customers. We look at their biggest pain points and design solutions to help them spend less time doing repetitive, labor-intensive tasks while improving the quality of their output. Second, we build everything based on our strongest assets — our proprietary research databases and human expertise. The result of that combination is a set of practical, real-world solutions helping our clients get the right answers faster and have confidence in the results.\nIn addition to helping our customers, employees utilized GenAI tools to simplify our internal processes and reduce time spent on routine tasks, enabling their teams to focus on more valuable work. This exercise included using a combination of commercially available AI technologies and internally developed AI capabilities. The teams have started to see early success in several functions across the enterprise. Some leading examples of early wins are customer service agents using AI tools to improve call handling time, sales reps using conversational AI capabilities to enhance their effectiveness, and several teams using meeting summarization features.\nChapter Five\nJustice, truth, and transparency\nThomson Reuters pursues access to justice, truth, and transparency by leveraging our people, products, and partnerships for positive, well-informed social impact. Together with the professionals and institutions we serve, we help uphold the rule of law, turn the wheels of commerce, catch bad actors, report the facts, and provide trusted, unbiased information to people worldwide. We harnessed the innovation of AI for good, and our employees leaned into the power of pro bono consulting to support nonprofit organizations. In addition, we made significant advances in tackling important global issues, including human trafficking.\nFourth annual Thomson Reuters Social Impact Hackathon empowers nonprofits\nWe believe pro bono consulting has the power to not only enrich our own professional lives but truly transform communities. We hosted our fourth annual Thomson Reuters Social Impact Hackathon, marking another milestone in our commitment to harnessing our collective skills for social good. Over the course of a week, 155 employees dedicated more than 975 hours, which is valued at over $209,660 in pro bono consulting. Our employees teamed up as pro bono consultants to support 39 nonprofit organizations from six countries across the world. They achieved remarkable outcomes and hacking solutions for challenges in communications, data analytics, finance, leadership development, marketing, strategy, and more.\nA key objective of the Thomson Reuters Social Impact Hackathon is that our nonprofit partners walk away with a deliverable that is both implementable and sustainable, supporting the goal of strengthening their infrastructure and increasing their ability to deliver on their missions. We are proud to share that 93% of nonprofit participants anticipate the deliverable will provide significant learning to their organization and staff, and that 90% of nonprofit participants anticipate the deliverable will enhance their organizational capabilities. As exemplified by Kate Moss, CEO of Vranch House in the United Kingdom, “The impact this work will have on our charity is endless — it was so motivating, and it felt so supportive to have such professionals help in an area in which we are not experts.”\nPro bono is a win-win across the board — nonprofits gain insight from functional-area experts that they may not otherwise have the expertise, capacity, or budget to accomplish on their own. On the flip side, we hear repeatedly from our employees that it not only felt rewarding to give back, but 85% state they valued the opportunity to gain new insights, apply their professional skills in a new context, and even enhance their leadership skills such as adaptability and strategic thinking because of the project.\nEchoing that sentiment, Sweta Patel — a talent development solutions lead at Thomson Reuters, participating in her second Thomson Reuters Social Impact Hackathon — shared, “Just like last year, it was incredibly rewarding. To be able to take time out of my workweek to give back with my colleagues brings us together, fills our cups, and helps us do some social good. We all contribute in meaningful ways because we all have different experiences that can provide value to these organizations, and it's just so wonderful to have the chance to give back in that capacity.”\nWe derive a great deal of pride in having a purpose-driven culture where the importance of doing work that has a positive impact on our communities is encouraged and rewarded. Stated best by three-time participant Robin Taylor, former Executive Director of Lawyers Without Borders, “The Thomson Reuters Social Impact Hackathon is a testament to the power of collective action in driving meaningful change.”\nView the 2024 Thomson Reuters Social Impact Hackathon report to take a closer look at our outcomes.\nLeading with purpose through volunteerism\nPro bono work has long been a cornerstone of the legal profession, reflecting the responsibility that comes with the privilege of practicing law. This commitment is deeply embedded in our company culture. More than 230 Legal Pro Bono Connection members provided 3,470 volunteer hours to over 100 nonprofit organizations, valued at $1.31 million in legal pro bono services.\nEach year, we proudly celebrate Global Pro Bono Month, during which our employees volunteer their legal skills in critical areas ranging from fair elections to immigration to bail reform. Employees participated in more than a dozen different legal research initiatives, pro bono sprints, incarcerated mothers law projects, and collaborations with leading law firms focused on expanding access to justice. The Legal Pro Bono Connection team also received the prestigious 2024 Institutional Cornerstone Award, presented by Lawyers Alliance for New York, for our extraordinary contributions through legal pro bono services. In presenting the award, Lawyers Alliance noted that close to 50 Thomson Reuters volunteers handled 71 pro bono matters over the past 10 years.\nEmployees also used their professional skills to provide non-legal pro bono support. This work is vital as it offers crucial services and support to individuals and communities, especially in areas requiring expertise that may be financially inaccessible. Using their expertise, 250 employees provided more than 5,000 volunteer hours to 159 nonprofit organizations, worth $1.12 million in pro bono services according to the Taproot Foundation.\n1 Pro bono (legal) valuation is calculated at $391 per hour, as referenced by the 2022 National Law Journal Survey\n2 Pro bono (non-legal) valuation is calculated by using the average hourly value for pro bono service ($220 per hour), as referenced by the Taproot Foundation/CECP\nEmpowering change: launching the Social Impact Grant program\nIn a world where access to justice, truth, and transparency is more important than ever, Thomson Reuters proudly launched the Social Impact Grant program. This initiative underscores our commitment to supporting nonprofit organizations that drive meaningful change in these vital areas.\nThrough the Social Impact Grant program, we are not just distributing funds — we're building strong, collaborative relationships with organizations sharing our vision of a more just, truthful, and transparent world. This program allows us to extend our reach and amplify our impact, working together with those on the ground to effect real change.\nIn its inaugural year, the Thomson Reuters Social Impact Grant program awarded over $1 million to 92 nonprofit organizations across nine countries. These include organizations dedicated to combating human trafficking and providing vital support to survivors, and initiatives focused on ending the book famine in Africa. This global reach ensures our impact meets the needs of each community it serves with intention and amplifies the voices of those working tirelessly on the ground.\nIn addition to programmatic and project funding, what sets our grant program apart is its emphasis on general operating support, a funding approach that is as rare as it is crucial. Unlike restricted funding, general operating support provides nonprofits with the flexibility to allocate resources where they're needed most, whether it's investing in organizational infrastructure, supporting fundraising efforts, or addressing urgent and emerging issues. This approach demonstrates our trust in these organizations' expertise and allows them to adapt swiftly to changing circumstances, ultimately maximizing their impact.\nThrough the Social Impact Grant program, we reaffirm our dedication to our societal responsibilities and our belief in the power of informed action. Together with our partners, we are paving the way for a brighter, more equitable future.\nClosing the gap: AI for justice\nThe justice gap highlights the urgent need for improved access to legal services, as many low-income Americans do not receive adequate legal assistance for most of their civil legal issues. To help narrow this gap, we launched the AI for Justice legal aid program, which includes a Legal Innovators Incubator to provide legal nonprofit organizations with free access to CoCounsel, our leading AI legal assistant.\nThe Legal Innovators Incubator pilot class consisted of nine nonprofit organizations offering legal services to low-income individuals in the United States. We gave participants a year of free access to CoCounsel to help complete complicated legal workstreams in a fraction of the time. Through CoCounsel, these organizations significantly reduced time spent on tasks such as identifying inconsistencies in witness statements, fact-checking, and drafting legal documents.\nThe inaugural Legal Innovators Incubator pilot class included The Innocence Center, an organization that seeks to free the wrongfully convicted from prison. Mike Semanchik, Executive Director of The Innocence Center, stated how CoCounsel has helped the organization do deep dives into cases. “When we review cases, we must go page-by-page, and often you might miss something. CoCounsel is capturing it all and citing back to it.”\nLearn more about the Innocence Center and their experience with CoCounsel.\nThe power of GenAI has the potential to bring about a more efficient, effective, and equitable justice system for everyone, and we are proud to be part of this effort.\nGeneration AI: Teaching kids the importance of ethical AI\nGeneration Z may have the distinction of being the first group of people to have never known a world without internet connectivity. But even for these so-called digital natives, the introduction of GenAI creates its fair share of uncertainty and confusion in everything from classroom protocol to identifying deepfakes and misinformation.\nAs part of our role as a leader in developing professional-grade AI solutions in the establishment of ethical guardrails for the use of GenAI, we hosted a program with Canada’s Rideau Hall Foundation to educate young people on AI literacy. Developed as part of the Foundation’s Ingenious+ program, the series was led by members of our technology and senior leadership teams and hosted around 250 students across the United States, Egypt, and Canada on the topic of how to use AI for good.\nExpanding our efforts to end human trafficking\nWherever there is geopolitical unrest, economic upheaval, or natural disasters, human trafficking is sure to follow. That’s why, according to the United Nations Office on Drugs and Crime’s Global Report on Trafficking in Persons, human trafficking has risen dramatically in recent years, climbing 25% above pre-pandemic levels. Beyond our dedication to supporting the principles of justice, truth, and transparency, we are also a leader in helping to raise public awareness on human trafficking. We provide the tools, technology, and expertise used by law enforcement agencies around the world to spot risks and identify bad actors.\nAs part of our ongoing commitment to ending human trafficking, we participated in several initiatives over the past year focused on awareness and prevention. One of these was our recognition of the National Center for Missing & Exploited Children (NCMEC) with an Everyday Heroes Award for its tireless commitment to finding missing kids and stopping sexual exploitation. Thomson Reuters has been a partner with NCMEC for 15 years, and our Everyday Heroes program is an annual initiative launched by our Government team to recognize public service professionals and the critical work they do to solve some of the most pressing challenges facing their communities.\nWe also teamed up with the Attorney General Alliance to participate in their second annual Anti-Human Trafficking Summit in Minneapolis, Minnesota. We led a series of panels focused on ways in which public safety, law enforcement, and other government agencies can work together within their communities to help stop human trafficking. These panel discussions were part of a series of special events and public awareness campaigns we helped coordinate over the course of the year. Discussions included a panel on World Day Against Trafficking in Persons, and the launch of the Safe Settings campaign aimed at providing parents, caregivers, and concerned adults with the necessary information to keep children safe online, and a series on safe gaming for children. To date, Safe Settings campaign ads have garnered 38 million impressions online.\nChapter Six\nSustainable future\nWe continue to reduce our environmental impact globally and work toward our climate change targets. Our commitment to sourcing 100% renewable energy for our global operations has helped reduce greenhouse gas (GHG) emissions. Our Global Print segment continued to align its eco-friendly printing processes with sustainability goals to minimize its carbon footprint and support a healthy planet. Employees turned their passion for sustainable issues into action through employee-led Green Teams and a reforestation project in Mexico City, Mexico.\nUpdate on climate change targets and disclosures\nIn 2020, Thomson Reuters joined the Science Based Targets initiative, committing to reduce Scope 1 and 2 GHG emissions by 50% by 2030 from 2018 baseline levels, as well as reducing absolute Scope 3 GHG emissions from fuel and energy-related activities, business travel, and employee commuting by 25% by 2025 from 2019 baseline levels. Additionally, we aim to require 65% of suppliers by spend to have Science Based Targets by 2025. Since 2020, we have sourced renewable energy for 100% of our operations. We have achieved this largely through the sourcing of renewable power by matching our electricity usage with renewable energy credits acquired worldwide.\nPrimarily through investment in renewable power for our facilities, we’ve been able to drive more than a 91% reduction in Scope 1 & 2 GHG emissions from our 2018 baseline. Our business travel emissions have decreased by 30% compared to our 2019 baseline. We have also expanded our Scope 3 calculations to include emissions from hotel stays, taxis, and rideshare. We have also made progress on our engagement target with our supply chain, with 44% of suppliers by spend committed to Science Based Targets. In addition to the switch to renewable energy, we remain carbon neutral through offsetting the remaining portion of our GHG footprint through carbon offsets.\nSustainability in our print business\nFor over 225 years, Thomson Reuters businesses have served as a powerhouse in publishing and manufacturing books, primarily for the professional legal and tax sectors, but also for government agencies, associations, and the educational, faith-based, trade, and children’s book markets.\nOur Global Print segment works diligently to ensure our processes help mitigate our impact on the environment. These processes align with company sustainability goals, focusing on eco-friendly printing and minimizing our carbon footprint to ensure our operations support a healthy planet. We have invested in the latest digital printing technologies that minimize the consumption of raw materials, while simultaneously offering publishers economical solutions to manage tighter inventories, which reduces obsolete inventory and waste. In addition to these initiatives, our Global Print segment requires that the paper mills and merchants we purchase paper from hold Programme for the Endorsement of Forest Certification, Sustainable Forestry Initiative, and Forest Stewardship Council certifications. These certifications ensure the purchase of paper products from suppliers supporting responsible forest management.\nThe impact of our Global Print segment’s efforts and dedication to environmental responsibility is clear. In 2024, Global Print recycled 9,530 tons of paper, 180 tons of corrugated materials, 98 tons of aluminum, 120 tons of steel, 11 tons of plastic, and 151 tons of wood. Through these landfill diversion initiatives, Global Print continues to focus on responsible and sustainable publishing practices and remains committed to a greener planet for all.\nPromoting grassroots sustainability globally\nFurthering our commitments to sustainability and our purpose-driven culture, our Green Teams — which were developed to bring Thomson Reuters staff together around a series of knowledge sharing events, volunteering activities, and local sustainability initiatives — recently expanded. We saw the official launch of our Toronto, Canada Green Team, which hosted an Earth Day conference, ran a session on sustainable investing, and created a digital community for conversations like green software and global-local employee experiences at the intersection of climate change, sustainability, and business.\nMeanwhile, our Green Team chapter in Costa Rica was recognized by the government of Costa Rica as part of its Ecologic Blue Flag Program, Bandera Azul, which celebrates outstanding volunteer work in conservation, climate change action, and public health improvement. Our Green Team in Bangalore, India, was also incredibly active, hosting a beach clean-up event, book exchange and donation drive, plant swap, workshops on solar energy, and other events throughout the year. Together, these efforts demonstrate the enormous power of small groups of individuals within a much larger community to effect change and spur action on sustainability.\nReforestation efforts in Mexico City\nEach year, we recognize employees who’ve demonstrated an extraordinary commitment to volunteerism with our annual Carla Jones Social Impact Award. Named in honor of the late Carla Jones, a former Thomson Reuters employee, this recognition is a testament to the power of individuals to drive change.\nThe winner of the award, Abraham Fuentes, teamed up with the Global Volunteer Network in Mexico City and Cultura Integral Forestal, a nonprofit dedicated to preserving Mexico’s natural parks, to organize a series of reforestation events focused on planting trees to rejuvenate the local ecosystem. Through this partnership, he helped organize and execute four major environmental activities aimed at making a tangible difference. The reforestation efforts indirectly benefited an entire community of more than 759,000 people by improving air quality, reducing urban heat, and creating green spaces. In recognition of the team’s efforts, Thomson Reuters made a $10,000 donation to Cultura Integral Forestal, helping to aid their sustainability efforts in 2025 and beyond.\nChapter Seven\nAdvancing our workforce\nOur human capital practices and initiatives are designed to attract, develop, and retain talented employees across all our businesses around the globe, and ensure they feel valued, are provided with opportunities to grow, and are driven to succeed. We focus on a variety of human capital topics, such as compensation and benefits, culture and employee engagement, talent acquisition, learning and development, and inclusion and belonging. Oversight of human capital management has also been a key focus area for our board of directors.\nOur culture\nAt Thomson Reuters, we take pride in cultivating an environment where our employees feel valued and supported, enabling them to thrive both personally and professionally. With over 26,000 teammates across more than 70 countries, we have built a distinctive culture championing continuous learning, career development, and innovation, all driven by our shared purpose to inform the way forward. Inclusion and belonging are central to our values, fostering a workplace where all backgrounds and perspectives are embraced. This culture enhances decision-making and innovation, allowing us to serve our customers globally in the pursuit of justice, truth, and transparency amidst constant change.\nMentorship, collaboration, and community\nCommunity is a critical ingredient when it comes to cultivating an environment of trust where people from all backgrounds feel they have the resources and support needed to grow. Our business resource groups (BRGs), which are open to all employees, play a vital role in helping us foster that environment. These groups span more than 80 chapters worldwide and are supported by 140 volunteer co-leads. Our BRGs hosted a series of events focused on empowerment, connection, and developing a growth mindset. These included Aspire to Lead, an internal professional development conference, which brought together hundreds of employees. Our global #IAmRemarkable workshops offered colleagues a highly interactive experience focused on empowering individuals to speak openly about their accomplishments and break through modesty norms and cultural barriers. In addition, other events brought colleagues together to learn and explore a range of key topics such as AI skill building, career development, mentorship, personal branding, and more.\nThe continued importance of digital accessibility\nEven the most breakthrough technologies in the world cannot live up to their fullest potential if they cannot be accessible to all users. To help bring attention to the importance of inclusive design, we celebrated Global Accessibility Awareness Day by amplifying the theme, “Advancing Accessibility: How to Build More Inclusive Experiences.” This day included a series of live and on-demand technology demos, learning sessions, and a panel discussion focused on empowering, informing, and inspiring our colleagues to incorporate accessibility into everything we do.\nSupporting, developing, and training employees\nThomson Reuters has established itself as a leader in harnessing AI to transform workflows across various professional services sectors, including legal, tax and accounting, risk and compliance, and news and media. In 2024, our talent strategy focused on adapting to the rapidly changing business landscape in an AI-enabled world.\nRecognizing the need for agility and proactive skill development, we launched initiatives to support career growth and skill-building for the future. More than 14,000 Thomson Reuters employees participated in one or more of our enterprise Learning Days. In addition, more than 11,000 Thomson Reuters employees completed our AI Foundations course, and some 3,800 have developed advanced skills in prompting on our own internal AI platforms.\nWe also increased our commitment to career development with the launch of Grow My Way. This initiative supports career growth in our dynamic work environment by fostering skill development and enabling leaders to deploy talent to meet rapidly changing business needs. Grow My Way included three educational webinars, simplified processes for employees to participate in short-term projects, and a new AI-enabled Careers and Skills Explorer tool to help colleagues identify development areas and potential career moves. Grow My Way will continue to expand and explore new AI tools, including various AI-powered digital assistants, to enrich our colleagues’ learning experiences. We continue to invest significantly in fostering a culture of continuous learning and innovation among our teams.\nInvesting in leadership development\nWe have developed several programs to give our business leaders and emerging leaders the tools needed to succeed in a fast-moving business environment. We launched our Managing at Thomson Reuters onboarding program to support new managers and equip them with essential tools and skills. These include educating on hybrid and remote work best practices, inclusive leadership practices, and building understanding across different cultures. More than 700 managers participated globally, with 93% finding it a valuable investment of their time.\nWe also partnered with the Massachusetts Institute of Technology’s Sloan School of Management to launch Elevate, a leadership development program through which a select group of 29 talented employees were immersed in an intensive nine-month experience focused on leading change, innovation, and data-driven decision-making. This program joins another executive development initiative, the Connected Leaders Academy, administered by McKinsey & Company. Since its launch in 2021, the Connected Leaders Academy at Thomson Reuters has reached over 1,000 colleagues from 15 countries and 21 business areas.\nCreating an environment for people to flourish\nOur people remain our greatest asset, and we are steadfast in our commitment to fostering a supportive and empowering workplace environment. We offer employee benefit plans, tools, resources, and workplace practices that promote mental, physical, financial, and social well-being.\nCentral to this is a strong focus on mental health and well-being. Our Mindful Leadership Training is a key component of our Managing at Thomson Reuters program, ensuring we equip all new managers to lead effectively. Additionally, we offer global resources such as employee assistance programs, meditation apps, and mindfulness discussions, which were highlighted during our May and October mental health campaigns.\nHere at Thomson Reuters, we uphold our commitment to flexibility through our hybrid working policy and the Flex My Way initiative. These global, flexible workplace policies enable employees to balance family and customer needs effectively. With offerings like bereavement leave, caregiver paid time off, sabbatical leave, parental leave, work-from-anywhere policy, and local paid and unpaid time off policies, we ensure our employees can take the time they need, when they need it. These efforts underline our unwavering dedication to cultivating a physically, mentally, financially, and socially healthy workplace for all.\nTogether, these initiatives help illustrate how we approach career development and employee growth as more than just a job — we are committed to the whole person and recognize that by developing a foundation of trust and connectivity, we can learn, inspire, and grow together far more effectively.\nChapter Eight\nCommunity impact\nWe are committed to conducting business ethically and responsibly, prioritizing the well-being of customers, employees, communities, and the environment. To uphold these values, we promote employee volunteerism, make financial and in-kind donations, and match employee donations. Employees continued to use our programs to support various causes, partnering with community organizations and charities to create real social impact.\nOur employees logged more than 51,000 volunteer hours, including over 9,000 hours in total pro bono support to nonprofit organizations around the world. We offer a global corporate match program, which matches eligible employee donations, as well as a volunteer rewards program in which an employee earns corporate funding for their volunteer time. Donations by our employees, together with our corporate match funds and rewards donations, totaled approximately $2 million given to over 1,900 nonprofits in 26 countries. In addition, employees worldwide participated in our third annual Global Volunteer Day, showing the collective impact we can make in just one day.\nA day of impact\nWe often talk about the global perspective Thomson Reuters brings to our work across various business groups, but it’s also important to recognize the enormous value we get from the local experiences of our over 26,000 colleagues working in hundreds of cities and towns around the world. That close connection to our communities figured prominently in our third annual Global Volunteer Day, which brought together more than 2,500 employees to participate in volunteer events in 16 countries.\nThis special day allowed our employees to contribute to causes they are passionate about, including education, food insecurity, human services, housing and homelessness, and environmental sustainability. In our Minneapolis-St. Paul office in the United States, team members packed backpacks with essentials for human trafficking survivors and prepared meals to help feed children worldwide. In Gdansk, Poland, employees crafted sensory cushions and rice-filled balls for senior citizens. Meanwhile, our team assembled hygiene kits in Zug, Switzerland for underprivileged and at-risk youth and adults. In São Paulo, Brazil, 30 employees gathered and wrapped toys for children. Additionally, more than 60 employees in Hyderabad, India demonstrated their creativity and scientific expertise by creating do-it-yourself science projects for students.\nBy the end of the day, our teams helped more than 100 charitable organizations and committed more than 8,600 hours to a wide range of efforts.\nGiving future generations the skills to compete on the world stage\nAs a world leader in the use of data, analytics, and AI to improve workflows and generate better answers faster, we recognize how important skills in mathematics, computer science, and effective communication can be when it comes to recruiting talent and driving innovations. We also realize it’s never too early to start honing those skills, and we can play a role in helping future generations gain exposure to these kinds of opportunities at an early age.\nThrough a series of CoderDojo sessions in Brazil, we brought some of our top tech talent out into the community to help children and adolescents learn the basics of coding. The event was organized by Centro de Promoção para um Mundo Melhor, which is dedicated to helping children in the underserved Jardim Itatinga neighborhood of Campinas. Volunteers shared their technical knowledge to help participants create their own games, then implement new characters and scores for each item collected in the game. In the past two years, over 40 employees have volunteered more than 280 hours helping participants learn how to code, develop apps, programs, and games, all while exploring technology in a fun and creative way. This work helps to reinforce the importance of initiatives that democratize access to digital education.\nReaching out in our communities\nThroughout the year, Thomson Reuters employees, working individually in their communities and collaborating with colleagues to support charitable efforts worldwide, have collectively helped thousands. In Canada, Thomson Reuters continued to deepen our partnership with the United Way of Greater Toronto since restarting our employee giving campaign in 2023. Through the generosity of Thomson Reuters employees, $131,000 CAD was raised and surpassed an ambitious campaign goal. Over 150 employees participated in the campaign, a 10-fold increase from the prior year. The funds raised were enough to feed 131 families of four for a month.\nA team of volunteers in India helped WaterAid India make clean water available in vulnerable communities nationwide. Together, our employees contributed over 600 hours of effort focused on water sanitation programs, school outreach efforts, and clean water project site visits. Through these activities, employees increased awareness of water conservation and sustainability practices among students, enhanced understanding of various subjects through interactive classes, and promoted environmental consciousness through creative activities and tree planting. Elsewhere, our Global Volunteer Network in Hyderabad, India led a campaign to get necessary supplies, such as notebooks, backpacks, and pencils, into the hands of impoverished school children in the region. Together, the team of 174 Thomson Reuters employees packed and delivered school kits through the program.\nThrough volunteer programs like these, our employees continue to make an impact and build momentum for future efforts to help our neighbors.\nEmpowering futures, transforming lives: A decade of CSR impact in India\nFor over a decade, Thomson Reuters employees in India have formed strong relationships with local non-government organizations (NGO) by sharing their skills and resources. Under India's Corporate Social Responsibility (CSR) mandate, eligible companies are required to spend at least 2% of their average net profits from the previous three financial years on CSR activities. To adhere to this policy, Thomson Reuters India implemented CSR programs focused on education and vocational training, livelihood enhancement, community well-being through public health interventions, and environmental sustainability.\nIn 2024, grants were donated to six NGOs throughout four states in India, including scholarships for 108 students from 17 states, with a special focus on rural youth — or 59% of beneficiaries. This initiative aims to bridge the gap from education to employment by offering career readiness through training, mentorship, and networking opportunities. One participant shared, \"I am deeply grateful for the scholarship support you have provided me which has alleviated my financial burdens and allowed me to focus on excelling in studies. Your generosity has been instrumental in shaping my future and inspiring me to strive for excellence.” Additionally, 1,000 students who are first-generation learners across colleges in Bangalore and Mumbai participated in communicative English, soft skills, and interview training.\nThese grants also provided awareness and training programs, language study materials, and special education resource kits for more than 4,000 individuals. Over 1,000 children with hearing impairments benefited from education intervention, STEM sessions, parent training, and speech therapy sessions.\nRounding out these programs was a commitment to local sustainability. A multipronged approach addressed critical areas, resulting in a healthier ecosystem, increased water security for local communities, and heightened environmental awareness among stakeholders. These examples illustrate the diverse landscape of CSR initiatives in India. Through these grants, a total of 9,400 beneficiaries received much-needed assistance to enrich their lives.\nEnabling employees to drive change through the Employee Impact Grant program\nWe believe our employees are the driving force behind our commitment to creating a more just and transparent world. That's why we introduced the Employee Impact Grant program, a global initiative empowering our employees to request corporate funding for the organizations they care about. This program is a key component of our broader Social Impact Institute, which aims to further our pursuit of access to justice, truth, and transparency, while strengthening the communities in which we live and work.\nEmployees have appreciated this additional opportunity to support causes they care about. Scott Midgley, a Strategic Client Director, shared, \"We felt privileged to contribute to the important work of the Literacy for Life Foundation (LFLF), a remarkable Indigenous-run charity dedicated to training local individuals to deliver literacy classes within their communities. The grant provided through the program further helped LFLF's mission to transform lives and end adult low literacy in Indigenous communities.\"\nBy supporting our employees' passions and values, we're making a difference in our communities and fostering a culture of social responsibility and civic engagement. The Employee Impact Grant program is a powerful tool for driving positive change. In its inaugural year, the program awarded over $94,000 to 58 nonprofit organizations in 10 countries globally. Whether supporting STEM initiatives, promoting human rights, or championing literacy programs, we're committed to empowering our employees to be forces for good in the world.\nMaking a difference with in-kind support\nWe continued our strong relationship with Books for Africa, a nonprofit organization dedicated to collecting, sorting, shipping, and distributing books to children and adults in Africa. Annually, we donate 10 law book libraries at a value of nearly $1.1 million. We are proud to support the development of legal knowledge and expertise in Africa, contributing to the growth of just and equitable societies.\nIn-kind support was also provided to Miles of Freedom, an organization committed to empowering individuals, families, and communities impacted by incarceration. We printed 100 updated curriculum books for their job readiness workshops, which provide essential training and tools for securing employment. In 2024, the organization delivered 107 workshops, equipping 170 individuals with the skills, confidence, and resources needed to reenter the workforce successfully. By supporting Miles of Freedom’s efforts to reintegrate formerly incarcerated individuals into the workforce, we contribute to breaking cycles of recidivism and promoting economic stability.\nIn-kind donations are a powerful way to support organizations in need while striving to create a more just, transparent, and sustainable global community.\nCelebrating our employees’ achievements\nThe Thomson Reuters Awards are given annually to recognize the extraordinary achievements of selected colleagues who go above and beyond for customers, business, and one another. Winners were recognized for their customer-centric approaches, innovative thinking, and strategic leadership. On behalf of each winner, we make a $10,000 donation to a nonprofit of their choice. Since its inception in 2020, $310,000 has been donated to 33 charities across 41 winners.\nAmong the winners were employees from the product team, who adopted AI to enhance legal research. In addition, the team award members utilized leadership and teamwork for the Eagan, Minnesota Data Center Exit project, a highly complex and multiyear endeavor to migrate essential products to the cloud. Each winner demonstrated a commitment to innovation, collaboration, and customer focus, driving significant advancements and success for Thomson Reuters.\nChapter Nine\nThomson Reuters Institute\nThe Thomson Reuters Institute engages professionals from the legal, corporate, tax, accounting, audit, and government communities to host conversations and debate, analyze trends, and provide the insights and guidance needed to help shape the way forward in an evolving and increasingly complex environment.\nHuman Rights Crimes Resource Center: a comprehensive toolset for combating modern slavery and exploitation\nIn 2024, the Thomson Reuters Institute launched its human rights crimes resource center, which offers invaluable resources for risk and compliance professionals in both corporate and governmental sectors. As the global landscape becomes increasingly complex, understanding and addressing human rights crimes is crucial for organizations committed to ethical practices. The revamped resource center provides detailed insights and tools to tackle some of the most pressing issues today, including forced labor and supply chains, sex trafficking, child exploitation, and anti-human trafficking toolkits.\nSupply chains, often sprawling and intricate, can sometimes mask the tragic reality of forced labor. This section of the resource center is designed to equip professionals with the knowledge needed to ensure their organizations’ supply chains are transparent and ethical, thereby safeguarding those organizations from potential legal and reputational damages. The sex trafficking section of the resource center offers comprehensive guidelines and case studies to help professionals recognize signs of trafficking and implement effective interventions. In addition, the child exploitation section provides a deep dive into the various forms of exploitation that many children face globally. It offers tools and best practices for compliance professionals to ensure their organizations are not inadvertently contributing to these acts.\nTo aid in the fight against human trafficking, the center refreshed robust toolkits, which the City of Houston originally created. These toolkits provide practical tools and tactics along with collaborative approaches that organizations can adopt to better spur effective private-public partnerships. These toolkits empower professionals with the necessary resources to implement effective anti-trafficking measures. To date, the resource center offers nine toolkits, such as a hotel ordinance toolkit and labor trafficking and supply chains toolkits, just to name a few.\nResearch identifies essential strategies to tackle forced labor in supply chains\nThe International Labor Organization (ILO) estimates that 50 million people are living in slavery, generating $236 billion in illicit profits annually. Each of these individuals deserves dignity, freedom, and the opportunity to live a life free from exploitation. Forced labor undermines legitimate trade and competition, driven by economic incentives for bad actors. In 2024, a field study led by Thomson Reuters in collaboration with Syracuse University’s Dynamic Sustainability Lab emphasized the importance of a collective effort among governments, companies, consumers, and workers to combat forced labor in global supply chains. The academic study highlighted best practices from Southeast Asia to address forced labor, instill good governance in the corporate sector, and the advantages of taking a multi-stakeholder approach to collectively protect vulnerable people. and the advantages of taking a multi-stakeholder approach to collectively protect vulnerable people.\nForced labor, as defined by the ILO, involves coercion through abuse, deception, and threats, often accompanied by violence and abusive conditions. A range of goods, including agricultural, manufacturing, and mined products, are produced using forced labor and laws in mature markets aim to reduce forced labor. For instance, Canada’s modern slavery law requires annual reports on efforts to prevent forced labor, while the United Kingdom’s Modern Slavery Act mandates large businesses to publish statements on their anti-slavery efforts. The European Union is developing legislation to address forced labor within its borders, with due diligence requirements effective in 2028. The United States Uyghur Forced Labor Prevention Act has led to the seizure of goods worth $2.096 billion due to violations.\nCorporate policies, such as codes of conduct and audits, are crucial for good governance, as audits often reveal indicators of forced labor. Human rights impact assessments can help companies identify and prioritize areas for improvement. United States investors can influence companies to minimize forced labor risks, while consumers can make informed purchasing decisions. Ultimately, eradicating forced labor requires collective action to prioritize ethical practices and transparency in global supply chains.\nBuilding AI education resources for the judiciary with the National Center for State Courts\nAI adoption in the United States judiciary has helped to reduce case backlogs, improve court operations, and increase access to justice for underserved communities. It has also facilitated the creation of a more efficient, effective, and equitable system for all involved. The rapid growth in the use of AI and GenAI in the legal system has the potential to dramatically accelerate that positive change, but it also entrusts courts with the responsibility to make informed decisions about responsible AI and GenAI adoption and use.\nTo assist the judiciary in remaining at the forefront of innovation and position United States courts as leaders on responsible AI and GenAI adoption, the Thomson Reuters Institute formed a strategic AI partnership with the National Center for State Courts (NCSC). The Thomson Reuters Institute and National Center for State Courts AI Policy Consortium for Law and Courts is designed to inform and educate the judiciary about the opportunities and challenges of evolving AI and GenAI solutions and thereby position the AI Policy Consortium as a leading resource for how AI can be used responsibly and effectively throughout the practice of law and the judicial system.\nThe AI Policy Consortium, comprised of judges, legal scholars, and technologists, is addressing four key areas — AI governance and ethics, workforce readiness, rules and practices, and AI's impact on access to justice. Working together with the NCSC, the educational program offers courses, taught by experts, for judges and other court officials to learn about AI and generative AI, its impact on the judicial and legal workforce, the ethical issues raised by using AI, how its use can enhance court efficiency, and more.\nChapter Ten\nThomson Reuters Foundation\nAs an independent charity registered in the United Kingdom and the United States, the Thomson Reuters Foundation works to inform, connect, and empower professionals and civil society to strengthen free, fair, and informed societies. It delivers its work through capacity-building programs, legal support, research, and data-driven products and events, including its flagship annual forum, Trust Conference. The foundation’s digital news platform, Context, provides news and critical analysis that help purpose-driven professionals understand the impact of major events on people, society, and the environment. In 2024, Thomson Reuters donated over $6 million to support its work.\nStrengthening access to the law through legal services and programs\nWith almost two-thirds of the world’s population having unmet justice needs, the foundation empowers the legal community to use its expertise in the public interest and increase access to the law for civil society organizations, social enterprises, and independent media.\nThe foundation runs the world’s largest pro bono service, TrustLaw, which facilitates access to free legal assistance and resources for NGOs and social enterprises on the frontlines of social or environmental change. We saw the development of critical legal research on a wide range of pressing issues, which included work that played a crucial role in delivering policy change to outlaw child marriage in Colombia.\nIn 2024, TrustLaw facilitated $29 million GBP in expert legal advice for NGOs and social enterprises worldwide. As a result, over 421 organizations received support to build capacity and achieve impact.\nLeveraging data intelligence to drive responsible business practices\nCorporations can contribute to social progress by balancing shareholders’ needs with the impact on stakeholders’ communities. Additionally, a combination of new regulations and investor scrutiny is adding pressure on businesses to increase corporate transparency. The foundation leverages its networks and data intelligence to encourage responsible business practices that support more equitable economies.\nIn 2024, the foundation acquired the Workforce Disclosure Initiative (WDI), which collates data voluntarily disclosed by companies on workforce issues across their operations and supply chains. This information is then shared with investor signatories to inform their analysis, stewardship, and decision-making, with the aim of advancing responsible business practices that allow companies to thrive while doing no harm.\nLast year, 144 companies responded to the WDI survey, employing around 8 million workers. Businesses that disclose via WDI voluntarily share nearly three times more data than those that do not. This data was shared with the WDI’s investor signatories, made up of around 50 institutions that collectively manage $9 trillion in assets.\nAdvancing responsible AI adoption\nDrawing on the foundation’s experience in running WDI, it aims to bridge a gap in the data available on corporate AI adoption. In partnership with the United Nations Educational, Scientific and Cultural Organization (UNESCO), the Foundation is working to support corporate leaders in mapping their AI adoption across their workflows, operations, and services, with the goal of doing no harm.\nBuilding on UNESCO’s Recommendation on the Ethics of AI and comprising a voluntary survey with added insights and services, the program prepares companies to get ahead of the curve, positioning themselves as best in class for ethical adoption as legislation and audits come into force. The survey will open for responses in summer 2025 and will support companies in mapping their AI use, considering issues such as legal accountability, data privacy and bias, environmental impact, and the impact on workers.\nThis initiative will operate in tandem with WDI and will be exclusively available to members of WDI’s investor coalition to help them steward their investments based on the responsible use of AI. The partnership was announced at Trust Conference, where Gabriela Ramos, UNESCO’s Assistant Director-General for the Social and Human Sciences, and Mariagrazia Squicciarini, CEO of the Social and Human Sciences Sector at UNESCO, spoke on the future of global governance of AI and charting a path for responsible AI adoption.\nChapter Eleven\nAppendix\nExtended datasheet\nWe invite you to explore our extended datasheet to view key metrics on our diversity and inclusion, community impact, and environmental efforts."
    }
]