[
    {
        "Ticker": "TTWO",
        "Company": "Take-Two Interactive",
        "Source_URL": "http://www.take2games.com",
        "Content_Type": "Website Content",
        "Raw_Text": "When you visit one of our websites, applications, or other web-based services (“Sites”), it may store or retrieve information on your chosen internet browser, mostly in the form of cookies and similar tracking technologies (“Cookies”) which are used to identify a computer, browser, or device, and often, the settings associated with those devices.\nCertain Cookies are necessary for our Site and our Site’s services to function, and certain Cookies allow us to provide you with an enhanced experience.\nWhile Cookies do not usually directly identify you, they can give you a more personalized web experience as they learn to recognize your device and preferences over time.\nYour Privacy\nTo learn about the types of Cookies we use across our Sites, you can click on the different category headings for more information. You can also change the default settings as you’d like.\nFor some types of Cookies, you can turn the Cookies on or off. You can also disable Cookies on your device or set your browser to alert you when we or others send Cookies to your device. Please note that if you turn off some types of Cookies, it may limit your experience on the Site and the services we are able to offer.\nMore Information\nThese Cookies are necessary for our Site to provide core functions and cannot be turned off in our systems.\nThese core functions usually include the main services on our Site, keeping the Site secure, managing your privacy settings, and allowing you to sign in or fill in forms. These Cookies may be set by us or by third-party providers whose services we use on our Site, and they do not collect or store any information that will directly identify you (such as your name, email address or address).\nYou can set your browser to block or alert you about these Cookies, but some parts of the Site may look odd or might not work at all.\nThese Cookies allow us to count visits and traffic sources so we can measure and improve the performance of our Site. These Cookies do not collect or store any information that will directly identify you (such as your name, email address or address) and the information that is collected is used in aggregate.\nThey help us to know which pages on our Site are visited the most, which pages are not visited very often, and how visitors move around our Site. This helps us learn what kind of content and Site experience visitors enjoy. These Cookies may be set by us or by third-party providers whose services we use on our Site.\nIf you don’t allow these Cookies, we won’t be able to recognize Site activity and will not be able to evaluate our site performance.\nThese Cookies enable Site enhanced functionality and personalization such as feature enhancement, spoiler prevention, and live chats.\nThese Cookies may be set by us or by third-party providers whose services we use on our Site.\nIf you decide not to allow these Cookies, then some or all of these services may not function properly.\nThese Cookies help us to accurately and properly pay for ads placed on our behalf (e.g., an ad that led you to purchase or download one of our games) and get paid when you see an ad on our or other third-party services; prevent you from repeatedly seeing the same ads; display targeted ads or other content on your computer or device (such as on a Site or social networking services you are visiting or an app you are using) that may be of particular interest to you.\nThese Cookies may be set through our Site by our advertising partners. They also may be used by those partners to build a profile of your interests and show you relevant ads on our Sites or other third-party sites based on topics you may like.\nThese Cookies may also transmit personal information and video viewing information to our advertising partners and other third parties. If you do not allow these Cookies, you will still receive ads, but they will be less targeted to your device and/or interests."
    }
]