[
    {
        "Ticker": "WBD",
        "Company": "Warner Bros. Discovery",
        "Source_URL": "http://www.wbd.com",
        "Content_Type": "Website Content",
        "Raw_Text": "Our Company\nWarner Bros. Discovery is a leading global media and entertainment company that creates and distributes the world’s most differentiated and complete portfolio of content and brands across television, film and streaming. Warner Bros. Discovery inspires, informs and entertains audiences worldwide through its iconic brands and products including: Discovery Channel, HBO Max, discovery+, CNN, DC, Eurosport, HBO, HGTV, Food Network, OWN, Investigation Discovery, TLC, Magnolia Network, TNT, TBS, truTV, Travel Channel, Animal Planet, Science Channel, Warner Bros. Motion Picture Group, Warner Bros. Television Group, Warner Bros. Pictures Animation, Warner Bros. Games, New Line Cinema, Cartoon Network, Adult Swim, Turner Classic Movies, Discovery en Español, Hogar de HGTV and others.\nSuperman\nPeacemaker\nThe Gilded Age\nSinners\nWork With Us\nThe makers, the storytellers, the world's greatest creators. We're bringing together the scripted and the unscripted, the local and the global, the timely and the timeless. Taking the world's greatest possibilities and making them a reality. Creating impact, inspiring imagination, and building connections. Here you can succeed, here you are supported, here you are celebrated.\nWarner Bros. Discovery hires talent across the globe and offers career-defining positions, carefully curated benefits, and the tools to realize your best self.\nFrom brilliant creatives to technology trailblazers and beyond, work with us."
    },
    {
        "Ticker": "WBD",
        "Company": "Warner Bros. Discovery",
        "Source_URL": "http://www.wbd.com/news/warner-bros-discovery-reports-third-quarter-2025-results",
        "Content_Type": "Website Content",
        "Raw_Text": "Warner Bros. Discovery, Inc. (the “Company”) (Nasdaq: WBD) today reported financial results for the quarter ended September 30, 2025. Please visit the “Investor Relations” section of the Company’s website to view the financial resultsand other earnings materials, including a Shareholder Letter.\nThe Company will conduct a conference call today at 8:00 a.m. ET to discuss the results. A link to the live webcast of the conference call will be available in the “Investor Relations” section of the Company’s website at https://ir.wbd.com/.\nA telephone replay of the call will be available approximately two hours after the completion of the call until November 13, 2025. The replay can be accessed via phone by dialing +1 888-660-6264 or +1 646-517-3975 and using playback passcode 76732#. A replay of the audio webcast will also be available in the “Investor Relations” section of the Company’s website for twelve months.\nQ3 2025 Highlights:\n- Total revenues were $9.0 billion, a 6% ex-FX decrease from the prior year quarter. Total revenues excluding the impact of the 2024 Olympics in Europe were flat ex-FX compared to the prior year quarter.\n- Distribution revenues decreased 4% ex-FX, as dynamic underlying growth in global streaming subscribers was more than offset by continued domestic linear pay TV subscriber declines and the first full quarter impact of the HBO Max domestic distribution deal renewal with a former related party, previously disclosed in Q2.\n- Advertising revenues decreased 17% ex-FX, as ad-lite streaming subscriber growth was more than offset by domestic linear audience declines.\n- Content revenues decreased 3% ex-FX, primarily driven by the sublicensing of Olympic sports rights to broadcast networks throughout Europe in the prior year partially offset by the stronger performance of the theatrical releases in the current year quarter. Content revenues excluding the impact of the 2024 Olympics in Europe increased 23% ex-FX.\n- Net loss available to Warner Bros. Discovery, Inc. was $148.0 million, which includes $1.3 billion of pre-tax acquisition-related amortization of intangibles, content fair value step-up, and restructuring expenses.\n- Total Adjusted EBITDA was $2.5 billion, a 2% ex-FX increase compared to the prior year quarter, primarily due to growth in the Streaming and Studios segments, partially offset by a decline in the Global Linear Networks segment.\n- Cash provided by operating activities was $1.0 billion. Free cash flow was $0.7 billion. Free cash flow was unfavorably impacted by approximately $500 million of separation-related items.\n- The Company repaid $1.2 billion of debt during the quarter, including $1.0 billion of the bridge loan facility.\n- The Company ended the quarter with $4.3 billion of cash on hand, $34.5 billion of gross debt, and 3.3x net leverage.\n- The Company ended the quarter with 128.0 million streaming subscribers, an increase of 2.3 million subscribers vs. Q2."
    },
    {
        "Ticker": "WBD",
        "Company": "Warner Bros. Discovery",
        "Source_URL": "http://www.wbd.com/news/warner-bros-discovery-announces-discovery-globals-2026-upfront-presentation",
        "Content_Type": "Website Content",
        "Raw_Text": "Discovery Global Will Debut its Inaugural Upfront Presentation on May 13, 2026 at The Theater at Madison Square Garden\nUS Ad Sales, Creative and Key Company Leaders to Present\nWarner Bros. Discovery (NASDAQ: WBD) today announced that Discovery Global will host its inaugural 2026 Upfront presentation at The Theater at Madison Square Garden the morning of Wednesday, May 13, 2026. The presentation will introduce Discovery Global’s vision, spotlight the company’s key leadership, and affirm its position as a one-stop shop for advertisers heading into the 2026/2027 marketplace.\nAs previously announced, Discovery Global will continue to represent the domestic advertising inventory of Warner Bros. in the 2026/27 Upfront and beyond, keeping together two powerhouse portfolios with scale across both companies’ linear, streaming, and digital properties. This partnership is set to provide advertisers with unique opportunities to connect with audiences across multiple platforms, leveraging culture-shaping content paired with advanced targeting strategies and technology.\n“At Discovery Global, we will seek to inspire and empower audiences through bold storytelling and engaging stories,” said Gunnar Wiedenfels, Chief Financial Officer, Warner Bros. Discovery and announced Chief Executive Officer, Discovery Global. \"We are committed to deepening connections between people and the world around them—while delivering innovative, data-driven solutions that help brands engage meaningfully with our passionate global audience. By uniting creativity with intelligence, we aim to build lasting partnerships and deliver measurable results.”\n“While the structure of our company is transforming, our shared commitment to creating meaningful connections between audiences and brands remains stronger than ever,” said Ryan Gould, President of U.S. Ad Sales, Go to Market, Warner Bros. Discovery. “We’re looking forward to showcasing how the world-class portfolios of both Discovery Global and Warner Bros. can connect advertisers with high-impact consumer engagement and drive unmatched value.”\n“The 2026 Upfront will mark a bold new chapter for Discovery Global and Warner Bros. —where strategic vision meets brand leadership across Sports, News, Entertainment, and Streaming,” said Bobby Voltaggio, President of U.S. Ad Sales, Platform Monetization, Warner Bros. Discovery. \"Through cutting-edge innovation in ad tech, data, and product development, we’re not just shaping the future—we’re inviting our partners to build it with us.\"\nThe presentation will highlight the trusted and iconic brands from both Discovery Global and Warner Bros., spanning entertainment, news, and sports — including Adult Swim, Bleacher Report, CNN, Discovery, Food Network, HBO, HGTV, Investigation Discovery (ID), Magnolia, OWN, TBS, TLC, and TNT Sports, as well as HBO Max and discovery+. Warner Bros. Television, Warner Bros. Motion Picture Group and DC Studios will also be featured —highlighting how advertisers can continue to activate across both portfolios to maximize reach and impact.\nTogether, these brands and creative studios will demonstrate unparalleled reach, premium storytelling, and commitment to delivering impactful opportunities for advertisers across every screen and platform."
    },
    {
        "Ticker": "WBD",
        "Company": "Warner Bros. Discovery",
        "Source_URL": "http://www.wbd.com/news/warner-bros-discovery-initiates-review-potential-alternatives-maximize-shareholder-value",
        "Content_Type": "Website Content",
        "Raw_Text": "Company Continues to Execute on Previously Announced Separation into Two Distinct, Leading Media Companies\nProcess Follows Unsolicited Interest from Multiple Parties for the Entire Company and Warner Bros.\nWhile Warner Bros. Discovery (the \"Company\") (NASDAQ: WBD) continues to advance its previously announced separation of Warner Bros. and Discovery Global, its Board of Directors today announced it has initiated a review of strategic alternatives to maximize shareholder value, in light of unsolicited interest the Company has received from multiple parties for both the entire company and Warner Bros.\nThrough this process, the Warner Bros. Discovery Board will evaluate a broad range of strategic options, which will include continuing to advance the Company's planned separation to completion by mid-2026, a transaction for the entire company, or separate transactions for its Warner Bros. and/or Discovery Global businesses. As part of the review, the Company will also consider an alternative separation structure that would enable a merger of Warner Bros. and spin-off of Discovery Global to our shareholders.\n\"We continue to make important strides to position our business to succeed in today's evolving media landscape by advancing our strategic initiatives, returning our studios to industry leadership, and scaling HBO Max globally. We took the bold step of preparing to separate the Company into two distinct, leading media companies, Warner Bros. and Discovery Global, because we strongly believed this was the best path forward,\" said David Zaslav, President and CEO of Warner Bros. Discovery.\nZaslav added, \"It's no surprise that the significant value of our portfolio is receiving increased recognition by others in the market. After receiving interest from multiple parties, we have initiated a comprehensive review of strategic alternatives to identify the best path forward to unlock the full value of our assets.\"\n\"Our decision to initiate this review underscores the Board's commitment to considering all opportunities to determine the best value for our shareholders,\" added Samuel A. Di Piazza, Jr., Chair of the Warner Bros. Discovery Board of Directors. \"We continue to believe that our planned separation to create two distinct, leading media companies will create compelling value. That said, we determined taking these actions to broaden our scope is in the best interest of shareholders.\"\nThere is no deadline or definitive timetable set for completion of the strategic alternatives review process. Other than the separation transaction that is already underway, there can be no assurance that this process will result in the Company pursuing a transaction or other outcome. Warner Bros. Discovery does not intend to make any further announcements regarding the review of strategic alternatives unless and until the Board approves a specific transaction or otherwise determines further disclosure is appropriate or necessary.\nAllen & Company, J.P. Morgan and Evercore are serving as financial advisors to Warner Bros. Discovery and Wachtell Lipton, Rosen & Katz and Debevoise & Plimpton LLP are serving as legal counsel."
    },
    {
        "Ticker": "WBD",
        "Company": "Warner Bros. Discovery",
        "Source_URL": "http://www.wbd.com/news/warner-bros-discovery-report-third-quarter-2025-results-thursday-november-6",
        "Content_Type": "Website Content",
        "Raw_Text": "Warner Bros. Discovery, Inc. (the “Company”) (Nasdaq: WBD) today announced that it will report its third quarter 2025 results on Thursday, November 6, 2025 before the market opens. Links to the live webcast of the conference call as well as the earnings materials will be available in the “Investor Relations” section of the Company’s website at https://ir.wbd.com/ starting at approximately 7:00 a.m. ET. The Company will host a conference call at 8:00 a.m. ET that same day to discuss the results.\nA telephone replay of the call will be available approximately two hours after the completion of the call until November 13, 2025. The replay can be accessed via phone by dialing +1 888-660-6264 or +1 646-517-3975 and using playback passcode 76732#. A replay of the audio webcast will also be available in the “Investor Relations” section of the Company’s website for twelve months.\nAbout Warner Bros. Discovery:\nWarner Bros. Discovery is a leading global media and entertainment company that creates and distributes the world’s most differentiated and complete portfolio of branded content across television, film, streaming and gaming. Warner Bros. Discovery inspires, informs and entertains audiences worldwide through its iconic brands and products including: Discovery Channel, HBO Max, discovery+, CNN, DC, TNT Sports, Eurosport, HBO, HGTV, Food Network, OWN, Investigation Discovery, TLC, Magnolia Network, TNT, TBS, truTV, Travel Channel, Animal Planet, Science Channel, Warner Bros. Motion Picture Group, Warner Bros. Television Group, Warner Bros. Pictures Animation, Warner Bros. Games, New Line Cinema, Cartoon Network, Adult Swim, Turner Classic Movies, Discovery en Español, Hogar de HGTV and others. For more information, please visit www.wbd.com.\n###\nSource: Warner Bros. Discovery, Inc."
    },
    {
        "Ticker": "WBD",
        "Company": "Warner Bros. Discovery",
        "Source_URL": "http://www.wbd.com/news/warner-bros-discovery-names-brad-singer-chief-financial-officer-post-separation-warner-bros",
        "Content_Type": "Website Content",
        "Raw_Text": "Warner Bros. Discovery, Inc. (Nasdaq: WBD) today announced that Brad Singer will assume the role of Chief Financial Officer of Warner Bros., upon completion of the company’s planned separation, which is expected to occur by mid-2026, subject to closing and other conditions. He will report to David Zaslav, President and Chief Executive Officer of WBD and future President and Chief Executive Officer of Warner Bros., and oversee Warner Bros.’ global financial functions and strategies, including FP&A, accounting, internal audit, treasury, tax, procurement, and investor relations activities.\nSinger will begin in this new position in October 2025 in a strategic role until the official formation of Warner Bros.\n“Brad was instrumental in driving significant value creation and growth during our time together at Discovery Communications, and I’m thrilled to be reuniting with a trusted leader whose financial expertise and strategic vision have consistently delivered results,” said Zaslav. “His proven track record combined with his sharp understanding of emerging technologies and evolving consumer trends will make him a tremendous addition to the new Warner Bros. leadership team.”\nSinger added: “I am excited and energized to reunite with David and join the future Warner Bros. at this pivotal moment. The company’s beloved brands, creative excellence, and enduring connection with audiences worldwide provide an extraordinary foundation. I see meaningful opportunities to unlock long-term value and I look forward to working with David and the leadership team to achieve that.”\nHe most recently served as Partner and Chief Operating Officer of ValueAct Capital before retiring in 2021, during which time he also served on the boards of Rolls-Royce Holdings and Motorola Solutions. Before joining ValueAct Capital in 2012, Singer was the Chief Financial Officer of Discovery Communications where he played a key role in taking the company public in 2008, as well as the Chief Financial Officer & Treasurer of American Tower Corporation where he helped lead post-IPO growth, capital planning and restructuring, major acquisitions and international expansion that underpinned the company’s trajectory. Before his role at American Tower, Singer was an investment banker at Goldman Sachs. Singer is a current board member of Warby Parker where he serves on the audit and compensation committees, as well as Sweetgreen where he has chaired the audit committee since 2021.\nSinger holds an MBA with distinction from Harvard Business School and a bachelor’s degree from the University of Virginia.\n###\nAbout Warner Bros. Discovery:\nWarner Bros. Discovery is a leading global media and entertainment company that creates and distributes the world’s most differentiated and complete portfolio of branded content across television, film, streaming and gaming. Warner Bros. Discovery inspires, informs and entertains audiences worldwide through its iconic brands and products including: Discovery Channel, HBO Max, discovery+, CNN, DC, TNT Sports, Eurosport, HBO, HGTV, Food Network, OWN, Investigation Discovery, TLC, Magnolia Network, TNT, TBS, truTV, Travel Channel, Animal Planet, Science Channel, Warner Bros. Motion Picture Group, Warner Bros. Television Group, Warner Bros. Pictures Animation, Warner Bros. Games, New Line Cinema, Cartoon Network, Adult Swim, Turner Classic Movies, Discovery en Español, Hogar de HGTV and others. For more information, please visit www.wbd.com.\nForward Looking Statements\nInformation set forth in this communication constitute forward-looking statements within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements include, without limitation, statements regarding Warner Bros. Discovery’s expectations, beliefs, intentions or strategies regarding the future, and can be identified by forward-looking words such as “anticipate,” “believe,” “could,” “continue,” “estimate,” “expect,” “intend,” “may,” “should,” “will” and “would” or similar words. These forward-looking statements are based on current expectations, forecasts, and assumptions that involve risks and uncertainties and on information available to Warner Bros. Discovery as of the date hereof.\nForward-looking statements include, without limitation, statements about the benefits of the separation, including future financial and operating results, the future company plans, objectives, expectations and intentions, and other statements that are not historical facts. Such statements are based upon the current beliefs and expectations of WBD’s management and are subject to significant risks and uncertainties outside of our control. Among the risks and uncertainties that could cause actual results to differ from those described in the forward-looking statements are the following: the occurrence of any event, change or other circumstances that could give rise to the abandonment of the separation or pursuit of a different structure; risks that any of the conditions to the separation may not be satisfied in a timely manner; risks that the anticipated tax treatment of the proposed separation is not obtained; risks related to potential litigation brought in connection with the separation; uncertainties as to the timing of the separation; risks and costs related to the separation, including risks relating to changes to the configuration of WBD’s existing businesses; the risk that implementing the separation may be more difficult, time consuming or costly than expected; risks related to financial community and rating agency perceptions of WBD and its business, operations, financial condition and the industry in which it operates; risks related to disruption of management time from ongoing business operations due to the separation; failure to realize the benefits expected from the separation; the final terms and conditions of the separation, including the terms of any ongoing commercial agreements and arrangements, and the relationship between Warner Bros. and Discovery Global following the separation; the nature and amount of any indebtedness incurred by Warner Bros. or Discovery Global; effects of the announcement, pendency or completion of the separation on the ability of WBD to retain and hire key personnel and maintain relationships with its suppliers, and on its operating results and businesses generally; risks related to the potential impact of general economic, political and market factors on WBD as it implements separation; and risks related to obtaining permanent financing.\nWBD’s actual results could differ materially from those stated or implied, due to risks and uncertainties associated with its business, which include the risks related to the separation. Discussions of additional risks and uncertainties are contained in WBD’s filings with the Securities and Exchange Commission, including but not limited to WBD’s most recent Annual Report on Form 10-K and reports on Form 10-Q and Form 8-K. WBD is not under any obligation, and expressly disclaims any obligation, to update, alter, or otherwise revise any forward-looking statements, whether written or oral, that may be made from time to time, whether as a result of new information, future events, or otherwise. Persons reading this communication are cautioned not to place undue reliance on these forward-looking statements which speak only as of the date hereof."
    },
    {
        "Ticker": "WBD",
        "Company": "Warner Bros. Discovery",
        "Source_URL": "http://www.wbd.com/news/warner-bros-discovery-announces-conference-participation-month-september",
        "Content_Type": "Website Content",
        "Raw_Text": "Warner Bros. Discovery, Inc. (Nasdaq: WBD) today announced that its President and CEO David Zaslav and its Chief Financial Officer Gunnar Wiedenfels will present at conferences during the month of September.\nGunnar Wiedenfels will present at the Bank of America Securities 2025 Media, Communications & Entertainment Conference on Wednesday, September 3, 2025 at 1:10 p.m. ET (10:10 a.m. PT). David Zaslav will present at the Goldman Sachs Communacopia + Technology Conference on Wednesday, September 10, 2025 at 11:50 a.m. ET (8:50 a.m. PT).\nA link to the live webcast of the presentation will be available in the “Investor Relations” section of Warner Bros. Discovery’s website at https://ir.wbd.com/. An on-demand replay of the webcast will be available on the Company's Investor Relations website shortly after the conclusion of the presentation.\nAbout Warner Bros. Discovery:\nWarner Bros. Discovery is a leading global media and entertainment company that creates and distributes the world’s most differentiated and complete portfolio of branded content across television, film, streaming and gaming. Warner Bros. Discovery inspires, informs and entertains audiences worldwide through its iconic brands and products including: Discovery Channel, HBO Max, discovery+, CNN, DC, TNT Sports, Eurosport, HBO, HGTV, Food Network, OWN, Investigation Discovery, TLC, Magnolia Network, TNT, TBS, truTV, Travel Channel, Animal Planet, Science Channel, Warner Bros. Motion Picture Group, Warner Bros. Television Group, Warner Bros. Pictures Animation, Warner Bros. Games, New Line Cinema, Cartoon Network, Adult Swim, Turner Classic Movies, Discovery en Español, Hogar de HGTV and others. For more information, please visit www.wbd.com.\n###\nSource: Warner Bros. Discovery, Inc."
    }
]