[
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/",
        "Content_Type": "Website Content",
        "Raw_Text": "The enterprise AI platform for people, money, and agents.\nManage HR, finance, and all your AI agents. All in one place.\nMove your business forever forward.\nLearn how one unified platform empowers your entire organization to work more effectively.\nUse AI to optimize transactions and processes, deliver data-driven insights, and generate value across the enterprise.\nTurn AI into ROI faster and deliver transformational outcomes driven by trust, agility, and data readiness you can rely on.\nTake control of your contracts and turn contract data into actionable insights that drive outcomes across your business.\nDrive faster, smarter frontline operations and enable a connected, agile workforce with AI agents and mobile tools.\nHuman + AI collaboration transforms how work gets done.\nWorkday Illuminate™ is the AI engine that powers our products and AI agents. Learn how Illuminate actively supports your people and enables them to do their best work.\nExplore Workday Illuminate"
    },
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/en-us/solutions/role/enterprise-technology/overview.html",
        "Content_Type": "Website Content",
        "Raw_Text": "The platform that steps up to IT’s challenges.\nThe future of work is here, and our AI platform equips IT leaders to meet it head-on. With people, money, and agents managed in one place, you can easily tackle your greatest challenges and focus on what lies ahead."
    },
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/en-us/why-workday/our-technology/overview.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Discover how our platform strategy and AI innovation empower CIOs to stay ahead of change. Read eBook\nOUR TECHNOLOGY PLATFORM\nBecome unstoppable on the Workday platform.\nIn today’s ever-changing business landscape, you need more than just software. You need a strategic advantage. Learn how our AI platform gives you the edge to not just keep pace but also to lead.\n“Having the ability to leverage the security and privacy controls within Workday’s trusted enterprise management cloud enables us to confidently spin up new apps to meet our unique needs and drive more value from our Workday investment.”\nDELIVERING GREATER INNOVATION\nInnovation powered by partnership.\nWith innovations built by our customers, partners, and Workday, our platform provides you with even more ways to increase agility, transformation, and performance. Explore what’s possible in the Workday Marketplace and the Workday AI Marketplace.\nThis content is blocked due to your cookie preferences for this site. By clicking here, you accept YouTube's Terms of Service and Privacy Policy. Workday will save your choice in a session cookie."
    },
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/en-us/solutions/industries/media-and-entertainment.html",
        "Content_Type": "Website Content",
        "Raw_Text": "CUSTOMER SUCCESS\nSee how leading companies use Workday.\nSee how leading companies use Workday.\nThis content is blocked due to your cookie preferences for this site. By clicking here, you accept YouTube's Terms of Service and Privacy Policy. Workday will save your choice in a session cookie."
    },
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/en-us/solutions/industries/technology.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Supercharge your growth with an AI platform that manages your people, money, and agents—freeing you up to focus on what you do best: pioneering the next big thing.\nImprove accuracy and confidence, streamline board and management reporting, and enhance collaboration between sales and finance. With Workday, you can:\nCRM integration. Sync opportunities with quotes and projects.\nProject launchpad.\nHarmonize quoting, resourcing, and contracting.\nSimplified Quoting\nService templates.\nIncrease quoting efficiency.\nSOW automation. Generate SOWs based on effort drivers and scope.\nQuote to deliver.\nBuild quotes to drive project resourcing and budgeting.\nMultidimensional\nRobust. Quote based on timelines, phases, tasks, and milestones.\nFlexible.\nBuild quotes based on worker, rate, hours, and skills.\nBundling. Price based on bundled products and services.\nIntelligent Resource Management\nOPERATIONAL EXCELLENCE WITH PSA\nIntelligent resource management.\nSync service delivery work to worker lifecycle processes, automatically recommend projects based on worker skills, and improve customer satisfaction. With Workday, you can:\nThis content is blocked due to your cookie preferences for this site. By clicking here, you accept YouTube's Terms of Service and Privacy Policy. Workday will save your choice in a session cookie."
    },
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/en-us/customer-stories.html",
        "Content_Type": "Website Content",
        "Raw_Text": "This content is blocked due to your cookie preferences for this site. By clicking here, you accept YouTube's Terms of Service and Privacy Policy. Workday will save your choice in a session cookie."
    },
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/en-us/company/latest/events-webinars/events.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Workday Digital Event Library.\nDiscover insights and resources from our past events, including Workday Rising and Workday DevCon.\nIf you’ve attended a Workday event in the past, use your registration information to log in. If not, simply sign up for access."
    },
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/en-us/company/latest/events-webinars/webinars.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Ready to tackle today’s top business challenges? Explore our upcoming live webinars and on-demand replays to learn how Workday can help you stay a step ahead and totally transform work.\nOctober 30, 2025 | 9:00 AM PdT\nReimagining Drury Hotels’ Frontline with Workday\nHow Drury Hotels streamlined frontline ops using Workday.\nWant to unlock the full power of Workday? Learn how to manage your people, money, and AI agents with agility—through customer stories, demos, and more.\nDiscover what's possible with Workday. Whether you're new or ready for a deeper dive, this series features in-depth, real-time product demos and live expert Q&A.\nLearn how businesses like yours achieve success with Workday. Join our interactive webinars for a deep dive into industry-specific solutions and live Q&A with our expert solution consultants.\nCheck out Workday product demos to learn how our powerful AI platform helps organizations of all sizes and across all industries drive business forever forward.\nThis content is blocked due to your cookie preferences for this site. By clicking here, you accept YouTube's Terms of Service and Privacy Policy. Workday will save your choice in a session cookie."
    },
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/en-us/learn/cio-insights.html",
        "Content_Type": "Website Content",
        "Raw_Text": "This content is blocked due to your cookie preferences for this site. By clicking here, you accept YouTube's Terms of Service and Privacy Policy. Workday will save your choice in a session cookie."
    },
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/en-us/company/partners/overview.html",
        "Content_Type": "Website Content",
        "Raw_Text": "“The solutions delivered by our partners directly translate to unparalleled value for our customers. Their innovative spirit is the cornerstone of our ecosystem, enabling us to exceed expectations and redefine success.”\n—Matt Brandt, SVP, Global Partners, Workday"
    },
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/en-us/company/partners/advisory-partners.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Partner with a trusted advisor.\nWorkday Advisory Partners have in-depth knowledge to help customers determine what’s best for their needs and how to maximize business value. They guide you through digital acceleration strategy and planning, product selection, change management, and more. Explore the list of independent consulting firms to find the right Workday Advisory Partner for you."
    },
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/en-us/company/partners/innovation-partners.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Build on, extend, and do more with the Workday AI platform.\nOur Innovation Partners are a global ecosystem of application, content, and technology companies that design, build, and support solution extensions and integrations tailored to your needs.\nPartner since: 2013\nTime and attendance tracking done right is simple and affordable yet powerful, with the ability to transform your business. Accu-Time Systems provides ...\nPartner since: 2016\nAccurate Background is a trusted provider of automated workforce screening. U.S. and international clients across all industries, from emerging businesses to ...\nPartner since: 2014\nAchievers is a global leader in employee Recognition and Reward software, powering Workday’s Recognition and Rewards strategy globally as an Achievers ...\nPartner since: 2022\nAd Astra is a higher education software provider that helps students progress to degree completion through better institutional academic scheduling, academic ...\nPartner since: 2021\nAt Adept, we’re training a giant neural network to do anything a human can do on a computer. It is a new category of foundation models (text-to-action) ...\nPartner since: 2022\nAdministrate is the leading enterprise training operations platform designed to scale and manage the complexities of large scale training programs. Founded in ...\nPartner since: 2014\nThe trusted leader in digital documents for over 25 years, Adobe brings secure e-signatures to Workday customers. Send, sign, track, store and manage documents ...\nADP® Compliance Solutions helps maximize your Workday Payroll investment and align HR with broader business strategies. Integrating Workday with ADP Smart ...\nPartner since: 2020\nAdvanced Technology Group (ATG) is a management and technology consulting firm focused on optimizing the Quote to Cash lifecycle from customer experience to ...\nAdway is your all-in-one marketing platform for recruiters and talent managers, designed to quickly find unique, qualified talent on social media—while ...\nPartner since: 2021\nAisera offers the industry’s first proactive, personalized, and predictive AI service management (AISM) solution that automates 65%–80% of ...\nPartner since: 2019\nAmazon Business combines the selection, convenience and value customers have come to know and love from Amazon, with new features and unique benefits tailored ...\nInnovation Partners earn badges that help customers identify integration quality and readiness.\nFind the expertise needed to easily connect third-party payroll solutions using certified integrations from Workday."
    },
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/en-us/company/partners/managed-service-providers.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Manage your contingent workforce with one of our proven partners.\nLeave your contingent workforce program to us. Workday VNDLY managed service provider (MSP) partners bring the expertise to streamline costs, refine recruitment strategies, mitigate risk, and more."
    },
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/en-us/company/partners/services-partners.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Deploy and adopt new capabilities.\nWorkday Services Partners represent a curated community of global systems integrators and regional firms that help companies deploy Workday and continually adopt new capabilities. Our services partners are trained extensively on Workday products and possess the expertise to help you realize value from your Workday investment."
    },
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/en-us/company/partners/partner-program-overview.html",
        "Content_Type": "Website Content",
        "Raw_Text": "We never stop thinking about our customers, and neither do our partners. Together, we’ve created a partner ecosystem that builds, grows, and delivers successful outcomes that move our customers forever forward.\nCreate value for your business with Workday by your side.\nWhen you become a Workday partner, you join a unique ecosystem that supports your organization as we work hand in hand to deliver successful outcomes for our joint customers.\nPARTNER BENEFITS\nWorkday training and product information\nWorkday partner logo eligibility\nCo-innovation opportunities\nWorkday Partner Management\nPartner Programs\nWays to partner with Workday.\nOur programs make it easy for partners to build, grow, and deliver on Workday. Check out the resources below to find the program that’s right for you.\nWorkday Innovation Partners\nBuild\nWorkday Innovation Partners offer best-in-class complementary offerings while driving verticalization and customer exposure.\nWorkday Sales\nPartners\nGrow\nWorkday Sales Partners play a key role in our go-to-market strategy by creating demand, expanding sales, and advising customers.\nWorkday Services Partners\nDeliver\nWorkday Services Partners manage deployments, support application-managed services, and provide staffing solutions.\nWorkday Marketplace\nShowcase your apps and solutions.\nWorkday Marketplace features solutions built on and certified for the Workday platform that power customer success. Innovate alongside Workday, promote your expertise, and scale growth.\nCreate even more value, move customers forward, and increase the value of their Workday investment.\nShowcase your advantage.\nPromote how your solutions are a result of applying your deep industry and domain expertise to address customers’ unique needs.\nCapture customer interest.\nGrow brand awareness by getting in front of our extensive customer base. We make it easy to capture leads and streamline your sales cycle.\nWorkday Partner Awards\nProudly celebrating outstanding partners.\nEach year we host the Workday Partner Awards to recognize outstanding partners who have made a positive impact on our customers. Get to know this year’s winners.\nThis content is blocked due to your cookie preferences for this site. By clicking here, you accept YouTube's Terms of Service and Privacy Policy. Workday will save your choice in a session cookie."
    },
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/en-us/company/about-workday/our-story.html",
        "Content_Type": "Website Content",
        "Raw_Text": "2005\nWorkday is founded by software visionaries Aneel Bhusri and Dave Duffield as the first true cloud application provider for HR and finance.\n2012\nWorkday becomes a publicly traded company on the NASDAQ exchange.\n2023\nWorkday surpasses 10,000 customers worldwide.\n2024\nWe made our debut on the Fortune 500 and S&P 500, joining hundreds of our customers.\n2025\nWorkday is recognized by Ethisphere as one of the World’s Most Ethical Companies for the fifth consecutive year."
    },
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/en-us/company/about-workday/core-values.html",
        "Content_Type": "Website Content",
        "Raw_Text": "At Workday, our values drive our culture to elevate our customers, empower our employees, and supercharge work. It’s how we get better in everything we do and move business forever forward.\nEmployees\nOur employees are at the core of everything we do—a global community of high performers bringing their best selves to work, speaking up respectfully, and striving to do better every day.\nCustomer Service\nWe relentlessly seek to deliver meaningful value to our customers and are deeply committed to their success. In all we do, we strive for the highest levels of customer and user satisfaction.\nInnovation\nTo succeed within a fiercely competitive industry, we innovate with urgency and create an environment where it is safe to take risks, experiment, and challenge the status quo while making investments that scale and deliver long-term value.\nIntegrity\nWe work hard to build and sustain a culture of honesty that will serve our business for the long haul. To earn the trust of everyone we work with, we set clear expectations, establish accountability, measure results, and own our outcomes.\nFun\nWe believe work should be fun. And that we should have fun every day by inspiring, winning, and celebrating in ways that build meaningful relationships across the world.\nProfitability\nProfitability is important but it’s not why we exist. We exist to inspire a brighter work day for all. If we live our values, make smart choices, and spend wisely, profitability will follow.\nThis content is blocked due to your cookie preferences for this site. By clicking here, you accept YouTube's Terms of Service and Privacy Policy. Workday will save your choice in a session cookie."
    },
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/en-us/company/about-workday/leadership.html",
        "Content_Type": "Website Content",
        "Raw_Text": "This content is blocked due to your cookie preferences for this site. By clicking here, you accept YouTube's Terms of Service and Privacy Policy. Workday will save your choice in a session cookie."
    },
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/en-us/company/about-workday/value-inclusion-belonging-for-everyone.html",
        "Content_Type": "Website Content",
        "Raw_Text": "“At Workday, we aim to cultivate a supportive environment of inclusion and belonging, where every perspective is respected and valued. Through this commitment, we stir innovation, elevate the customer experience, and contribute to lasting success.”\n—Kumari Williams, Chief VIBE Officer, Workday"
    },
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/en-us/company/about-workday/public-policy.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Driving public policy that fuels trusted innovation.\nAt Workday, trust and transparency are at the core of everything we do. That’s why we advocate for policies that bolster trust in technology, help our customers thrive, and ignite innovation to move business forever forward.\nWHAT WE DO\nLeading the way in trusted technology policy.\nWe collaborate with policymakers, customers, and industry partners to advance thoughtful and workable technology policy.\nWe offer thoughtful and constructive public policy recommendations.\nWe leverage our deep AI expertise to ensure AI policy drives trustworthy innovation.\nExplore our core values that guide our public policy advocacy.\nWHAT WE FOCUS ON\nArtificial intelligence.\nWe leverage our AI expertise to ensure regulation is effective and workable, and drives trustworthy AI innovation.\nSharing our expertise.\nWe’re deeply engaged in AI governance conversations and share what we learn with customers, partners, and policymakers.\nThe privacy of our customers’ data has always been our priority. We believe privacy is a fundamental right and we proudly support strong privacy protections around the world.\nStrengthening privacy worldwide.\nWe’re supporting strong privacy laws and helping our customers navigate changing regulations around the globe.\nAs jobs and work continue to change, we’re working with policymakers to strengthen skills-based approaches to talent and leverage technology to solve workforce challenges.\nDriving skills-based approaches.\nWe’re advancing policy that supports skills-based approaches and leverages AI to bring them to scale.\nPublic sector organizations are facing uncertainty, rising costs, and workforce shifts—we’re supporting policies that help governments move beyond legacy systems to navigate these challenges.\nFocusing on talent in the U.S.\nWe focus on helping governments adopt skills-based approaches to attract, recruit, and retain talent.\nThis content is blocked due to your cookie preferences for this site. By clicking here, you accept YouTube's Terms of Service and Privacy Policy. Workday will save your choice in a session cookie."
    },
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/en-us/company/about-workday/sponsorships.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Justin Rose\nWidely respected for his consistency and class, Justin Rose has built a legendary career around the world. Former world #1, Major Champion, Olympic gold medalist, over 20 wins worldwide and a deep commitment to giving back through the Kate and Justin Rose Foundation and Rose Golf."
    },
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/en-us/company/about-workday/contact-us.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Looking for Workday Product Support?\nIf your company uses Workday and you need help logging in to your account, updating your information, or accessing your documents, please contact your HR or IT department.\nDue to our security policy, we’re unable to provide direct assistance with account requests."
    },
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/en-us/company/corporate-responsibility/overview.html",
        "Content_Type": "Website Content",
        "Raw_Text": "At Workday, “corporate responsibility” isn’t just an idea—it’s something we put into action. And our “Global Impact Report” shares our progress toward a more sustainable future.\nThis content is blocked due to your cookie preferences for this site. By clicking here, you accept YouTube's Terms of Service and Privacy Policy. Workday will save your choice in a session cookie."
    },
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/en-us/company/corporate-responsibility/workday-foundation.html",
        "Content_Type": "Website Content",
        "Raw_Text": "“AI is rapidly reshaping our workforce, calling for an agile and intentional approach to future-proof careers. While AI’s potential is immense, it is through our collective action that we can unlock its promise and build a future of opportunity for all.”\n—Carrie Varoquiers, Chief Impact Officer, Workday"
    },
    {
        "Ticker": "WDAY",
        "Company": "Workday, Inc.",
        "Source_URL": "https://www.workday.com/en-us/company/corporate-responsibility/sustainability.html",
        "Content_Type": "Website Content",
        "Raw_Text": "Protecting the planet.\nOur approach to sustainability focuses on the areas where we can make the most impact.\nWe’re actively reducing our carbon footprint, making investments in renewable energy, promoting climate policy, reducing and responsibly disposing of our e-waste, and encouraging our employees to adopt sustainable practices.\nOn a global level, we partner with other climate-focused leaders who believe it’s our collective responsibility to support a sustainable future."
    }
]