[
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/",
        "Content_Type": "Website Content",
        "Raw_Text": "ZERO TRUST ARCHITECTURE\nSecure, simplify, and transform your enterprise with zero trust\nAchieve superior protection\nStop cyberattacks, prevent data loss, and securely embrace AI\nIncrease agility and productivity\nAccelerate branch deployments, cloud adoption, and M&A time to value\nReduce costs and complexity\nEliminate firewalls and point products, and slash infrastructure spend\nour platform\nThe Zscaler Zero Trust Exchange\nSecure user, workload, and device communication between and\nwithin the branch, cloud, and data center.\nZero Trust Everywhere\nSecure Data\n- Find, Classify, and Assess Data Security Posture\n- Prevent Data Loss Across All Channels\nThe most trusted name in zero trust + AI\nPARTNERS\nIndustry-leading experience.\nWorld-class partners.\nOur ecosystem of partners and integrations enables faster and more reliable deployments, facilitates easier and more agile operations, and enhances our customers' cloud experience."
    },
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/press/zscaler-secures-enterprise-ai-lifecycle-acquisition-innovative-ai-security-pioneer-splx",
        "Content_Type": "Website Content",
        "Raw_Text": "Zscaler Secures The Enterprise AI Lifecycle With Acquisition of Innovative AI Security Pioneer SPLX\nAcquisition extends Zscaler Zero Trust Exchange with shift-left AI asset discovery, automated red teaming and governance, advancing Zscaler’s AI security leadership\nSan Jose, California, November 03, 2025\nZscaler, Inc. (NASDAQ: ZS), the leader in cloud security, today announced it has acquired innovative AI security pioneer SPLX, extending the Zscaler Zero Trust ExchangeTM platform with shift-left AI asset discovery, automated red teaming, and governance, so organizations can secure their AI investments from development through deployment.\n“Today marks an important step in advancing Zscaler’s role as the trusted partner helping organizations securely adopt AI,” said Jay Chaudhry, CEO, Chairman, and Founder of Zscaler. “AI is creating enormous value, but its full potential can only be realized when it can be secured. By combining SPLX’s technology with the intelligence of the Zscaler Zero Trust Exchange and its native data protection that classifies, governs, and prevents loss of sensitive data across prompts, models, and outputs, Zscaler will secure the entire AI lifecycle on one platform. This will strengthen our industry leadership and give customers the confidence to safely embrace AI.”\nAs AI drives record infrastructure investments projected to exceed $250 billion by end of 20251, organizations face a rapidly expanding attack surface and shadow AI sprawl. Continuously evolving models, agents, and large language models (LLMs) require ongoing discovery, risk assessment, and remediation, while AI agents and Model Context Protocol (MCP) servers demand strict guardrails and new techniques to secure data and AI assets across the lifecycle.\nSPLX’s innovative technology and deep expertise in AI red teaming, asset management, threat inspection, prompt hardening and governance will expand Zscaler’s current capabilities, creating a new, dedicated and natively integrated layer of AI protection within the Zscaler Zero Trust Exchange platform, that includes:\n- AI Asset Discovery and Risk Assessment: Discovery extends beyond public generative AI applications and public clouds to include AI models, workflows, code repositories and RAGs and MCP servers in both public and private deployments.\n- Automated AI Red Teaming and Remediation: From development to production, with 5,000+ purpose-built and domain specific attack simulations to find risks and vulnerabilities, and offer remediation in real time.\n- AI Runtime Guardrails and Prompt Hardening: Expands Zscaler’s current AI Runtime Guardrails that protect sensitive data and block malicious attacks between AI apps and LLMs, as well as agentic workflows, to include deep visibility within development environments and automate Guardrails for risky AI assets.\n- AI Governance and Compliance: Risk mitigation and support for organizations to shift from reactive defense to proactive protection for their valuable AI investments, and comply with governance frameworks.\n“Zscaler and SPLX share a vision to confront the vast new attack surface created by rapidly expanding AI infrastructure investments,” said Kristian Kamber, CEO and co-founder of SPLX. “By joining forces, we’ll bring our innovation to one of the most trusted security platforms in the world, securing AI innovation at the speed organizations are adopting it.”\nSource: 1) Goldman Sachs, “Technology in 2025: The Cycle Rolls On” February 2, 2025\nFollow Zscaler on LinkedIn, Instagram, and X.\nForward-Looking Statements\nThis press release contains forward-looking statements that are based on our management's beliefs and assumptions and on information currently available to our management. These forward-looking statements include the expected benefits of the proposed acquisition to Zscaler and its customers and plans regarding SPLX’s capabilities. These forward-looking statements are subject to the safe harbor provisions created by the Private Securities Litigation Reform Act of 1995. A significant number of factors could cause actual results to differ materially from statements made in this press release, including those factors related to Zscaler’s ability to successfully integrate SPLX technology into our cloud platform, the potential impact of the acquisition to the existing SPLX business and the retention of SPLX employees. Additional risks and uncertainties are set forth in our most recent Annual Report on Form 10-K filed with the Securities and Exchange Commission (“SEC”) on September 11, 2025, which is available on our website at ir.zscaler.com and on the SEC's website at www.sec.gov. Any forward-looking statements in this release are based on the limited information currently available to Zscaler as of the date hereof, which is subject to change, and Zscaler will not necessarily update the information, even if new information becomes available in the future.\nAbout Zscaler\nZscaler (NASDAQ: ZS) is a pioneer and global leader in zero trust security. The world’s largest businesses, critical infrastructure organizations, and government agencies rely on Zscaler to secure users, branches, applications, data & devices, and to accelerate digital transformation initiatives. The Zscaler Zero Trust Exchange™️ platform combined with advanced AI combats billions of cyber threats and policy violations every day and unlocks productivity gains for modern enterprises by reducing costs and complexity."
    },
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/company/contact",
        "Content_Type": "Website Content",
        "Raw_Text": "Let’s connect\nWant to get in touch? We’d love to hear from you.\nLet us know how Zscaler can help\nWe’d love to talk with you about how we can help accelerate your security, network, and cloud transformation initiatives.\nWhether you’re doing product research, evaluating your options, or just trying to scope your needs to start a project, we’re ready to point you in the right direction.\nPlease provide a few details to help us understand how we can best serve your needs.\nAmericas\nBellevue, WA\n777 108th Avenue NE,\nSuite 1750\nBellevue, WA 98004\nPlano, Texas\n7950 Legacy Dr Suite 400,\nPlano, TX 75024\nWashington, DC Metro Area\n7900 Westpark Dr,\nMcLean, VA 22102\nAlpharetta, GA\nSerendipity Labs,\n100 North Point Center East Suites 125 & 200,\nAlpharetta, GA 30022\nBurnaby, BC, Canada\n6060 Silver Dr., Suite 300-03-124,\nBurnaby, BC V5H 0H5, Canada\nBoston, MA\nOne Seaport Square\n77 Sleeper St.\nBoston MA 02210\nCosta Rica\nEl Cedral - Tower 3\nCentro Corporativo El Cedral\nMain entrance to Escazú, on the Prospero Fernandez Highway\n100m South, 200m West.\nSan Rafael de Escazú, 10203\nSan Jose, Costa Rica\nNew York\n250 West 34th Street\n3rd Floor, Suite 303\nNew York, NY 10119\nASIA PACIFIC\nBangalore, India\nBren Optimus, 3rd floor,\n8/2 Dr. M.H. Marigowda Road,\nDairy Colony,\nAdugodi Bengaluru-560029,\nKarnataka, India\nBangalore, India\n11th Floor, Bagmane Constellation Business Park,\nOrion Building, Ferns City Road,\nFerns City, Doddanekkundi,\nBengaluru-560048,\nKarnataka, India\nChandigarh, India\nNetsmartz Square,\n2nd & 3rd Floors,\nPlot No.- ITC-09,\nSector 67 (IT Park),\nMohali, Punjab- 160062\nGurgaon, India\nHyderabad, India\nWeWork Raheja Mindspace, 15th Floor, Building 9, Raheja\nMindspace IT Park, Building 9, HITEC City, Mindspace Madhapur Rd,\nOpposite The Westin Hyderabad Mindspace, Madhapur,\nHyderabad, Rangareddy, Telangana, 500081\nMumbai, India\nKaledonia,\n1st Floor, Sahar Rd, Andheri East,\nMumbai, Maharashtra 400069, India\nPune, India\nLevel 10, Tower C,\nPanchshil Business Park Phase 2,\nBalewadi, Pune,\nMaharashtra, 411045, India\nMelbourne, Australia\nLevel 7, 180 Flinders Street\nMelbourne VIC 3000\nAustralia\nSydney, Australia\nLevel 4\n17-19 Bridge Street\nSydney NSW 2000\nSingapore\nSingapore Land Tower\nLevels 45-47, 50 Raffles Place\n048623, Singapore\nSouth Korea\n4/F., Haesung Building 942,\nDaechi-dong, Gangnam-gu, 06178,\nSouth Korea\nTokyo, Japan\nLevel14, JP Tower,\n2-7-2, Marunouchi,\nChiyoda-ku, Tokyo 100-7014, Japan\nEMEA\nMilan, Italy\nVia San Marco 21,\n20121, Milan\nItaly\nFrankfurt, Germany\nGervinusstraße 17,\n60322 Frankfurt am Main,\nGermany\nIsrael\nAvalor\nOne Tower 10th Floor,\n21-23 Abba Hillel Silver Rd,\nRamat Gan, 5268104, Israel\nZscaler\nOne Tower 31st Floor,\n21-23 Abba Hillel Silver Rd,\nRamat Gan, 5268104, Israel\nMunich, Germany\nHerzogspitalstraße 24\n80331 München, Germany\nAmsterdam, Netherlands\nFred. Roeskestraat 100,\n1076 ED Amsterdam, Netherlands\nPoland\nCitySpace West4 ul. Na\nOstatnim Groszu 3,\n54-207 Wrocław, Poland\nLondon\n3rd Floor, The Royal Exchange\n2 Royal Exchange Steps,\nLondon EC3V 3DG\nMadrid, Spain\nPaseo de la Castellana, 91, Plantas 2 y 3, Tetuán, 28046 Madrid, Spain\nValència, Spain\nCarrer de l'Almirall Cadarso, 26,\n46005 València, Spain\nStockholm, Sweden\nc/o Epicenter Stockholm,\nMalmskillnadsgatan 44A,\n111 57 Stockholm\nZurich, Switzerland\nElias-Canetti-Strasse 2,\n8050 Zurich\nVienna, Austria\nPostgasse 8b,\n1010 Wien, Austria"
    },
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/tours",
        "Content_Type": "Website Content",
        "Raw_Text": "Featured tours\nZscaler Internet Access (ZIA) Product Overview\nTry ZIA hands-on and explore our key capabilities that protect your users, data, apps, and devices with the industry-leading SSE.\nZscaler Digital Experience (ZDX) Innovations\nExplore ZDX's latest features that make troubleshooting faster, improve user experiences, and drive better workforce productivity\nZscaler Private Access (ZPA) Product Overview\nSee how easily your organization can adopt the first AI-powered ZTNA solution. Explore ZPA and discover capabilities that transform secure access.\nPublic GenAI Data Security\nExplore how our GenAI security dashboard delivers unmatched data visibility and control over every facet of shadow AI.\nFilter by\nProducts\nTopics\nEndpoint DLP Walkthrough\nExplore Zscaler's Endpoint DLP to gain visibility and control over risky channels like USB devices, printing, and network shares.\nInline DLP Walkthrough\nTake a tour of Zscaler's Inline DLP and how it enables complete visibility across data risk in motion across the enterprise.\nFile Type Control\nRestrict file uploads/downloads by type or domain and block audio/video files to prevent bandwidth overuse across users and locations.\nMalware Protection\nDefend against ransomware, malware, adware, and spyware with signature detection, threat feeds, and AI-powered protection.\nZero Trust Firewall\nBuild zero trust policies on a cloud-native firewall protecting web and non-web traffic for all users, apps, and locations.\nCloud Sandbox\nScans, quarantines, and executes files inline in real time, using AI verdicts to block malicious files from reaching endpoints.\nSimplify Privilege Access with End User Initiated Approvals\nEnd-User Initiated Approval lets users request just-in-time, scoped, time-bound access via PRA—secure Zero Trust workflows without admin delays.\nUnified SaaS Security\nSafeguard data across your SaaS platforms and get everything you need to govern and secure SaaS data and posture with a single, powerful approach.\nAI-SPM Overview\nTest drive Zscaler AI-SPM and learn how you can get unmatched visibility and secure your AI models, services and agents.\nPrivileged Remote Access | File Transfer Flow\nSafely transfer and review files within privileged consoles to improve workflows while protecting against malware.\nPrivileged Remote Access | Session Recording\nRecord and replay privileged remote sessions to ensure accountability, support compliance, enable forensic investigation, and deter misuse of critical\nUVM Use Case: Ticket Grouping\nGroup related findings into smart tickets to sort by required fixes, assignees, business unit, or any other grouping logic to streamline remediation.\nDSPM Overview\nExperience the power of Zscaler DSPM and learn how to proactively discover and mitigate risk across IaaS, SaaS, data clouds, on-prem and endpoint.\nRobust Business Continuity for Private Access\nMaintain consistent zero trust security posture during disruptions without manual intervention and meet stringent regulatory requirements with ZPA.\nSecure Browser Access for Third-Party Users\nSecure access from any browser for unmanaged devices and third-party contractors, while accelerating M&A integration with Day 1 access.\nSecure B2B Application Access\nEnable secure connectivity to applications in your business partner's network without deploying additional infrastructure.\nAsset Exposure Management Use Case: Create a Policy\nCreate and enforce asset compliance policies at scale, including tool coverage and CMDB hygiene.\nUnified Vulnerability Management Use Case: Custom Risk Scoring\nDitch your vendor-defined \"black box\" risk scoring and prioritize the factors that matter most to your team."
    },
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/custom-product-demo",
        "Content_Type": "Website Content",
        "Raw_Text": "The Zscaler Zero Trust Exchange™ platform uses the largest security cloud on the planet to make the experience of doing business and navigating change simpler, faster, and more productive.\nBuilt from the ground up for zero trust, our leading technology can help you:\n- Solve your security and networking challenges\n- Accelerate business transformation\n- Optimize user experiences"
    },
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/products-and-solutions/secure-access-service-edge-sase",
        "Content_Type": "Website Content",
        "Raw_Text": "Zero Trust SASE builds on the industry’s leading SSE platform with a fresh approach to SD-WAN that reduces business risk.\nPrioritize your mission\nProvide secure connectivity for your workforce and locations, so you can focus on your goals.\nImprove cyberthreat protection\nBetter protect your crown jewels with superior security built for today's dynamic organizations.\nLay a strong base for IoT adoption\nSecurely adopt IoT and OT without widening your attack surface or complicating policy enforcement.\nThe Problem\nTraditional SD-WAN overextends trust\nTraditional SD-WAN helped reduce the costs associated with dedicated WAN circuits. However, it was built on network technology that extends trust between locations. As a result, it:\nExpands the attack surface\nby exposing more IP addresses to the public internet\nHeightens ransomware risk\nby letting attackers move freely across your network\nIncreases complexity\nby requiring additional equipment to provide network security\nGartner projects that 60% of new SD-WAN purchases will be integrated into a single-vendor SASE offering by 2026. It’s time to ensure new deployments are fit for purpose in a world of greater cyber risk. A zero trust architecture provides the best foundation for securely connecting workforces and locations to their work.\nSolution Overview\nThe first SASE platform built on zero trust\nZscaler Zero Trust SASE builds on the leading AI-powered security service edge (SSE) platform with a new approach to SD-WAN that securely and reliably connects users, locations, and cloud services via the Zscaler Zero Trust Exchange™.\nBenefits\nSimplify IT and security\nExtend zero trust beyond workforces\nEnforce zero trust security for IoT/OT devices, servers, and guests in branches.\nUnify security and network access\nImplement a single-vendor SASE framework with a simpler, proxy-based architecture.\nImprove user experiences\nEnforce security as close to users as possible, eliminate unnecessary backhauling, and optimize latency and bandwidth usage.\nReduce cost and complexity\nRemove the need for multiple security point products by unifying security with zero trust.\nsolution Details\nPrepare your organization for what’s next with Zero Trust SASE\nZscaler Zero Trust SASE provides least-privileged access for workforces, devices, workloads, and business partners across managed offices. Made up of six core technologies, it eliminates the need for complex and costly network-based security that fails to prevent breaches.\nZero trust software-defined wide area network (SD-WAN)\nOptimize user experience and reduce complexity by auto-selecting the best route for traffic to cloud apps, the internet, and the data center.\nCloud access security broker (CASB)\nPrevent data leaks, regulatory compliance issues, and malware infection by ensuring safe use of cloud apps and services. Increase visibility to help your team see policy violations.\nZero trust network access (ZTNA)\nEnsure trust is never assumed. Give remote users secure connectivity without placing them on your network by granting least-privileged access based on granular policies.\nUse Cases\nExtend secure, dynamic connectivity\nExtend cloud-delivered security out to workforces, applications, networks, and endpoints—no matter where they’re located.\nEliminate the need to backhaul traffic to a data center, and deliver a seamless user experience with security at the edge. Connections are brokered at 160+ points of presence worldwide.\nStay on top of threats, no matter how quickly they evolve. Zscaler operates the world’s largest security cloud, with more than 250,000 unique security updates per day.\nInspect and secure every connection. Zero Trust SASE defines security—including threat protection and data loss prevention (DLP)—as an integral part of the connectivity model.\nour platform\nThe Zscaler Zero Trust Exchange\nSecure user, workload, and device communication between and\nwithin the branch, cloud, and data center.\nZero Trust Everywhere\nSecure Data\n- Find, Classify, and Assess Data Security Posture\n- Prevent Data Loss Across All Channels\nFAQ\nZero Trust SASE redefines network security by integrating AI-driven security service edge (SSE) capabilities with Zero Trust SD-WAN. Unlike traditional SD-WANs, which rely on complex routing and additional appliances, Zero Trust SD-WAN focuses on connecting and securing users and locations without overlay routing or policy inconsistencies. It ensures simplified branch management, robust security, and seamless protection across distributed infrastructures.\nSASE combines key networking and security technologies in a cloud-delivered framework. It includes software-defined wide area network (SD-WAN) for connectivity, secure web gateway (SWG) for web security, cloud access security broker (CASB) for cloud protection, zero trust network access (ZTNA) for access controls, and data loss prevention (DLP) for safeguarding sensitive data.\nWhen evaluating SASE providers, focus on solutions that integrate robust SSE capabilities like SWG, CASB, and ZTNA with powerful SD-WAN functionality. Look for scalability, ease of deployment, and seamless integration with cloud services and zero trust frameworks. The ideal provider should offer proven performance, AI-driven threat detection, and centralized management for consistent visibility and control across distributed networks."
    },
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/products-and-solutions/security-service-edge-sse",
        "Content_Type": "Website Content",
        "Raw_Text": "Protect and accelerate your business with SSE\nSSE is a network-agnostic security framework commonly adopted as the first stepping stone toward a secure access service edge (SASE) framework, giving your organization the power to:\nEliminate the attack surface\nPrevent compromise\nImprove user experience\nReduce costs and complexity\nThe Problem\nLegacy security impedes transformation\nTraditional network security can't protect cloud-based apps and data, stop lateral movement, inspect encrypted traffic at scale, or follow remote users and endpoints. Security, performance, and user experience are compromised. In short, legacy protection is no longer fit for purpose.\n56%\n87%+\n82%\nSolution Overview\nTransform your architecture from firewalls and VPNs to zero trust with SSE\nThe Zscaler Zero Trust Exchange™ meets all the SSE needs of a modern, cloud-centric strategy with comprehensive threat and data security. As a unified, consolidated platform, it reduces complexity and cost while securing all users, apps, and data.\nExperience the only comprehensive, cloud native SSE platform\nSSE was originally conceived with just users in mind. Zscaler extends the benefits of SSE beyond the workforce to also include workloads, IoT/OT devices, and business partners.\nBenefits\nTransform IT and security with confidence\nThe Zero Trust Exchange helps IT securely accelerate business transformation using a foundation of zero trust.\nZero attack surface\nHide applications, making them invisible to the public internet and eliminating the attack surface entirely.\nNo more compromise\nStop data loss and threats with a unified platform, more effective than legacy or point products.\nImproved user experience\nDeliver all-in-one security from as close to your end users as possible for optimal performance.\nMore than SSE\nProvide cloud-delivered data loss prevention (DLP), UEBA, browser isolation, inline sandbox, and more for the workforce, workloads, and devices.\nSolution Details\nPioneering SSE with unified, cloud native security\nZscaler SSE enables the transformation of IT and security with the all-in-one Zero Trust Exchange, built on the world’s largest security cloud.\nProtect enterprise environments with scalable, cloud native security delivered at the edge.\nIncrease agility and support productivity to drive business growth.\nReduce costs and complexity, and improve visibility and control, by consolidating multiple point products into one platform.\nPerform inline inspection and policy enforcement with a scalable, multitenant, proxy-based architecture.\nEliminate multiple security point products (e.g., the entire inbound/outbound DMZ stack) with a single platform for holistic SSE.\nCombine access to the internet, cloud services, and private apps, with CASB for users and their devices.\nLook at a bigger picture of the attack surface—beyond users and their devices—unlike conventional SSE.\nExtend SSE beyond your users to also protect your workloads, IoT/OT, and business customers/suppliers.\nDeliver a comprehensive SSE platform for your whole organization.\nUse cases\nProtect and accelerate your entire business\nProtect workload-to-internet traffic, provide zero trust workload-to-workload connectivity, and secure cloud workload posture.\nSecure IoT/OT-to-internet traffic and provide zero trust connectivity for IoT/OT systems.\nour platform\nThe Zscaler Zero Trust Exchange\nSecure user, workload, and device communication between and\nwithin the branch, cloud, and data center.\nZero Trust Everywhere\nSecure Data\n- Find, Classify, and Assess Data Security Posture\n- Prevent Data Loss Across All Channels\nCustomer Success Stories\nZscaler SSE: The backbone of security transformations across all industries\nLearn how we help the company gain robust visibility, improve protection, and lower cost.\nLearn how NOV reduces costs, improves productivity, and protects against threats with the Zero Trust Exchange.\nFAQ\nWith secure access service edge (SASE), both network and security services are consumed through a unified, cloud-delivered approach, with a focus on improving the user-to-cloud-app experience while reducing costs and complexity. In particular, the SSE slice focuses on unifying security services, including SWG, ZTNA, CASB, FWaaS, and others.\nSSE supports remote workforces by extending them consistent security and secure access, wherever they are. Because it effectively eliminates data center backhauling, SSE offers significantly lower latency and better performance, and lets organizations enforce uniform security policies, monitor user activities, and stop threats."
    },
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/company/analyst-reports",
        "Content_Type": "Website Content",
        "Raw_Text": "When you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer.\nMore information\nManage Consent Preferences\nStrictly Necessary Cookies\nAlways Active\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nSocial Media Cookies\nThese cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools.\nFunctional Cookies\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nPerformance Cookies\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nTargeting Cookies\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising."
    },
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/partners/technology",
        "Content_Type": "Website Content",
        "Raw_Text": "Technology Partners\nA comprehensive zero trust ecosystem of partners that delivers industry leading integrated solutions to accelerate your digital transformation\nBest-in-class technology partner ecosystem\nZero trust is a team sport. To enable fast, easy, and secure work-from-anywhere access to applications, Zscaler provides integrations with leaders in cloud, data, endpoint, identity, network, and operations.\nExplore the Zscaler technology partner ecosystem\nIntegrations with cloud providers and DevOps partners for fast and secure infrastructure management with data security and compliance controls.\nIntegrations to enable usage of cloud applications with comprehensive Data Security and compliance controls.\nZscaler works closely with various endpoint security partners to share telemetry, enhance mutual visibility, and orchestrate response end to end. With defense in-depth, we help joint customers implement zero trust effectively and efficiently.\nSAML and SCIM integrations with identity providers for SSO and zero trust user access.\nIntegrations to seamlessly enforce secure access service edge (SASE) at all branches.\nIntegrations to enable efficient and effective risk, compliance, and infrastructure management with information enrichment and automation."
    },
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/gartner-magic-quadrant-security-service-edge-sse",
        "Content_Type": "Website Content",
        "Raw_Text": "We believe our position as a Leader attests to the revolutionary power of our SSE platform to help organizations accelerate secure digital transformation with Zero Trust Everywhere.\n- How SSE unifies secure web gateway (SWG), cloud access security broker (CASB), and zero trust network access (ZTNA) services, delivered in the cloud\n- How SSE can reduce risk and help organizations pursue their digital transformation goals\n- What to look for in a complete SSE and zero trust platform provider\n- Why Zscaler is a Leader in SSE for the fourth consecutive year\nAs the most widely deployed SSE platform across all entities – workforces, workloads, IoT/OT, and B2B – we believe the Zscaler Zero Trust Exchange™ empowers organizations to leave legacy network security behind for a zero trust architecture, purpose-built for cloud and mobility.\nGartner, Magic Quadrant for Security Service Edge, Charlie Winckless, Thomas Lintemuth, Dale Koeppen, Charanpal Bhogal, 20 May 2025\nThis graphic was published by Gartner, Inc. as part of a larger research document and should be evaluated in the context of the entire document. The Gartner document is available upon request from Zscaler. Gartner does not endorse any vendor, product or service depicted in its research publications, and does not advise technology users to select only those vendors with the highest ratings or other designation. Gartner research publications consist of the opinions of Gartner’s research organization and should not be construed as statements of fact. Gartner disclaims all warranties, expressed or implied, with respect to this research, including any warranties of merchantability or fitness for a particular purpose.\nGARTNER is a registered trademark and service mark of Gartner, Inc. and/or its affiliates in the U.S. and internationally, and MAGIC QUADRANT is a registered trademark of Gartner, Inc. and/or its affiliates and are used herein with permission. All rights reserved."
    },
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/products-and-solutions/deception-technology",
        "Content_Type": "Website Content",
        "Raw_Text": "Turn the tables on advanced attackers inside your network\nAttackers who gain access to your environment undetected think they've already won. Deploy deception technology for a proactive defense that lures and reveals sophisticated bad actors through realistic decoys.\nStop lateral movement\nby cutting off attackers with convincing honeypots\nDefend against GenAI attacks\non your infrastructure and learning datasets\nDetect compromised users\nand the abuse of stolen credentials\nThe Problem\nAttackers compromise zero trust environments through users and apps\n90%\n80%\n91%\nProduct Overview\nDetect advanced threats that evade traditional defenses\nZscaler Deception deploys realistic decoy assets across your environment to lure, detect, and intercept active attackers. When a compromised user interacts with a decoy, your team gets an immediate alert—attackers never know they've been caught until it's too late.\nAs part of the cloud native Zscaler Zero Trust Exchange™ platform, Deception can rapidly and seamlessly deploy high-fidelity threat detection throughout your enterprise.\nDe-risk your attack surface\nDivert malicious actors away from critical targets like endpoints, identity systems, networks, applications, and the cloud.\nDetect threats that matter, faster\nDetect compromised users, lateral movement, and ransomware with high-confidence IOCs and near-zero false positives.\nContain threats in real time\nLeverage zero trust access policies to dynamically limit or cut off access to sensitive SaaS services and internal applications.\nBenefits\nTake a fresh approach to targeted threat detection\nProtect users and applications with decoys\nSilently detect threats and attacker activity with endpoint lures as well as decoy applications, servers, users, and other resources.\nSpeed up incident response and reduce alert fatigue\nRapidly notify your security team of confirmed threats and breaches, with no false positives or added operational overhead.\nPut the burden of success back on attackers\nReplace your attack surface with convincing fake targets attackers can't resist, and catch them the moment they take the bait.\nProduct Details\nA complete cyber deception platform\nGenAI Decoys\nUse decoy chatbots, decoys LLM APIs, adaptive decoys, and decoy agents to detect attackers targeting GenAI infrastructure in your environment.\nThreat Intelligence Deception\nUse internet-facing decoys to detect pre-breach threats specifically targeting your organization.\nEndpoint Deception\nPlant a minefield to protect your endpoints with decoy files, credentials, processes, and more.\nCloud Deception\nDetect lateral movement in your cloud environments with decoy web and file servers, databases, and more.\nThreatParse\nExtract insights from context-rich logs, and get automated forensics and root cause analysis in two clicks.\nApplication Deception\nDeploy decoy server systems that host services like SSH servers, databases, file shares, and more.\nActive Directory Deception\nDetect enumeration activity and malicious access with fake users in Active Directory.\nRDP Decoys\nGain deeper attack visibility in realistic, highly interactive decoy OS environments.\nUse Cases\nMake your network a hostile environment for attackers\nGet early warning signals from perimeter decoys when advanced threat actors like ransomware operators or APT groups are performing pre-breach reconnaissance.\nDeploy decoy passwords, cookies, sessions, bookmarks, and apps to detect compromised users when an attacker interacts with the deceptive environment.\nUse application decoys and endpoint lures to divert and intercept attackers who are trying to move laterally in your environment.\nSurround your high-value assets with decoys that detect and instantly block even the stealthiest and most sophisticated adversaries.\nDetect ransomware at every stage of the attack life cycle with decoys in your network, endpoints, clouds, and Active Directory environments.\nIntegrate seamlessly with the Zscaler platform and third-party security operations tools like SIEM and SOAR to shut down active attackers with automated, rapid response.\nIntercept attackers using stolen credentials to access decoy web apps that resemble vulnerable testbed applications and remote access services like VPNs.\nUncover prompt injection, data poisoning, and other severe attacks targeting your GenAI infrastructure and learning datasets.\nour platform\nThe Zscaler Zero Trust Exchange\nSecure user, workload, and device communication between and\nwithin the branch, cloud, and data center.\nZero Trust Everywhere\nSecure Data\n- Find, Classify, and Assess Data Security Posture\n- Prevent Data Loss Across All Channels\nFAQ\nFAQ\nZscaler Deception technology reimagines traditional honeypots by embedding deception directly into user environments across endpoints, network, Active Directory, cloud workloads, IoT/OT devices, and more, making traps indistinguishable from legitimate assets. Unlike static honeypots, Zscaler utilizes decoys and breadcrumbs, enabling attackers to unknowingly reveal themselves. This proactive, distributed strategy detects threats in real time and integrates seamlessly with the Zscaler Zero Trust Exchange platform.\nZscaler Deception is seamlessly woven into the Zscaler Zero Trust Exchange to dynamically distribute lightweight decoy assets across enterprise endpoints, networks, Active Directory, cloud workloads, and IoT/OT devices. These traps mirror authentic assets, making detection of malicious activity virtually instant. This embedded approach enables proactive threat detection while maintaining continuous validation for zero trust. Zscaler Deception is also built into the Zscaler Client Connector endpoint agent and Zscaler Private Access to detect lateral movement from endpoints to applications.\nZscaler Deception is designed to uncover a diverse range of threats, including advanced persistent threats (APTs), pre-breach attacks, identity compromise, privilege escalation, lateral movement, insider threats, and ransomware. By luring attackers with decoys and lures, it identifies suspicious behavior at early stages, providing proactive protection against breaches and reducing dwell times significantly.\nYes, Zscaler Deception fully supports cloud, on-premises, and hybrid environments. Its lightweight design ensures seamless deployment across endpoints, workloads, and IoT devices, regardless of the infrastructure. As a cloud-delivered solution, it aligns perfectly with modern distributed environments to provide comprehensive and scalable threat detection.\nYes, Zscaler Deception can detect attacks like prompt injection, data poisoning, jailbreaking, adversarial suffixes, training data extraction, and more. Zscaler Deception supports creating decoy LLM chatbots and APIs to detect these attacks."
    },
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/products-and-solutions/business-insights",
        "Content_Type": "Website Content",
        "Raw_Text": "Turn actionable insights into strategic decisions\nEmpower IT, procurement, facilities, and business leaders to make confident, data-driven decisions. Understand SaaS app usage and spend, office usage trends, and more, powering valuable cost savings and more deliberate back-to-office strategies.\nThe Problem\nGaining insights on technology and offices is challenging\nOptimizing the use of SaaS apps and office space can go a long way in managing costs, supporting productivity, and providing seamless user experiences. However, essential data is often spread across departments and tools, and it can be incredibly difficult to get the full picture. You need a simpler, more effective way to access, analyze, and visualize these insights.\nGet 360-degree visibility into SaaS apps and workspaces\nZscaler Business Insights delivers rich business intelligence to help decision-makers drive efficiency, productivity, and savings. Understand key trends with intuitive data visualization and easy reporting.\nBenefits\nControl SaaS app sprawl and optimize office usage\nReduce and consolidate SaaS apps\nUnderstand how users are using SaaS apps to help IT leaders pinpoint and remove redundant apps, curb access to certain user groups, and more.\nEffectively utilize your office space\nConduct capacity planning based on hour-by-hour office usage data across departments, with reporting on past weeks, months, and quarters.\nDrive stronger cost savings\nUse cost-savings models based on predictive analytics to help IT, HR, Real Estate, and Facilities leaders drive savings in application and workplace transformation.\nSee instant time-to-value\nGain deeper business insights with nothing new to deploy. Get smarter about your applications with the same Zscaler deployment you use to enable application transformation.\nSolution details\nFull visibility with comprehensive data and analytics\nComplete SaaS App Inventory\nGain total visibility into your SaaS application landscape. Get a list of all your SaaS applications, including redundant ones, in one place.\nUser and Engagement Index\nEffortlessly stay on top of app engagement, monitor the details of your plans/seats purchased, and understand active users and top usage by department.\nCost Matrix\nCurtail SaaS sprawl and spend by using the SaaS app usage vs. cost matrix feature to see where you can consolidate and reduce costs.\nDetailed Workplace Insights\nOptimize office overhead with detailed views of when workers are in-office, hybrid, or remote. Plus, coming soon, see closed-loop analytics on office usage vs. capacity and expectations.\nVisibility Over Time\nVisualize data across any period of time—days, week, months, or quarters—to help effectively execute your return-to-office strategy.\nUnparalleled Accuracy\nSave time and effort on data consolidation to determine app and office usage for a clearer, more accurate picture.\nUse Cases\nRich SaaS app and workspace usage insights\nGet access to a complete SaaS app inventory, usage trends, and a view of overlapping apps to control SaaS app sprawl.\nAlign all teams on SaaS app usage and spend in one dashboard. Get detailed insights on plans/seats purchased, active/inactive users, risk, and compliance adherence.\nGet insights into SaaS app usage, and realize potential savings by removing redundant apps or reducing licenses/seats to align with usage.\nOptimize your workspace by understanding when workers are in the office vs. hybrid vs. remote, top departments coming to the office, and more.\nGet hour-by-hour office utilization visualizations and access historic weekly, monthly and quarterly data across all your office locations to make data-based decisions.\nour platform\nThe Zscaler Zero Trust Exchange\nSecure user, workload, and device communication between and\nwithin the branch, cloud, and data center.\nZero Trust Everywhere\nSecure Data\n- Find, Classify, and Assess Data Security Posture\n- Prevent Data Loss Across All Channels"
    },
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/executive-insights-app",
        "Content_Type": "Website Content",
        "Raw_Text": "Your organization’s security, risk, and digital experience—all in one app.\nExecutive Insights delivers curated insights to critical questions about your organization’s security and risk posture, ensuring you’re always ready to lead with confidence.\nEffortless clarity\nWhen every second counts, you need the right information at the right time. The Zscaler Executive Insights Mobile App redefines how executives stay connected to their organization’s security posture and digital transformation. Designed with simplicity and power in mind, this app curates the most relevant insights to help you lead with clarity and focus, anytime, anywhere.\nCurated insights: Go beyond dashboards. Get actionable answers to critical questions to help quickly address risks, gaps, and opportunities.\nPowerful metrics: Track performance and critical metrics across digital transformation, security posture, and user experience.\nIntuitive experience: Find what you need in just a few taps. No learning curve, just instant access to critical insights.\nUnified mobile experience: All your critical insights, from security posture to network health and risk scores, in one streamlined view.\nActionable insights: Get the answers that matter most to CXOs with curated views designed to quickly identify risks, threats, and gaps that need action.\nProactive threat monitoring: Stay informed about risks with rapid updates on vulnerabilities, blocked threats, and policy violations.\nIndustry benchmarks: Enable strategic comparisons and informed decision-making from anywhere with peer benchmarks and breaking security advisories.\nRisk360 Standard included: Drill down into your risk score, how each stage of a breach influences your score, and the financial impacts of potential risks.\nStay connected: Access curated security and performance insights without complex reports, all in one unified mobile experience.\nLead with confidence: Leverage the clarity and control to make quick, impactful decisions, wherever you are.\nAlign your team: Unlock strategic insights that foster collaboration, engagement, and drive toward shared strategic goals.\nGain continuous visibility: Stay informed with frequent updates on your digital experience, security posture, and risk.\nStreamline security and risk: Identify, prioritize, and act on emerging threats to manage risk proactively and strengthen your cyber resilience.\nAlways in touch and in control\nStay on top of security\nSee your security posture and assess vulnerabilities and protection levels as soon as a new security advisory or threat emerges.\nDeliver status updates with ease\nLeverage curated insights to confidently answer questions on the spot, providing instant clarity on security and digital performance.\nPlan effectively\nLeverage industry benchmarks and peer comparisons to better understand and manage risks and strategically improve security resilience."
    },
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/blogs",
        "Content_Type": "Website Content",
        "Raw_Text": "By submitting the form, you are agreeing to our privacy policy.\nPrivacy Preference Center\nWhen you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer.\nMore information\nManage Consent Preferences\nStrictly Necessary Cookies\nAlways Active\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nSocial Media Cookies\nThese cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools.\nFunctional Cookies\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nPerformance Cookies\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nTargeting Cookies\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising."
    },
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/customers",
        "Content_Type": "Website Content",
        "Raw_Text": "Our customers' stories\nZscaler protects users and workloads worldwide\n7.7K+\nCustomers globally\n40%\nof Global 2000 Companies\n>70\nNet Promoter Score (Avg. SaaS NPS is 30)\nYour success story, secured.\nReach new heights with the Cloud Collective\nJoin our customer advocacy program to take your career to the next level. Share your Zscaler experience, expand your network, and demonstrate thought leadership with other industry experts."
    },
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/company/about-zscaler",
        "Content_Type": "Website Content",
        "Raw_Text": "Experience secure digital transformation\nWe accelerate digital transformation so our customers can be more agile, efficient, resilient, and secure. Our cloud native Zero Trust Exchange platform protects thousands of customers from cyberattacks and data loss by securely connecting users, devices, and applications in any location.\nAchievements\n7.7K+\n500B+\n>70\nGartner\nHow We Help\nSecurity is more than protection against threats\nFast, secure access to cloud resources is a key driver of transformation in today’s cloud-first world. Using zero trust principles, Zscaler helps IT move away from legacy network infrastructure to achieve modern workplace enablement, infrastructure modernization, and security transformation. Let’s take a closer look:\nWe believe that security is the foundation for a more inclusive, connected, and empowered world. By helping our customers anticipate, secure, and simplify the experience of doing business, your talent, expertise, and insight will ensure that today's brightest ideas become tomorrow's boldest innovations.\nMore Information"
    },
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/company/news-press",
        "Content_Type": "Website Content",
        "Raw_Text": "Zscaler ThreatLabz Uncovers Surge in AI-Driven Cyberattacks ...\nZscaler’s 2025 Phishing Report reveals cybercriminals are exploiting AI to launch precise attacks, underscoring the need for Zero Trust + AI powered defenses\nNew Zscaler AI Security Report Reveals an Over 3,000% Surge ...\nAnnual ThreatLabz Report Reveals 36x More AI/ML Transactions in World’s Largest Security Cloud, Stressing the Need for Zero Trust Everywhere to Enable Secure GenAI Adoption and Stop AI-Powered Threats\nWhen you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer.\nMore information\nManage Consent Preferences\nStrictly Necessary Cookies\nAlways Active\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nSocial Media Cookies\nThese cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools.\nFunctional Cookies\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nPerformance Cookies\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nTargeting Cookies\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising."
    },
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/company/leadership",
        "Content_Type": "Website Content",
        "Raw_Text": "When you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer.\nMore information\nManage Consent Preferences\nStrictly Necessary Cookies\nAlways Active\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nSocial Media Cookies\nThese cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools.\nFunctional Cookies\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nPerformance Cookies\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nTargeting Cookies\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising."
    },
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/company/media-center",
        "Content_Type": "Website Content",
        "Raw_Text": "Zscaler ThreatLabz Uncovers Surge in AI-Driven Cyberattacks ...\nZscaler’s 2025 Phishing Report reveals cybercriminals are exploiting AI to launch precise attacks, underscoring the need for Zero Trust + AI powered defenses\nNew Zscaler AI Security Report Reveals an Over 3,000% Surge ...\nAnnual ThreatLabz Report Reveals 36x More AI/ML Transactions in World’s Largest Security Cloud, Stressing the Need for Zero Trust Everywhere to Enable Secure GenAI Adoption and Stop AI-Powered Threats\nWhen you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer.\nMore information\nManage Consent Preferences\nStrictly Necessary Cookies\nAlways Active\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nSocial Media Cookies\nThese cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools.\nFunctional Cookies\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nPerformance Cookies\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nTargeting Cookies\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising."
    },
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/company/zenithventures",
        "Content_Type": "Website Content",
        "Raw_Text": "Zenith Ventures\nOVERVIEW\nZenith Ventures is committed to making strategic investments with entrepreneurs who thrive on solving tough cybersecurity problems while leveraging the Zscaler security cloud.\nA proven, world-class team\nLeverage our experience in building a high-growth business through every stage of the startup journey.\nThe Zero Trust Exchange Partner Ecosystem\nIntegrate with our industry-leading platform to enhance your customers' cloud experience.\nLarge enterprise focus\nWe prioritize the evolving needs of Global 2000 enterprises, and we look forward to sharing our expertise with you.\nGlobal reach\nWith 30+ offices, 6,000+ employees, and 150+ data centers worldwide, we see cybersecurity as a global opportunity.\nNext-Generation SOAR and Threat Intelligence\nCyware delivers an innovative approach to cybersecurity that unifies threat intelligence, automation, threat response, and vulnerability management with data insights gleaned from assets, users, malware, attackers, and vulnerabilities.\n\"Partnering with Zscaler has been an important part of our success. Drawing on their experience building a billion dollar plus ARR business has helped us scale.\"\nAnuj Goel, CEO and Co-Founder of Cyware\nDeep Learning Built Exclusively for Cybersecurity\nDeep Instinct takes a prevention-first approach to stopping ransomware and other malware using the world’s first and only purpose-built, deep learning cybersecurity framework.\n“Deep Instinct is proud to work with investors who share our vision and invest in like-minded growth companies like Zscaler who are on a mission to enable the digital world to run safely and securely for all enterprises.”\nLane Bess, CEO of Deep Instinct\nSecure Cloud Access in Minutes\nP0 Security is the first unified IGA and PAM platform for the cloud that governs and secures all forms of access for both human and machine identities.\n“The cloud brings new complexities when it comes to governing access to enterprise applications. We’re thrilled that Zscaler supports our mission to transform access governance for all human and machine identities through the first-ever unified IGA and PAM platform for the cloud. This gives security teams complete visibility and control into who or what is accessing cloud resources.”\nShashwat Sehgal, CEO and Co-Founder of P0 Security\nIntelligent API Security at Enterprise Scale\nTraceable is the industry's leading API security platform that discovers, manages, and secures all of your APIs across your development lifecycle.\n\"Widespread use of APIs has led to a significantly larger attack surface. Traceable is committed to protecting these APIs from malicious usage and abuse. We are excited to collaborate with a market leader like Zscaler to help accelerate our mission.\"\nJyoti Bansal, CEO and Co-Founder Traceable\nDETAILS"
    },
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/campaign/explore-zdx-innovations",
        "Content_Type": "Website Content",
        "Raw_Text": "Interactive Product Tours\nDetect, Diagnose, and Remediate User Performance Issues Faster Than Ever\nExplore Zscaler Digital Experience's latest features that make troubleshooting faster, improve user experiences, and drive better workforce productivity with our self-guided product tours.\nStep inside the platform and explore our key innovations:\n- Detect device events like software or system crashes and network anomalies impacting user experience.\n- Diagnose end-user performance issues into ISP and network-related root causes.\n- Remotely remediate device-wide issues and persistent internet disruptions without additional installation.\nBenefits\nWhat sets Zscaler Digital Experience apart?\nGet unified visibility across devices, networks, and apps\nIdentify ISP bottlenecks, reroute traffic via Zscaler Internet Access (ZIA) for better connectivity, and utilize enhanced features to negotiate improved SLAs for uninterrupted user experiences.\nDetect issues early and quickly pinpoint root causes\nGain holistic visibility into impacted devices with detailed metrics and crash data, while leveraging remote remediation to resolve issues quickly and boost user productivity.\nGet end-to-end visibility\nExtend multipath insights to applications with 24/7 global monitoring, ensuring proactive issue detection and uninterrupted SaaS and private application performance."
    },
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/blogs/company-news/zscaler-2021-zero-trust-champion-microsoft-s-20-20-partner-awards-ceremony",
        "Content_Type": "Website Content",
        "Raw_Text": "In my previous blog, I was proud to share that Zscaler was nominated for two awards from the Microsoft community, including the Zero Trust Champion of the year. On May 12, Microsoft announced the award winners at its 20/20 Partner Awards ceremony, a prestigious event recognizing industry excellence in a number of key areas.\nI couldn’t be more grateful to the Microsoft community to announce that Zscaler has won the Zero Trust Champion of the Year award, beating out a strong field of competitors. This award validates our forward-looking vision and the significant innovation behind our zero trust architecture, which is reimagining how leading enterprises safeguard their digital business in today’s mobile and cloud-first world. This recognition comes on the heels of the landmark Executive Order on Federal Cybersecurity from the Biden Administration that puts zero trust at the forefront of both public and private efforts to transform security to become more agile, resilient, and significantly reduce risk.\nWe believe wholeheartedly in three fundamental principles of zero trust:\nZero trust has generated a massive amount of noise across the industry for good reason—it’s the only way to disrupt the attack equation and get ahead of highly intelligent, rapidly evolving adversaries. With users, data, and applications everywhere, there needs to be a different approach; one that is cloud-native, optimized for the needs of the modern enterprise, and adaptable to the ever-changing threat landscape. Zscaler believes a true zero trust architecture must be built on the following three tenets:\n- Zero network access: connect users to apps, not corporate networks to prevent lateral movement.\n- Zero attack surface: make apps invisible so they can’t be attacked.\n- Zero passthrough connections: deny all privileges; utilize a proxy architecture for better cyberthreat prevention and data protection.\nIt has become evident that legacy network security architectures can’t deliver on the promise of zero trust, as adapting traditional solutions to this new era introduces massive complexity and cost without improving security. The Microsoft Zero Trust Champion of the Year award recognizes Zscaler’s approach to delivering a comprehensive zero trust architecture, one made all the more meaningful by being selected by the Microsoft Intelligent Security Association (MISA) members who were solely responsible for voting on this year’s winners.\nTogether with Microsoft, we will continue to deliver exceptional security outcomes to our customers, built on a foundation of the industry’s leading zero trust architecture, the Zscaler Zero Trust Exchange. Thank you to the MISA members and Microsoft for this honor. Recognition amongst our peers in the industry is humbling, and we are grateful for your confidence in our strategy and execution of providing zero trust to our customers.\nDon’t miss our joint breakout session at Zenith Live\nIn a few weeks, Zscaler will be hosting its virtual Zenith Live conference, with this year’s theme being Full Cloud Ahead. In our joint session, you will hear from experts at Zscaler and Microsoft about actionable cloud-based zero trust solutions and crucial strategies to stay ahead of today’s most advanced threats. Our experts will discuss the strategies and technologies required for a true zero trust architecture and how you can make zero trust a reality for your organization.\nRegister for Zenith Live here: zscaler.com/zenithlive\nWe hope to see you there!\nThank you again to Microsoft and the Microsoft Intelligent Security Association for this opportunity and recognition."
    },
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/blogs/company-news/national-cybersecurity-center-excellence-nccoe-selects-zscaler-technology",
        "Content_Type": "Website Content",
        "Raw_Text": "Strengthening the nation’s cybersecurity requires more — and better — collaboration between the public and private sectors. That’s why we are honored to announce that the National Institute of Standards and Technology (NIST)’s National Cybersecurity Center of Excellence (NCCoE) has selected Zscaler as one of its partners in a new Zero Trust Architecture Project. Zscaler will work alongside the NCCoE and other top Federal IT vendors on different approaches for implementing zero trust architectures.\n“We received an overwhelming response from the vendor community on this important project,” said Natalia Martin, acting director of the NCCoE, in the announcement. “Implementing a zero trust architecture has become a Federal cybersecurity mandate and a business imperative.”\nTop industry leaders will come together to demonstrate various approaches to implementing a zero trust architecture. These approaches will use a diverse mix of products and capabilities — and the effort will provide valuable \"how to\" guidance and lessons learned.\nAs Federal employees continue to work from anywhere, and more and more applications move from inside the data center to outside the network perimeter, network and security teams are shifting their focus from securing the network to protecting users, devices, and business resources.\nAs we like to say at Zscaler, zero trust is a team sport — and the NIST NCCoE is taking the initiative to bring together best-of-breed zero trust leaders. We’re committed to collaborating with customers and partners to demonstrate different, practical approaches to implement a zero trust architecture.\nAs we know, no one solution fits every situation. Zscaler is honored to be a part of this coalition working side by side to realize the opportunity for zero trust to strengthen every agency’s cyber defenses.\nFor more information, see NCCoE’s press release."
    },
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/blogs/zscaler-life/celebrating-oneteam-zscaler-named-best-workplace-technology",
        "Content_Type": "Website Content",
        "Raw_Text": "At Zscaler, our culture is built on a foundation of shared values to create a workplace where every employee feels engaged, supported, and empowered to thrive. Today, I’m proud to share that we've been named one of Fortune’s Best Workplaces in Technology–our second time earning this distinction, and an achievement that belongs to our entire team at Zscaler.\nReflecting On Our Purpose\nWhen I reflect on Zscaler’s journey since 2007, the growth is remarkable, but the “why” behind it is what truly makes me proud to work at this company. We believe security is the foundation for a more connected and empowered world, and our work provides the secure foundation that gives customers the confidence to turn today’s brightest ideas into tomorrow’s boldest innovations. Knowing we are a trusted partner in their success makes our work deeply meaningful, and our employees are the driving force behind it.\nValidation from the Inside Out\nThis recognition is especially meaningful as it’s based on feedback from our own employees and benchmarked against input from more than 157,000 professionals across the tech industry. For us, this award is a testament to the infectious energy in our teams, the growth mindset that defines our work, and our passion for innovation that makes this such a special place to be.\nThis external validation powerfully mirrors what we hear directly from our team. Our recent mid-year sentiment survey revealed a remarkable 90% favorability score for overall engagement, highlighting how connected our employees feel to Zscaler’s vision and mission.\nOur Culture by Design\nThe engagement and pride we see across our team is no accident. Our culture at Zscaler isn’t something we take for granted; we intentionally cultivate it and bring it to life through our programs and initiatives. For example, we empower professional growth through robust leadership and management development programs. We foster a culture of fearless innovation with company-wide hackathons. And we continue to invest in new and redesigned office spaces to spark collaboration, innovation, and connection. And we champion a culture of recognition to ensure that great work is always celebrated.\nEach of these initiatives is a direct expression of our TOPIC values, creating an environment where every employee feels a strong sense of purpose, clarity, and belonging.\nLooking Ahead with Gratitude\nThis recognition as a Best Workplace in Technology is a celebration of every single member of the Zscaler team. Thank you for your unwavering commitment to our mission and to each other as we continue to shape the future of cybersecurity.\nWas this post useful?\nDisclaimer: This blog post has been created by Zscaler for informational purposes only and is provided \"as is\" without any guarantees of accuracy, completeness or reliability. Zscaler assumes no responsibility for any errors or omissions or for any actions taken based on the information provided. Any third-party websites or resources linked in this blog post are provided for convenience only, and Zscaler is not responsible for their content or practices. All content is subject to change without notice. By accessing this blog, you agree to these terms and acknowledge your sole responsibility to verify and use the information as appropriate for your needs."
    },
    {
        "Ticker": "ZS",
        "Company": "Zscaler",
        "Source_URL": "https://www.zscaler.com/custom-product-demo-v2",
        "Content_Type": "Website Content",
        "Raw_Text": "The Zscaler Zero Trust Exchange™ platform uses the largest security cloud on the planet to make the experience of doing business and navigating change simpler, faster, and more productive.\nBuilt from the ground up for zero trust, our leading technology can help you:\n- Solve your security and networking challenges\n- Accelerate business transformation\n- Optimize user experiences"
    }
]